{"cid": "372", "title": "Chapter 372. Penance (3)", "content": ["After leaving the office, the Yi siblings quietly trudged through the hallway.", "Being pushed around left and right, they obviously weren’t pleased with the situation.", "“Noona.”", "While silently walking, Yi Sungjin spoke all of a sudden.", "“I… really want to help Mom heal.”", "A strong determination could be felt from his voice.", "“So don’t hate me too much.”", "Yi Seol-Ah turned her head at his out-of-the-blue words.", "“Sungjin?”", "However, Yi Sungjin didn’t say anything else and walked to his room. Putting on his armor and shield, he left the building immediately.", "Yi Seol-Ah put on her own armor and quickly chased after her younger brother.", "They arrived at the pub.", "Three people were waiting for the siblings.", "“You couldn’t bring anyone?”", "“No, everyone was busy.”", "Sergei Romanchev furrowed his brows. He seemed nervous like something happened in the meanwhile.", "“Shit, I was betting on you guys…”", "“We’ll work hard. You can use us as porters if you’d like.”", "“Our team doesn’t need porters. We’re busy feeding our own mouths…”", "“You don’t have to give us a share either. Just let us follow you around.”", "“Huh? Aren’t you guys from Valhalla? I don’t want any problems later.”", "The burly man looked back at his companions with a dumbfounded expression.", "“…Why don’t we just bring them along?”", "The scrawny man fiddling with a dagger gave his opinion.", "“We discussed it before, didn’t we? That we should go by ourselves if we can’t recruit a High Ranker. They’re Level 3s, so they should at least carry their own weight. Plus…”", "Trailing off, the scrawny man carefully scanned his surroundings.", "Sergei Romanchev spat on the floor.", "“Damn it, I shouldn’t have brought it up before.”", "“That was your fault for being careless. It’s not these kids’ fault.”", "“I know.”", "“Anyway, it’s not like they’re asking for a share of the loot. It looks like other teams have caught on and are on the move. Shouldn’t we get going as quickly as possible?”", "Sergei Romanchev repeatedly squeezed and opened his hand at his companion’s urging.", "He stared at the brother and sister pair, who clearly looked like newbies and then slicked his hair back.", "“Fine. You said it. That you don’t need a share of the loot. You better not go back on your words.”", "“Of course.”", "“We don’t care that you’re from Valhalla. If we decide you’re a hindrance to our expedition, we’re going to leave you behind on the spot. If you still want to go, come to the eastern gate by six.”", "“I already have all my stuff. You just have to give me your stuff.”", "“Hah, you sound like a High Ranker. Here.”", "The burly man snorted and looked back at Yi Seol-Ah.", "“You coming too? You should leave now if you’re not coming.”", "“Y-Yes? Ah, I’ll come.”", "Yi Seol-Ah agreed without realizing it and looked back at her younger brother.", "Yi Sungjin was slinging a backpack over his shoulder with an expressionless face.", "Soon, Sergei Romanchev got up grumbling.", "The pub owner, who was wiping down a cup with a cloth, stole a glance at the five people leaving the pub.", "*", "It wasn’t until five days later that the pub owner saw the five people again.", "Four people followed after a burly man covered in a cloud of dust.", "“Owner, bring us some drinks and meat!”", "“Hey, isn’t Sungjin a minor?”", "“Who cares? This is Paradise. Plus, it’s totally fine for high schoolers to drink alcohol! Heck, I did it when I was in middle school!”", "Seeing how they were laughing and giggling to themselves, their expedition seemed to have been a success.", "As the owner brought them food and alcohol, he noticed that the atmosphere was mostly good.", "Of course, when something was mostly good, that naturally meant that some part was bad.", "While the Warrior and the Assassin were smiling at the teenage boy, the female Archer had her mouth shut and the teenage girl seemed anxious.", "“Now, now, let’s all drink. Sungjin! You have a cup too.”", "“No, I’m fine—”", "“Come on. You don’t want a drink I’m offering? This hyung will give you this as well, so cheer up.”", "Sergei Romanchev cut the juiciest bit of the meat and put it on Yi Sungjin’s plate. He had a completely different attitude than five days ago.", "“Tonight’s tab is on me. You can order to your heart’s content!”", "He even sat down next to Yi Sungjin and put his arm around his shoulder.", "“Do forgive this hyung for ignoring you at first. I was overly sensitive at the time in fear of someone snatching our chance. Who would have thought someone with no experience would perform so well?”", "“You sure got that right. You would have died if it wasn’t for Sungjin.”", "The scrawny black man said with a chuckle, and the burly man shivered.", "“Don’t make me remember. I still get chills. You ever experience time slowing down to a crawl?”", "“That’s usually what happens when you get poisoned.”", "“Anyway, I barely managed to kill the monster in front of me, but then I felt a chill run down my back. So I turned around, and lo and behold, I saw another one holding its vicious claws right in front of my eyes. I thought, Ah, this is it for me… Then boom!”", "Sergei Romanchev shot up from his seat.", "He picked up Yi Sungjin’s shield and then ran forward while shouting, ‘Watch out!’", "“He suddenly cut in between us and pushed me back. Kyaa! I fell in love with him on the spot!”", "He smacked Yi Sungjin’s back a few times while guffawing.", "The pub owner smiled as he watched the teenage boy chewing on a chunk of meat with furrowed brows. From the sound of it, this youth seemed to have saved the burly man’s life.", "It was then.", "Ring.", "“Welco…”", "The pub owner paused as the sound of someone entering was heard.", "“Alright, eat, eat. This is part of the expedition. What’s the fun in saying goodbye as soon as the job’s over? Merrily celebrating is vital for building a good relationship.”", "On the other hand, Sergei Romanchev sat back down and gulped down the drink in his hand.", "He wiped his lips and looked at the teenage boy intently.", "“Sungjin.”", "Then, he began to speak suggestively.", "“Do you wanna maybe tag along with us for a while?”", "“Pardon?”", "“I know that you’re a member of Valhalla. But you said yourself, didn’t you? That you need experience.”", "“Ah, yes.”", "“As you know, I’m a Barbarian Warrior.”", "The burly man thumped his chest.", "“I couldn’t show my real abilities because I had to protect these guys. I really felt this time that I’d be able to relax and go wild with a Guard in the team. So in other words, you and I have great synergy.”", "“I’d be happy to, but… can I?”", "“Of course! If it’s you, we welcome you with open arms!”", "Sergei Romanchev spread his arms out, then looked back at his companions.", "“You guys don’t have any complaints, right?”", "“Of course, not. This is the Guard that was trained by Paradise’s legendary trainer. He’d surely protect us well.”", "The scrawny man endorsed the idea right away. Then, he glanced at the female Archer.", "“What do you think?”", "“…Hm, it’s not a bad idea.”", "The female Archer tilted her chin back while breathing through her nose.", "“But, there’s a catch.”", "“Catch?”", "“Yep. I’m fine with him. I agree that having a Guard is nice. But next time, make him come alone.”", "The female Archer pointed at Yi Seol-Ah.", "“Don’t bring her along.”", "The atmosphere instantly turned heavy.", "Yi Seol-Ah shut her eyes.", "She foresaw this coming for a while now. Unlike her brother, she received a poor evaluation in this exploration.", "Sergei Romanchev looked back and forth between the two siblings before speaking with a troubled voice.", "“Mm… but they’re siblings. Can’t you compromise?”", "“What does that have to do with anything? She has an organization behind her. Anyway, I’m not going anywhere with her.”", "The female Archer said firmly and spat out her grievances.", "“She can’t even hold a lot of stuff as a porter, and she cuts in willy-nilly in the middle of fights. I mean, I wouldn’t be saying this if she did it right. There’s an unmarked one running in, so why shoot the one that the Warrior is holding back? And you even flipped shit, thinking I was the one who fired that arrow.”", "“I said I was sorry. I didn’t know that.”", "Sergei Romanchev apologized again.", "However, the female Archer was only just getting started.", "“Never mind her combat ability, she doesn’t even know how to fight! So then, does she know how to feel presences or read tracks? No. Is she really a Tracker? And she just keeps asking question after question like this is kindergarten or something. I wasn’t sure if I went out to explore or to look after a child in a daycare.”", "Harsh criticism came out.", "Yi Seol-Ah dropped her head in a hurry.", "“S-Sorry, I’m still new to all this.”", "“Then you shouldn’t have come. Or stay quiet and pick up things on your own. Do you know how many things a header needs to look out for? Do you think they have time to be answering every little question?”", "It was as the female Archer said. Every class had a role in an expedition.", "A Warrior’s job was simple — serving as a meatshield in most situations, but an Archer’s job was much more complex.", "This was especially so for a header.", "Yi Seol-Ah did not do a single thing right.", "Although she went on a few expeditions before as a member of White Rose, back then, her teammates had purposely looked out for her.", "But this time, she was met with a cold reality after setting out by herself for the first time.", "In the end, she was only a promising Earthling. While her physical level increased, her attainment as an Archer was no different than when she was a Level 2.", "“I’ll be more careful from now on.”", "“No, you don’t need to come next time. It’s either you or both of you.”", "Yi Seol-Ah’s head dropped even further as the female Archer spoke resolutely.", "She didn’t cry. She was used to being yelled at. It was just that she felt bitter, receiving such a different evaluation than her younger brother.", "“So? What’s your answer?”", "The female Archer spoke with a frown as if she hadn’t vented enough. Yi Seol-Ah’s silence seemed to be making her angrier.", "“You kept blabbering Valhalla this, Valhalla that. They must not be anything special if they’re holding onto someone like y—”", "The female Archer suddenly paused, her eyes widening.", "It was because she felt an arm gently wrapping around her neck from behind.", "“Sounds like a fun topic.”", "The face of a red-haired beauty cut in next to the female Archer’s face.", "“You mind if I join?”", "“W-Who are you?”", "“Me? I’m Phi Sora.”", "“Phi Sora?”", "The female Archer, who was about to angrily shake off the arm, froze.", "Phi Sora, the old White Rose’s scumbag and the vanguard of Valhalla.", "She had heard of the name.", "It was the same for her companions.", "Sergei Romanchev hiccuped, and the scrawny black man loosened his grip on his dagger.", "Phi Sora exchanged looks with the startled Yi siblings before raising her upper body back up.", "“I overheard you talking about Valhalla, you see.”", "“N-No, that’s not what I meant…”", "The female Archer stammered.", "“My apologies. We didn’t mean to criticize Valhalla.”", "Sergei Romanchev apologized sincerely.", "“Oh, I must have misheard then.”", "Phi Sora didn’t seem to mind all that much as she glossed over the issue.", "“Anyway, looks like you’re interested in one of our members.”", "“Ah, yes, he’s been a huge help. So if it’s alright…”", "“Sure, you guys look like a decent team. I’d be grateful if you take him along.”", "“Haha, we should be the one to be grateful.”", "Sergei Romanchev spoke joyfully on the outside but was sighing a breath of relief on the inside.", "Judging by the way Phi Sora talked, she must have been listening in on their conversation from the beginning.", "“Now…”", "Phi Sora’s gaze turned to Yi Seol-Ah.", "“You get up.”", "“Pardon?”", "“Get up, I said. I’m going to take her back, so please take good care of Sungjin. You better do well too, Sungjin.”", "The female Archer raised her gaze slightly. She looked at Yi Seol-Ah with a furtive sneer.", "“Of course, of course.”", "Sergei Romanchev replied right away. He had no reason to refuse when Phi Sora was arranging the situation to his advantage.", "“Follow me.”", "Phi Sora turned around.", "Yi Seol-Ah hesitated before reluctantly getting up. She knew that staying and clinging on would only make her look ugly.", "*", "“Don’t I get even a thank you?”", "Phi Sora said on the way back to Valhalla.", "“I got you out of that sticky situation. I know you don’t like me, but I thought you’d at least say thanks.”", "Yi Seol-Ah stared at Phi Sora’s back with an enervated gaze.", "“…How…”", "“How did I know? Yi Sungjin called me. He said the expedition ended, and that he’d come back after stopping by the pub.”", "“Ah…”", "“It’s hilarious, really. I specifically told you two to report to me before leaving, but you do it after it all ends? You guys must think I’m a joke. Anyway, I got tired of gritting my teeth and waiting for you two to come back, so I went to the pub. Then I watched you guys for a bit because things seemed a little unusual.”", "That was to say, she was watching from the very beginning.", "What would she have felt seeing me getting yelled at? She must have laughed for sure.", "A dumbstruck laugh escaped Yi Seol-Ah’s mouth.", "“How did it feel?”", "“?”", "“Going on an expedition, I mean. It’s pretty obvious that you screwed up big, thinking it would be like the expeditions you went on when you were in White Rose.”", "Yi Seol-Ah didn’t reply.", "Half of her had already given up on herself.", "“You chose the wrong team, to begin with. It’s obvious that they’re a tightly-knit, family-like team. They might not be the most skilled, but they’re usually not fond of newcomers. To join a team like that, you either have to do one of two things — be able to perform a role that they cannot in their team or show exceptional ability that goes beyond having overlapping roles.”", "They arrived at Valhalla while talking. Phi Sora climbed up the stairs, entered the Team 1 office, and then sat down.", "“What are you doing? Come in.”", "Yi Seol-Ah walked in quietly and sat down.", "“What do you think this is?”", "Phi Sora slipped a paper in front of Yi Seol-Ah.", "After reading it, Yi Seol-Ah bit her lip. It was from the intelligence team, and it detailed what the siblings did after going to Team 2.", "The last line of the report politely asked that this does not happen again.", "“To be honest, I’ve got a lot of things I want to say.”", "Yi Seol-Ah expected to be chewed out, but Phi Sora sounded nonchalant.", "“Didn’t I tell you to let me know if you need anything? At the very least, talk to your own team leader. Why go to that bitch Oh Rahee’s team? Representative put me in this position to hold the other teams in check, yet you make me get a warning like this? Did you want to frustrate me to death?”", "Phi Sora said as she put her interlocked fingers behind her head.", "“But what use is there in me talking, right? I know what you think about me, so it’s not like I don’t understand.”", "Yi Seol-Ah looked at Phi Sora in a renewed way as she listened quietly.", "Phi Sora seemed different than when she was in White Rose.", "“You must be curious why I put you and your brother in Team 1.”", "“…Yes.”", "“I’ll say this now. Let’s forget about the past and start over. I’m trying to look after you two to make up for what happened in the past. But I won’t do you two a favor ever again. Because I never did the two of you any wrong.”", "“….”", "“I brought you guys into my team despite all of that because of three reasons.”", "Phi Sora raised three fingers.", "“The first was because I was sorry.”", "“Eh?”", "“Not to you, but to Representative Seol. Well, he was the one who asked me to be in charge of Team 1, but since I took the Archer of Steel and Valhalla’s only Priest, I judged that I should take you two to make it fair to the other teams.”", "Phi Sora folded her ring finger.", "“The second was because taking you two was at least better than raising complete newbies from scratch. And the third was because Team 1’s say in Valhalla will get stronger if you two can carry your own weights in the organization.”", "“Say?”", "“Don’t misunderstand. I’m not doing this for myself. As I said before, Representative Seol asked me to take on this role. I’m talking from the team’s perspective. You might be too young to understand, but the reason Representative Seol made me the leader of Team 1 was to create a force that would support and back up the main team.”", "Phi Sora lowered her hand and then crossed her arms.", "“Well, I won’t make it any more complicated than it already is. All you need to know now is that you need to grow. You’re no good as things are right now. Strictly speaking, right now, Team 1 has less say in the organization than the intelligence team and has a weaker line-up than Team 2. Though, there’s going to be another team forming session tomorrow.”", "Yi Seol-Ah tilted her head. She looked like she didn’t understand anything that Phi Sora just said.", "But, she could tell that Phi Sora wasn’t trying to help her out of goodwill.", "“So I want you two to at least hit Level 4 on your own… Thankfully, it looks like Sungjin’s found his path. The problem is you.”", "Phi Sora said bluntly.", "“I’ll be straight with you. You understand your current position, right? That you’re just leeching off of your past connection with the representative.”", "“…Yes.”", "“Don’t you want to stop walking on eggshells every time you’re with someone? Strictly speaking, you’ve been a member even before me. You hold seniority to everyone other than the original members of Carpe Diem. Don’t you want to hold your chest up high and say, ‘I’m a founding member’!?”", "Yi Seol-Ah would have said no if it was in the past.", "But starting from the time she went to Team 2 to the recent expedition, she had gone through much and had grown weary.", "Because of it, what Phi Sora said sounded much more enticing than it would normally have.", "“…Yes.”", "And so, she quietly returned an affirmative reply.", "“I don’t want to be ignored.”", "The corner of Phi Sora’s mouth curled up.", "As the saying went, even a mute person would bark if driven to a corner. The girl, who sheepishly said yes every time, had finally revealed her true feelings.", "“That’s only natural. Alright then, do you want to try doing what I recommend?”", "“What do you want me to do?”", "“First, spit it out.”", "“Huh?”", "“When Little Chick first hatched, you were the only one who could understand his chirping. What did Lust Unni say when she pulled you outside to talk?”", "“Ah, that…”", "Yi Seol-Ah explained hesitantly.", "Once Yi Seol-Ah finished, Phi Sora nodded her head. It was as if she was saying that she expected as much.", "“Okay, then go to the Federation.”", "Phi Sora said flatly.", "“You have the jack-of-all-trades aptitude and potential spirit affinity as well. An Archer contracted to a Spirit sounds nice. You haven’t given it any thought?”", "Yi Seol-Ah was surprised. It wasn’t that she never thought about it. It was just that she gave up because there wasn’t any way around it.", "“But the Federation—”", "“It might have been a hopeless proposition in the past, but now it’s different.”", "Phi Sora put her hand on the communication crystal on her desk.", "“Mister Ghio? It’s me. Yes, come to the office.”", "Soon, Marcel Ghionea opened the door and walked in.", "“I’m sorry to call you before you leave, but I need you to help me with something.”", "“Go ahead.”", "“Can you take Seol-Ah and go to the Federation?”", "“The Federation…?”", "“To Tigol Fortress, I mean. Seol-Ah says she has a spirit affinity. Maybe you’ve guessed as much already, Ghio.”", "Marcel Ghionea nodded.", "“It’s Ghionea. Anyway, I did think it was strange that she could understand Little Chick’s chirping.”", "“Great, looks like we’re on the same page. I’ll contact the Eva Royal Palace and tell them to let the Federation know, so help her contract a Spirit. I can go too, but I think it would be better if you go.”", "“That makes sense. Can I set out today?”", "“Sure.”", "“Got it.”", "Marcel Ghionea turned back. Then, he spoke to Yi Seol-Ah, who was dazedly sitting on her seat.", "“Get ready and come out.”", "*", "That night.", "Yi Seol-Ah left Eva with Marcel Ghionea.", "To Tigol Fortress."]}