{"cid": "400", "title": "Chapter 400. To Change (2)", "content": ["Earthlings who weren’t related to the ‘Valhalla Attack Incident’ had recently started to stay in Paradise longer.", "It was exciting to see so many organizations that had been boasting their status getting beaten up one-sidedly, and they were also curious to know who the traitors acting secretly in Paradise were. Many were also interested to see how this entire incident would come to a close.", "But simply put, there was nothing more fun than watching a fire burn from across a river.", "Ever since that incident happened, every day in Paradise had been a series of chaos.", "New organizations bowed to Valhalla on a daily basis, and some organizations disappeared overnight.", "They didn’t dare to leave Paradise with a drama they couldn’t afford to miss being aired 24/7.", "But no matter how delicious a meal was, one would get tired of it after eating it every day.", "Although Sinyoung, the main dish, was still remaining, with the situation showing no sign of escalating, the boiling excitement and anticipation began to subside.", "By the time the fire became noticeably weaker compared to the beginning, a new update arrived to relight the flame.", "It was regarding an official announcement by the Eva Royal Family.", "As if that wasn’t enough, Queen Charlotte Aria would personally make the announcement.", "Once this news was confirmed through various intelligence organizations, Earthlings headed to Eva to see the royal family joining the Earthlings’ matter.", "Most people had an idea as to what this announcement would be about.", "The Eva Royal Family was stepping up to the plate? Ah, it must be to support Valhalla and further pressure Sinyoung. Then Sinyoung would have a harder time just sitting still. How would the Scheherazade Royal Family react?", "Most were thinking along these lines.", "*", "By the time the sun rose to the middle of the sky, the streets of Eva grew rowdy.", "Earthlings residing in Eva and even Earthlings from other cities had all come out. There were Paradisians in the mix as well.", "Seol Jihu was waiting inside the royal palace to prepare for anything that might happen.", "He was on the rooftop of an appropriate building, looking down at the crowd that was gathering around the palace with his back leaned against the wall.", "As today was the most important day, a faint tension could be seen in his eyes.", "How much time went by?", "Seol Jihu turned his gaze at the sound of people’s murmuring.", "He could see a familiar girl in the distance. Her hair, which was usually tied in twin-tails, was neatly braided up, and a silver-white tiara adorning a red ruby was sitting on her head.", "The girl, who had clearly taken great care into dressing up for the event, walked out slowly on a terrace on the highest level of the palace.", "Charlotte Aria had finally made her appearance.", "Though she was trying to act dignified, her expression, which did not hide her nervousness, made Seol Jihu chuckle.", "On the other hand, he was worried. To Seol Jihu, Charlotte Aria was only a young, lovable girl. He wasn’t sure if she could withstand the reaction of such a large crowd.", "However, the die had already been cast.", "Though he was worried, he decided to trust Sorg Kühne, who gave his assurance.", "Kim Hannah had changed and Seol Jihu himself had changed. There was no reason for him to doubt that Charlotte Aria couldn’t change as well.", "Perhaps, she already had.", "From what he heard, Charlotte Aria had forcefully dragged Eva’s Earthlings to the Tigol Fortress War. Now was a good time to see whether that was true.", "Seol Jihu swallowed his saliva and stared at Charlotte Aria, who was slowly looking around at the crowd.", "How would she start her speech? What if she freezes up from nervousness? As Seol Jihu watched, half-concerned and half-excited…", "“Twenty-one years ago…”", "Charlotte Aria calmly began her speech.", "—A new alien race appeared on this planet.", "Though trembling slightly, her voice carried a certain dignity.", "Speaking in a grand voice imbued with a minute amount of mana, Charlotte Aria started her speech.", "—After the appearance of the Parasites, the Empire, which reigned supreme at the apex of Paradise as the Country of the Never-Setting Sun, was razed to the ground in less than four years.", "‘Already?’", "Seol Jihu’s eyes widened. He thought she would start with a brief introduction.", "—After the fall of the Empire, two winds of change blew inside Paradise, which was on the verge of falling to the Parasites’ hands.", "It was the same for the crowd.", "—The first change was the appearance of the Fallen Angels, followed by their establishing of the Federation.", "They were all furrowing their brows and looking up at Charlotte Aria. They had expected her to declare their support for Valhalla and openly denounce Sinyoung at best, so what was this sudden talk of history?", "—The second change was the entry of you Earthlings onto this planet.", "Charlotte Aria gazed softly at the crowded streets. She surprisingly seemed to have a natural talent for speaking in front of a crowd as her trembling had subsided before anyone noticed.", "—It was not bad at first. The earliest Earthlings understood our plight, rapidly grew stronger under the blessings of the Seven Sins, and participated in wars for Paradise.", "—The Seven Kingdoms were also committed to supporting the Earthlings back then, and they gave appropriate rewards to those who made contributions.", "—Fight with us and receive items of this world as rewards. It was a logical relationship of a clear give-and-take.", "—That was how it was… at first.", "As Charlotte Aria emphasized the last bit, the faces of a few Earthlings stiffened.", "—A lot of time passed since then, long enough for one girl to have her parents and brothers ripped asunder by war and to have risen to the throne alone.", "—Over the last ten years, countless Earthlings have gone through Paradise, and as the influence of the Earthlings grew, so did our relationship. From a give-and-take relationship to a one-sided give-or-take relationship.", "Displeased looks began to spread on the spectating Earthlings’ faces.", "—Of course, I am not saying all Earthlings are like this.", "Charlotte Aria cleared her throat.", "—Some of you certainly have not forgotten about the relationship of the past. In fact, I know there are those who do not hesitate to risk their lives to give to Paradise.", "—Let me take this opportunity to express my utmost gratitude and respect to these Earthlings.", "Charlotte Aria gently closed her eyes, held her skirt out slightly, and curtsied gracefully.", "—…But.", "She then opened her eyes and signaled a twist.", "“Unfortunately, a majority of you do not have the qualification to receive my gratitude.”", "Her voice was calm as she dropped this bombshell.", "The Earthlings blinked at the sudden blow.", "Soon, menacing looks surfaced on their faces.", "—I’m sure you all remember the Parasites’ attack on Tigol Fortress one year ago.", "—At the time, knowing that the fall of Tigol Fortress would result in the destruction of the Federation, thus exposing Eva to danger, this royal self requested you all to join the war.", "—But what were your reactions?", "—Most of you rose up in protest and criticized this royal self, and one group even barged into the royal palace and threatened this royal self openly.", "—That day, I asked for the first time.", "—Why?", "Charlotte Aria’s voice gradually got louder.", "—How come?", "The air also grew heavier, exerting great pressure.", "—The few who cared were out there, risking their lives on the boundary of life and death.", "While everyone stared with expressionless faces, Charlotte Aria continued without the slightest tremble in her voice.", "—So why was it that the vast majority of Earthlings were so proud in trying to avoid their duty as if it was the most natural thing?", "Before anyone noticed, the Earthlings were all glaring.", "—This majority of you are enjoying the benefits of being Earthlings, receiving rewards, and taking pleasure in their activities in Paradise.", "So what of it?", "—So why are you so busy returning to Earth whenever your precious Paradise is in danger?", "What are you getting at? What are you trying to say?", "Their openly hostile gazes fell on the queen.", "Although nothing Charlotte Aria said was wrong, no one was comprehending her message.", "Facing their piercing gazes…", "—This royal self is truly curious.", "Charlotte Aria endured.", "—This isn’t all.", "—I’m sure you all are aware of what recently transpired.", "Fighting hundreds of hostile gazes…", "—What’s the reason?", "She asked back.", "—Rather than helping and cheering on the person giving his all to protect Paradise…!", "And continuing her words firmly…", "—For trifling reasons, you, despite having the same duty, choose to attack the person carrying out the same duty?", "She quietly expressed her rage.", "—Did the Seven Sins summon you all to this world forcefully?", "Those who recognized Paradise’s situation and voluntarily accepted its call, they were called Earthlings.", "—Or did we force you into slavery and send you to your doom?", "Those who campaigned for the freedom and the rights of Paradise, they were called Earthlings.", "—No, we did not. You all were given the freedom of economic activity. You all are citizens who have the duty to protect this land!", "—Despite this, you only pursued benefits, fighting and slinging mud at each other. Whenever there was a draft call, you cursed your country and were busy to return to Earth.", "—How can you ask for the right to pursue profit whilst ignoring the responsibility following it?", "Such people were Earthlings too.", "—Yet you dare to think you are qualified to be in this world? Are you not ashamed of yourselves?", "The enraged Charlotte Aria’s eyes slowly turned gold.", "—…As if that wasn’t enough.", "—You try to harm the hero of humanity and the Federation? To prove your worth to the Parasite Queen?", "—On top of ignoring your duty, you dare to side with the enemy you are supposed to fight?", "—The truth has already been revealed, yet rather than explaining yourselves, you’re staying silent and hoping it all goes away!?", "—Words cannot describe how aggrieved I am to think such shameless traitors may be listening to me, right now, right here, in this city!", "Kim Hannah, who was listening to the speech, almost burst out laughing.", "It was just too beautifully put. She was so focused on listening that she almost glossed over it.", "Charlotte Aria started by mentioning Paradise’s history. She then pointed out the Earthlings’ contradictions before mentioning the recent incident and stealthily lumping it onto the crowd.", "It was like she was suggesting, ‘Who’s to say you aren’t among them?’", "‘What is she trying to get at by saying all this?’ Kim Hannah strained her ears with an intrigued look.", "—This royal self has judged that this problem cannot be left alone any longer.", "And so.", "—For the survival of this world, modeling after the two changes of the past that have supported Paradise until now, this royal self vows to enact two new changes.", "—Today, in this place.", "Charlotte Aria raised her main point at last.", "—First, as of today, Eva will formulate a restoration of relationships with the Federation.", "—Going beyond a simple alliance, Eva will become a pillar of support for Tigol Fortress and take on the role of mutual assistance with the Federation.", "The crowd buzzed.", "Formulation of an official alliance with the Federation.", "This wasn’t anything to be surprised about given that Eva already had a tacit alliance with the Federation.", "But becoming a pillar of support for Tigol Fortress and taking on the role of mutual assistance?", "—Second.", "Before anyone could fully process the first vow, Charlotte Aria continued.", "—In Eva, which will carry out Tigol Fortress’ rear base missions, having Earthlings, who avoid participating in wars, and traitors, who collude with the Parasites, will be the height of outrageousness.", "—And so, the Eva Royal Family will request for one power over all Earthlings that reside in Eva.", "—The authority to modify the setting that the Seven Sins have given you!", "As soon as Charlotte Aria made this declaration, a heavy silence descended on the city.", "Some doubted their ears. A royal family asking for the authority to modify an Earthling’s status window. In truth, this second point was the true core of Charlotte Aria’s speech.", "The status window setting was the source of an Earthling’s power. To touch that was to touch the foundation of an Earthling’s activity.", "—The representative of Eva Royal Family’s partner organization said this.", "—Those who attacked Valhalla, those who devised and supported the plan, and those who knew about the plan and remained silent. I will not distinguish them. Every organization and Earthling involved in this matter will have to take responsibility.", "—This royal self is of the same opinion.", "—As of today! Eva will not distinguish between those who do not try to fight the Parasites and those who collude with the Parasites!", "—Those who cast aside their duty and only pursue their own benefits will come to bear responsibility for their actions!", "Kim Hannah closed her eyes. Her throat trembled. She finally understood the true intent behind the recent series of incidents.", "Seol Jihu was not targeting Sinyoung.", "The twenty-four organizations, including Sinyoung, were only stepping stones to his ultimate goal.", "Right, from the very beginning, Seol Jihu’s target had been Paradise, the whole of Earthlings.", "The fire that was kindled in Eva today would soon spread like wildfire throughout the entire human territory.", "That wasn’t all.", "Earthlings who were active in Paradise could largely be categorized into two types: those who were part of an organization and those who were not.", "It went without saying that the former were the ones that usually led Paradise.", "Valhalla and its supporting organizations had no reason to be bothered by the queen’s statement.", "Because it was true that they were fighting the Parasites while greatly endangering their lives.", "Powerful organizations of other cities had no reason to object either. In fact, they should welcome it.", "Because the top thirty or forty percent of organizations had all turned their backs on Sinyoung and signed a contract with Valhalla.", "The contract had the following provisions:", "1. Those who sign the contract shall not collude with the Parasites and not do anything against the interest of humanity.", "2. In the case that a war against the Parasites breaks out, those who sign the contract shall spare no effort to help humanity.", "These organizations were forced to carry out these terms even before Eva’s queen made this official announcement.", "Naturally, representative organizations of Nur, Grazia, and Caligo were included, and there was no need to even mention Eva, Haramark, and Odor’s representative organizations.", "In other words, Seol Jihu was forcing Sinyoung to make a decision.", "Will you take our offer or be left behind in the dust?", "“…Hic.”", "‘So this is what he meant.’ When Kim Hannah thought so, she was overwhelmed with emotions and wiped the tears glistening up with a handkerchief.", "[Did I… do something wrong?]", "[Why is everyone so bent on harassing me?]", "[ I, I just wanted to save them, that’s all. I didn’t have other intentions.]", "[It’s true that I just did what I wanted at the time, but it’s not like I hurt them or inconvenienced them somehow.]", "When she heard Seol Jihu say these words in the past, she was inwardly seething in frustration.", "But the child from back then, who didn’t know the way of the world had grown to the level of setting up such a grand scheme.", "Not only that, but he was also trying to devour everything, to grasp the world in the palm of his hand.", "Kim Hannah held onto her stained handkerchief and gazed at the crowd.", "‘He set the foundation to minimize opposition as much as possible, but still…’", "It was probably wishful thinking to expect zero backlash.", "“W-What was that?”", "“You’re going to meddle with our settings?”", "And lo and behold, fierce outcries burst out.", "“We’ve had enough!”", "“Insane. You’re completely insane!”", "“All that talk for this… You just want to use us as slaves!”", "“You must be mad!”", "All sorts of sharp criticisms were hurled toward the queen.", "It showed how Earthlings currently viewed Paradisians.", "Charlotte Aria scanned the streets with cold eyes.", "—No.", "She spoke with a snort.", "—For you all, who shut your ears and interpret my words however you want, this royal self will say it clearly one more time.", "—We will only meddle with the settings of those who do not try to fight the Parasites and those who collude with the Parasites.", "—If you are an Earthling who knows to perform the duty that follows your freedom, you should have no reason to object to this rule.", "—I am saying the royal family will investigate and eliminate potential traitors like the ones from the most recent incident. Should you not be happy about that?", "—Or could it be that the ones who are angry have been promised something by the Parasite Queen?", "The commotion died down in an instant.", "No one could find the words to object.", "There was no way to find fault with what she said.", "—You don’t answer the important question… yet you call me crazy.", "A mocking smile emerged on Charlotte Aria’s face.", "She sighed and then raised her hands above her head.", "—Right, I must look like a crazy woman to you all.", "—But to me, you are the crazy ones.", "—Right, both you and I are crazy. It’s not just us. This world itself has gone crazy.", "—If it is to survive in this crazy world, I will not hesitate to do crazy things.", "She then held up the tiara on her head.", "—This is a token of Royal Oath, which the Seven Kingdoms were promised in return for serving the Seven Sins.", "—At the time, Second Brother and I each received one each. When Campbell Aria used his Royal Oath, he said this.", "—Don’t use this precious item for something like reviving a family member.", "—Use it for Paradise, when it needs it the most.", "—It seems that time has come.", "Charlotte Aria slowly lowered the Royal Oath to her chest.", "She then spoke in a solemn, imposing tone.", "—Hear me, Earthlings.", "—This royal self will go to the temple immediately after this. Using this token of an oath, which even the gods cannot refuse, I will formalize what I announced today.", "—Not by Valhalla’s will, not by the Seven Sins’ will, but by my own will.", "—Those who object to my will!", "Pzzt!", "Charlotte Aria’s eyes, which were glowing in a golden hue, crackled with golden-yellow electricity.", "—LEAVE!", "A thunderous voice struck down on the area.", "—Such people have no right to be in Eva! This Eva will reject them! On the name of Aria!", "—…I will not say it a second time.", "She pointed to the palace gate and then turned around.", "“….”", "Seol Jihu was smiling, leaning against the wall with his arms crossed.", "‘She’s even better than I thought…’", "Now that things had progressed to this point, an indescribable emotion welled up inside him.", "For some reason, he liked how the streets had gone silent from shock.", "He wanted to savor this air a little longer… but he took his back off the wall after seeing Charlotte Aria walk toward the main gate.", "“W-Wait!”", "“Are you really going to do this!?”", "As soon as Charlotte Aria walked out to the streets, Earthlings crowded around her from all sides with hostility.", "However, they paused before they got anywhere near her.", "It was because Seol Jihu was following her along with the members of Valhalla.", "“Representative Seol.”", "Seeing the crowd filling up the path to the temple, Chohong called Seol Jihu.", "When Seol Jihu nodded slightly, Chohong grinned and flew forward, violently striking down the Thorn of Steel.", "BOOM!", "A large crater formed on the ground.", "The destructive power of the strike was unbefitting of a simple swing of the arm. It was the result of enhancement stones strengthening the weapon.", "As Chohong stared at the crowd with her unique, piercing gaze, the Earthlings backed off in shock.", "Like Moses parting the Red Sea, a path opened up between the crowd.", "Seol Jihu walked up to Charlotte Aria.", "Standing beside her, he could clearly feel Charlotte Aria trembling faintly. He felt like she would reach out with her tiny hand and grab the hem of this shirt.", "However, Charlotte Aria did not do so.", "She held back.", "Guarded by Valhalla and its supporting organizations, she walked forward with her tiara held tightly in hand.", "Cutting across the silent streets, she did not show a single sign of weakness until she arrived at the temple.", "*", "That day, Charlotte Aria carried out her words using the Royal Oath, and the Seven Sins shared control over a part of the setting they created.", "This was limited to those who did not try to fight the Parasites, those who colluded with the Parasites, and major criminals—the authority to drop or restore their stats, and even seal or eliminate their ability was granted.", "Along with it came the authority to permanently bar entry into Paradise.", "All to the queen of Eva."]}