{"cid": "116", "title": "Chapter 116. Quickening", "content": ["‘She’s….’", "Now that he thought about it, there was someone else. When Seol Jihu and Maria first entered the room, there were two people inside. The first one was the bob cut Lara Wolff, and the other was this girl with the white headband. Because she hadn’t said a word this entire time, he had forgotten about her existence.", "Her snowy silver-white hair matched her white clothes. She was deeply absorbed in something to the point she didn’t notice Seol Jihu’s fixed gaze.", "Soon, the girl’s eyes curled to a crescent moon shape, and she covered her mouth with her hand.", "‘She’s laughing?’", "What was she laughing about? Seol Jihu’s eyes narrowed as he glanced in the direction the girl was looking. There, he saw Sophie Chalet who was receiving treatment as she let out muffled groans, Lara Wolff who had fallen into despair, Straight Face who had her arms folded, and Snake Eyes who was sniggering.", "One who suffered, one who sneered, and one who enjoyed watching.", "Suddenly, Seol Jihu was reminded of the middle-aged man who had struggled from guilt after abandoning his wife and daughter to run away. He was also reminded of Kang Seok, who had stood in front of him and laughed uncontrollably.", "‘She’s different than how she looks, huh….’", "The girl must have realized the young man’s gaze as she raised her slim face. Their eyes met. Her arced eyes blinked a couple of times before she lowered her hand. Judging by the way her thin, pale lips were quivering slightly, she must have been laughing in secret.", "The girl didn’t avoid Seol Jihu’s gaze. She tilted her head slightly before setting it straight and beckoning him with her frail hand.", "‘Does she want me to get closer?’", "Seol Jihu didn’t hesitate. It didn’t seem like a bad idea to try and talk to her, so he walked forward immediately. Because the girl was removed from the rest of the group, he had to walk a good distance. That said, they were both in the same room.", "Once he got close, the girl gave him a blank look while saying, “I think you’re misunderstanding me.”", "Her voice was quiet and soothing like a melody, but it also sounded empty and hollow. “I laughed, but it wasn’t because I was sneering at them or because I found the sight funny.”", "The girl admitted to laughing but pleaded her case skillfully. Seol Jihu noticed how good she was at reading people’s thoughts and felt a bit sorry.", "Even if the girl did laugh, Seol Jihu had no grounds to pick fault with it. He could think badly of her in his head, but the moment he said it out loud, he would end up being a nosy person.", "At the very least, that was Seol Jihu’s perspective regarding the matter.", "“It’s fine. I don’t mean to interfere in your business.”", "Hearing this, the girl smiled while nodding her head. “You were just staring at me so much….”", "Seol Jihu observed the girl’s hollow smile. Looking at her up close, he noticed how white, or rather pale, her cheeks were. Her waist was also extremely slender and delicate as if she would snap in half if he held her with a little force. She clearly had an illness of some sort.", "“If it’s okay with you….” Seol Jihu asked bluntly, “can you tell me why you were laughing?” He didn’t judge her. He was more curious than anything else.", "The girl looked up at him and muttered softly, “Because it seemed like a play.”", "‘So she also felt that way?’ Seol Jihu laughed bitterly.", "“Right?”", "“Yes,” Seol Jihu agreed as he had also been thinking that Straight Face was just enjoying her hobby.", "“I was wondering why the majority of people got separated…. I didn’t expect to be role-playing at my age.”", "“…Excuse me?”", "“I haven’t even done it when I was little.”", "The girl smiled brightly. Seol Jihu mulled over what she just said. It sounded like they were talking about different things.", "“Role… playing?” Seol Jihu tilted his head. “You mean like a puppet show?”", "“No, I wouldn’t say puppet since everyone is acting as they normally would….”", "“?”", "“Mm…. Right, everyone is being true to their nature…. Since no one is playing an assigned character or a fictional role, this isn’t an ordinary role-play.”", "In an instant, the girl fell into a world of her own. Looking at her, Seol Jihu wondered if he should continue talking to her or walk away. He wasn’t sure if he was the idiot for being unable to understand her, or if she was simply talking in a cryptic way.", "The girl glanced at him with languid eyes. From the previous exchange, she realized that the young man had yet to understand.", "“You see, I think there is a good chance that this group has been put together deliberately.”", "What did that mean?", "“I guess you could say this conflict was bound to happen.”", "“Why?” Seol Jihu immediately asked back.", "The girl opened her mouth before revealing a troubled face, “Mm— I know the reason in my head, but it’s hard to explain in words. It’s like different extremes or like counterparts.”", "She gently scratched her lips with her index finger, seemingly trying to think of a good way to explain her theory. Soon, she pointed at herself and began, “For example, if I am the altruistic person…”", "Seol Jihu stared at her fixedly. The girl smiled sheepishly.", "“What? I’m really kind.”", "“….”", "“Anyways, if I am the altruistic person, then that person is the selfish person.”", "The person the girl was pointing to was none other than Maria Yeriel.", "“What do you mean?” Seol Jihu asked back, but he immediately became speechless. He realized that the phrase, ‘selfish person’, described Maria perfectly.", "‘How did she know?’", "Did she hear Maria talking to me about going our own way? Or was it because she refused to cast barriers?", "“So you see….”", "While all sorts of theories brushed past Seol Jihu’s mind, the girl clenched her hands into fists and bumped them into each other.", "“That person and I are counterparts.”", "Seol Jihu stared at the girl with a complicated look. He finally understood what the girl was saying, but accepting it was a different matter.", "“Also—” Next, the girl’s finger headed to Lara Wolff. “If she is the type of person who values cooperation and mutual help….” She then pointed to Straight Face. “…Then she is the self-centered maverick.”", "Seol Jihu only looked half-convinced. What the girl was saying made sense, but he was constantly plagued by the thought that there was no way to confirm it.", "The girl’s finger then headed to Sophie Chalet. “If she is the gentle person….” She then pointed to Snake Eyes. “…Then she is the vicious person.”", "“Vicious?”", "“Yep.” The girl nodded her head before saying, “she smells rotten.”", "She pinched her nose and said something more enigmatic, “She’s going to die early because of it….” The more the girl talked, the more mysterious she became.", "‘Let’s see.’", "Seol Jihu chuckled inwardly and activated his Nine Eyes. When he checked Snake Eyes’ Status Window with the green color of ‘General Observation’…", "“!”", "He gasped.", "His eyes trembled as it confirmed the trait ‘Vicious (Deliberately cruel and heartless)’.", "That wasn’t all. Lara Wolff, Straight Face, and Sophie Chalet weren’t too far off from what the girl said. As for Maria, she was obviously spot on.", "‘Im… impossible….’", "“Think about it.”", "Seol Jihu turned back to the girl with widened eyes.", "“With four pairs of people just as incompatible as water and oil, how can a conflict not break out?”", "Seol Jihu subconsciously agreed, “Not random…. So that’s what you meant when you said this group was put together deliberately.”", "“It fits too well to be a coincidence.”", "“Then….” Seol Jihu paused briefly before continuing, “…what is the motive?”", "The girl was talking nonstop for a long time, but this question made her shut her mouth. Obviously, it wasn’t as if the girl was omniscient.", "“I don’t know,” she admitted quietly. “But for some reason… what you said about a puppet show is weighing on my mind.”", "Seol Jihu had thrown the word around thoughtlessly, but the girl seemed to have taken it seriously.", "“To be sure, we need the final piece of the puzzle….” She blurred the end of her speech and looked up at the young man.", "Seol Jihu pointed to himself in a daze.", "“Me?”", "Immediately, he went “Ah!” He had remembered the man who died as soon as he came in. If the girl’s theory was correct, that man had to be his counterpart.", "“Oppa, have you heard of this saying?” The girl stealthily changed the way she addressed him, but Seol Jihu didn’t mind that much. Before he noticed, he had gotten fully absorbed in talking to the girl.", "“That if you gather five people together, one person is always trash?”", "“I think I’ve read about it online…. Wait, are you saying that I’m—”", "“Of course not.” The girl denied it without hesitation. “I hope that Oppa is a treasure.”", "“Is that the counterpart of trash?”", "“Yes. Because then an interesting situation will develop.”", "Seol Jihu tilted his head curiously.", "“The three pairs we know about are skewed the same way in terms of usefulness in battle and alignment of personality.”", "She was right. In terms of ability, Straight Face, Snake Eyes, and Maria were elites, but the other three were the opposite. The former three also happened to have bad personality traits, while the latter three had the good ones.", "“It would be terrible if Oppa is on the other side… but if not, then you would be the only counterexample in this group.”", "“….”", "“We might be able to find out more about the existence who created this setting.” The girl cupped her hands together and continued, “That’s why I’m so curious.”", "What kind of a person Seol Jihu was.", "“Whether you’re someone who will inflame the already-wounded relationship, aggravate the division by playing politics, and seek to use the conflict to your benefit.”", "Or.", "“Whether you’re someone who will mend the broken relationship, reconcile the division with words, and bring everyone together like one who leads.”", "In that instant, Seol felt as if his head had been struck by a hammer.", "“Your Status Window…. Can you show it to me, please?”", "The girl requested, but Seol Jihu was no longer listening to her. The phrase he had forgotten about for the longest time, but one that was etched deep inside his consciousness….", "Executor. The One Who Leads.", "‘Ah….’", "Suddenly, a strange sense of deja vu crept over him. It was the same feeling he got when he was floating in Huge Stone Rocky Mountain’s lake, the kind of wistful feeling similar to a word being stuck on the tip of the tongue.", "Before, he had lost touch with the sensation in a stupid way. Refusing to make the same mistake, Seol Jihu desperately searched his memory.", "The words the girl mentioned: Role-playing, counterparts, deliberate, the one who leads….", "Finally, when he remembered the Golden Commandment he had seen at the start….", "‘AH!’ The five words connected together, and a ray of light seemed to shine through the dark clouds in his head. He was progressing without a clear plan, but now, he felt like he found the thread-like pathway to the solution.", "Of course, he couldn’t be sure that it was the correct answer. After all, it was only a possibility.", "But he became convinced of one thing. And that was his role within this group.", "An altruistic person without skill.A calculative person with skill.", "A cooperative person without skill.A self-centered person with skill.", "A gentle person without skill.A vicious person with skill.", "And… a person with skill, who had yet to decide.", "‘So they want me to make up my mind.’", "He had two paths to choose from. The answer was already out there. His Nine Eyes were telling him which one to take.", "When he thought this—", "‘Can I… do it?’", "He finally realized the gravity of the situation. At the same time, he realized just how difficult his job was.", "Setting aside the fact that they were complete strangers, leading Straight Face and Snake Eyes, two unpredictable and volatile individuals, seemed extremely difficult.", "Seol Jihu closed his eyes to calm his beating heart. Suddenly, the village head’s words brushed past him.", "[We’re living in such a time.]", "[There is no right or wrong in matters of survival.]", "[Whether you are a righteous man or of a wicked persuasion, you have to gather under one banner and pool your resources to survive. That is the case, even now.]", "With that, he finally came to a decision. Now wasn’t the time to worry about whether he could do it. He had to do it.", "Soon, his eyes flickered open.", "‘Let’s do it.’", "As Seol Jihu looked at the six people in the group, his eyes glistened like the stars in the night sky.", "*", "Same time.", "—?", "The ‘existence’ sitting on the Corrupted Throne trembled. With one hand supporting her head, her eyebrows slowly went up. The existence looked around the area with half-closed eyes.", "What spread out before her was a vast space. Around Paradise, the planet she inhabited, countless stars were forming a galaxy.", "The vision of a god was both physically and mentally on a different dimensional level than the vision of a human.", "Using her divine eyes, the existence read information about the movements and changes of the constellations.", "—I….", "…Felt a tingling sensation. The existence, who had devoured the Chief Deity, had detected it. There was no chance it was a simple matter.", "However, even when the existence examined the stars, she could not find anything out of place. Well, it did seem like some stars were grouped closer together….", "But the star in the center of it wasn’t shining.", "Gathering around a dead star would not pose a threat to her.", "—Hm….", "Was she mistaken about the feeling? She let out a subdued hum before closing her eyes once again.", "Thus, the existence sitting on the Corrupted Throne, the Parasite Queen, fell into a deep sleep."]}