{"cid": "264", "title": "Chapter 264. The Beauty at the Opening Ceremony (1)", "content": ["Once the series of intense incidents finally came to a close, Carpe Diem regained its peaceful days.", "But a war didn’t end just because there was a victor. Dealing with the aftermath of a war was just as important as the victory itself.", "If Carpe Diem was satisfied just with defeating its enemy, it would not have such peaceful days later on because just like in Haramark, people would employ all sorts of methods to hinder them.", "But unlike back then, Carpe Diem now had Kim Hannah.", "Being the witty fox that she was, Kim Hannah knew other Earthlings would hold grudges against Carpe Diem if it devoured an easy-to-control city like Eva for themselves.", "That was why she put the Triads forward, portrayed Carpe Diem strictly as victims, and even put out the fake news that Jang Maldong and Seo Yuhui, the two influential characters in Paradise, were severely injured.", "On top of that, she had utilized Ochoa Cartel’s Omar Garcia and the leaders of each of the other organizations and made them cough up their relationship with Evangeline’s representative, Jung Sua.", "They were harder to deal with since they were closely related to the royal family, but if things went well, Carpe Diem would be able to blow their nose without using their hands.", "In truth, victory was more or less assured at this point. The result of the investigation was revealing numerous evidence of communication between Jung Sua and Omar Garcia, and there was testimony from Dongchun Merchants and Red Hwaru’s representatives as well.", "As a result, Jung Sua was surrounded by enemies on all sides, and more and more members of Evangeline were leaving the organization every day.", "The problem was that Jung Sua was persevering even in such a situation.", "“Sorg Kühne is trying to push Jung Sua to a corner by using the fact that she provided assistance for Eva Alliance’s attack on Carpe Diem.”", "Kim Hannah’s finger tapped on her chair’s armrest.", "“The problem is that there’s only circumstantial evidence.”", "Seol Jihu tilted his head.", "“Didn’t Omar Garcia confess? You said there were testimonies too.”", "“But there’s no decisive piece of evidence. She should really be raising the white flag at this point, but she’s struggling to the bitter end. Well, she must know that there’s a chance of survival as long as she holds on to the Queen.”", "Seol Jihu fell into thought.", "‘The Queen…’", "When he first came to Eva, he had high hopes and wanted to meet her. But his curiosity was dwindling by the day. Now, he didn’t really care to see her.", "‘She sounds like a really frustrating person.’", "Seol Jihu smiled faintly, to which Kim Hannah gave him a strange look.", "“Why are you smiling?”", "“Ah, I just remembered what you said before.”", "“What’s that?”", "“That not all royalty is like Princess Teresa or King Prihi.”", "Kim Hannah nodded.", "“It can’t be helped. Eva’s Queen is a pitiful person if you get to know her. If you’re judging her as a human being and not a ruler, that is.”", "“What if you judge her as a ruler?”", "“A total failure. If someone like her can be a queen, I would do it a million times better. I still can’t believe that brat shares the same blood as her father and older brother.”", "Kim Hannah criticized the queen sharply. Seol Jihu suddenly grew curious.", "“What kind of a person is Jung Sua? She’s also from Area 1, right?”", "“She’s an opportunist. And to add one more thing—”", "Kim Hannah’s eyes rolled.", "“Come to think of it, you participated in the last Banquet, right?”", "“Yeah.”", "“Then you should remember role-playing.”", "Role-playing. It was a term he hadn’t heard of in a while.", "The burly man known as the Heaven-Slaughtering Star and the odd white-headband girl crossed his mind, but he chose to ask about them later. That wasn’t his focus for now.", "“Jung Sua too lost in role-playing and is struggling in her own delusion. Together with her opportunistic nature, she’s a weird type of hybrid that you probably haven’t seen before.”", "“What do you mean by role-playing?”", "“The role of her predecessor.”", "Kim Hannah answered right away, but Seol Jihu still looked confused.", "“Can you explain in more detail?”", "“Ah— It’s a bit complicated. Where should I start…”", "Kim Hannah must have expected this response as she closed her eyes and swept down on her face.", "“Evangeline was a good organization. By your standards, I mean.”", "“?”", "“Listen. You know that Evangeline’s members are continually leaving the organization right now, yes?”", "“Yeah, I’ve heard of it.”", "“Why do you think they’re leaving? Or rather, what can you get out of this?”", "Kim Hannah continued.", "“It’s simple. Their affection fell when the representative they thought was just and clean was actually dirty. Meaning, Jung Sua didn’t share her relationship with the Eva Alliance with the rest of the organization.”", "“You’re saying Jung Sua used to be an Earthling who sincerely cared for Paradise in the past? And she’s changed now?”", "“No.”", "Kim Hannah spoke firmly.", "“I told you, Jung Sua is an opportunist who’s too much into role-playing. The real one was her predecessor, Evangeline Rose.”", "‘Evangeline Rose?’", "“Well, she died in the last Banquet though.”", "‘Ah.’", "It was then that Seol Jihu realized the truth. The Earthling who volunteered to enter the Plaza of Sacrifice first and was killed. Gula had once regretted the ‘Guardian of Eva’ dying in exchange for the ‘Hero Killer’ dying as well.", "Seol Jihu spoke after thinking about the matter for a long time.", "“Weren’t Evangeline and the other organizations treated as a single entity in the past?”", "“Yeah, but something interesting happened after Evangeline Rose died.”", "“Something interesting?”", "“The seven organizations captured some of their own members and killed them.”", "The corner of Kim Hannah’s mouth curled up.", "“There are many theories about this, but I think the most likely one is that Evangeline Rose planted spies in the seven organizations. You know, like double agents. They’d pretend to be on the seven organizations’ side, making them put their guard down while gathering evidence to send them flying in one go.”", "Kim Hannah then added, “Kind of like what we did.”", "“…How do you know all this?”", "Seol Jihu was surprised.", "“Don’t underestimate me. Sinyoung’s intelligence network is far wider than you think.”", "Kim Hannah continued.", "“Anyway, for whatever reason, she participated in the Banquet and died in Stage 2. She failed to deliver the fatal blow she worked so hard to prepare.”", "“….”", "“That’s when Jung Sua stepped up as the proxy leader. She smoothly swallowed the empty seat Evangeline Rose left behind and even won over the Queen. I could genuinely praise her for her hustle if she just stopped there, but…”", "Kim Hannah shook her head.", "“She used Evangeline Rose’s scheme for a secret deal with the seven organizations. So really, she’s just a pathetic opportunist who’s desperate to maintain her position.”", "Kim Hannah spoke as if it wasn’t a big deal, but this detail made Seol Jihu’s interest in Evangeline Rose grow bigger.", "‘Kim Hannah said it was only a theory, but there’s a high chance that this is the truth.’", "After all, this fits perfectly with Evangeline Rose’s title as the ‘Guardian of Eva.’", "But what Seol Jihu couldn’t understand was why she decided to participate in the Banquet. Why would she do something so risky when the opportunity to destroy the Eva Alliance was around the corner?", "Just what wish could she have had?", "‘There has to be something… I can smell it…’", "“Anyway, I’m sure we’ll hear from Jung Sua soon.”", "Kim Hannah continued.", "“Before then, let’s do what we need to. You know, like registering as an organization like we discussed yesterday. We also have to hold the opening ceremony. We can’t delay these things forever.”", "Seol Jihu stopped nodding and asked.", "“Opening ceremony?”", "“It’s nothing much, just announcing to the world that Eva is our territory and that no one should thoughtlessly meddle with it.”", "“And everything’s good to go for the organization registration?”", "“There’s just one thing.”", "Kim Hannah stretched her arms out and twisted her body side to side.", "“The necessary papers are all ready, and Sorg Kühne said he’d approve instantly if we bring them to him, but there’s just one thing missing~”", "Kim Hannah giggled as she said in a carefree manner. Seol Jihu furrowed his brows.", "“What’s missing?”", "“The new organization’s name.”", "Kim Hannah spoke clearly.", "“You said you were going to come up with a new name. You forgot already?”", "Seol Jihu went ‘Ah.’", "*", "After dinner, Carpe Diem’s members gathered together to decide on what would be the organization’s name.", "An organization’s name had to be simple and concise so that people could intuitively understand its meaning. It would be even better if it sounded nice.", "Choosing a long, complicated word to make a cool name was not preferred because once registered, an organization’s name could not be changed so easily.", "In a way, this was an important matter, so everyone sat down together to offer their thought.", "Chohong was the first one to speak.", "“The Strong.”", "She crossed her arms and tilted her chin up. She seemed extremely satisfied with the name she came up with.", "“The Strong. Let’s go with The Strong. There’s no better name than The Strong.”", "Seol Jihu asked with a reluctant look.", "“…The heck does that mean.”", "“Isn’t that obvious? It means we’ll only accept strong bitches and bastards! The Strong.”", "“Haak!”", "Phi Sora tilted her head back. She burst into laughter once again.", "“The Strong is a bit meh.”", "Hugo also struck down the idea.", "“What?”", "Chohong, who was glaring at Phi Sora, raised her eyebrows in anger.", "“I like the meaning, but not the way it sounds. How about—”", "Hugo cleared his throat.", "“The Mighty. That sounds smoother, doesn’t it? Ah, we can go with Tyrant too. Ooh, yeah, Tyrant sounds nice!”", "“Haak! Haak!”", "Phi Sora was practically spazzing at this point. And she wasn’t the only one.", "“Keuk!”", "Even Jang Maldong turned around and dropped his head.", "“….”", "And Seo Yuhui looked like she received some sort of a culture shock.", "“Ppi— ppi ppi ppi!”", "Even the little chick laughed. Covering its stomach with its wings, it rolled around like it was dying of laughter.", "Hugo frowned.", "“What are you laughing for!? What’s so funny?”", "He couldn’t get mad at Seo Yuhui and Jang Maldong, and provoking Phi Sora would probably end with him getting his ass beaten up, so he yelled at the poor little chick instead.", "But as if that didn’t matter…", "“Pyaaakhakhakha!”", "The little chick laughed harder.", "Hugo turned serious.", "“You little bastard!”", "He pinched the chick’s spinning leg…", "“Ppi?”", "Then he brought it up above his wide-open mouth.", "“I’m gonna eat you! Huh? If you laugh one more time, I’ll really eat you!”", "The little chick twisted its leg and escaped between his fingers. Then, it hopped up like flowing water and pecked the middle of Hugo’s legs.", "“Aaaaaack!”", "Hugo cupped his precious area and rolled around crazily.", "Seol Jihu shook his head.", "Let’s slide those two aside. No fooling around for this sacred naming event!", "“Hmm, a new name.”", "Marcel Ghionea thought about the matter seriously. Seol Jihu’s eyes flickered with light.", "Right, if it was Marcel Ghionea, if it was the Archer of Steel…!", "“How about Carpe Diem 2?”", "It might be diff…", "“I think New Carpe Diem is alright too.”", "“….”", "Seol Jihu turned away. He didn’t even want to respond.", "“Kyaahahaha—!”", "As he stared at Phi Sora, who was cracking up while slamming the ground…", "“Valhalla.”", "Yi Sungjin spoke up calmly. His suggestion was at least normal.", "“Valhalla?”", "“Yes, it’s the name of the palace from Norse mythology. You can think of it as a utopia.”", "“Hnng— Khnng— Alright, I’ll accept Valhalla.”", "Phi Sora spoke nasally as she wiped away the tears around her eyes. Seol Jihu rubbed his chin.", "“Utopia, huh.”", "“Eii, Valhalla?”", "Liking the sound of it, Seol Jihu began to consider it seriously, but Yi Seol-Ah reacted negatively.", "“Why? It looks like Hyung likes it.”", "“Tsk, tsk, can’t you see that he accepted it reluctantly?”", "Yi Seol-Ah clicked her tongue before looking at Seol Jihu.", "“Orabeo-nim, you don’t mind if the name ends with ‘hoe’ (會), do you?”[1]", "“That’s fine, ‘hoe’ meaning group or society, right? …Ah, you’re not going to use the Triads as a reference to say Biads or Quadads, right?”", "“Orabeo-nim, who do you think I am?”", "Yi Seol-Ah shook her index finger left and right while giving a sideways scowl.", "“The name of an organization has to have a clear meaning. And it’s even better if it matches up with the organization’s goal.”", "“Right, right.”", "“So I thought about it carefully, and I came up with a good name! I’m sure you’ll like it.”", "“Okay, what is it? Stop teasing us and say it.”", "With Seol Jihu urging her, Yi Seol-Ah cleared her throat with a cough.", "“The word, one, usually refers to the number 1, but it also means unity of thoughts, purpose, and wish.”", "“Oho, and?”", "“So to say, ‘we’re all one and the same!’, how about Hanahoe?”[2]", "“What!? What-hoe?”", "Jang Maldong immediately turned around and screamed. Yi Seol-Ah flinched in a startle.", "“Seol-Ah, no, that’s just… no.”", "Seol Jihu realized the alternative meaning of the word and shook his head. On the other hand, Phi Sora, who had barely gotten herself together, slammed her forehead on the floor.", "“I think it’s good though…”", "Yi Seol-Ah pouted at the vehement rejection. Seol Jihu sighed.", "“We have so many people… how can there not be a single good name… Ah, Sungjin’s wasn’t that bad.”", "“Hey, then why don’t you come up with one? Haven’t you thought of a name?”", "Chohong protested in a grouchy voice.", "Seol Jihu smacked his lips. He wanted to decide on a good name by taking everyone’s opinion into account, but most of what he heard was useless.", "It looked like he needed to demonstrate for them.", "“Listen up, this is the kind of name I’m going for.”", "“Alright, say it.”", "“Veni, Vidi, Vici. Good, right?”", "“Pft!”", "Seo Yuhui burst out laughing before quickly covering her mouth.", "“…Noona?”", "When Seol Jihu turned to her, she waved her hand around in a fluster.", "“N-No, Jihu, I didn’t laugh! It’s was just too cute!”", "“Hueeeeeeeeeng—!”", "Phi Sora couldn’t hold back anymore and burst out laughing.", "“I came, I saw, I conquered, he says…!”", "It must have been hilarious because…", "“Look at that serious look on his face! HAHA! What am I gonna do!? I’m gonna die of laughter! Uaaaaaaang—!’", "Her laughing had transcended and reached the realm of crying.", "Seol Jihu’s face quickly turned sour. He had genuinely put a lot of thought into the name and was quite proud of it as well.", "“The fact that he’s serious makes it even funnier—!”", "But the reaction he got wasn’t that different from what the other names got. It was just too shocking.", "Jang Maldong had turned back before he noticed, so Seol Jihu turned to Kim Hannah as if to clutch at straws.", "“I-Is it that weird?”", "Kim Hannah kept her arms crossed and snorted with an indescribable face. Her aloof expression seemed to be saying, ‘Bunch of idiots.’", "“Ah, that name isn’t it. Hell, The Strong sounds better than that shit. I came, I saw, I conquered my ass.”", "Maria mocked him as well. She even rated his name below Chohong’s!", "Sometimes, the kind sister-in-law’s concern was more annoying than the nagging mother-in-law. As Seol Jihu often cursed Gula for her naming sense, he couldn’t stand to hear this.", "“Then why don’t you give us a name, Miss Maria?”", "Seol Jihu muttered in a cold voice.", "“Me? Hmm—”", "Maria tilted her head and pondered. After a moment, she opened her mouth.", "“Gold…”", "In that instant, she could clearly see the corner of Seol Jihu’s mouth curling up. That wasn’t all.", "“Ehew.”", "“I bet it’s gonna be Gold Hurrah or something. Well, it sounds like Maria.”", "The other members’ reactions weren’t that positive either. It was as if they were saying, ‘What did anyone expect from Maria?’", "At this rate, she would be treated the same way as the other fools who made up stupid names! Seol Jihu, especially, looked like he would spit out all sorts of harsh words.", "‘I refuse!’", "In this brief moment, Maria racked her brain frantically. She grabbed one of the words floating inside her head and spoke carefully.", "“Golden… Lion?”[3]", "“?”", "Seol Jihu flinched. He paused after hearing the word ‘Golden’. Maria didn’t miss this opportunity and pushed forward.", "“The lion is a symbol of courage. Yeah, Golden Lion! How about it?”", "1. ’Hoe’ here specifically refers to the Hanja character 會, meaning group/society. The Hanja for the Triads also end with this character, literally meaning ‘Three Harmonious Society’. ", "2. Hana means one, while hoe is the same Hanja meaning group/society. I’ve kept the translation in literal Korean, because Hanahoe, meaning Group of One, was also the unofficial private military group under Chun Doo-hwan, who later became the militant Korean president who caused the infamous Gwangju Massacre. ", "3. This name is a pun too, but the joke is explained in the next chapter. "]}