{"cid": "412", "title": "Chapter 412. Omen (3)", "content": ["Trrrr… Following the sound of pouring water, a fragrant scent of coffee wafted out.", "Vlad Halep poured water into a large cup before half-heartedly swirling it with a spoon and holding up a long stick of butter.", "He cut the stick with his scythe, dropping it into the cup, and then handing it over Seol Jihu.", "Seol Jihu carefully held the hot cup in his hands.", "“Drink. It’ll warm your body up a bit.”", "Vlad Halep said stiffly before plopping down on a seat across from Seol Jihu and gulping down another cup of coffee he made for himself.", "Seol Jihu stared at the yellow butter melting in his coffee with a somewhat surprised look.", "After taking a sip, his eyes widened.", "The coffee’s bitter flavor and the butter’s softness mixed together and smoothly flowed down his throat.", "“…It’s good.”", "His stiff expression loosened slightly.", "“I’ve never had coffee with butter before.”", "“That’s how people usually drink coffee in my hometown.”", "Vlad Halep replied after taking the coffee cup off his lips.", "“It’s the best way to warm yourself up when it’s cold.”", "He then sipped down the coffee again.", "Seol Jihu was growing anxious, but he waited patiently. He could tell Vlad Halep was thinking about how to bring up the topic.", "In Seol Jihu’s eyes, Vlad Halep was a cold person by nature, who didn’t care much about other people’s matters.", "Someone like him had asked to talk, so Seol Jihu figured there was a reason for it.", "“By any chance…”", "Just as Seol Jihu thought so, Vlad Halep spoke.", "“Do you remember what I told you before? At Odor’s inn.”", "“Odor’s inn… You mean the reason you and your sister entered Paradise?”", "“No, not that. That’s what Oana said, not me.”", "Vlad Halep shook his head.", "Seol Jihu searched through his memories. He then remembered the few lines that Vlad Halep had said then.", "[…Please protect us.]", "[I’m asking if you can protect me and my little sister with your strength. Without asking anything.]", "[No. We aren’t criminals.]", "[I know it sounds strange, but we don’t know who they are exactly. We can’t even figure out what they want from us.]", "[All we know is that there are people in this world who do not like us and that they are making things inconvenient for us.]", "Seol Jihu did a double-take.", "He planned to talk to the Halep siblings properly once the Tigol Fortress War ended, but because of the trials and a slew of other things, he had forgotten about it completely.", "“To be honest, I don’t know if this is something I should tell you.”", "Vlad Halep started.", "“I have no proof or a way to be sure. But—it’s true that Oana’s and my life changed from entering Valhalla, and there have been things I’ve come to realize because of it.”", "Seol Jihu nodded his head as if having proof did not matter.", "“My younger sister and I entered Paradise with a red stamp.”", "“Yes, Oana mentioned you guys falling into poverty because of the lustful spirit and being introduced to Paradise by an acquaintance.”", "“Acquaintance…”", "Vlad Halep snorted.", "“That’s not exactly wrong, I guess. A creditor is still an acquaintance.”", "It seemed like it wasn’t the case that the siblings’ Inviter found them pitiful and gave them an opportunity.", "“He had an ulterior motive, that damned guy.”", "“Ulterior motive?”", "“We knew that people with red marks were treated like slaves in Paradise. It’s understandable that they serve as meat shields or baits. But that doesn’t mean becoming an outlet for his sexual desire.”", "“…An outlet?”", "“I’m talking about Oana.”", "Vlad Halep spoke calmly, but his expression turned fierce as if he was recalling the past.", "“I only found out later, but Oana had been getting offers from that guy for a long time. For example, writing off a certain amount of debt every time she let him have his way with her.”", "Seol Jihu’s eyes narrowed. Enticing a debtor into selling her body wasn’t an uncommon thing, but it was undoubtedly an unpleasant thing to recall and to hear.", "“He must have been eyeing for an opportunity ever since he made her enter Paradise.”", "“You mean…”", "“I killed him before he could do anything though.”", "Vlad Halep sluggishly moved his fingers on the coffee cup.", "“I had given Oana a communication crystal to use between the two of us. She cleverly let me know their location while pretending to talk to him casually, so I ran there and ripped him apart on the spot.”", "“Good job.”", "“…Well.”", "Vlad Halep’s gradually rising voice sunk low in an instant.", "“I didn’t think I did a good job. Not until a year ago.”", "Seol Jihu’s eyes widened at his confession.", "“Oana regretted it from time to time, saying things like, ‘maybe it would have been better for my family if I just accepted it…’”", "Tak! Vlad Halep slammed down the coffee cup with a sigh.", "“Because…”", "He then said.", "“That’s when everything began.”", "“What do you mean?”", "“It’s when they started going after us.”", "Vlad Halep continued.", "“They didn’t even stop to think about why we killed their Inviter. They killed our comrade, so we have to get revenge. That’s what they seemed to be thinking.”", "“There was no safe place for us. Whenever we went outside, we would have a group of people start tailing us, and it was the same inside cities. Because we were attacked so often at inns, a rumor started spreading, and innkeepers started to chase us out, saying we were obstructing their businesses.”", "“We were getting desperate. We wanted to fight back… but there was just no end to them. Oana almost died on three different occasions. Every day was like a living hell.”", "“Things were getting so bad that we participated in the Banquet knowing the risks. ”", "Seol Jihu raised his eyes while silently listening to his story.", "Speaking of the Banquet, he remembered how, at the end of Stage 1, Vlad Halep trudged up the staircase covered in blood.", "“We figured we might be able to escape from them during the Banquet, maybe even finding a solution to our problem… I didn’t expect some of the people in my room to bare their fangs while I was agitated from being separated from my sister.”", "“They just didn’t give up, huh.”", "“Yep. Their tenacity was baffling considering killing one insignificant member started it all.”", "Vlad Halep snorted.", "“The problem was that it wasn’t just in Paradise that this happened.”", "Seol Jihu furrowed his brows.", "“They viciously came after us on Earth too. They didn’t just target us, but also our family… For the record, our parents passed away from a car accident. The police said it was an unfortunate accident, but Oana and I don’t think so.”", "Seol Jihu gasped unknowingly.", "“…Sung Shihyun, was it? Maybe I shouldn’t be saying this to you, but I can understand why he defected.”", "Vlad Halep continued with slightly rough breaths.", "“I hear the suppression he faced wasn’t small… I can’t help but feel sympathy for the guy. There was no place for Oana and me in both Paradise and Earth. I suppose it was the same for him.”", "No place… Seol Jihu reiterated the phrase in his head as it resonated with him strongly.", "Then, he shook his head.", "He finally understood why he couldn’t hear from the Halep siblings for a while after going back to Earth.", "“It’s a shame that your parents passed away…”", "“I almost exploded when it happened. Oana was also shot and was in danger of dying… I was already on the brink of going crazy, and I almost went blind from rage.”", "“….”", "“With the situation being how it was, I even thought about turning to the Parasites.”", "“You considered defecting?”", "“Yes. It wasn’t just a momentary thing either. I considered it seriously. I talked to Oana about it once too. We had nothing left on Earth, and since it looked like we were going to die anyway, I suggested turning to the Parasites and becoming one of them.”", "Because successfully becoming a Parasite would mean they would no longer have to worry about dying.", "Because he would be able to save his younger sister.", "Because he would be able to kill his enemies.", "“If it weren’t for Oana…”", "“She must have stopped you.”", "“Yes. She pleaded with me not to, saying that a day would come when things would get better. She told me not to lose, saying that defecting was equivalent to losing.”", "Not to lose? Seol Jihu tilted his head.", "“So I told her I’d try to bear with it a little more… but I wasn’t really hopeful…”", "Vlad Halep trailed off and then glanced at Seol Jihu.", "“Coincidentally, the pursuit died down not long afterward. To be more precise, it was when you started to make a name for yourself.”", "Seol Jihu blinked at the sudden mention of his name.", "“It’s not like it disappeared completely, but it lessened significantly compared to the past. And…”", "Vlad Halep paused and waited a bit before continuing.", "“The attack against us stopped completely after the Tigol Fortress war. Out of the blue.”", "Then, he grinned.", "“It’s ironic, isn’t it? Choosing to enter Valhalla was a trivial decision, but it actually granted the one thing we’ve been wanting for so long. But you know…”", "Vlad Halep stopped, stiffened his expression, and looked straight at Seol Jihu.", "“Once I regained some semblance of peace, I couldn’t help but think how strange it was. It didn’t seem so at the time, but the more time I had to look back on things, the more I thought it was strange.”", "“What do you mean?”", "“Believe it or not, I’ve had keen senses ever since I was a kid. In a different way compared to my sister. I guess you can say I react sensitively to killing intent.”", "Seol Jihu swallowed the thought, ‘Isn’t that because you were born with the fate of Heaven-Slaughtering Star?’", "“Here’s the strange thing. These people murdered my parents disguising it as an accident, they almost killed Oana several times, but I never once felt killing intent directed at me.”", "It was as if they were trying to drive Vlad Halep to a solitude without killing him.", "“And when you appeared, the attack that’s been going on for years suddenly stopped.”", "It was as if the large, mysterious enemy that was trying to seize control over him stopped and turned its attention to Seol Jihu.", "“Looking back, I can’t help but think that they were trying to drive me to a corner…. And once I started thinking that way, I began to understand why Oana told me not to lose.”", "“You have a wise sister.”", "Seol Jihu grew curious as well.", "What if his younger sister was in Paradise?", "What would Seol Jinhee have said?", "“Anyway.”", "Vlad Halep thought for a moment before clearing his throat.", "“What I’m trying to tell you is this. Don’t get swayed.”", "Don’t get swayed.", "“When things like this happen, it’s natural to get emotionally charged.”", "“Right.”", "“If I had given in to my feelings back then… I might have become a Parasite and stood against you as an enemy. If that happened, I wouldn’t have been able to enjoy the happiness I have now.”", "Vlad Halep made an awkward face as if he was embarrassed to say the word ‘happiness’.", "By now, Seol Jihu had calmed down significantly. What Vlad Halep was suggesting played a big part.", "Thinking about it, he and Vlad Halep had a few things in common: being involved in many incidents and accidents, being targeted by a mysterious enemy, and so on.", "In this sense, Vlad Halep was his senior.", "That wasn’t all. Seol Jihu felt the same strangeness at Vlad Halep’s story, and it was something he had felt before too when he read the records Ian wrote about renowned Earthlings who met unfortunate ends.", "Once he thought this far, his head cleared up.", "“Thank you.”", "Seol Jihu bowed politely.", "His heart had been charred black with rage on his way to the building, but thanks to Vlad Halep, his reason came back, his head cooling down.", "Vlad Halep stared at Seol Jihu expressing his gratitude before looking away and sipping on his coffee.", "“Well… let me know if there’s anything I can help with. It’s hard to deny that Oana and I are benefiting from Valhalla’s protection.”", "Only then did a thin smile surface on Seol Jihu’s face.", "Vlad Halep could easily have said he wanted to repay Valhalla for its help, but he said so in such an odd, roundabout way. It seemed that’s how he was by nature.", "Seol Jihu thought for a moment before asking.", "“By the way, how is it living here?”", "“I told you. I’m hap… It’s good.”", "“What does Oana think?”", "“She said she’s happy to be around lots of big-breasted older sisters.”", "“Come again?”", "“Don’t look at me like that. I’m saying exactly what she said.”", "“Well… alright. Anyway.”", "Seol Jihu said with a bland laugh.", "“I’ve been meaning to ask for a while, but how about you and Oana quit being guests and become official members?”", "Vlad Halep raised his eyebrow.", "“…To tell you the truth.”", "He stared at Seol Jihu as the corners of his mouth curled up.", "“I was wondering when you were going to ask.”", "“Great.”", "Seol Jihu raised his coffee cup at Vlad Halep’s refreshing answer.", "“I’m looking forward to working with you.”", "“Sure, as long as our promise holds.”", "Vlad Halep held his coffee cup out.", "Clang. After a light toast, Seol Jihu brought the cup to his mouth, tilting it slightly.", "The coffee was very hot and flavorful.", "*", "Seol Jihu and Vlad Halep signed the contract on the spot.", "Vlad Halep dragged his half-asleep sister out of bed, and the two of them became official members of Valhalla.", "Then, Seol Jihu summoned Eun Yuri once morning came.", "There was something he realized after talking with Vlad Halep.", "Right, though Paradise might be a world where the fist was stronger than the law, he was still the agent of his actions.", "To not be manipulated by others, he had to put his reason ahead of his emotions.", "And so, Seol Jihu called Eun Yuri, who was one of the most rational people he knew.", "“Did you call?”", "Eun Yuri staggered in after knocking on the office door.", "Her hair was wet, perhaps having left the shower just now.", "Judging by her bloodshot eyes and severe fatigue that was written all over her face, she must have pulled another all-nighter.", "“Are you alright? You look exhausted.”", "“I’m okay. It’s just that Teacher keeps giving me difficult homework… I’m in the middle of learning construct magic, but she wants me to define the degree of chaos following expansion and compression using the number of microstates, which directly corresponds with macrostates, then combine the increase, propensity, and state of entropy with probability theory and explain it to her… What a clusterfuck.”", "Seol Jihu doubted his ears while Eun Yuri did a double-take.", "“Ah, forget what I just said.”", "“I feel like you’re becoming more and more like Lady Roselle.”", "“The other two will be devastated when they find out I got a separate, higher-difficulty homework. I’m sure they’ll chew me out behind my back.”", "‘That’s what she wanted me to forget?’", "Seol Jihu stared at Eun Yuri with a bad aftertaste.", "Eun Yuri pushed back her wet hair and stretched out her arms.", "“Anyway, why did you call me?”", "“You seem tired… How about solving a mystery to freshen up?”", "“A mystery?”", "Eun Yuri’s drowsy eyes lit up. Then, she stared at Seol Jihu suspiciously.", "“I don’t mind… but is the reward a silver plate and a glass cup? If it is, I’m leaving for real.”", "“No.”", "Seol Jihu smiled bitterly.", "“I actually want Miss Eun Yuri’s advice with regard to what’s been happening recently.”", "Eun Yuri fixed her posture, realizing that Seol Jihu wasn’t joking around. Her lax eyes sharpened in an instant as she nodded her head.", "“Let’s see…”", "Eun Yuri was a genius. Of course, she was only a genius in terms of her talent in magic. She wasn’t a tactician rivaling Zhuge Liang nor a detective rivaling Sherlock Holmes.[1]", "However, Seol Jihu knew she had unusually sharp discerning eyes.", "Though she did not get the answer right in the Special Tutorial, she had still provided a way forward that Seol Jihu did not think of.", "Seol Jihu wasn’t expecting Eun Yuri to solve all his issues, but he was at a stage where he had to clutch at every straw.", "And so, Seol Jihu decided to seek advice from his surroundings, borrowing the help of a female college student who was majoring in modern dance.", "“Where do I begin…”", "Seol Jihu pondered before starting with the slandering incident when he was in Haramark and ending with his younger sister recently being shot on Earth.", "He didn’t leave out a single detail.", "Despite how long it took to recount the whole story, Eun Yuri did not lose focus until the end.", "“This…”", "She spoke as soon as the story ended.", "“This isn’t a mystery, it’s a Naporitan.”", "“Naporitan?”", "“Yep. Have you heard of the story of the red billiard ball?”", "“I think so… on the internet…”", "“It’s a story without a correct answer so that anyone’s imagination can become the answer as long as it sounds plausible.”", "Eun Yuri stuck out her tongue and looked up. Judging by the way she was rolling her eyes left and right, she seemed to be in deep thought.", "Though Seol Jihu didn’t understand why she was licking her lips with her tongue so quickly, he remained silent and waited patiently.", "“Mm, it sounds complicated at first glance, but…”", "Eun Yuri murmured to herself.", "“Oppa.”", "Before she stared at Seol Jihu and asked.", "“How much do you trust Gula-nim?”", "It was a rather unexpected question.", "“What do you mean?”", "“I’m just asking. Do you trust Gula-nim?”", "“Yes, I do.”", "“Then does Gula-nim trust you? Do you guys think of yourselves as definite allies?”", "“Probably.”", "Seol Jihu nodded his head.", "“Indeed, since Gula-nim is going against the Parasite Queen and seems to adore Oppa a lot too… I’m sure there’s a reason she said what she did. You can really think of it as a hint.”", "Eun Yuri nodded strongly.", "She then raised her index finger and middle finger, pointing them at Seol Jihu.", "1. Zhuge Liang was a Chinese politician, military strategist, writer, engineer, and inventor. If interested, feel free to Google. "]}