{"cid": "93", "title": "Chapter 93. Addiction (2)", "content": ["While the treatment room was bustling with visitors, Ayase Kazuki stayed silent with his back leaning against the wall.", "‘It’s quite loud here, huh….’", "He found the situation quite rowdy, but he was surprised at the same time.", "‘I heard he was a Level 2 Warrior.’", "Almost everyone in the room was a well-known Earthling. Seeing how they all came to wish the young man a speedy recovery, Ayase Kazuki could easily guess they had some sort of a connection with him. In other words, these people were friends, if not acquaintances, of the Earthling known as Seol.", "‘Hm?’", "Just as he turned around thinking it was time for him to leave, he caught sight of a woman peeking into the room through the half-open gap behind the door.", "‘That’s…!’", "Kazuki was shocked inwardly but tilted his head at the same time. The woman was staring at one particular man in the room. Her eyes were fixed on him somewhat uncomfortably. Rather than being sad, she looked more worried.", "‘Who is she looking at?’", "Following the woman’s line of sight, Kazuki turned his gaze, which landed on the young man sitting on the bed. The young man was talking with a bright smile while occasionally bursting out into a hearty laughter. He said he was fully recovered, and he seemed fine mentally as well.", "‘Looks like there aren’t any lasting effects….’", "Kazuki turned back to the door and his gaze met the woman’s. Kazuki quickly unfolded his crossed arms and respectfully bowed. The woman smiled gently and bowed back before turning around.", "*", "Ayase Kazuki was the first to leave. Following him, the visitors began to return one by one. Seol Jihu’s safe return was something to celebrate, but it was hard to see it as a perfectly happy ending. The loss of the Level 5 Arch Shooter, Edward Dylan, was a cold, harsh reality.", "Losing the leader of a team was a matter of serious consequences, especially if that leader was a High Ranker. It was no different than losing the captain of a ship mid-voyage.", "It was an undeniable fact that Carpe Diem would no longer hold the position it used to. After all, no one was insane enough to entrust an important mission to a team with only three Warriors.", "As visitors purposefully took their leave, the treatment room was eventually left with just three people. Once the commotion died down and silence descended on the room, Seol Jihu was left feeling a bit bitter. He couldn’t help but think how happier he would be if Dylan was here with the rest.", "“Why are you so depressed?”", "Chohong must not have liked how he was acting as she shouted with a displeased look.", "“Raise your shoulders! Open your chest! The mission was a success. We rescued three people and saved three others. You even screwed the Parasites’ plans big time. Do you know how big of a wave you caused in Paradise?”", "“She’s right, Seol. There’s no reason for you to feel guilty. No, you should be proud. Dylan would have surely said the same thing.”", "Hugo also chimed in.", "“…Dylan.”", "Seol Jihu carefully raised his voice after listening quietly for a bit.", "“He’s doing well… right?”", "“If you’re talking about the penalty… well.”", "Hugo scratched his nose.", "“It’s not easy. The sense of emptiness and loss you feel when you lose your memories of Paradise is something that’s hard to deal with for most.”", "“Then….”", "“But if it’s him, I’m sure he will be able to overcome all difficulties. I trust Dylan.”", "Hugo continued with a firm voice.", "“What’s important is that Dylan returned to Earth as a human. We should focus on that.”", "Hugo’s words touched Seol Jihu. He really did wish Dylan would be able to overcome the infamous penalty. No, he was certain Dylan would be able to overcome it.", "Seol Jihu clenched his fists. A moment of silence ensued before Chohong opened her mouth.", "“What are you going to do from now?”", "Seol Jihu was slightly taken aback. Was she talking about the future of Carpe Diem? He wanted to ask her about that himself. He never expected her to be the one to ask that question.", "“Hugo and I are going to return to Earth for now.” Chohong continued, “We’re, well, a bit exhausted. We want to rest easy… and we also need some time to organize our thoughts.”", "“Are you disbanding Carpe Diem?”", "“What are you talking about?”", "Chohong snorted and waved her hand.", "“I’m just saying we should rest since we just completed a huge mission. Don’t jump the gun.”", "Thankfully, it seemed Chohong had no plans to disband Carpe Diem. That was enough. Seol Jihu internally heaved out a sigh of relief.", "“Oh, also, I need to tell you something.”", "Hugo, who had his hand in the basket, suddenly spoke as if he just remembered something.", "“Miss Foxy wanted us to pass you a message. She said you should come to Earth when you’re awake.”", "“Miss Foxy…. You mean, Kim Hannah?”", "Seol Jihu asked in surprise.", "“Yep. I was surprised too. Who knew you were contracted to Sinyoung?”", "“No, I’m not.”", "“You’re not?”", "“No, they did ask me to, but I refused. Kim Hannah and I just have a personal contract between us.”", "“You refused? And you signed a contract with Miss Foxy?”", "“Yeah.”", "Hugo’s eyes widened in surprise. Then, his hands started moving again. He took out a well-ripened fruit and muttered in admiration.", "“Wow… I can’t believe you refused Sinyoung. Ah, well, I guess you are a Gold Mark.”", "Crunch. He bit down on the fruit and began snickering.", "“Still, I was really surprised.”", "“Why? Did she say something?”", "“No, not that… Kik! Don’t take this the wrong way, but… how come all the women in your life are crazies?”", "‘Crazies?’", "“What does that mean?”", "Chohong must have been curious too. Hugo continued to snicker as he pointed at Chohong with his chin.", "“I mean, you have four of Paradise’s Six Crazies around you.”", "“Four of the Six Crazies? Uh, Miss Foxy, Maria Yeriel, Claire Agnes… ah, you’re right.”", "Chohong counted with her fingers and eventually burst out laughing.", "“He’s contracted to one and two came to visit him! He, he’s screwed! Are we going to find his corpse one day in an alleyway somewhere? Puhahaha!”", "Chohong cackled as she smacked Seol Jihu’s back.", "“Who’s the other one? Ah! Cinzia! Cinzia noonim! Puhahaha!”", "But for some reason, Hugo wasn’t laughing at all.", "“….”", "In fact, he was staring at Chohong with an expression that was a mixture of bitterness and confusion. His lips were twitching like he wanted to tell her something, but he just clicked his tongue and bit down on the fruit again.", "“…Be careful, Seol, especially of the one close to you. I’m not kidding.”", "He whispered to Seol Jihu while chewing on the fruit. Seol Jihu returned a wry smile.", "“But calling them crazy… isn’t that a bit rude?”", "“Rude? Do you know how long I’ve known her? Crazy doesn’t begin to describe her. Her nickname is Slaughter Maiden. Slaughter Maiden! It’s not even Battle Maiden.”", "“S-Slaughter Maiden?”", "While Chohong was busy cackling to herself with her hands on her belly, the two men whispered to each other.", "“Didn’t I tell you before? She acts all coy and innocent around you. Really.”", "“Chohong? Coy? Eii, she almost beat me up today. Though, that was my fault.”", "“Exactly! That barely counts as being angry. It has to be at least ten times what you’ve seen today to say, ‘Ah, she’s really triggered today.’”", "‘Ten times?!”", "Seol Jihu couldn’t believe it. He immediately activated Nine Eyes and glanced at Chohong.", "[Chung Chohong’s Status Window]", "[General Information]", "Summoned date: November 18th, 2015Marking Grade: RedSex/Age: Female/22Height/Weight: 170.2 cm/58.6 kgCurrent condition: HealthyClass: LV. 4 Divine ChampionNationality: Hong Kong (Area 7)Affiliation: Carpe DiemAlias: Go-stop, Slaughter Maiden, Six Crazy, Chung Tricked-Again.", "‘Huh…?’", "It was true. Seol Jihu was just about to ask Chohong to read her aliases on her status window, but then his eyes spotted the shattered drawer next to his bed. Suddenly, a chill ran down his back.", "“Ah, I haven’t laughed that hard in a while.”", "Chohong finally grabbed a hold of herself and was wiping tears off her eyes.", "“Anyways, you’re going, right?”", "“Hm?”", "“To Earth.”", "Seol Jihu suddenly felt he was caught off guard.", "“Hello? Don’t you need to go back? Your contractor is calling you, you know.”", "“Uh, yeah… I’ll give her a call.”", "“What are you talking about? How are you going to call someone on Earth from here? What, is there something you need to do? Why do you sound reluctant to go back?”", "“Princess Teresa said she’d invite me to the palace.”", "“Who cares? That can go once you come back.”", "Seol Jihu was a loss for words and could only stammer. Chohong felt that something was off, and her eyebrows perked up.", "“You… do you really not want to go back?”", "“N-No.”", "Seol Jihu answered reflexively, but he couldn’t hide his Adam’s Apple trembling slightly. It was then that Seol Jihu noticed his fingers shaking and hid them under the blanket.", "To be honest, he wanted to tell her he didn’t want to go back. He didn’t know why. It was just that when he thought about leaving Paradise… an instinctive sense of rejection swelled inside him. He felt his chest congest uncomfortably and even felt a bit of anxiousness.", "But he couldn’t bring himself to say all this. If he did, he knew Chohong would ask why. He didn’t want to lie, but he didn’t want to tell the truth either.", "‘…No.’", "Now that he thought about it, he did have to go back at least once. It was hard to say he was in a secure position on Earth, and he also figured it would be easier to find basic knowledge of spear throwing and energy circulation on Earth.", "Thinking about it this way, he felt a bit better.", "‘Right, if I want to live in Paradise….’", "“Of course, I’m going back. I have things to take care of, so it might take a while until I’m back.”", "“…Yeah, I’m sure. Don’t worry about it and have a safe trip.”", "Chohong erased her suspicions hearing Seol Jihu’s straightforward answer. Seol Jihu smiled. He was already excited when he thought about learning Mana Spear and Mana Circulation once he returned.", "*", "Carpe Diem’s new direction was revealed. The three remaining members decided to take a break and use the time to think about the future.", "Chohong and Hugo said they would go back to Earth today. Seol Jihu figured he shouldn’t waste any more time. After asking Chohong to bring him a bag, he contacted Kim Hannah through the communication crystal ball she gave him.", "‘She’s not picking up….’", "However, he couldn’t get in touch. It seemed she still had not returned from Earth. He grabbed the clothes Chohong brought him and left the treatment room. Since he wasn’t in a hospital, he didn’t need to go through formal procedures to be allowed to leave. Still, he had to pay for the treatment he received.", "‘It looks like my body’s gotten a lot better.’", "Seol Jihu cracked his neck and swung his arms around, only to be surprised beyond belief. His physical body was simply too healthy. His wounds had all closed up, and although he might just be mistaken, he felt like his mana was circulating more intensely than before.", "Overall, it felt like he powered-up, almost like he ate a precious herb or pill. However, he couldn’t remember a thing about the Priest who healed him. It was because he did nothing but sleep after seeing that bright light.", "That said, he knew someone had taken care of him deeply for the 24 hours he was asleep or barely awake.", "‘Who could it be?’", "To pay for his treatment and to thank the Priest who took care of him, Seol Jihu headed to the reception desk of the temple. However, he was met with an unexpected predicament.", "“She’s not here?”", "“No, she said she had something urgent to take care of.”", "“Then can I at least know her name…?”", "“I apologize, that isn’t something I can reveal without her permission.”", "He was even told that he didn’t need to pay. Apparently, whoever treated him had given the Priests a strict order not to receive payment. Still, Seol Jihu remained persistent, and the reception lady eventually said that the treatment cost at least one gold coin. Seol Jihu couldn’t hide his shock when he heard that.", "‘H-How amazing was the person who treated me?’", "In the end, he gave in and stood in front of the returning warp gate. He told himself that going back was the right choice, yet he was still hesitant.", "‘Don’t expect anything. Don’t expect anything.’", "He muttered to himself multiple times before he entrusted himself to the blue light.", "*", "Returning to Earth. He had experienced it once before, but he couldn’t help but feel a little strange. It wasn’t that he was unfamiliar with the sensation of returning. He was unfamiliar with the clean room he returned to.", "‘How long was I gone?’", "He looked around his room like he was standing in someone else’s place. He then found his phone lying on the ground. Perhaps because of the constant reminder to not expect anything he muttered in his head, his hands didn’t immediately grab it. He knew he would only be disappointed. However, he still needed his phone if he were to contact Kim Hannah. Seol Jihu smacked his lips and picked up the phone.", "‘It looks like it’s still morning….’", "When he opened the window, he was greeted by blazing sunlight. He furrowed his brows as stuffy hot air rushed in.", "It was early May. The weather was too hot considering summer had only just begun.", "‘Guess I’m back.’", "He watched cars running through the streets under his apartment buildings. Then, he suddenly grabbed his wallet. Like a donkey stung by a bee, he hurriedly left his apartment building and ran to the convenience store by the road.", "“Keu!”", "When he bought a can of Coke and chugged it down his throat, he felt like he had the whole world under his grasp. He never thought carbonated drinks would feel so good. Only after purchasing a pack of cigarettes on top did he feel like he was finally back on Earth.", "After emptying the can of Coke and finishing a cigarette by the roadside, he felt relaxed. He wanted to go grab some tasty food but knew he had better things to do.", "He took out his phone and pressed the power button with his thumb, his eyes constantly staring at the screen. The moment the phone finished booting and the screen popped up….", "Bzzz, bzzz, bzzz!!", "The phone buzzed crazily. Although there was a short pause between each vibration, he could count at least ten of them. His eyes now widened, Seol Jihu checked his messages. His jaw dropped slightly.", "‘Mom… and Hyung, too?’", "Most of his missed calls seemed to be spam calls, but his mother had called him twice and his older brother, Seol Wooseok, once.", "‘W-Why?’", "It wasn’t as if someone was chasing him, but Seol Jihu panicked. He checked the date of the calls. Although it had been a while since then, he was still tempted to call them back. But after thinking about it a little more, he decided that wasn’t such a good idea. They had to be calling to ask where he got the money he previously showed up with. Seol Jihu had yet to come up with a good answer.", "As such, there was only one person for him to call right now.", "‘It was April 17th the last time I was here, right?’", "He remembered Kim Hannah yelling at him for not picking up his phone as he scrolled down the list of past callers. An unregistered phone number had called him several times on April 17th. Judging by the time the calls were made, he became positive that this was Kim Hannah’s number.", "But now that he thought about it, calling her wasn’t so easy either. He tried his best to calm his beating heart as he pressed the call button.", "Beep-!", "Before the ringtone sounded out once…", "—You-", "Seol Jihu quickly pulled his phone away from his ear. He could barely hear the voice coming out of the phone, but he picked up on a few words, including ‘son’ and ‘-tard’.", "%@#^&@^#@!", "Like a sparrow that met a bird of prey, Seol Jihu blankly stared at his crying phone."]}