{"cid": "147", "title": "Chapter 147. A Dreamy Night (2)", "content": ["From where the bloodstain cut off, a seemingly random white cloth caught Seol Jihu’s eyes.", "‘Cloth?’", "The moment he raised his startled eyes, he instantly took in a deep breath.", "In the dark hallway, a woman was looking back at him. Judging by the robe she was wearing, she had to be a Priest.", "But her standing posture was strange.", "Her head was drooped low and her body was tilted slightly, giving her an overall ominous aura. She wasn’t even leaning against a wall, so it didn’t seem possible to stand so staggeringly.", "‘Wait.’", "Seol Jihu’s eyes narrowed.", "Her feet weren’t touching the ground…. They were floating.", "[Neck.]", "Hearing Flone’s voice, Seol Jihu finally realized the cause behind the ominous sensation.", "He didn’t see it at first because of the darkness, but a rope tied to the ceiling was wrapped around the Priest’s neck.", "That was why she was tilted.", "Seol Jihu tightened his grip on the Ice Spear.", "‘What exactly happened here?’", "He had only climbed up one floor. How could the atmosphere change so much?", "An odd silence that muffled even the sound of breaths filled the air, and the hanging corpse began to suddenly wobble.", "Like a broken marionette, its limbs swayed side to side before turning halfway around and creaking its head up.", "Next….", "“!”", "When Seol Jihu saw her black eye sockets that had been dug out, he clenched his mouth.", "Instead of screaming, he fixed his posture right away. His spear spat out blue flames, and, in his left hand, a tremendous amount of energy coalesced to form a blue spear.", "Just as he was about to throw his Mana Spear, Flone snatched his arm up.", "[Wa, wait.]", "“What’s wrong?”", "[Look closely.]", "Seol Jihu turned his gaze.", "The short female Priest’s robe looked clean. Since her corpse looked fresh, she was likely a member of Phi Sora’s expedition team.", "But the way her mouth moved like a fish, it was almost as if she was… alive.", "“She’s not alive, is she?”", "[She’s dead.]", "Flone made it clear.", "[But she doesn’t have any malice. It looks like she earnestly wants to say something.]", "Seol Jihu doubted his ears.", "When Earthlings died in Paradise, they would lose their memories of Paradise and revive on Earth.", "But it wasn’t as if there weren’t exceptions, so if the girl was truly dead, it would mean that this villa was a place of such an exception.", "Kuk, kuk. Dry coughs escaped her mouth. It seemed she couldn’t talk because of the noose around her neck.", "The coughing Priest raised her trembling arm and opened her palm with great difficulty. Her quivering index finger pointed at a room diagonally opposite from her.", "[Plea… he….]", "‘Plea? He?’", "[She’s asking for help.]", "Seol Jihu furrowed his brows, but Flone seemed to have understood her.", "“Is there a chance it’s a trap?”", "[I don’t know, but that girl is pleading.]", "Flone murmured and then tilted her head.", "[I think she’s worried.]", "Seol Jihu asked without taking his eyes off her.", "“She’s not the previous one, right?”", "[No. That one must have gone into hiding. I can’t feel its presence anymore. Plus, this spirit is too weak. A little squeeze and it will crumble into pieces. By the looks of it….]", "The hesitating Flone spoke without confidence.", "[I think she’s not leaving on purpose.]", "“Huh?”", "[Passing onto the afterlife, I mean. Well, it might be a little different, but regardless, she’s strongly refusing to leave this place.]", "“W-Why?”", "[I don’t know. She’s repeatedly saying, ‘Please help. Please help.’]", "Seol Jihu’s expression turned complicated. He remembered the spirit of Yi Seol-Ah trying to help Yi Sungjin back in the Tutorial.", "In other words, not all deceased were the same.", "“…Got it.”", "Seol Jihu stepped forward with his spear raised high. As soon as he arrived at the room the Priest was pointing to, the Priest’s arm dropped down and, as if the rope had been cut off, her body fell to the ground.", "Flone must have done something.", "After momentarily staring at the unmoving corpse, Seol Jihu carefully entered deeper into the room. Immediately, he felt a strange sense of déjà vu.", "Inside the room was a woman shaking sporadically. Just like the Priest he saw in the hallway, she was hanging from the ceiling by her neck.", "“Ah!”", "After seeing who it was, Seol Jihu’s steeled resolve broke in a startle.", "“Miss Phi Sora?”", "He realized the reason behind the sense of déjà vu.", "A room as dilapidated as a deserted building.", "A chair knocked over in the middle of the room.", "And Phi Sora who hung herself with a strange laugh.", "He had seen this place in the vision he saw when he visited the White Rose Guild.", "[Ah, I get it now.]", "Flone clapped her hands together.", "[I was wondering what that girl was worried about so much. She wanted us to save this woman!]", "“….”", "[It looks like she’s about to die…. Do you know her?]", "“….”", "[What’s wrong? Are you okay?]", "Seol Jihu barely snapped out of the daze from watching Phi Sora’s convulsing limbs and answered back.", "“…Ah, yes, she’s someone I know.”", "Hearing his hurried reply, Flone quickly flew across the room. The rope snapped, and Phi Sora fell on the ground.", "Seol Jihu quickly approached her.", "‘Eh?’", "But the moment he grew near, an indescribable sensation stimulated his back. He couldn’t quite put it into words, but the sensation was strange and heavy.", "Seol Jihu straightened his half-bent back.", "‘What’s happening? It wasn’t like this just a moment ago…’", "His body didn’t listen to him and began to shake. When he secretly looked around the room, he saw a black figure that was curled up in a corner of the room slowly getting up.", "He mistakenly thought that a huge mountain was shooting up, even though he knew that was logically impossible.", "Finally, a problem broke out. He had to fight or escape, but he wasn’t sure which one was the better choice.", "“…Flone.”", "He muttered quietly, but Flone didn’t answer. It wasn’t that she had disappeared. She was simply gazing at the rising black figure in a daze.", "Seol Jihu turned his body and stared straight at the black figure. It exuded a dominating force that seemed to firmly grasp the air around him.", "It wasn’t there when Seol Jihu first entered the room and his Nine Eyes had not reacted either.", "‘Where did it come from?’", "There wasn’t anything on the first three floors. To think so many of them would be gathered on the fourth floor….", "Stepping back slowly while glancing at the door, Seol Jihu suddenly tilted his head.", "From the looks of it, the black figure seemed to have perceived Flone and him. Although its eyes, nose, and mouth couldn’t be seen, he could still feel its heavy gaze.", "But it didn’t move once it got up. It simply stared at them from the same spot.", "No. Now, it was starting to slowly raise its arm-like body part.", "‘Does it want us to leave?’", "Seol Jihu raised an unfounded hope. Unfortunately, the arm didn’t point to the door, but straight in the forward direction.", "[Th….]", "Seol Jihu flinched slightly as an aged stammer rang out. He strained his ears to listen.", "[That neck… how….]", "‘Neck?’", "Seol Jihu looked down as his pendant before going ‘Ah’.", "“Flone! Could this be—”", "[Flo… ne…?]", "When Seol Jihu called out Flone’s name, ready to clutch at straws, Flone finally opened her mouth.", "[…Grandpa?]", "Flone asked, half in doubt, and the black figure flinched.", "[Oh… oooh….]", "As if someone pressed down hard on a piano keyboard, a resounding ringing spread out.", "[Um… it’s Flone. Your granddaughter, Flonecia Lusignan La Rothschear.]", "[Oooooh….]", "[Grandpa… is it really you?]", "[Ooooooooh…!]", "A sobbing voice and a voice of disbelief mixed together in harmony.", "[How… how…!]", "[Grandpa!]", "Flone flew forward. When the black figure’s arm gently wrapped around Flone, Seol Jihu felt the tension strangling him loosen up.", "He felt blood rushing to his brain as if he had been miraculously saved before death.", "‘Can I call this… good fortune?’", "He already knew the villa had ghosts from the era of the deceased emperor. But still.", "‘Flone’s grandfather really was here…?’", "Soon, Seol Jihu put his spear down and stared at the grandfather and granddaughter duo. He still felt dazed by the whole thing.", "It would be a touching reunion if they were both alive. However, they were spirits that were close to being evil spirits. As a result, what should have been a touching scene seemed a bit strange.", "But it seemed the two of them didn’t mind this as they were holding hands and talking incessantly.", "Well, hundreds of years had passed, so it was understandable that they thought both sides were dead.", "[That… bastard…!]", "[Yes, so I….]", "Seol Jihu could only hear what they were saying intermittently. Seeing as how Flone continued to nod her head, they seemed to be exchanging words quickly through their minds.", "Thinking of how life was full of surprises, Seol Jihu looked down at Phi Sora whom he had neglected until now.", "Her eyes were rolled back, revealing only the whites of her eyes, and she was foaming from her mouth to her neck. From the way she was breathing faintly, she seemed to be on the verge of death.", "In other words, she was still alive.", "Looking at the moaning Phi Sora, Seol Jihu suddenly thought about the Choice of Destiny.", "‘Did it change?’", "It was Phi Sora’s destiny to die here by hanging. Seol Jihu had witnessed her death in the vision shown by the Choice of Destiny.", "But because he entered this villa with Flone, he had ended up saving her.", "In that case, could he say that Phi Sora had now met a different destiny?", "‘This easily?’", "Deep in thought, Seol Jihu nodded his head.", "Before he noticed, Blackie, or rather Flone’s grandfather had approached him.", "Perhaps happy to have found her family after hundreds of years, Flone stuck next to him, smiling brightly with tears of blood glistening around her eyes.", "[Grandpa, this is him. If it weren’t for him, I….]", "Seol Jihu followed his instincts and took on a respectful posture.", "…Rather than frightening, he now found the situation complicated.", "[Is….]", "“H, Hello….”", "[Is what Flone said… true…?]", "“Y-Yes, it is.”", "Although Seol Jihu had no clue what Flone and her grandfather talked about, he decided to affirm the question first.", "A fixed gaze scanned him from top to bottom.", "[Thank you… so much….]", "“?”", "[Favor… pendant… oath… change….]", "When the word ‘change’ was heard, the pendant released a faint light. However, the light quickly disappeared, and because Seol Jihu was focused on what was in front of him he didn’t notice the light.", "But he still heard the words ‘pendant’ and ‘oath’.", "“Um… what is this pendant?”", "When he asked as respectfully as he could, the black figure fell silent for a moment.", "[Pendant….]", "It wasn’t until a minute later that the hoarse voice rang out again.", "[Promise with the Seven Virtue’s Temperance… in other words… on par with the Imperial Oath….]", "It was then…", "The intermittent voice suddenly stopped completely, as if someone had struck down with a sword.", "Flone’s grandfather turned around in a hurry.", "[Grandpa? What’s wrong?]", "At the same time, Flone tilted her head…", "[Coming….]", "Seol Jihu felt murmuring noises abruptly filling his ears.", "It sounded like dozens of wasps buzzing around flapping their wings, but also like hundreds of people whispering.", "[He… why…?]", "There was no forewarning or any sign.", "But one thing that was sure was that a terrifying aura, clear enough for even Seol Jihu to feel, was rushing towards them. The malice behind this aura was so evil that even Flone’s resentment seemed like child play.", "[Go….]", "The black figure pushed Flone away.", "[Grandpa?]", "Flone made a flustered expression.", "[It might not be… too late….]", "[W, What happened? Just what happened in this place…!?]", "[Hurry…!]", "The black figure looked to be in a great hurry.", "At that moment, the absent-minded Seol Jihu recalled the words he had heard in Stage 3.", "[The movement of this star rea~lly doesn’t change easily. No matter how much it is disturbed, it continues to advance toward its predetermined fate.]", "[In exchange for Lara Wolff surviving, someone else died. That is the result of a Star of Fate that has broken away from its course trying to return to its original path. This is the reason that the future can’t be changed so easily.]", "Just like Ira said, a Star of Fate that has broken away from its course would struggle to return to its original path. In that case….", "‘Could it be?’", "The thing that was coming to this room might be the counterreaction to saving Phi Sora.", "Once his thoughts reached this far, Seol Jihu stopped thinking and moved into action.", "As he had escaped from the clutches of death several times, his body moved naturally.", "But when he saw the unconscious Phi Sora, he hesitated. In that split second, all sorts of thoughts brushed past this head. He was suddenly put at the crossroads of choice.", "He remembered how affectionate she was to Jang Maldong and how the dead Priest in the hallway pleaded earnestly.", "“God damn it.”", "In the end, he held Phi Sora in his embrace.", "Pang, pang, pang!", "And he activated the Festina Earring three times.", "Seeing that Flone was also hesitating, the black figure billowed in size.", "[Hurry… and leave…!]", "“Flone! Let’s go!”", "When Seol Jihu’s urgent shouting followed the black figure’s thunderous roar, Flone finally moved.", "[Go, go…!]", "After leaving the room and racing mindlessly through the hallway, he suddenly felt his body float up. When he raised his head, he saw Flone biting down on her lip.", "As soon as he covered the distance of the entire hallway, he saw a cluster of light rushing toward him from the front.", "‘Golden light?’", "Seol Jihu raised his spear with Phi Sora underneath his arm, but when the golden light came near, he realized that it was the Priest he had seen before in the hallway.", "To his surprise, the Priest brushed past him.", "[Please…!]", "‘What?’", "Seol Jihu turned around after hearing the fleeting voice, and his expression turned bitter.", "He saw a black figure that was likely Flone’s grandfather stopping an encroaching darkness with all his strength.", "But he alone seemed inadequate as he was being pushed back constantly. However, out of the blue, over a dozen corpses, including that of the Priest that just brushed past him, began to help the black figure.", "There were several incomplete corpses, like ones missing their heads or missing their lower bodies, but Seol Jihu could tell they were all fighting against the darkness desperately.", "Soon, with a sinking sensation, Seol Jihu’s field of vision changed.", "And just like that, as he fell from the fourth floor all the way to the first, then escaped through the entrance of the villa…", "—KUOOOOOOOO!", "A ghastly cry filled with deathly resentment echoed out from inside of the villa."]}