{"cid": "374", "title": "Chapter 374. Penance (5)", "content": ["Loss of vision.", "Using this simple, straightforward method, Black Seol Jihu easily increased the difficulty level of the second trial.", "The day he passed the first trial, Seol Jihu faced a new challenge.", "Pushing the boulder up from the foot of the hill was now a problem.", "Even though he’d walked this same path thousands of times before, he was still not sure he was going the right way.", "Climbing was now much more time consuming than before because he had to concentrate all his senses on going in the right direction.", "Even the slightest loss of concentration resulted in him going in the wrong direction or the boulder rolling down the slope.", "There was a big difference between trying not to see with the eyes and actually be unable to see.", "“Do you understand now why I said 59.5?”", "Black Seol Jihu chirped mockingly as he watched Seol Jihu climb, each step heavy and painful.", "He was right. Climbing would’ve been easier had Seol Jihu been strong enough to push the boulder up without having to put all his strength into it.", "Then, he could’ve regained his balance before the boulder would begin to roll in the wrong direction.", "But Seol Jihu’s current strength was just barely enough to pass through the trial. One small mistake immediately led to failure.", "“Buddy, your brain looks hella cute. Ah, but don’t misunderstand, I prefer men with sexy brains. You know what I mean, right?”", "Black Seol Jihu mocked as Seol Jihu struggled to move forward.", "“Let’s think, shall we? Why do you think your Intuition stat doesn’t go up even though you’re working your ass off? Don’t you find it odd?”", "“The answer is simple. With the method you’ve been using so far, you can’t go any higher than Intermediate (High).”", "“Look. There’s a limit to improving your skills through simple repetitive training. Even spear techniques like Thrust, Strike, and Cut have their limits. And of course, mindless repetition is even less effective for physical body skills like Intuition.”", "“Remember what Master Jang said during the colored stone training? See, perceive, don’t think, just hit. He’s not wrong, but that advice doesn’t apply to you.”", "“Why? Because that advice applies only to those who know how to see, perceive, think, and do all three smoothly in succession.”", "In Black Seol Jihu’s opinion, Seol Jihu knew how to see but did not know how to perceive or think.", "“Stop assuming that if you keep trying, it will somehow work. Don’t you have a brain? You’ve walked this path more than a thousand times already.”", "“Picture the path in your head. Follow that path. Is that so hard?”", "“It’s easier said than done? You little shithead. Don’t you feel sorry for yourself? Your brain is desperately trying to help you, yet you can’t even trust your own intuition?”", "“I guess yesterday you fell asleep so deep that you didn’t hear the sound of your brain crying.”", "Only after Black Seol Jihu’s parade of insults, did Seol Jihu realize what intuition really was.", "Intuition didn’t just refer to a feeling. It involved thinking.", "Black Seol Jihu was trying to warn him not to rely solely on gut feeling.", "He had to utilize not only his sensory skills but also his perceptual abilities.", "‘Picture the path in my head….’", "Seol Jihu wasn’t sloppy. He tried to picture even the smallest details about the path, such as weeds growing on the side of the road and the bumps on the slope.", "He thought and thought until his brain could no longer form new pictures, then pushed the boulder forward.", "‘Am I going the right way?’", "‘Is this the right direction?’", "Whenever a sense of insecurity began to take hold of him, Seol Jihu fended it off diligently. He continued to climb, trusting his intuition.", "Only then did the despair fogging his mind disappear.", "[Miscellenaous Ability, Intuition [Intermediate (High)], ranks up to Intuition (High).]", "He was finally getting used to being blind.", "“…Yup. That’s what it means to perceive and to think.”", "Black Seol Jihu nodded his head.", "*", "Day 422.", "Seol Jihu was now able to reach the first peak without much difficulty.", "It was then that a new challenge emerged, mocking him and reminding him that this was only the beginning.", "The first condition for passing the second trial was to place the boulder intact on the next peak.", "From here on out most of the restrictions were lifted and he was able to use mana again. But just 15 steps into the second path, he realized that was meaningless.", "Rumble!", "He heard the rumble of the approaching boulders.", "Thud!", "“Kkauk!”", "Seol Jihu’s eyes shot open when a boulder rammed itself into the boulder he was holding.", "Even though he was protecting his boulder with mana, even though he’d activated his entire mana circuit….", "When the boulder hit, Seol Jihu felt a tremendous amount of shock travel up from his palms to his arms, and then to his entire body.", "The collision didn’t end there.", "Koong, koong, koong, koong….", "The burden on his arms increased as the boulders piled up on top of each other, one after another.", "With each collision, he was forced to take a step back.", "He had walked ahead 15 steps, and only after he took 14 steps backward did the rumbling stop.", "“Kkeuuuuu…!”", "Seol Jihu struggled to support a total of 15 boulders.", "His face couldn’t be redder. Blood vessels popped out on his arms, which were shaking violently.", "His mana circuit screamed in pain because he fed it too much mana.", "‘I-I have to hurry…!’", "He knew he had to break the boulders.", "‘…But how?’", "Seol Jihu’s face distorted with agony.", "He wasn’t allowed to harm the boulder he was touching.", "This meant that he had to break the boulders in line one by one, starting with the second boulder, without using a frontal attack.", "It wasn’t completely impossible.", "Like Baek Haeju, he could shoot up his energy towards the sky, bend it, and drop it towards the boulder he wanted to shatter.", "To do so, however, he had to take one hand off the boulder he was supporting, point it to the sky, and create Mana Spear.", "Could he do it? It was difficult enough just supporting the boulders.", "Slowly, Seol Jihu pulled back his left hand.", "He didn’t move his arm completely out of the way.", "He supported the weight with the edge of his hands, barely slanting his palms back.", "“You sure are trying hard.”", "He heard Black Seol Jihu’s stifled laughter, but he couldn’t afford to look at him.", "Seol Jihu clenched his teeth.", "If he could manage to shatter at least one boulder, the situation would be a lot better.", "‘Please, please…!’", "Seol Jihu created Mana Spear with the utmost sincerity.", "He carefully calculated the distance to the target and the direction of the attack before launching the spear diagonally.", "He wasn’t sure he could hit the second boulder perfectly, but he hoped the spear would land somewhere in the middle.", "Kwang! Fortunately, he heard the boulder shatter.", "One-fifteenth of the weight disappeared.", "Seol Jihu panted. However, even before he could let out a sigh of relief, he gasped in astonishment.", "“Wh-What the hell?”", "An exclamation of shock escaped his lips.", "The reduced weight had quickly returned to its original state.", "But hadn’t he just shattered a boulder?", "“Here’s what’s happened. The remaining 14 boulders increased in weight to cover the loss of one boulder.”", "He heard Black Seol Jihu’s voice.", "Seol Jihu’s jaw dropped in shock.", "“That’s…!”", "“Unfair? But it is what it is.”", "“Keuuuuuu!”", "“In the first place, the number of boulders was designed to fit your current level.”", "“What…!?”", "“Well, don’t worry too much, though. All you have to do is destroy all 14 boulders at once. Although, before you do that, the weight will remain the same no matter what.”", "Seol Jihu gasped in pain and in horror.", "Black Seol Jihu yawned, covering his mouth with his hand.", "“I warned you that the second trial would be incomparable to the first one. There’s a lot of work to be done at the same time.”", "“Still…!”", "“Well. I guess you did gain something from the first trial after all. You still have time and energy to complain.”", "It was then that a sense of apprehension swept through Seol Jihu.", "Soon his apprehension proved true.", "“I warned you about this too, remember? The second trial will be crazy fun.”", "As Black Seol Jihu’s snickering subsided….", "Rumble!", "Seol Jihu heard the sound of boulders rolling down the slope again.", "But this time, the sound came from left and right, not from the front.", "His face blanked in shock.", "Only then did he recall the fact that the second path had a bunch of crossroads stemming from the main road.", "“Ah….”", "Seol Jihu’s head desperately shook from side to side.", "But because he couldn’t see, he couldn’t tell where the boulders were or how far they’d come.", "He instinctively launched Mana Spear but it fell flat on the ground.", "Puk! A boulder that rolled out of a nearby crossroad struck Seol Jihu.", "As he fell helplessly, the boulders lined up on the main path began to roll downwards.", "“Goodbye.”", "Black Seol Jihu waved his hand.", "“Aaaaaak!”", "The boulders crushed down on Seol Jihu’s body, cracking his bones and tearing him to many pieces.", "*", "Seol Jihu found a way to break through the second trial.", "The total weight of the boulders on the path remained unchanged until all of them were destroyed at the same time. What this meant was that he had to first get rid of the boulders rolling towards him from the crossroads.", "But this was easier said than done.", "Aside from the fact that it was difficult to precisely aim the Mana Spear at the target, he couldn’t see the direction and distance of the boulders coming at him down the crossroads.", "The order in which the boulders came down changed every time, so remembering their order didn’t help.", "In the end, Seol Jihu decided to rely on his hearing.", "He focused all his senses on his ears.", "Whenever he heard the sound of a rolling boulder nearby, he threw a Mana Spear at it.", "Even a single mistake meant death. And he died several times before he was even able to throw the spear, as controlling mana while supporting the weight of 15 boulders and protecting one was not easy.", "But his efforts weren’t wasted.", "As he learned to control Mana Spear better, he was able to focus more on his hearing.", "More time passed, and on the day he succeeded in destroying seven boulders in a row, he finally saw hope. He really thought he might get through this trial.", "This was the first time in the 672 days that he felt such hope.", "If he could destroy a few more boulders at the crossroads, if he was lucky, perhaps he could really get through this.", "He felt his confidence grow.", "That was before Black Seol Jihu destroyed it.", "“Next up is your hearing. Because you seem like you’re used to not seeing.”", "Black Seol Jihu used mana to destroy Seol Jihu’s eardrums.", "With his hearing gone, everything went back to square one.", "Seol Jihu held his head in his hands and clenched his teeth.", "His next solution was his sense of smell.", "As funny as it sounded, it was the only method left to him.", "He noticed that the boulders rolling down the crossroads smelled of blood.", "The traces of his numerous deaths seemed to remain on the boulders in the form of blood and flesh.", "And so, Seol Jihu sniffed. He flared his nostrils like a dog in heat.", "Distinguishing boulders by smell was much more difficult than distinguishing them by sound, but it worked.", "The bitter smell of blood was a red flag for him.", "Of course….", "[Up next is your sense of smell. You knew this would happen, didn’t you?]", "Just as he became accustomed to the deafness, Black Seol Jihu robbed him of his sense of smell.", "Seol Jihu was devastated by the loss of all progress. He didn’t know what to do next.", "—I know you’re trying, so I’ll refrain from making fun of you. Improving your sensory skills is good. But don’t try to depend on them. You should be aiming to connect the different steps into one fluent process, like threading beads. Why do you keep clinging to one sensation?", "Black Seol Jihu’s voice didn’t even leave an impression on him anymore.", "Now all Seol Jihu had was his sense of taste, touch, and intuition.", "But he hadn’t walked the second path as often as the first. What’s more, every time he climbed the second path, the order of the boulders that came down the crossroads changed.", "He struggled to paint pictures in his head.", "He never realized the preciousness of his senses until today.", "He couldn’t see.", "He couldn’t hear.", "He couldn’t even smell.", "He’d lost most of his senses, and to make matters worse, part of the third trial was now mixing with the second.", "Seol Jihu was no longer making any progress. He infinitely repeated the process of climbing up to the first peak, stepping onto the second path, and being crushed to death in less than one minute.", "Meanwhile, three years had passed.", "The number of days Seol Jihu spent on the Path of the Soul reached four digits.", "Rumble!", "“…Kill me now.”", "Black Seol Jihu shook his head as he watched the boulders roll down the slope again.", "“Do I need to give up on Spatial Abilities …?”", "He muttered and licked his lips.", "*", "Day 1078.", "“Uaaaaaaah!”", "Seol Jihu screamed at the top of his lungs as he sprinted up the path.", "He’d left the boulder that he was supposed to carry at the foot of the slope.", "Because he was no longer making progress in an original way, he switched his goal to meet the second condition.", "But the second condition— ‘Reach the peak before boulders appear from the path and the crossroads’— wasn’t easy either.", "Despite raising his mana to the limit and using Flash Thunder, he kept running into boulders before he even reached the middle.", "However, Seol Jihu didn’t stop.", "It was more accurate to say that he’d let go of himself than to say he hadn’t given up.", "Immediately after his resurrection, he ran, and he ran.", "He didn’t even bother pushing the boulder up to the first peak anymore.", "If Black Seol Jihu hadn’t limited his senses every time, he’d have ignored even that.", "“Damn it!”", "Seol Jihu grabbed the Spear of Purity and ran as he waved his arms frantically.", "He crawled up screaming, even when both his legs had been crushed.", "He left the boulder below, so if he had tried, he could have avoided the boulders coming down from the above. But he didn’t.", "This just proved that Seol Jihu was on the verge of insanity.", "“…Huh.”", "Black Seol Jihu stared at Seol Jihu, wriggling like a headless zombie. He then snapped the tree branch in his hand in half.", "He’d made countless blocks of tally marks on the ground.", "Ever since Seol Jihu began ignoring the first trial and repeating meaningless sprints, Black Seol Jihu had given up counting the number of times he died.", "“…Why is it so quiet?”", "He muttered in wonder. This time, Seol Jihu wasn’t running straight for the path screaming. This time, something was different.", "Black Seol looked below with nonchalant eyes before getting up. He went close to Seol Jihu to find out what he was up to, and to put new restrictions on him.", "Seol Jihu stood in his place, flaring his nostrils in anger.", "His eyes had not yet fully formed since the recent resurrection.", "“Why are you standing still?”", "Black Seol Jihu spoke.", "“Are you tired or something?”", "With eyes glistening with frustration Seol Jihu turned to face him. Black Seol Jihu smirked in response.", "“What are you doing? Go die some more. Come on, let’s go.”", "Seol Jihu’s lips distorted at the sarcastic voice.", "Gulp. His throat moved as he swallowed. A weak voice escaped his lips.", "“What… do you want from me…?”", "“Hmm?”", "“What more… do you want me to do? You said you were my helper. Tell me.”", "“Don’t you already know the answer? And what an odd time to speak casually.”", "“No, I don’t know the answer. You took my sight, my hearing, my sense of smell—”", "“Raise your intuition.”", "“It’s hard enough just supporting the boulder—”", "“Raise your strength.”", "“The boulders from the crossroads—!”", "“Raise your sword qi and Mana Spear. Your mana control too, while you’re at it.”", "Seol Jihu glared at Black Seol Jihu. He knew Black Seol Jihu was right but couldn’t help feeling frustrated.", "“Oh?”", "Black Seol Jihu gave a crooked smile.", "“Are you gonna hit me? That’ll be interesting. Try me.”", "The sound of teeth grinding filled the air.", "Seol Jihu’s breath quivered.", "His eyes burned with an intense fury, overtaken by the desire to tear Black Seol Jihu into a million pieces.", "“…”", "Seol Jihu desperately tried to calm his breathing.", "Suddenly, he lowered his head and shut his eyes tightly.", "He slowly spoke after a moment of silence.", "“..I give up.”", "“?”", "“I said, I give up…!”", "“You’re giving up?”", "It was then.", "“Yes! I give up! I give up, I give up, I give up!”", "A sudden shout broke out of Seol Jihu like exploding fireworks.", "His reaction was understandable.", "Passing the trials was damn near impossible.", "He’d already suffered countless failures and deaths.", "No matter how hard he tried, whenever he gained any hope, Black Seol Jihu would spoil it by imposing unfair restrictions on him.", "He endured Black Seol Jihu’s tyranny for over a thousand days, but the hopelessness of the present situation finally broke him down.", "While his reaction was understandable….", "“Hey.”", "Black Seol Jihu spoke.", "“Didn’t you swear you wouldn’t whine?”", "Seol Jihu’s face distorted into a grimace.", "“I warned you. But it was you who decided to try.”", "“What kind of training is this?”", "Clang! Seol Jihu threw the Spear of Purity to the ground.", "“Can you even call this training? Does it mean anything?”", "“Ha!”", "Black Seol Jihu snorted.", "Seol Jihu screamed at the top of his lungs.", "“This isn’t training! It’s torture! You just want to torture me to death!”", "“Yeah.”", "“What?”", "“You’re right. I am trying to torture you, you dimwit.”", "Black Seol Jihu chuckled mockingly.", "“You son of a bitch—”", "Seol Jihu’s expression momentarily became bleak and golden sparks erupted from his body.", "Black Seol Jihu nodded his head.", "“Go on. That’s actually better. I like you better that way.”", "Then, all of a sudden, Seol Jihu felt a kick in his stomach.", "“Uek!”", "He rolled on the ground and felt another kick in his chest before he could even get up.", "Black Seol Jihu was looking at him, his feet pressing down on Seol Jihu’s chest.", "His movements were virtually undetectable.", "“Let me ask you something.”", "Black Seol Jihu began in a cold voice.", "“Why did you come here in the first place?”", "Seol Jihu scowled at the hovering figure, barely catching his breath.", "“What exactly do you think a trial is?”", "“…”", "“A trial is a difficult ordeal, a test for measuring your determination or your character. …Training? Don’t make me laugh. Hey, did you think that the Path of the Soul was like an education facility for learning new techniques through repetitive practices?”", "Black Seol Jihu removed his feet.", "“Or….”", "Slowly, he knelt down beside Seol Jihu and crossed his arms over his chest.", "“Did you think you’d get a fun mission, like the ones you got in the Tutorial or the neutral zones, and that a nice reward would be waiting for you in the end?”", "Seol Jihu’s eyelashes trembled slightly.", "Black Seol Jihu’s face slowly came closer to Seol Jihu.", "“Get a grip, dickhead.”", "The icy voice stabbed his ears.", "“Look, pal.”", "Black Seol Jihu grabbed Seol Jihu’s cheeks with both hands.", "He pressed his palms firmly and shook his head.", "“There’s nothing like that here. Okay? No fun missions and no awesome rewards. There’s only one thing this place has given you. Time.”", "Black Seol Jihu shook Seol Jihu’s head left and right in between his palms.", "“How much blood and sweat you spill in here determines the quality of your reward. If you thought this was a game, why didn’t you just use your ability points and contribution points to gain strength? Why did you come here?”", "Black Seol Jihu released Seol Jihu’s cheeks and slowly got up from the ground.", "“You see, I just don’t understand.”", "He murmured in a slightly worn-out voice before raising one of his arms.", "In that next moment, Seol Jihu doubted his eyes."]}