{"cid": "352", "title": "Chapter 352. Reform (2)", "content": ["“I’ve been meaning to hold an official meeting. Not just Valhalla’s members, but everyone who helped in this war will get a fair share.”", "“Eck— Aren’t you slicing the pie into too many pieces then? It’s not just Eva. There’s also Haramark…”", "“No. If I don’t treat them the same way they treated me, it will be difficult for me to expect the same good treatment next time.”", "Seol Jihu said firmly as if this was the one thing he would not yield.", "“…Well, I guess it’d be pretty unfair to exclude one side.”", "Phi Sora smacked her lips and shrugged.", "“There’s no choice then, huh. Since we’re on the topic, why don’t we just take care of it now? I’ll call everyone over. The timing will match perfectly with when you finish breakfast.”", "“Sure. That works for me.”", "“Cool. Then hurry up and eat. If I tell them we’re distributing rewards, they’ll get up immediately.”", "“Ah, hold on.”", "Seol Jihu grabbed Phi Sora as she turned to dash out.", "“About the meeting… reward distribution is one thing, but there’s actually another urgent problem we need to discuss.”", "Phi Sora’s eyes widened as Seol Jihu said this with a serious face.", "“What is it? It’s unlike you to put on such a heavy air.”", "“I had a talk with the Federation’s higher-ups the day before we left Tigol Fortress.”", "“Oh right, I heard about that… Why, did they tell you something important?”", "“It certainly is important.”", "Seol Jihu nodded in a big motion and spoke.", "“The Federation and humanity will soon form a new allied force. To invade the Empire.”", "Phi Sora’s expression didn’t change. But just three seconds later, she blinked rapidly and her expression changed to that of shock.", "“W-W-What? Forming a new allied force? Invading the Empire?”", "“Yes.”", "“Y-You mean you’re going to start another war?”", "“Pretty much.”", "“Are you mad!?”", "Phi Sora jumped.", "“It’s only been a few days since the war at Tigol Fortress ended! Have you been possessed by a war-hungry ghost or something?”", "“Miss Phi Sora.”", "Seol Jihu closed his eyes and sighed.", "“Hear me out.”", "He slowly continued.", "“The Army Commanders all released their divinities and are all out of commission for the time being. The Parasite Queen also received a grave injury. The Parasites’ mother species were annihilated, and half of the Nests were destroyed. We need to strike while the iron is hot. This isn’t an opportunity we can afford to miss.”", "Seol Jihu spoke each word with clarity. He made it clear that he was not joking around.", "“D-Did the Federation suggest this?”", "“No, the Federation suggested that we take some time to reorganize.”", "“Right! That’s normal!”", "“But I didn’t give in. I even gave them an ultimatum and said humanity will no longer help the Federation if they do not help with this invasion. So then they reluctantly agreed.”", "“W-What? You did what?”", "“I admit I was a little forceful.”", "Phi Sora’s jaw dropped. A loud gulp was heard from her throat.", "‘Haha, see you later!’", "She was so dumbfounded that she hallucinated seeing her soul running away.", "“I understand that this might be sudden. But I won’t change my mind.”", "It was so absurd, in fact, that she suspected Seol Jihu was pulling another prank.", "But judging by his serious face, it didn’t look like he was kidding.", "“Please, lend me your strength. I repeat. We cannot miss this opportunity.”", "Seol Jihu bowed till his waist and asked earnestly.", "Phi Sora unwittingly gulped. Now that she thought about it, this was the same man who destroyed an entire organization and declared war against an alliance of organizations on the first day he arrived in Eva — all because he didn’t like what he saw.", "Right, he was a madman who did whatever he set his mind to.", "When she remembered this, she finally snapped out of her daze.", "‘N-No.’", "Phi Sora hurriedly sat back down and grabbed Seol Jihu’s arm.", "“Dear, hold on. I understand what you’re saying, but let me say something. You’ll hear me out, right?”", "“Yes, of course.”", "“Great. I understand that you think it would be a waste to miss this opportunity, but I personally think the Federation is right. I think you’re being too rash.”", "“I’m being rash?”", "Phi Sora jumped in a startle as Seol Jihu frowned.", "“Ah, what are you getting mad for!? Just hear me out! All I’m saying, dear, is that…”", "As Phi Sora quickly changed her tone to console him…", "“Eii, I guess I don’t have a choice then. Alright, dear.”", "“We should… huh?”", "“You said I was being rash, right? I’m not such a stubborn person. If my dear is that worried, I’ll give in.”", "Seol Jihu nodded his head lightheartedly and got up.", "“Alright, let’s take things slow. I’ll only discuss the reward distribution at today’s meeting. As for the other topic… you can just comment something like, ‘Something big might happen soon.’”", "Phi Sora dazedly stared at the man walking toward the door.", "She had a very confused expression that was a mixture of ‘Really?’, ‘What gives?’ and ‘Wait, what?’.", "At that moment, Seol Jihu peeked his head back in. The serious face he had before was nowhere to be seen, and he was smiling like an idiot.", "“Got it, dear?”", "Phi Sora’s face stiffened.", "“…You son of a—”", "She shut her eyes, tilted her head back, and stood up as she clutched the back of her neck.", "“Ah, you fucking… shit… son of a bitch… I’ll kill you.”", "As Phi Sora began to saunter over like a predator sneaking up on its prey, Seol Jihu stepped backward while smiling brightly.", "“But why?”", "“Get your ass over here before I really kill you.”", "“I just wanted to take the opinions of my fellow members into consideration—”", "“Cut the bullshit and get over here!”", "“You’re gonna hit me? Don’t you know that’s not nice?”", "“I said, get over here!”", "“Phi-diot!”", "In the next moment, Phi Sora kicked off the ground and pounced like a tiger.", "Pang! Seol Jihu also activated the Festina Earring and swiftly turned back.", "“You son of a bitch—!”", "Leaving Phi Sora’s thundering voice behind, he escaped downstairs while giggling.", "It was a peaceful morning as usual.", "*", "Phi Sora must have been hell-bent on exacting revenge as she didn’t give up so easily. She chased after Seol Jihu like the devil even when he used Festina Earring and Flash Thunder to escape.", "It wasn’t until Seol Jihu entered the hot spring and threw off his clothes that she screamed and ran away.", "Seol Jihu shouted toward Phi Sora, who was running while covering her face.", "“Do you want to hop in with me?”", "“Shut it!”", "“Alright, see you later~”", "“You better stay in there forever! I’ll kill you if you ever get out!”", "Seol Jihu cackled and entered the hot spring.", "Once he relieved his fatigue in the hot water and got out, the majority of Valhalla’s members were gathered in the meeting room.", "Having washed himself clean and having satisfied his desire to pull pranks to a degree, Seol Jihu joined the meeting feeling refreshed.", "Phi Sora must have said something as a few of them laughed blandly. Phi Sora, on the other hand, was glaring at him while fuming from her nose, and Baek Haeju, who was invited as a guest, was giving him a pitying look.", "“Kuhum.”", "Seol Jihu cleared his throat, then spoke.", "“Um… first, it’s nice to see everyone here again. It feels like it was just yesterday that I briefed everyone about the Spirit Realm expedition here.”", "“Can you just cut to the chase? Do you think we came here so early in the morning to listen to your empty compliments?”", "Phi Sora growled.", "Chohong glared at her threateningly, but Seol Jihu raised his hands, knowing that he sinned.", "“Alright, alright. Then should we first take a look at this box?”", "Thud. Seol Jihu placed down a large box on the table, drawing everyone’s eyes to it.", "The box was rather heavy and was separated into four compartments.", "“I’ll open it up now.”", "Seol Jihu slowly opened the first compartment.", "“Tantan tararan tan tarara tararan, tantan tararan tan….”", "His humming stopped as soon as the compartment was opened as a brilliant light burst out in the middle of the day.", "The sound of chairs being dragged rang out, and everyone huddled around the box in an instant.", "Maria, who was peeking into the box, raised her head slightly.", "“This a Sakura?”[1]", "“It’s a Sakura.”", "Hoshino Urara bounced off her words.", "“Hoh.” Maria glanced at her and exclaimed quietly.", "Seol Jihu stared at the two women giving each other a meaningful smile, then picked up the first thing that caught his eye.", "It was a large blue stone that barely fit his hand.", "“It’s a Thunder.”", "“Thunder? That’s the Thunder?”", "Chohong looked inside the box. There were about ten stones of the same size and color as the one in Seol Jihu’s hand.", "She made a disappointed expression.", "“Eh, only ten?”", "“It’s not only.”", "Kim Hannah corrected her. After examining the Thunder in Seol Jihu’s hand, she took a deep breath.", "“It’s not an ordinary Thunder. It’s a special Thunder.”", "“Special Thunder?”", "“Yes, it’s a special product that is crafted by refining ten ordinary Thunders together. Because of how dangerous the process is, I heard there were only a few Dwarves who could craft it… This is the first time I’m seeing one.”", "“Ooh~ How strong is it then?”", "“I’m not sure. Even an ordinary Thunder can easily blow up the building we’re in, so with ten of them fused together, we can only imagine what its power would be…”", "Chohong became a bit flustered.", "“It’s an excellent present. It would probably be best that we keep this in the organization’s storage.”", "Seol Jihu and the rest of Valhalla’s members nodded their heads.", "Special Thunders. They certainly weren’t a bad gift as they would come in handy against the Parasites.", "Seol Jihu closed the first compartment and immediately opened the second.", "This time, he could see a heap of five-colored feathers.", "“This is…”", "Seol Jihu took out a feather that was glowing with a green hue.", "“A Spirit Feather.”", "The answer came from Little Chick.", "“These aren’t the Fairies’ feathers. They must have infused the five Spirits’ power into the Fallen Angels’ feathers. It was probably made for the Archers to use. If you attach it to an arrow, it should be able to borrow the power of a Spirit.”", "“Wait, does that mean we’ll be able to use magic?”", "Marcel Ghionea asked with a slightly flushed tone.", "Little Chick scoffed.", "“Magic? No. It would just be a magic arrow. But the effect should be similar.”", "Marcel Ghionea showed a rare smile. Kazuki seemed to like the idea as well.", "“Chet, so it’s only good for the Archers. Isn’t there anything for us Warriors?”", "Hugo pouted and sulked.", "“We still have two more compartments to go. Be patient.”", "Seol Jihu laughed blandly and opened the third compartment.", "Inside were dozens of rough, shining gemstones.", "‘What are these?’", "Seol Jihu asked inwardly. Then, he blinked.", "“What’s… wrong?”", "Everyone else was standing with their mouth agape.", "They all had dazed expressions.", "But that only lasted a moment.", "“They’re all miiiiiiinnneeee!”", "Hoshino Urara pounced with a bestial howl.", "However, Kim Hannah quickly stretched out her foot and stopped her.", "“Gimme! Gimmmmeeeeee!”", "Even with a high-heel stamping down on her face, Hoshino Urara flailed her arms around and threw a tantrum.", "Seol Jihu picked up a gemstone and asked while repeatedly throwing and catching it.", "“What is this?”", "“T-This is…”", "Audrey Basler spoke with her trembling lips.", "“I’m not one hundred percent sure… but if it’s what I think it is… then it’s that precious, priceless thing…”", "“Shining gemstones. I’ve heard about them in the rumors. The Federation really gave you all these?”", "Even Oh Rahee didn’t hide her surprise.", "“Hello? Can anyone explain what this is?”", "Seol Jihu looked around the room, wondering if he should just activate General Observation, and then fixed his gaze on the sighing Kim Hannah.", "“It’s… an enhancement stone.”", "“Enhancement stone?”", "“Yes. It’s a mystical stone that can enhance a piece of equipment.”", "“Huh? That’s a thing?”", "“Well just take a look here.”", "Chohong tapped her mace.", "“Thorn of Steel +2. It means it was successfully enhanced two times. Shouldn’t you know this as the person who gifted it to me?”", "Seol Jihu did a double-take. Now that he thought about it, that was indeed the case. He had just forgotten about it since he never used an enhanced item.", "Kim Hannah spoke at that moment.", "“For that mace, +1 doubles its power and +2 quadruples it.”", "“Then +3 and +4 would mean…”", "“The weapon’s power would be multiplied by 8 or 16. Though, the chance of successfully enhancing an item decreases drastically the more you do it…”", "Kim Hannah trailed off before pressing her forehead.", "“But given the size of these gemstones, they must be high-grade enhancements stones at the very least. They might even be pinnacle-grade enhancement stones… And that changes things.”", "“Changes things how?”", "“The higher the quality of an enhancement stone, the higher the probability of an enhancement succeeding. For example, with a pinnacle-grade enhancement stone… imagine enhancing Miss Seo Yuhui’s Proof of Chastity just once.”", "Seol Jihu gasped inwardly. He had finally realized the value of the stones in front of him.", "One would be able to quadruple their weapon’s power with just two successful enhancements.", "“Hey, hey.”", "He nudged Little Chick.", "“Dream on.”", "But Little Chick was unenthusiastic.", "“I don’t know about the others, but it won’t work for you or that masked woman.”", "“What? Why?”", "“Idiot, did you forget what your weapon is? The Spear of Purity is a divine spear that has no equal anywhere else in Paradise!”", "“What does that have to do with anything?”", "“Isn’t that obvious? To enhance a divine spear, you need a power that is on an equal level. In other words, they have to be in the same league.”", "Little Chick crossed its tiny wings and shook its head.", "“Well, I see a few pinnacle-grade enhancement stones as that swindler said… but still, it doesn’t even come close to being able to enhance a divine spear.”", "“So it won’t work?”", "“Find a divine-grade enhancement stone if you really want to try. Or you can just try using these stones. I can guarantee they’ll just break.”", "Hearing this, everyone glared at Seol Jihu like they wouldn’t forgive him if he dared to try.", "Seol Jihu regretted greatly. If he could get a ‘+10 Spear of Purity’, defeating the Parasite Queen in one blow might have been possible.", "“I’m shocked.”", "Seeing Kim Hannah place her hand over her chest and take deep breaths, Seol Jihu tilted his head.", "“I can tell how good these stones are by everyone’s reactions, but is it really something to be so surprised about?”", "“Of course. Enhancement stones are a thing of legend to the Dwarven race. They’re a treasure among treasures that rarely enter the market. They were precious even before Earthlings began to enter Paradise. Both the ingredients and the crafting recipes are passed down only to the head of the Dwarven race. Because of it, pretty much nothing is known about them besides their effect… To have so many of them now…”", "“Head of the Dwarven race? You mean Mister Vidalif?”", "“You’ve heard of him?”", "“Heard of him? I’ve personally met him.”", "Kim Hannah looked back at Seol Jihu with widened eyes.", "“You met him?”", "“Yep, along with other top echelon members of the Federation. He’s the one who gave me this box. Ah, now that you mention it, he did look like a master craftsman…”", "Kim Hannah marveled inwardly. She knew that the head of the dwarves stayed inside his private, secret workshop most of the time and rarely appeared in the outside world.", "Though it was a long time ago, there was a time when Sung Shihyun visited the Federation to ask them to enhance his weapon and got turned down by Vidalif, who didn’t even come out to see him.", "“Anyway, I will put these inside the storage as well. I will keep them safe on my honor.”", "“Wait! What about us!? Don’t we get any?”", "“Representative Seol will distribute them at a later time. You see that over there? There are already people trying to pocket them secretly.”", "Maria and Hoshino Urara, who were stealthily reaching toward the stones, flinched.", "Seol Jihu swallowed his regret and reached toward the box while Chohong, Hugo, and the other Warriors beat the two hopeful thieves down.", "Three compartments had been opened, and now there was one remaining.", "Drrk. When he opened the bottom compartment, a flat box could be seen inside. The rectangular box was made of crystal, making it seethrough.", "‘What’s this? I don’t see anything inside. Is the box itself a treasure?’", "Seol Jihu’s eyes lit up after examining the box. He thought it was empty, but that wasn’t true. A transparent liquid swished around inside it.", "He became sure when he tilted the box, and a thin, water-colored liquid formed a pool.", "When he opened the box and carefully picked up the content, the liquid flowed down like a waterfall and spread open.", "Looking at it this way, it looked like a cape.", "‘Am I really holding this?’", "Seol Jihu tilted his head and activated General Observation.", "[Ego Te Defendere]Threads weaved with the leaves of the ash tree containing the World Tree’s will to protect someone. A masterpiece of the ages crafted by the legendary craftsman, Vidalif.Though it usually has the shape of a cape, it transforms into an armor that protects the user’s body upon being infused with mana.It is hard to see unless it is from an up-close distance, and it does not hinder its user’s movements due to its comfy fit.It has a high resistance to physical attacks and ‘all’ types of magic, and it can cure its user of ‘any’ status effect under the league of divinity.It has a self-repairing effect and has a disguise function that changes the user’s clothes based on the environment.Lastly, it is infused with ‘Blessing of the World Tree’, which allows the user’s body and soul to travel to the Spirit Realm for one second, once a day.", "“Wow!”", "Seol Jihu exclaimed in awe. He had been worried about not being able to find defensive equipment on the same level as the Spear of Purity. But now, he had an almost omnipotent piece of armor.", "There was no need to hesitate.", "He immediately infused his mana into the cape, and it instantly wrapped itself around Seol Jihu’s body.", "He moved his arms left and right but didn’t feel even the slightest resistance.", "“This thing is no joke.”", "He exclaimed once more and gave the Spear of Purity a little swing. The thin water-colored cloth was cut like tofu.", "“….”", "Seol Jihu was taken aback.", "“Do you finally see what an amazing weapon that spear is?”", "Little Chick snorted from the side.", "“It could even injure the Parasite Queen, so how could it not cut a little piece of cloth? Now if you understand that, go train some more rather than thinking about enhancing your equipment.”", "Seol Jihu scratched his head as he watched the severed cloth slowly repair itself.", "Despite the armor not quite reaching the league of the weapon, Seol Jihu was still satisfied with it. He especially liked its last effect, sending his body and soul to the Spirit Realm for one second.", "Though it was limited to once a day, it would surely save his life at a critical moment.", "“Blessing of the World Tree…”", "Seol Jihu examined his body until his thoughts strayed off.", "Now that he thought about it, he also had the fruit given to him by the World Tree and the divinity of Temperance.", "However, there was no way for him to find out what these two items did exactly as not even General Observation could see through them.", "“Does anyone know anything about these two items?”", "He held the two things in his hands and asked, but as expected, nobody knew anything about them.", "[Un~ The World Tree is a god of sorts, right? The fruit is the essence of the World Tree and Temperance’s divinity is exactly that. Since they’re both related to gods, wouldn’t it be better for you to ask the gods about them?]", "Agreeing with what Flone said, Seol Jihu clapped his hands and gathered everyone’s attention.", "“Okay, we will keep the box in the organization’s storage as Kim Hannah suggested. We’ll distribute the items at a later time, so don’t worry about it. Now, about the divinity and this fruit…”", "Hearing this, the members who were beating Maria and Hoshino Urara all stopped and turned.", "“I will go to the temple and ask Gula-nim about them. We can decide on what to do with them after we know their effects. Everyone’s going to the temples soon anyway, right?”", "Everyone nodded.", "“Speaking of which, I have something to say.”", "Oh Rahee raised her hand at that moment.", "“I leveled up. I went to the temple last night.”", "“Huh?”", "“I got promoted. From Imperial Chevalier to Imperial Knight. I’m a full-fledged Level 6 now.”", "“Right away? What about the promotion exam?”", "Phi Sora asked urgently, to which Oh Rahee grinned and went, “Hnng~”", "“Don’t Hnng~ me and speak!”", "“So pushy. I got a by for the promotion exam.”", "“Really?”", "“That’s what I was told.”", "Oh Rahee shrugged while twirling her hair.", "“Participating in the expedition to save the Spirit Realm and contributing toward the revival of the World Tree. Gula said she’d count that as the test.”", "“…”", "There was no first or second. The moment Oh Rahee said this, everyone dashed out of the meeting room like they all made a promise to do just that beforehand.", "They knew class promotion was practically guaranteed given what Oh Rahee said.", "Everyone had to go to their respective temples, so Seol Jihu went to Gula’s temple with Flone.", "He ran excitedly and stopped as soon as he saw the familiar stone statue.", "‘Gula-nim!’", "[You’re finally here.]", "A benevolent voice rang out in his head.", "[What took you so long? I’ve been waiting since yesterday.]", "‘Contribution points! Contribution points!’", "[Yes, yes, you did well. What you achieved this time is—]", "‘Oh right, and tell me what this divinity and fruit does!’", "[Sure, sure. But before that—]", "‘Thank you! Anyway, tell me about my contribution points first!’", "Seol Jihu shouted with a twinkle in his eyes.", "[….]", "Gula sighed quietly.", "1. Reference to a famous line in the Korean movie, Tazza: The High Rollers. "]}