{"cid": "422", "title": "Chapter 422. Yun Seohui", "content": ["“Not bad.”", "Yun Seohui’s eyes curved into crescent moons as she smiled.", "Phi Sora flinched, as did others.", "The reason they were in this mess, the reason Roe Scheherazade chose to betray humanity, was Sinyoung.", "Of course, the order might not have come directly from Yun Seohui, but that didn’t change the fact that her attitude as Sinyoung’s representative was inappropriate.", "They certainly didn’t expect her to break down in remorse, but it puzzled them that she showed no signs of regret.", "Yun Seohui seemed rather amused.", "“It did surprise me that they captured Nur and came to Scheherazade at full speed…. But when I really think about it, I have nothing to lose in this situation.”", "With a smirk, Yun Seohui spread her arms wide.", "“You know what they say. Opportunities are found in times of crisis. The Parasites’ invasion basically proved my innocence, and I can use that to my advantage…. And as for Sinyoung, I was scheduled to resign anyway.”", "She tilted her head and shrugged her shoulders.", "“I hate that I had to go down without a fight. And then this happens, and I feel much better. Or should I say, refreshing?”", "Everyone stood frozen in shock.", "Only Seol Jihu calmly stared at Yun Seohui twirling her hair with a finger.", "After a moment of silence, he cleared his throat and asked the same question he asked earlier.", "“Roe Scheherazade? As I said, I knew about her. But I couldn’t lay a finger on her because of my father. What a retard. Couldn’t hide his disgusting stench in Paradise…. It’s all his fault.”", "“Nope, I had no intention of stopping her. It had nothing to do with me. Though I didn’t know this would happen.”", "“I didn’t know. I knew he was planning something, but didn’t think he’d go so far as to join hands with the Parasites. He tricked me. That Jung Minjong, he’s a son of a bitch.”", "“Oh, the texts? I was just curious. That’s all.”", "Yun Seohui answered without hesitation due to the influence of mental magic.", "And then….", "“Ah, about your sister?”", "Her voice suddenly rose.", "“As I said, I only told him to take responsibility.”", "She held up her hands and remarked primly.", "But the bitterness was soon wiped from her face.", "“However~”", "The corners of her mouth curled up into a horrifying smile.", "Then she continued.", "“You and I both know that words can be interpreted in many different ways.”", "Seol Jihu’s eyebrows twitched.", "The possibility had crossed his mind before, but….", "“You, Representative Seol, are such an idiot. Did you really think a contract would solve all your problems? A Priest’s vow? Do you think that’s impossible to get around?”", "“Dumbass. When all Earthlings return to Earth for the first time, they’re required to sign a contract saying that they won’t mention Paradise. Does that mean we can’t talk about Paradise on Earth? Of course not. We can and we do. We refer to it using words like ‘that place’ or ‘Eden’.”", "“And I took advantage of that loophole. Director Jung Minjong has been working with me for many years. He understood what I meant when I told him to take responsibility. He gets me.”", "“I told him I was in the same position as he was. He knows how I operate, so I bet he thought I'd create an opportunity for him to get back on his feet.”", "Seol Jihu closed his eyes.", "“…So you’re saying—”", "He took a deep breath and continued.", "“You’re the one who ordered him to threaten my family.”", "“Didn’t you hear what I just said? I only told him to take responsibility!”", "Yun Seohui pushed up her upper lip with her lower lip.", "“I never lied.”", "She opened her eyes wide and smirked.", "The mocking expression on her face most certainly called for a punch.", "After a brief pause, Seol Jihu slowly opened his eyes.", "“You’re the one who murdered Jung Minjong.”", "“Yeah, I killed him.”", "Yun Seohui grinned.", "“I was going to kill him whether he succeeded or not. A way out? There’s no way I had something like that when you were driving me into a corner.”", "“I signed a contract and made a vow. By that time I had reached the point of no return, so I used him as a tool to prove my innocence.”", "“Since then, I’ve been carrying blank contracts everywhere I go. Because I didn’t know when you’d show up!”", "Even as she revealed her true feelings, her face didn’t show the slightest hint of guilt.", "Phi Sora’s jaw dropped.", "Chohong chuckled and Oh Rahee shook her head.", "“Whoa….”", "Even Maria seemed aghast and bewildered.", "“Holy fuck…. Whoa…. Seriously, whoa….”", "Her face clearly displayed the shock of discovering a bitch beyond belief.", "Some of the more impatient members grabbed their weapons, but their feet stayed planted.", "“…Why….”", "Because even though he appeared calm….", "“Why?”", "Seol Jihu was angrier than anyone else here.", "“Why did you do that?”", "“Why?”", "Yun Seohui snorted.", "“That’s an easy question to answer. There was something I wanted to see.”", "“?”", "“I really, really~ wanted to see your face in despair. I wanted to see you kneel down in regret.”", "Seol Jihu’s face hardened.", "“Just think about it. During the Arden Valley War, I gathered the executors and sent reinforcements for you. When you founded an organization in Eva, I visited to congratulate you. On Earth, I protected you and your family.”", "“Ah, the actual person who looked after you and your family is Seora…. But I approved it, so I can take the credit for it, right?”", "“Anyway, my point is that I’ve done so much for you, but you still forced me to sign the contract and resign. It’s bullshit. Ugh, just thinking about it makes me angry again.”", "“You’re right, I’m Sinyoung’s representative. I am. But you crossed the line. You’re not supposed to do this to me. How could you do this to me?”", "‘Now it’s my turn to ask.’ She announced and threw a question.", "“I was nice to you, so why weren’t you nice to me?”", "“…”", "“I did nothing to harm you, so why? Hmm?”", "“…”", "“Why are you so quiet? Answer me…. Answer me, you son of a bitch!”", "Seol Jihu raised his chin and looked up at the sky.", "A sigh escaped his clenched lips.", "Yun Seohui pouted.", "“Anyway, that’s the reason. Now I’m going to do the same thing to you as you did to me.”", "This must be why she answered ‘not bad’ when asked how she felt. Because whether it was intentional or not, she did get to see Seol Jihu’s face in despair.", "“I didn’t do anything wrong.”", "“…”", "“This is all your fault.”", "Yun Seohui lifted her chin and announced in an almost arrogant tone.", "[There’s one case I believe Yun Seohui could be the culprit, but for my assumption to be true, she has to have the mind of a 5-year-old….]", "Suddenly, the conversation he had with Eun Yuri the other day crossed his mind.", "Eun Yuri was right. The status window didn’t lie.", "Capricious, manchild, selfish, contrived, artificial doll… Yun Seohui was an adult and a human only on the outside. Inside, she was still an immature child.", "“What are your plans from here on?”", "Seol Jihu asked, swallowing his breath.", "“Me? Let’s see…. Sinyoung is basically done for, so I’ll leave the mess to Seora and join Valhalla.”", "“How?”", "“Now that my innocence has been proven, I’ll beg Valhalla for forgiveness, tell them that I was never cut out to be the representative of an organization, and that I’ll do anything they ask me to do, even the shitty tasks. Then maybe they’ll take pity on me and accept me.”", "“…If we accept you, will you work hard?”", "“W-What? Hey! You can’t possibly…?”", "Chohong, who had already tightened and loosened her grip around the Thorn of Steel more than a dozen times, jumped in a startle.", "She was about to ask Seol Jihu if he was out of his mind, then stopped.", "Seol Jihu’s fist was clenched tightly around the shaft, slowly lifting the spear.", "“Yeah! I’ll work hard!”", "But this didn’t seem to alarm Yun Seohui at all and she shouted merrily.", "“I’ll work hard to win your trust for the time being…. And then~”", "“And then?”", "“I’ll stab you in the back at the most crucial moment!”", "Yun Seohui waved her right arm in a circle as if swinging a hammer.", "“So you can screw me over?”", "“Yup, yup. I’ve seen your face warped with despair, but I haven’t seen you kneel in regret yet. It’ll be hard, but I’ll come up with a plan. I’ll do whatever it takes to make you regret what you’ve done. I’ll make you say, ‘I shouldn’t have treated Yun Seohui like that~’”", "‘Of course, if you're nice to me, I might change my mind.’ Yun Seohui shrugged with a smirk.", "“And if we don’t accept you?”", "Seol Jihu asked in a calm voice, even though he heard his comrades shouting at him to kill her already.", "“If you don’t accept me? Let’s see…. If you refuse to take me with you….”", "Yun Seohui propped her chin on her finger, and then smirked and tilted her head.", "“Well then, I guess I have no choice but to return to Scheherazade.”", "“You’re crossing the line.”", "“Roe Scheherazade’s presence bothers me… but wouldn’t she accept me if I showed her how sorry I am?”", "Seol Jihu remained silent.", "Because he had already seen what would happen.", "Only this time, Roe Scheherazade replaced Kim Hannah.", "Suddenly, Yun Seohui clenched her stomach and giggled quietly.", "Seol Jihu’s expression became bleak.", "“…What’s so funny?”", "“Ah, come to think of it, it’s funny.”", "Yun Seohui nodded, wiping her tears.", "“Funny, because this could’ve been prevented. If I hadn’t told Jung Minjong to mess with your family… you’d have more time on your hands….”", "That was the last straw.", "“Or at least… if I hadn’t played hard to get and picked up your call just a little sooner….”", "Seol Jihu took a step forward with the Spear of Purity in his hand.", "“In a way….”", "The light slowly returned to Yun Seohui’s dull eyes.", "“My actions have… ruined your plan…?”", "‘Huh?’ Yun Seohui blinked rapidly as if she had suddenly awakened from a dream.", "The effect of Roselle’s mental magic had come to an end.", "“Huh? Huh….”", "Yun Seohui was evidently perplexed.", "She couldn’t tell whether she was dreaming or not.", "But the memory of what had just happened was clear in her head.", "Going over everything she’d said out loud….", "“…Ah.”", "Yun Seohui turned pale with fright.", "Upon realization, she hurriedly raised her head.", "Seol Jihu was approaching her slowly, step by step, holding the snow-white spear diagonally in his hand.", "There was not a trace of anger or rage on his face.", "Rather, his expression was devoid of all emotions.", "This frightened her all the more as the blank expression seemed to indicate that he had finally given up all hope for her.", "And she was right. Seol Jihu no longer wanted to hear what she had to say.", "“D-Don’t co…. W-Wait….”", "Yun Seohui’s face was a sight to see.", "She looked like she didn’t expect this to happen like she knew she was fucked.", "“D-Don’t come any closer!”", "Yun Seohui backed away from him, shaking her head left and right and shouting at the top of her lungs.", "“Don’t be mad. I lied… I mean… Seora! That’s right, it’s all Seora’s fault!”", "Seol Jihu snorted.", "“L-Listen. Aren’t you curious? Of course, this doesn’t mean that I’m innocent, but I…!”", "Babbling nonsense, Yun Seohui suddenly tripped and fell on her butt.", "Her mouth slowly opened as she looked up at Seol Jihu approaching her.", "At the same time, a look of defiance quickly brushed her face, and her hands moved with great agility.", "A light flickered past Seol Jihu’s eyes.", "“S-Stop! Please!”", "Could it be that she had expected this from the beginning?", "On the surface, Yun Seohui appeared completely frightened, but even in this situation, she was secretly moving her hands toward her pockets.", "Her tenacity was simply astounding. She was thorough beyond belief.", "Seol Jihu strengthened his grip.", "The truth was that he had meant to kill her ever since she said she never lied.", "Black Seol Jihu might have kept her alive because he needed all the hands he could get, but Seol Jihu had no intention of letting her escape.", "So he made up his mind and pulled the spear behind his shoulders.", "“I said…!”", "Yun Seohui shouted desperately before her lips curled into a small grin.", "“Don’t!”", "She took her hands out of her pockets at the same time that someone, growling like a beast, rushed at her brandishing a long sword.", "Rip!", "“Come…?”", "Yun Seohui’s eyes widened.", "The left side of her body felt numb.", "She unconsciously turned her head and saw her left arm, separated from her body, flying in the air. Her hand was clutching a blue stone.", "Yun Seohui’s eyes shot open even wider than before.", "But even as that happened she quickly brought her right hand holding a piece of paper to her mouth. She bit the paper and tore it.", "No— she tried to tear it.", "Rip!", "The long sword once again slashed down at her.", "This time, her right arm separated from her shoulder and fell to the ground.", "Yun Seohui tried to get up but fell to her knees.", "At the same time, she tilted her head back.", "“KIAAAAAAA!”", "A sharp shriek broke out as blood spurted like a fountain from where the arms had been cut off.", "Slap! Yun Seohui’s face turned to the side.", "Her cheek ached and burned.", "She had just been slapped with the blade of a sword, and blood was beginning to drip from the cut on her cheek.", "“Kyaaaak!”", "Slap! Before she could say anything, her face turned again under the force of the blow.", "Her eyes moved instinctively in the midst of confusion.", "The attack hadn’t come from a Valhalla member.", "Marcel Ghionea and Kazuki were pointing their arrows at her, but they hadn’t fired yet.", "And it wasn’t Seol Jihu either. He was frozen in place with his spear above his head, looking slightly surprised.", "Which meant….", "“!”", "Yun Seohui finally managed to hold her head up straight. When she saw the figure in front of her, she became dazed.", "Because the woman standing before her, with her sword raised to the sky and her bloodshot eyes filled with rage, was….", "“You…!”", "…None other than her sister, Yun Seora."]}