{"cid": "431", "title": "Chapter 431. Seo Yuhui", "content": ["A meteor shower fell from the sky like rain.", "Seol Jihu’s jaw dropped open.", "There was only one Priest in Paradise who was capable of using a holy spell of such scale.", "‘No way!’", "Seol Jihu looked back in a hurry.", "It was just as he thought. He could see Seo Yuhui standing in the distance, tightly holding onto the Proof of Castitas.", "“Jihu!”", "Seo Yuhui was also looking at Seol Jihu, so she shouted as soon as he noticed her.", "“Hurry…!”", "She shouted with difficulty while sweat poured out of her.", "Seol Jihu immediately thought, ‘Why is Yuhui Noona here?’ But he moved before anything else. They had to get away from here while the barrier was holding the artificial sun back.", "He called Flone, used Ethereal Shift consecutively to get to Seo Yuhui, and then picked her up in his arms before madly using Ethereal Shift again and again.", "In the next moment…", "Koong!", "The sphere shattered the barrier and crashed into the earth. The moment it made contact with the ground, the sphere shone and exploded with incandescent light.", "Flash!", "A blinding, intense cluster of light spread throughout the area in an instant. The light surpassed Seol Jihu in the blink of an eye, exponentially heating the air and setting everything ablaze.", "The saving grace was that Seol Jihu managed to narrowly escape from the source of the explosion while Seo Yuhui bought him time.", "“Jihu…!”", "Amidst the glimmering world, Seo Yuhui tapped Seol Jihu. Running any further wouldn’t make a difference unless it let them entirely escape the scope of the attack and its aftermath. In that case, it was better to stop and focus on defending preemptively.", "Once Seol Jihu stopped running, Seo Yuhui immediately chanted a spell, creating several layers of barriers around them.", "Soon, a terrifying heatwave raged. The air boiled, and their skin seethed. Despite being inside a barrier and the heatwave being only the aftermath of the explosion, it felt like they were in a scalding sauna.", "But perhaps this wasn’t so bad, considering that the rocks around them were burned to ashes in mere seconds.", "[Whew….]", "Flone breathed out a sigh of relief from the pendant.", "[Had we gotten caught up in it… eck, I don’t even want to imagine it.]", "The world beyond the barrier was still flickering like a broken lamp, even though they had gotten out of the epicenter of the explosion. Otherwise, they would only be seeing the world burn in white light.", "[So there’s an enemy capable of something like this….]", "Flone murmured in regret while staring endlessly. In truth, she had been hopeful when Seol Jihu decimated the Parasite army. Though she wasn’t sure what happened, with how powerful Seol Jihu became, she felt like they could really escape. However, the might that the enemy displayed snapped her hope in half.", "Seol Jihu took his eyes off of his surroundings and turned to Seo Yuhui.", "After concentrating for a while, Seo Yuhui wiped the sweat from her forehead with the back of her hand. Then, she looked back at Seol Jihu.", "“Thank goodness. I made it in time.”", "Seo Yuhui smiled sweetly, but Seol Jihu stared intently without saying a word. Seo Yuhui’s expression sank, clearly sensing his gaze asking, ‘Why did you come?’", "“…Something felt off.”", "Eventually, she spoke in a faint voice.", "“We ran into the Parasites a few times, but they were all flying in the same direction.”", "“Just because of that?”", "“We were caught once too.”", "Seol Jihu frowned.", "“I’m sure of it. A flying Parasite looked back at us and even met my eyes. But it ignored us and flew off.”", "Seo Yuhui continued quietly.", "“I had a sneaking suspicion when the Parasites were all following your escape route. When they didn’t bother to search the area, I was convinced….”", "Seo Yuhui’s guess wasn’t wrong.", "When she arrived, Seol Jihu was surrounded by the Parasite army and was even fighting against three Army Commanders. But what was even more surprising was that Seol Jihu wasn’t losing out in any way.", "“Anyway, what happened? You… you didn’t use that cube, did you?”", "“…No, I didn’t.”", "Seol Jihu shook his head. He finally understood Seo Yuhui’s intention. She must have been worried that he would use the Harmonia Magic Square.", "Unfortunately, that wasn’t what was important right now.", "“Why did you come back?”", "“Well…”", "“You can’t just deviate from the plan. You’re not like this normally, Noona.”", "Seol Jihu spoke with a stiff expression. His voice was low, but it seemed ready to boil up at any moment. It was the voice Seol Jihu had when he was furious.", "“…I know. That what I did isn’t right.”", "“So, you know.”", "“Then what about you?”", "Seol Jihu shut his mouth.", "“I wouldn’t have broken away from the party if the Parasites moved as Mister Philip Muller said.”", "Seo Yuhui continued calmly.", "“But you know that’s not the case. I don’t know the reason, but the Parasites aren’t aiming for the stele, but you.”", "“That’s….”", "“And you were trying to draw the enemy’s attention so we could escape safely.”", "She was hitting the nail on its head with each reply.", "“As the leader of the expedition team, it’s natural that I take responsibility for this operation.”", "Seol Jihu tried to protest.", "“By that logic, I’m also to blame since I hid the stele in Scheherazade.”", "However, Seo Yuhui replied flatly.", "Seol Jihu shut his eyes.", "“But… this is putting you in danger.”", "He sighed deeply and pressed his forehead.", "“You might die…. No, dying isn’t the problem. There’s a chance that you….”", "Seol Jihu trailed off, but it was easy to guess what he was trying to say. There was no way Seo Yuhui wouldn’t know what would happen to people captured by the Parasites.", "“Are you worried about me?”", "When Seol Jihu didn’t answer, Seo Yuhui gave a coy look.", "“You promised back then, didn’t you? That you’d keep me by your side and make me ramen forever.”", "“Noona, that’s…”", "“Yep, I want to eat your ramen, so I came to protect you. What’s wrong with that?”", "“…Are you serious?”", "Seol Jihu asked dumbfoundedly. Of course, Seo Yuhui was only joking, so she smiled bitterly.", "“Of course, I’m kidding.”", "“….”", "“To be honest, it’s not like the thought that this was all in my head didn’t cross my mind…. Still, I just couldn’t run away. My brain was saying no, but my feet just wouldn’t move.”", "“….”", "“Because I….”", "Seo Yuhui closed her mouth without finishing her sentence. She then gave a sorrowful smile and lightly pinched the disappointed Seol Jihu’s cheeks.", "“Anyway, it would have been a different story if I didn’t know, but how can I leave my pipster behind and run, knowing the situation?”", "Seol Jihu widened his eyes and stared at Seo Yuhui.", "It was then.", "Guoooooooo!", "The light that blanketed the land subsided, and their field of view broadened.", "Seol Jihu clenched his teeth.", "Should they continue fighting? Or temporarily retreat?", "It wasn’t a hard decision.", "Twisted Kindness had appeared. It would be hard to end this even if they fought, and what would happen if a new Army Commander appeared in the middle was as clear as daylight.", "Especially Sung Shihyun. If that bastard saw Seo Yuhui was here…", "Seol Jihu clenched his teeth and shook his head vigorously. Setting aside all else, something had come up just now that he had to take care of with urgency.", "The mountain-sized flaming orb that Twisted Kindness conjured up had shrunk to the size of a hill.", "Seol Jihu took out a piece of paper from his pocket without a moment of delay. It was one of the items that Yun Seohui was trying to use before she was beheaded— the teleportation scroll.", "“Let’s get out of here for now.”", "Seol Jihu grabbed Seo Yuhui’s hand and ripped the scroll.", "Immediately afterward, a small light burst out, and the two of them vanished.", "*", "When the explosion subsided, nothing was left in the area. Only a gigantic pit spanning several kilometers remained like a sinkhole.", "“…So we missed them, huh.”", "Twisted Kindness muttered briefly after scanning the ground below.", "The Star of Lust’s intervention was outside of her expectation. She had drawn up her energy to the limit for the first time in a while, so it would be a lie to say she wasn’t disappointed.", "‘In any case, that brat really did a number on our forces…’", "Although Twisted Kindness was the one to completely wipe out the Parasite army with her spell, she had been carefully watching the battle from the very beginning.", "Never mind the Bugs and Cockroaches, even the Hydras were toppled by a strange skill, and the Sixth Army Commander was almost killed as well.", "If she didn’t intervene, both Vulgar Chastity and Exploding Patience would have perished here today.", "‘The Second Army Commander wasn’t lying…’", "She didn’t make any excuses this time as everyone had fought to the best of their abilities. The fact that they were pushed back despite this meant that the enemy was a powerhouse that could effortlessly suppress an Army Commander or two.", "‘A star that evolves the more it is irritated…. Is that why he got stronger than the time we fought in Scheherazade?’", "“Are we not going to chase after them?”", "Exploding Patience flew over and asked while Twisted Kindness was lost in thought.", "“Didn’t you see just now?”", "Twisted Kindness replied with a slightly exhausted look.", "“You and the Sixth Army Commander were used as baits, and I used the strongest spell in my arsenal. Despite all this, he managed to escape from here alive.”", "The Brightest Star, a hero that was under the world’s protection, would not die easily.", "“Then…”", "“We’ll retreat and reorganize.”", "“R-Retreat?”", "The hesitating Exploding Patience asked in surprise.", "“It is the Queen’s order.”", "Twisted Kindness retorted apathetically.", "“If I fail, she said the First Army Commander would have been right.”", "“….”", "“And I agree. If we chase after him without a plan just because we have him cornered, we will only be accelerating his growth.”", "She spoke with strength.", "“Perhaps his growth can’t be helped now that we’ve irritated him, but we can’t go on this way. We need to use our resources more efficiently.”", "The Parasites needed a more methodical tactic to ensure the Brightest Star’s demise.", "*", "[Where are we?]", "Flone looked around the area.", "There was no way of knowing their exact location, but it was easy to tell they had not left the Empire’s territory. It was because the scroll that Yun Seohui had was only a short-distance teleportation scroll. It was made to be used in an emergency to escape.", "The silver lining was that they could not see any enemies nearby.", "“Damn it! We have to re-route our path…”", "Little Chick popped out of Seol Jihu’s pocket and turned its head left and right.", "Flone stared at Little Chick intently before yelling in anger.", "[Hey, aren’t you being too harsh?]", "“What?”", "[Seol and I are fighting with all our might, yet you’re…!]", "“Hmph, stupid brat, did you forget I used up my energy going back and forth around the hideout from Via Lactea?”", "Little Chick raised its voice as well.", "“Do you think I’m sitting here because I want to? What do you want me to do when I need to recover my energy? It’s not like I even have time to absorb nutrients.”", "[But…! Okay, fine. Then when can you transform again?]", "“Transforming for a moment won’t do anything. I need to gather more energy if I want to maintain my phoenix form for even an hour.”", "As Flone’s voice subsided a bit, Little Chick retorted curtly and smacked its lips.", "“Don’t be impatient. This battle is going to be a long one. We need to look at things long-term rather than giving our all in one fight.”", "[….]", "“Not choosing to push ourselves just now was the right choice. Maybe I’m too result-oriented, but hey, our reinforcement came at the perfect time.”", "Little Chick then muttered, ‘Why she came is a different matter though.’", "Flone turned her head.", "Seo Yuhui was standing in front of Seol Jihu, busily checking for any injuries.", "“Amazing. Against such a huge army, you’re barely hurt… But just to be safe…”", "“….”", "“Can you raise your arm for a bit, Jihu? Let me see your side.”", "It was then.", "Seol Jihu, who was sitting like a stone statue, suddenly shook his arm irritably.", "Seo Yuhui paused in a startle. She looked a little shocked.", "“Jihu….”", "For some reason, Seol Jihu was flushed red from his neck, all the way up to his face.", "“Are you… still mad…?”", "Seol Jihu quietly glared at Seo Yuhui. He dropped his head and nibbled on his lower lip before looking up at the sky and letting out a deep sigh.", "He repeated this a couple of times before finally looking straight at Seo Yuhui.", "“…Noona.”", "Then, he asked nervously.", "“Who are you?”", "“Hmm?”", "“Don’t pretend like you don’t know what I’m talking about. Who are you?”", "“W-What do you mean all of a sudden?”", "“Pipster.”", "Seol Jihu spoke with strength.", "“You said so back then. ‘How I can imagine of leaving behind my pipster and escape.’”", "Seo Yuhui blinked.", "“How do you know that word?”", "“…Huh?”", "“Pipster. That’s something only my family knows. It’s a nickname I’ve had ever since I was young.”", "Seo Yuhui froze. Her eyes widened, and she covered her mouth in a fluster.", "Seol Jihu did not miss Seo Yuhui’s reaction, which clearly showed she had a slip of the tongue. Seol Jihu became convinced.", "“Are you my father? Or mother?”", "“….”", "“Are you Hyung? Or Jinhee?”", "“….”", "“Or… are you Seonhwa? Or Seunghae?”", "“…N-No.”", "“Then, who?”", "Seol Jihu gritted his teeth.", "“I, I heard it.”", "Pressured by his spirit, Seo Yuhui blurted out.", "“You heard it?”", "“Y-Yeah, I heard it a long time ago…. It sounded cute, so I remembered it… I must have said it unknowingly because I kept saying it in my head…”", "Seol Jihu’s eyes narrowed. Seo Yuhui’s explanation didn’t make any sense. Even if she was telling the truth, just who could she have heard it from?", "“Don’t lie.”", "“I’m not!”", "“That nickname is something only my family knows. Does that mean a member of my family is an Earthling, and Noona is acquainted with that person?”", "“That’s….”", "Seol Jihu closed his mouth tightly and glared at Seo Yuhui. He had no intention of moving before she told him the truth.", "After biting her poor lower lip for a while, Seo Yuhui eventually gave in.", "“Jihu.”", "“Say it.”", "“Listen to me, please.”", "“I’m listening, so say it.”", "“Okay, I’ll tell you. So, please.”", "Seo Yuhui continued.", "“This isn’t something I can explain quickly. It won’t end in ten or even twenty minutes. It’s not something I can explain in our current situation. Our lives are more important, right?”", "“….”", "“I’ll swear on Luxuria-nim’s name. I’ll answer any question you have once we make it home alive.”", "“….”", "“So please, let’s focus on escaping for now, okay? With the four of us working together, making it out of here alive shouldn’t be impossible.”", "Seo Yuhui pleaded earnestly and desperately.", "She wasn’t wrong either. Now certainly wasn’t the time to kick back and have a discussion with the Parasites capable of appearing at any moment.", "“Haa….”", "Seol Jihu, who was glaring fiercely, sighed for the umpteenth time and spoke.", "“Status window.”", "“?”", "“Let me at least see your status window. You can show it to me if you allow it, right?”", "“You want to see my status window…?”", "Seol Jihu nodded heavily.", "“I’ll also swear on Gula-nim’s name. Just show me your status window. Then I won’t say anything else and focus only on escaping.”", "Seo Yuhui looked conflicted.", "Is this not allowed either?", "When there was no reply even after a while…", "“Noona!”", "Seol Jihu shouted impatiently and activated his Innate Ability in anger.", "In that instant, for some reason—", "Was it because his mana rose to EX-rank? Or was it because Seo Yuhui allowed it?", "The Future-Gauging Nine Eyes no longer saw Seo Yuhui as colorless.", "Her status window popped up, and several colors burst out of her body.", "At the same time—", "Flash!", "A screen unfolded in front of him."]}