{"cid": "258", "title": "Chapter 258. Fox, O Fox (4)", "content": ["Yang Yang.", "He was the head of an organization that made up the Eva alliance, an Earthling that represented one of the four Weaks of Eva’s forces, and a close friend of Omar Garcia. This was all thanks to Yang Yang’s creed of doing anything if paid properly and Omar Garcia’s interests often coinciding.", "Actually, it wasn’t an exaggeration to say that it was Omar Garcia who raised Yang Yang’s authority and elevated him to be the representative of the 4 Weaks.", "Omar Garcia called him today for a similar reason.", "\"I originally didn’t intend to go this far.”", "Omar Garcia calmly spoke.", "\"Carpe Diem, Seol Jihu, and the Triads. It didn’t seem like a bad idea to draw them in as allies at first. I considered kindly forgetting the past and even gifting them the territory that the Royal Pattaya was in charge of. It looked like it’d make a magnificent picture.”", "Yang Yang smirked.", "\"You’re too generous.”", "\"It’s not too bad to gain a figurehead after all. That’s what I thought… but I’ve been getting second thoughts lately.”", "\"They’re making too much of a mess. There have been a lot of complaints within the alliance because of them.”", "\"There’s a limit to everything. Bluntly put, they must view us as pushovers. Otherwise… Tsk.”", "Omar Garcia clicked his tongue and continued in a subdued voice.", "\"What do you think?”", "\"Are you planning to drive them out?”", "\"The correct phrase would be to serve them retribution. In any case, it seems that I’ll need to borrow your helping hand this time. You won’t be disappointed with the payment.”", "\"I’ll have to refuse, sir.\"", "Yang Yang flatly declined without hearing the rest of what Omar Garcia had to say. Omar Garcia’s eyebrows twitched.", "\"I wasn’t done talking.”", "\"Please don’t demand ridiculous requests. I’m not that eager to walk into my own grave.”", "\"Yang Yang, I’m not asking you to declare war on them. You just need to give them a taste of their own medicine.”", "\"That sounds like the same thing to me. What do you expect me to do when even the alliance can’t do anything to them…”", "\"What if Seol Jihu left Eva?”", "Yang Yang’s eyes narrowed.", "\"…Excuse me?\"", "\"The royal family lent us a hand. Carpe Diem is going to dispatch several members to complete an escort mission to the Federation.”", "\"So in other words…\"", "Yang Yang suspiciously asked.", "\"You want me to ambush them while their main force is absent?”", "\"Now we’re talking.”", "Omar Garcia smiled as he continued.", "\"You don’t need to think things too hard. Quietly sneak attack them early in the morning and then quietly retreat after you’re done. Burn down the entire area, building and all, so there won’t be a trace of evidence left.”", "\"Well that’s what we’ve always done, but…”", "Yang Yang pondered. It theoretically wasn’t an impossible task.", "There would be only non-combatant High Rankers remaining if Carpe Diem’s main force left. Granted, there would be an Executor, but it was an open secret that Seo Yuhui lost her ability as an aftermath of the war. Since there were only one or two low-levels excluding her…", "He had dismissed the thought as a ridiculous notion at first, but after reaching that point in thought, a perverse desire arose within Yang Yang.", "'The Daughter of Luxuria….'", "A flower that even Sung Shihyun failed to pluck. He would be lying if he said it didn’t tug at his interests.", "\"I have a few questions I want to ask.”", "\"Go ahead.\"", "\"How are you planning to deal with the Triads? Unless they’re fools, they’ll definitely request protection from them.”", "\"I knew you’d asked. Actually, I secretly met with the Triads not a while ago.”", "Omar Garcia spoke as if it was all within his expectations.", "\"I noticed that the Triads had always bided their time, restraining themselves. So, I spoke with them out of a hunch, and my guesses were spot on.”", "\"Is that true?\"", "\"You’ll know when you see it.\"", "\"Don't be like that and please tell me. Aren’t I the one who’ll be doing the work? I need to know the situation to come up with a plan.”", "Seeing Yang Yang show great interest, Omar Garcia relented and proceeded to explain.", "\"It’s simple. The Triads agreed to send four to five hired-thugs.”", "\"Why thugs…\"", "\"Listen. What we’ll do is….”", "This was Omar Garcia’s scheme:", "Hao Win would send hired thugs dressed like members of the Triads and have them pick a fight with Ochoa Cartel members at a pub.", "\"Brawls at a pub is a normal occurrence, isn’t it?”", "\"Sure.\"", "\"It would be nothing special at first. However, once someone takes out a weapon, it can’t be treated as a trivial fight anymore.”", "\"Are you purposely intending to stir up a scene?”", "\"Yes. We’re going to send members from our cartel and the Dongchun Merchants. Of course, make sure you’re present with members of your organization too. Send just enough to prove you were there at the scene.”", "Just like that, all the organizations under the Eva Alliance would rush to the pub, followed by the members of the Triad that would be guarding the Carpe Diem building.", "Yang Yang scoffed hearing the strategy.", "\"Is there really a need to go this far?”", "\"This guy. We have to take the Triad’s position into account. Reputation is a factor that can’t be ignored for organizations.”", "Things would be too suspicious if the Triads conveniently withdrew all their members in a timely manner without any reason. That was why they would create a situation that would ‘force’ them to abandon the building’s security.", "That wasn’t all.", "The Eva Alliance would be the first one to be suspected if they launched an attack against Carpe Diem. However, if they created a scene by fighting against the Triads, they could create an alibi for themselves. Furthermore, it would be difficult to identify exactly who was present when the brawl happened.", "\"Once the situation is set up, the royal family’s attention will be focused on the pub. You take that moment to ambush Carpe Diem. You just need to give me a call once you’re done with the task.”", "\"What happens then?”", "\"Hao Win and I will appear when the situation escalates to the verge of exploding. Then I’ll apologize first, ending the situation, and we all go home.”", "\"I understand what you mean. But what do we do when Carpe Diem’s main force returns? Do we stay still?”", "“What can they do if they can’t find the culprit? There’s no lack of Earthlings that were dissatisfied with how they destroyed the red-light district. We just need to push the blame. Everything will settle down in time.”", "\"Well… Judging by their actions up to now, they might try to raze us down to the ground…”", "\"Then we have to thank them instead. They’d be giving us justification to take action. After all, internal conflict is forbidden within the city without legitimate reasons. If that happens, it won’t be just the Eva Alliance but the royal family that will move as well. We’ve already talked things through.”", "Yang Yang couldn’t help marvel at Omar Garcia’s attention to minute details as he smoothly answered his worries.", "\"You’ve already thought that far. You’re really determined this time, aren’t you?”", "\"There’s a limit to my patience. I’ve already shown them mercy. Now I have to show them that I’m not someone they can trifle with.”", "Yang Yang nodded his head, agreeing with him.", "\"So how is it? Are you confident now?”", "\"Well… If everything’s as you’ve said, then it’s more than possible. You’ve already laid out a mat for me.”", "\"Good! Then—\"", "\"But.\"", "Yang Yang interrupted him and lifted three fingers.", "\"I’ll do it if you listen to three of my requests.”", "\"…Really. This guy.”", "\"It’s nothing other than making things clear.”", "Yang Yang snickered hearing Omar Garcia grumble.", "\"First, I’ll carry out the mission only after I confirm Seol Jihu has left Eva. In other words, I get to decide when to execute the plan.”", "\"It doesn’t matter.\"", "\"The second is on similar lines too. I’ll commence only when the Triads completely leave the building.”", "\"That’s a given.\"", "\"And for the third… I’d like to borrow a High Ranker.”", "Omar Garcia gazed at him instead of immediately replying. Anger flashed across his face before quickly disappearing.", "\"…You’ve changed a lot too. Where did your bravado of doing anything for money go?”", "\"I don’t want to die. Of course, I’ll be selecting only the elites of my organization to go with me, but don’t I also need to leave some at the pub for our alibi? Also, there’s no guarantee that all of Carpe Diem’s main force will be leaving.”", "\"You want insurance, huh. That’s good. I’ll send Oliver Rogers with you.”", "\"No. I’d like to take Noah Freya-nim.”", "\"What?\"", "\"If Oliver Rogers-nim comes… We’ll be forced to share.”", "\"Share?\"", "Omar Garcia questioned him with an inquiring face, but soon sent him a strange gaze.", "\"Now that I think about it….\"", "\"I’ve researched a little on my own, and there’s Miss Foxy and another pretty girl. But above all, there’s the Daughter of Luxuria…”", "Yang Yang trailed off his words and giggled. It was a peal of dirty and perverse laughter.", "\"Don’t say no. It’s not an opportunity that comes often.”", "\"Jeez, fine, do whatever you want.”", "Omar Garcia guffawed.", "\"It’s good to have some fun if you’re going to kill them anyway, but don’t screw up.”", "\"Don’t worry, you know my personality. I’ll quickly kill everyone that needs to be killed and get out after burning the whole place down, building and all. And then I’ll drag her out and… Hehe!”", "As if he was excited just thinking about it, Yang Yang’s face became filled with lust. Omar Garcia’s eyes also sparkled.", "\"I’m suddenly beginning to envy you.”", "\"Feel free to drop by when the work is done. We’ll probably still be in the basement sharing a heated moment… You might even have to wait in line!”", "\"Look at this guy talk. Good! It’ll be a scene worth watching.”", "\"I’m already getting aroused. There’s Miss Foxy, too, but doing the Paradise’s legend with my very own hands… Hehehehe!”", "Dark laughter rang out of the room for a long time.", "*", "Meanwhile, a tripartite talk was underway at the Carpe Diem building.", "There were two notable points.", "One was that Seol Jihu was nowhere in sight and the other was that one of the parties was participating through a communication crystal.", "There was no way Seol Jihu was aware of this since Kim Hannah convened the meeting in secret while he was busy preparing for the escort mission to the Federation.", "\"Hmm…\"", "Jang Maldong murmured to himself while sitting on the couch with a disapproving face.", "\"Master.\"", "Kim Hannah spoke with a firm voice.", "\"I know what you’re thinking about this as. But Jihu needs to be punished at least once.”", "\"…\"", "\"That guy doesn’t even have a clue as to what he’s done wrong this time.”", "\"…I don’t really know why we need to go this far.”", "Jang Maldong spoke in a tired voice.", "\"Jihu is a boy without a sense of entitlement. You can tell by watching him unable to grasp how great of a feat it was when he took down Undying Diligence.”", "\"I know. He doesn’t have a bad personality.”", "Kim Hannah continued.", "\"And as you said, he doesn't have a sense of entitlement. But he harbors a victim mentality.”", "\"Victim mentality?\"", "Jang Maldong’s gaze grew sharp. His expression plainly asked whether she was done talking.", "However, Kim Hannah did not falter and resolutely continued.", "\"Since you’ve been with him for a long time, even you must be aware that Jihu is excessively immersed in Paradise. It’s not an exaggeration to say that he’s treating this place equal to his own life.”", "\"…”", "\"He suddenly becomes a different person altogether when certain incidents happen. This was the first time I’ve personally witnessed it, but you must have seen it a couple of times already.”", "Jang Maldong shut his mouth at those words.", "Because of how he doted on Seol Jihu, he wanted to defend Seol Jihu like he normally did, but… his mouth did not open easily.", "It was because Jang Maldong had also seen and felt the same way several times before.", "\"He’s gone too far, especially after coming to Eva… Jihu’s probably thinking of every Earthling besides himself as potential threats to Paradise.”", "\"Even if he’s thinking that way, he’s not entirely wrong.”", "\"You’re right, he’s not. But not everyone’s like that. Just in our team alone, there’s you and Miss Seo Yuhui.”", "—I don’t think it’s a bad idea to go along with Miss Foxy’s idea this one time.", "Hao Win, who had been silently listening in this whole time, expressed his opinion.", "—Seol is already as drunk as he can be. He doesn’t think so himself, but he isn’t even looking at the people around him. If he takes another step further from this, he won’t even be able to look at himself anymore for sure.", "Hao Win concluded his words, emphasizing the end.", "\"…I understand what you’re saying, but the leader of this team is still Seol Jihu.”", "Jang Maldong spoke with difficulty.", "\"What Miss Kim Hannah is trying to do can be seen as overstepping her authority. I’m worried about this part.”", "\"I’m aware of that, of course.”", "Kim Hannah clearly admitted.", "\"I’m doing this, fully prepared to face the consequences. But more importantly, Jihu promised me.”", "\"A promise?\"", "\"Yes. At the inn in Scheherazade. Jihu wanted me to join, and I accepted under certain conditions. One of those conditions was that I’d refuse to take care of him like a nanny.”", "\"…\"", "\"To be more precise, I asked for the authority to act as the proxy leader, and Jihu consented. I know Jihu won’t break his promise.”", "Jang Maldong closed his eyes. He leaned back and buried himself in the sofa before letting out a deep sigh.", "\"I don’t have anything else I can say if you say that.”", "In the end, he nodded his head. Without saying anything else, he got up from his seat and left the room.", "An awkward silence ensued once the two of them were left.", "—Is it because he’s getting old? He’s surprisingly inflexible.", "Hao Win jokingly commented. Letting out a short sigh, Kim Hannah placed her hand on the crystal.", "\"Thank you for cooperating. Everything’s easier now, thanks to you.”", "—I didn’t know things would turn out this way either. I’ve only pounced on a timely opportunity that presented itself before me.", "\"Not missing an opportunity is also an ability.”", "—I’m just thankful.", "Hao Win chuckled.", "—I finally get to show the PPAP dance that I’ve been practicing for the past couple of days.", "Kim Hannah scrunched her forehead at his sudden words.", "\"PPAP?\"", "—Ahah. I was just talking to myself so don’t mind it. Everything will go according to the script. We’re already on standby.”", "\"Then we’ll be in your care.”", "—Good, good.", "Hao Win’s grinning face could be seen just before the crystal went dark.", "—It’s finally time for an awesome prank video.", "*", "The next morning, Seol Jihu led a portion of his team on an escort mission to the Federation. He had made a separate request to the Triads, but he also had Chohong stay back, just in case.", "After being entrusted with the individuals from the Federation, Seol Jihu quickly left Eva and headed towards the border.", "Nothing happened that day. Nor the second day.", "And when the next day came and the night passed… A small commotion began at a pub in the streets.", "It was a typical argument that one could see every so often. Only, the fact that the quarrel was between members that looked like they were from the Eva Alliance and men that were in black suits, a trademark of the Triads, created an uneasy atmosphere.", "And that uneasiness soon turned into reality.", "The voices gradually rose before people began shouting and releasing murderous intents. Sensing the serious atmosphere, the bystanders quickly retreated and the gap they created was filled with members from both parties.", "Early in the morning, while the city’s attention was drawn by the commotion at the pub, an unknown group rapidly took action.", "Under the cover of darkness, they stealthily moved without a sound and surrounded their destination, the Carpe Diem building.", "*", "Meanwhile, Seol Jihu was fully concentrating on his mission without a clue of what was taking place in Eva. Since he couldn’t march the entire time with individuals that were still recovering from their injuries, he made them set up camp the moment the sun went down and prepared dinner.", "And during the night when everyone was asleep…", "\"Huaaaam. Good work~”", "“I’ll be sleeping now then. We're in your care.”", "\"Yes yes, sleep well dear.”", "Seol Jihu finished his night shift and switched with Phi Sora.", "Something was off about Seol Jihu’s neck that night as he stretched and proceeded to enter his tent.", "The pendant that had always been around his neck was nowhere in sight."]}