{"cid": "243", "title": "Chapter 243. Farewell, Haramark", "content": ["In the end, Seol Jihu swallowed his pride and decided to apologize. Teresa now had her head down on the table, no longer replying. Seol Jihu sat down next to Teresa, inched closer to her, then began consoling her.", "“Eii, Princess, don’t be like that. Look at my face, come on.”", "“I’m fine.”", "“I’m sorry. Really.”", "“I said I’m fine.”", "A depressed voice escaped from the gap between her face and arms.", "“Go. You don’t have to be considerate of someone like me anymore. Stop caring about me and go do what you need to do.”", "“Princess…”", "With a troubled expression, Seol Jihu placed his hand on Teresa’s left arm.", "“Don’t touch me.”", "But disregarding what Teresa said, Seol Jihu slowly moved his hand to her silky, rose-gold hair, slowly stroking it.", "“Go away.”", "Teresa’s words also didn’t match her actions as she snuck closer to Seol Jihu’s chest, having waited for this moment.", "“I’m sorry. From now on, I won’t forget to contact you ever again.”", "“…From now on?”", "“Yes.”", "“Never again?”", "There was a saying that one shouldn’t make promises they couldn’t keep. But Seol Jihu was too focused on making Teresa feel better that he was blurting out words without regard for repercussions.", "“Yes, never again.”", "His words must have had some effect as the air around Teresa softened.", "“Then you won’t go?”", "A sneaky question flowed out. It almost felt like the series of events that unfolded beforehand was all in preparation to lead up to this moment. Seol Jihu smiled bitterly.", "“I can’t do that.”", "“Why not…”", "A helpless voice flowed out. Teresa had asked this exact same question before.", "Seol Jihu cleared his throat. He was about to take his hand off and interlock his fingers, but Teresa quickly snatched it up and placed it back on her head.", "Seol Jihu laughed, going back to stroking her hair.", "“Several months ago, Master Jang gave me a record book that Master Ian left behind.”", "Seol Jihu could feel Teresa flinch once he mentioned Ian’s name.", "“The record book had names of Earthlings who died mysterious deaths or retired. There were even names of Earthlings who defected to the Parasites.”", "Seol Jihu’s voice turned bitter, still in shock from when he read the record.", "It wasn’t that all Earthlings were trash.", "That was true in the past, and that was still true now. In the Seven Cities, there undoubtedly were Earthlings who were doing their best for the benefit of Paradise.", "It was just that they were outnumbered by trash.", "But what was important to Seol Jihu was that in the past, present, and future, there were Earthlings who were willing to sacrifice themselves for Paradise.", "“I want to raise, support, and protect Earthlings who are sincerely striving to make Paradise a better place. I’m making an organization because I can’t do that alone.”", "Of course, if it was just this, there was no need to move out of Haramark. But, Seol Jihu’s grand ambition went a few steps farther.", "“Another reason is to improve humanity’s relationship with the Federation.”", "He had said this before, so he added in more details.", "“I realized something during the Pagoda of Dreams expedition. That it’s possible for the Federation and humanity to reconcile. And this is something we must do, since only then will we be able to fight the Parasites.”", "“….”", "“I’m leaving, Princess. I’ll go to Eva and become the city’s representative organization.”", "He spoke with conviction.", "“I will clean up Eva’s deeply-rooted evils and extend a hand of apology to the Federation. Then, I will formally become their ally.”", "Teresa raised her head slightly, but Seol Jihu continued without pausing.", "“It won’t be an alliance that is in name only. As long as the Federation is willing, I am willing to accept them into Eva and carry out a cultural exchange.”", "Teresa finally sat back up. As she slowly looked back at Seol Jihu, a dazed expression filled her face.", "“You’ll accept them… and do what?”", "“I’ll turn Eva into a fortress city. Just like you did.”", "Seol Jihu talked nonstop, almost like flowing water.", "“Of course, Eva’s terrain isn’t like that of Arden Valley’s fortress, able to benefit from nature. But with the Federation’s technology, which helped to build Tigol Fortress, it shouldn’t be impossible.”", "“Since when have you been planning this?”", "“Since the war ended. At the time, the Parasites raised a huge army, large enough to besiege all of humanity’s major cities.”", "As a result of this encirclement, the humans had trembled in terror, fearing that the Parasites finally unsheathed their swords. But at the end of the day, the Parasite Queen’s objective was different.", "She had deceived everyone when her real objective was to prevent the transfer of reinforcements.", "“As to why that happened… I thought a lot about it before I arrived at the answer. It was all because Tigol Fortress fell.”", "Teresa had a complicated expression, even though it looked like she understood what he meant.", "“Will the Federation agree to your offer so easily?”", "“Without lips, teeth will feel cold. Eva shares a border with the Federation and is the closest human city to Tigol Fortress. It is in the ideal location to help them in case something happens. I do not believe the Federation will ignore this fact.”", "Teresa closed her eyes. She had no choice as she finally saw the big picture Seol Jihu was attempting to draw.", "“That sounds like a dream…”", "Blurring the end of her speech, she smiled helplessly.", "“You remind me of an Earthling I once knew.”", "“?”", "“Joshua Claflin. He was the old Star of Sloth.”", "Teresa heaved out a long sigh.", "“He was an Earthling who insisted that humans should work together with the Beastmen Alliance. He was a hero who conquered the Kapyshan Kingdom, where the Parasites’ corruption was taking place, and foiled the Parasite Queen’s plans.”", "Seol Jihu remembered his name from Ian’s record book. When the Beastmen Alliance was at risk of being wiped out, he had led a small force of elites to reinforce them but was killed by Unsightly Humility’s ambush.", "“After that event, I swore again and again that I would never sit back and watch… I almost committed the same mistake I did back then. Because of my greed.”", "Seol Jihu’s eyes widened as he could tell Teresa had mostly given up on making him stay.", "“So you’ll understand?”", "“I don’t have a choice now that I heard where you’re coming from.”", "I shouldn’t have run away last time and listened. Teresa was ashamed of herself while being surprised at the same time.", "Regardless, she was sure of one thing. Seol Jihu had an ambitious plan that no one would even dream of.", "Hearing it, she finally understood what he meant by, ‘for the sake of Paradise’. She might not be able to help him, but she couldn’t bring herself to hinder him.", "“This is the first time.”", "Seol Jihu spoke softly.", "“That I’m telling someone about my plans in detail.”", "Laughing awkwardly, he scratched his head.", "“I know it’s a wild dream. It’s unrealistic, and I might be counting my chickens before they hatch. Still…”", "“No.”", "Teresa firmly denied it, gently gazing at the young man sitting next to her.", "“I believe you can do it.”", "He had achieved impossible things again and again.", "She had to believe in him. And she wanted to as well.", "If he could really achieve his goals…", "A smile spread across Seol Jihu’s face. Perhaps because Teresa just cheered him on, he felt a surge of strength.", "“Thank you.”", "He didn’t need to make long comments. After giving a short thanks, Seol Jihu quietly stood up before going “Ah” and asking.", "“By the way, nothing happened to the palace, right?”", "“Huh? Ah, yes.”", "“Ah, thank goodness.”", "“…Why?”", "Teresa tilted her head. Once Seol Jihu smoothed down his chest and explained why he rushed to the palace, Teresa smiled bitterly.", "But that only lasted a moment. Her pink pupils flickered with a crafty light.", "“I was really surprised. General Sanctus made it sound like there was an urgent matter to take care of. I thought something huge happened…”", "“Well, you see, there actually is a problem.”", "“Pardon?”", "“Well, it’s not a big problem for now, but it’s something the kingdom has to worry about for its future.”", "Teresa spoke innocently without the slightest change in her expression. Seol Jihu turned serious.", "“What is it? Can you tell me about it?”", "“I don’t mind, but…”", "“Even if I leave, it’ll be after I hear about this problem.”", "Teresa sent Seol Jihu a coy look, and he quickly sat back down.", "What Teresa said afterward could definitely be considered a problem. Haramark had apparently lost a huge number of hoplites as well as footsoldiers during the war, causing their military strength to fall significantly.", "They had to supplement the lost personnel to reinforce the kingdom’s army, but due to the plummeting population, they were in a precarious spot.", "“That’s not all. Soldiers aside, the lack of officers is also a huge concern. Raising an experienced officer is extremely difficult…”", "This was a problem as well. An army showed its true value when it moved as a group. The problem was so bad that Haramark was selecting veteran soldiers and training them to become field officers. Learning about this gave Seol Jihu a good estimation of Haramark’s situation.", "“We’re reviewing the matter from several angles. Starting from short-term methods like lowering the draft age to long-term methods like the childbirth grants…”", "Teresa sighed, unable to finish her thought. In reality, the draft age couldn’t get any lower, and they had no data to support that childbirth grants would be of any use.", "What parent would want to give birth to a child in a world where they could die at any moment?", "“Is there something I can help you with?”", "Seol Jihu asked, unable to think of any solutions to the problem. Teresa pretended to be in conflict before carefully guiding the conversation in one direction.", "“This is normally a problem that the kingdom should worry about. But… I actually want to ask you for a favor…”", "“What is it? Tell me.”", "Seol Jihu rejoiced. Teresa hesitated for a long time, seemingly embarrassed to ask for his help again, but with Seol Jihu persuading her, she asked with great difficulty.", "“Can we go somewhere else first?”", "“Of course.”", "Seol Jihu left Teresa’s office under her guidance. But he suddenly felt a strange disharmony as he passed the dining hall and entered a familiar corridor.", "“Come in.”", "Where he arrived, at last, was Teresa’s bedroom. As he had been here once before, he remembered it clearly.", "“Why here…? Weren’t we going to talk about how to supplement soldiers?”", "“Eii, what soldier supplement plan?”", "Teresa flicked her hand down and gave a sweet smile.", "“You mean the officer supplement plan. It will take some time, but come in. Hurry.”", "With that, she inched closer to Seol Jihu, seemingly trying to pull him in.", "‘Officer supplement plan?’", "Rolling his eyes in surprise, Seol Jihu abruptly stopped breathing and his face reddened instantly.", "Next, Seol Jihu turned around in a hurry, while Teresa’s outstretched hand simultaneously brushed past the hem of his shirt.", "“Ah!”", "Seol Jihu ran away at full speed. He heard a frustrated, “Damn it! I almost had him!” from behind, but he didn’t stop. Because rather than giving up, he sensed a presence chasing after him at a frightening speed.", "But Seol Jihu wasn’t the one to be caught so easily. As his Agility stat had recently ranked up by a stage, if he gave his all to running, even Teresa found it difficult to shorten the distance.", "Just like that, by the time he escaped the palace and darted past its grand gate…", "“SEOOOOOL!”", "Teresa’s voice stretched out before coming to an abrupt stop.", "Seol Jihu glanced back before slowly speeding down and turning around. Teresa was taking deep breaths with her back bent down.", "Her face was full of laughter as if she was cracking up after a funny prank.", "“Huu—”", "Shortly afterward, Teresa stood tall and looked straight at Seol Jihu. Then, with one hand tightly clenched, she said with a smile.", "“Good luck.”", "“Princess?”", "“I’ll be cheering for you. If you run into any trouble, give me a call. This time, I will definitely be of help.”", "…In truth, this was something Seol Jihu had been wanting to hear ever since the return trip from the expedition. Having his sincere feelings understood by someone else was truly a happy thing.", "Seol Jihu replied with a grin. Then, he turned around. While crossing the dark streets under the night sky, he hardened his resolve.", "To achieve his plans in Eva no matter what.", "*", "Morning sunlight illuminated the city. Today was the day Carpe Diem would be leaving for Eva.", "The carriage was already waiting outside. After loading what they could onto the carriage, the only thing that remained was their private assets at the temple.", "Seol Jihu had already retrieved his belongings the night before, but Chohong, Hugo, and Phi Sora, who were the type to push things off until the very last moment, rushed to the temple when the carriage arrived.", "‘They should have retrieved it earlier… It’s not like it’s a small amount.’", "Seol Jihu grumbled inwardly and asked the coachman for his understanding. It wasn’t until another 30 minutes went by that the three of them came back. After loading the bags they brought into the carriage, Seol Jihu finished the final inspection.", "“Everyone’s on… No one forgot anything, right? Everything you want is in one of the bags?”", "And just as he was about to hop in the carriage and close the door, he had a sudden thought and glanced back at Carpe Diem’s office.", "It was then.", "“WAAAAAAIT!”", "Following a thunderous roar, a small hand suddenly grabbed the door.", "When Seol Jihu looked outside in a startle, a blonde-haired girl was standing while panting heavily. On her back were several fat bags.", "“Miss Maria?”", "“First— Take these—”", "Maria handed the bags over while grunting. Only after Seol Jihu loaded them onto the carriage did she spit out a rough breath.", "“What is an outsider doing here?”", "Kim Hannah, who was sitting in the carriage watching the scene unfold, asked mockingly.", "Maria snorted before narrowing her eyes and retorting.", "“Outsider? I’m a fully-fledged insider now.”", "“What?”", "Chohong asked with a curious look. This was the first time she was hearing about Maria joining them.", "“What do you mean, ‘what’? I’m a member of Carpe Diem now.”", "“Where’s the proof?”", "Kim Hannah put her hand out, showing off her slender arm.", "Maria snorted and put her hand into her pocket. What came out wasn’t the contract paper, but…", "“Take it, take it.”", "A bag of money.", "Maria slammed the bag on Kim Hannah’s outstretched palm as if to kill her with the force. Kim Hannah peeked inside the bag before letting out a surprised whistle.", "“Color me surprised. You can get a signing bonus if you choose the contract, so what made a moneygrubber like you choose the other option?”", "“Don’t underestimate me. Do you think I would be willing to become a legal slave?”", "“Oh?”", "“Anyway, with this, I’m a founding contributor as well. Don’t forget that.”", "Maria growled before quickly hopping inside the carriage.", "While everyone beside Seol Jihu, Kim Hannah, and Maria tilted their heads, Seol Jihu reached out with a smile.", "“Welcome, Miss Maria. I’ve been waiting for you.”", "Maria took his hand and grumbled quietly.", "“Chet, you were about to leave without me anyway.”", "“You should have come earlier then or at least contacted us about joining.”", "“I didn’t have a choice. I was contemplating my options until late last night. It was the most difficult decision of my life.”", "Maria shook her head. Judging by the dark bags under her eyes, she really must have given it a long thought.", "In any case, Seol Jihu, who was half in doubt, rejoiced. He didn’t know what pushed Maria over the edge, but she had chosen to join Carpe Diem. The team finally had a noble healing Priest in their midst.", "“Wow… a solitary bitch like you knows how to join a team?”", "Chohong chuckled, understanding the situation by the flow of the conversation. Maria put on a self-important air.", "“You should be thankful. Do you think it’s easy to find a healing Priest like me who’s on the cusp of becoming a High Rank…er?”", "She finished her sentence with a stutter, promptly changing to a dumbfounded face. It was because Seo Yuhui was sitting on the opposite side, gently smiling at her.", "“Um, well… it’s not like before… Carpe Diem’s standard has gotten a lot higher… so I made up my mind to join…”", "Stammering, Maria stuck out the bottom of her lips and shrugged.", "Soon, the carriage set off. Once it picked up speed, it passed the downtown area through the boulevard, finally crossing over the gate.", "Haramark grew out of sight in the blink of an eye.", "“You look like you have regrets.”", "Chohong’s voice was heard while Seol Jihu was blankly staring at the city, which, by now, had become a single dot in the distance. Seol Jihu shook his head.", "“It’s not that I have regrets.”", "It was just that he was thinking about a lot of things.", "Meeting Alex and Hugo on his way to Haramark.Sleeping his first night at the inn Alex introduced him to.Meeting Dylan, joining Samuel’s expedition as a porter, and reuniting with Carpe Diem.And, and… all kinds of things had happened.", "So many that he couldn’t count. That wasn’t all.", "‘What is Princess Teresa doing right now?’", "She must be working. What about Miss Agnes and Miss Cinzia? Come to think of it, he had not said goodbye to Village Head Arbor Muto. Ah, was Mister Mikael and Miss Veronica doing well?", "All sorts of thoughts swirled inside Seol Jihu’s head. In a way, the feelings he had while leaving Haramark were similar to the feelings he had in the Neutral Zone.", "A place where he had grown up.A place where he had met many people.That was Haramark.", "But what he was feeling on the way to Eva was slightly different. If he was excited and hopeful on the way to Haramark, then now he felt his lower stomach was churning from tension.", "This was only natural.", "If the Neutral Zone and Haramark were places for him to ‘grow’, then Eva was the place where he had to ‘show the results’.", "Seol Jihu was no longer a newbie Earthling. He was a Level 5 High Ranker, who was acknowledged and respected everywhere.", "Now that he had a different position, his thoughts changed as well.", "“….”", "By the time Haramark completely disappeared from his view, the wave of emotions in his heart finally subsided.", "Only then did Seol Jihu close his eyes. Savoring the emotions left in his heart, he lowered his head.", "Farewell, Haramark!!"]}