{"cid": "469", "title": "Chapter 469. Collision (1)", "content": ["Raging Temperance.", "The Parasite Queen was well aware of the Fourth Army Commander’s shortcomings even back when she first planned the Tigol Fortress Invasion.", "That’s why she ordered him to stay in the Spirit Realm, which the Parasites had mostly finished occupying, to reduce the variables that could affect her mission.", "But that decision turned out to be the second biggest mistake of her life after she decided to rebel against the Martial God.", "The rampaging Raging Temperance became the reason for Twisted Kindness’ defeat. His failure ultimately served as a turning point that led to the resurrection of the World Tree and the Parasites’ defeat in the Tigol Fortress War.", "In short, the Parasites lost the war that they should have won easily.", "And the rest was history.", "Because of one mistake, the future of the Federation and humanity, which should have ended a long time ago, had continued to this day.", "The Parasite Queen’s face hardened as she recalled the past.", "It was obvious why the Brightest Star was mentioning all this. He was attempting to manipulate the situation to his advantage by agitating her.", "However, the Parasite Queen was a queen, and more importantly, a god.", "She wasn’t stupid or inexperienced enough to fall for such blatant provocation.", "[…How insolent!]", "The Parasite Queen only snorted, and then roused her energy as she prepared for battle.", "Seol Jihu opened his eyes slightly and pushed one corner of his mouth upward.", "“This is our second… no, the third encounter. Am I right?”", "Resting his spear on his shoulder, he began to speak.", "“It sure has taken long enough. Too many obstacles stood between us. But now, I can finally enjoy a one-on-one date with you.”", "He mocked her in a roundabout way, asking how she felt now that all four of her Army Commanders were subdued.", "[Interesting. I see your take on romance is surprisingly peculiar. Do you wish for me to hold your hand and take a stroll around the bloody battlefield?]", "The Parasite Queen answered fluently, unaffected by his sarcasm.", "“That actually sounds great. You have no idea how long I’ve been waiting for this date, Your Majesty.”", "[Huhu. You sure seem fond of me. Try me if you want, but I must make it clear that I have no interest in holding your hand, or bearing your child.]", "With a chuckle of contempt, the Parasite Queen raised her lengthy arm.", "This was her battle signal.", "“…Alright.”", "Seol Jihu, too, straightened up his posture. He spun and pointed the Spear of Purity at the Parasite Queen. Then he spoke.", "“I swear on my honor, that ‘Parasite Crybaby’ will be listed in the nickname section of your status window.”", "[Parasite Crybaby?]", "“Yes. The Parasite Crybaby, instead of the Parasite Queen…. Don’t you think it’s cute?”", "After a moment of silence, the Parasite Queen’s eyes narrowed.", "She decided she had been too tolerant for too long.", "[Crazy fool.]", "It was then.", "KWANG!", "Seol Jihu heard the roar of an explosion.", "When he came to his senses, he found himself flying in the air. His body had sensed danger and reacted much faster than his eyes could see.", "He glanced down and saw the Parasite Queen’s palm had struck where he had just stood.", "Rumble!", "He felt a chill run down his spine as the wall came crumbling down a beat later.", "Had it not been for his Intuition, his whole body would have exploded, and he would be dead by now.", "The Parasite Queen lifted her chin.", "Seol Jihu’s eyes saw her body.", "It was common sense that any ‘action’ required some kind of ‘movement’.", "For example, the action of jumping required the bending of the knees to push oneself higher into the air.", "Likewise, in battles, it was necessary as well as common sense to read the opponent’s movements, predict what their next moves would be, and prepare accordingly.", "But the Parasite Queen’s movements shattered common sense.", "She didn’t bend her knees, nor did she spread her bone wings.", "She only looked at him, and Seol Jihu felt as if he were falling into a bottomless pit.", "Again, his intuition raised red flags.", "He kicked the air and pulled himself back. Then, as he raised his head, he felt an invisible blade slash down at the air in front of him, grazing the tip of his nose.", "He didn’t even blink once, and the Parasite Queen was already above him, swinging her arm at his head.", "Seol Jihu’s eyes widened with shock.", "He was moving as fast as he could, but the enemy’s attacks kept pouring toward him.", "This time, even his intuition was too late.", "Toong!", "Seol Jihu managed to activate Ethereal Shift at the very last moment.", "At the same time, he intuitively thrust his spear, emitting Reinforced Sword Qi.", "He knew that the enemy would catch up to him again, so he was intent on seeking a counterattack.", "But Seol Jihu’s prediction proved to be only partly correct.", "The Parasite Queen did indeed appear in the Spear of Purity’s path, but her fist was carrying an unprecedented amount of divinity.", "It shattered Seol Jihu’s Reinforced Sword Qi and flew straight toward his head.", "KWANG!", "Another huge explosion erupted.", "The air upon which the fist landed wavered before the space itself ripped apart.", "Shaking violently, invisible force flew straight through the open space and beyond.", "Even though at the very last minute he turned his head with all his might, the tip of his hair completely disappeared.", "Seol Jihu’s throat moved as he swallowed.", "The time he spent practicing mock battles with Black Seol Jihu in preparation for the Parasite Queen wasn’t helping at all.", "In the mock battles, Seol Jihu first scored big, and then Black Seol Jihu chased him with small tricks.", "But in the real game, he realized that his opponent was superior to him in both fields.", "Suddenly he remembered Black Seol Jihu’s warning.", "[The Parasite Queen? I don’t know….]", "[It’s meaningless to plan a strategy against a god… but if I had to categorize her, I’d say she’s better at ranged attacks than melee.]", "[That isn’t to say that her close combat skills aren’t top-notch.]", "Black Seol Jihu seemed less than confident when asked what kind of strategy would work most effectively against the Parasite Queen, which was rare for him.", "[I’ve only seen the Parasite Queen fight in person a few times. And it was only twice that I actually fought her.]", "[The reason I learned Seamless Sublimity was to use it against the Parasite Queen.]", "[Because, to kill her, I’d have to land her a blow first. And to do that, I thought I should first learn to move as fast as she could.]", "[So I got rid of all the flaws in my movements and achieved a realm of perfection. But… well, it turned out that I underestimated her. The Parasite Queen’s movements are beyond flawless.]", "Black Seol Jihu wasn’t wrong. Now that he’d experienced it, he understood, too. Fast wasn’t enough to describe the Parasite Queen.", "He could see Black Seol Jihu’s hand moving during consecutive attacks, but with the Parasite Queen, even that was impossible. She seemed to defy all norms.", "[That’s why I told you not to copy me.]", "[My Seamless Sublimity failed. But your Trinity Harmony… it might be able to invoke a new possibility.]", "[Thousand Stream Convergence. Your movement, which ties everything into one, and my movement, which has reached the height of optimization…. Maybe there’s some similarity between the two. Think about it.]", "It was then that Seol Jihu finally understood Thousand Stream Convergence.", "All rivers flow to the sea.", "Differences in motion could be reduced by amplifying other abilities and integrating them all.", "Seol Jihu’s eyes gleamed.", "As he stomped his foot in the air, Thousand Thunder filled up to the top of his head.", "Pang, pang, pang! He activated the Festina Earring three times.", "Everything happened almost simultaneously but in succession, like a thread passing through the beads of a necklace.", "The next moment, the sound of air ripping rang out, and Seol Jihu disappeared.", "And so did the Parasite Queen.", "Toong, toong, toong, toong!", "Kwang, kwang, kwang, kwang!", "Golden thunder flashed and crashed everywhere, and space fluctuated like a tidal wave.", "In less than one second, already a dozen explosions had occurred.", "The sheer magnificence of the spectacle stole the attention of the bystanders and caused their jaws to drop.", "But of course, Seol Jihu was in no condition to enjoy such luxury.", "[Is running all you can do?]", "The Parasite Queen’s voice echoed from all around.", "Seol Jihu didn’t answer. He couldn’t even open his mouth.", "He felt something cold touch his stomach.", "Seol Jihu screamed inside his head as he twisted his body as fast as he could.", "‘4 to 6 my ass!’", "It wasn’t even 3 to 7. It was 2 to 8, and even that was being too proud. The 20 percent was only backed by the fact that he had yet to use his trump card.", "But it was too early to reveal it. The technique was not something he could use repeatedly, and the moment he revealed it, the Parasite Queen was sure to raise her guard.", "‘Even this feels too early, but….’", "As much as he knew he had to consider the physical burden, now was not the time to be a miser. Trinity Harmony alone was not enough.", "Amidst the fierce battle, Seol Jihu hurriedly raised his mana output.", "Thousand Stream Convergence.", "[!]", "The moment Seol Jihu’s movement changed was when the Parasite Queen’s face finally revealed a hint of alarm.", "But speed wasn’t the only thing that was different about Seol Jihu.", "[Ah…!]", "The space around Seol Jihu and the Parasite Queen began to crumble. The two streams were crashing against each other, distorting the space around them in the process.", "Sensing that her flow had been interrupted, the Parasite Queen flinched for the first time since the start of the battle.", "Finally, Seol Jihu found a chance to counterattack.", "Level 9 Divine Spear, Class Ability — Mana Spear: Sword Qi Flurry.", "Reinforced sword qi fired from Seol Jihu’s entire body.", "Its intensity caused the Parasite Queen to pull herself back swiftly.", "It was then.", "Seol Jihu saw the Parasite Queen’s movement for the first time today.", "Wait, but could that really be called a movement?", "She could’ve stretched her arm just to block the sword qi, or her movement could have absolutely no meaning at all.", "‘No.’", "But the moment he saw the sword qi that he had fired waver like a heat haze, he became certain that the Parasite Queen had done something.", "It was as if something invisible had penetrated his sword qi.", "However, Seol Jihu, who had just barely found a chance to attack, did not want to waste this opportunity.", "Originally, he had planned to activate the Blessing of the World Tree to negate the enemy’s attack and secure a more definite chance to attack.", "However, for some reason….", "‘Something’s not right.’", "His body was hesitating.", "This was the first time he had been so alarmed ever since he acquired Intuition.", "He wouldn’t be able to block it. He wouldn’t be able to evade it.", "He would die, end of story.", "When his thoughts reached that far, Seol Jihu found himself ditching his original plan and thrusting the Spear of Purity forward.", "Level 5 Lance of Nemesis, Class Ability — Punishing Vengeance Spear.", "Seol Jihu did not know why he had activated this particular ability.", "Its effect had changed slightly since its rise in rank, but technically, he hadn’t suffered any damage yet.", "He thought the only way to deal with an attack that causes 100 percent damage would be to counter it with an ability that reflects the said attack.", "Crack!", "Seol Jihu was right.", "No, he was almost right.", "“Keuk!”", "A grunt escaped Seol Jihu’s mouth.", "He realized that the sound just now had come from his own body.", "There was no blood, no visible signs of any injury, but a gut-wrenching pain dominated his entire body, distorting not only his flesh but also his soul itself.", "The pain quickly subsided after Seol Jihu forcefully raised his energy.", "Thank goodness he activated the Punishing Vengeance Spear in time. If it wasn’t for that…. He cringed just imagining what could have happened.", "[Mm…!]", "A small groan also escaped from the Parasite Queen.", "The same thing that happened to Seol Jihu’s body also happened to her body before quickly subsiding.", "The battle paused momentarily, and the pair each landed above the crumbling wall.", "It hadn’t been long since the fight started, but the walls had already been more or less destroyed.", "Seol Jihu winced as he took a deep breath. There was a sharp pain in his side.", "It seemed that he wasn’t completely successful in evading the attack that caused him to use Ethereal Shift earlier, and it scraped past his side.", "[How….]", "The Parasite Queen paused in the middle of her sentence and lowered her gaze.", "Chwaak!", "Suddenly a long scar appeared across her back, causing blood to spurt from it.", "The moment the Parasite Queen briefly withdrew herself, Seol Jihu had attacked her projected course with Mind Spear.", "It was surprising enough that he saw through her curse, but in the meantime, he had also managed to defend and attack at the same time.", "The scar quickly healed, but the Parasite Queen looked a little shocked.", "Still, Seol Jihu did not let his guard down.", "‘This is….’", "Fighting her was nothing like fighting the Army Commanders, which consisted of simply bombarding the opponent with mana.", "The notion of fighting was fundamentally different.", "The cause and effect seemed almost unclear.", "Thinking back now, he had never seen the Parasite Queen fight with all her might.", "‘…Different.’", "Finally, Seol Jihu concluded that the Parasite Queen standing in front of him was completely different from the Parasite Queen that he fought at Tigol Fortress.", "Naturally, he grew warier.", "So did the Parasite Queen.", "Despite the many limitations laid down to weaken her, she was once the ruler of an entire galaxy.", "In terms of rank, she was somewhere between Heaven-rank 7 and Heaven-rank 8.", "Considering that the Creation Gods were Heaven-rank 9, she was definitely not a lowly god.", "[The curse just now was enough to exterminate an ancient god….]", "She hadn’t used all her strength, of course, but she did use her divinity for the first time in a long time with a serious intention to kill Seol Jihu.", "But her opponent was still standing.", "[…Those foolish Seven Sins. They’ve chosen an existence that even they cannot handle, just to exterminate me.]", "The Parasite Queen muttered as if lamenting. It was then that her mana suddenly soared.", "[I can no longer deny that I am also curious how far you can go.]", "Seol Jihu blinked and clicked his tongue.", "[To pay my respects, I shall consider you equal in rank as myself from now on.]", "Because he sensed a renewed determination from the Parasite Queen’s voice.", "“No, thank you, you can go easy on me. I’m only a human. You are a god.”", "[What are you talking about?]", "The Parasite Queen smirked at Seol Jihu’s calm protest.", "For him to speak like that must mean he still had both the strength to fight back and a card up his sleeve.", "[Don’t be weak.]", "Her heart began to fill with anticipation.", "She felt as if she had gone back in time to when she was walking on the path of a conqueror.", "[Don’t tell me your confidence from before is gone?]", "Chwaak!", "Fourteen pairs of bone wings spread open on the Parasite Queen’s back."]}