{"cid": "112", "title": "Chapter 112. The Banquet Has Already Started", "content": ["『The history of the Banquet dates back to the time when a mysterious passenger ship was found at the Mariposa Sea near the city of Nur. The first eyewitness, José Sánchez (Spain), described the moment as follows:", "‘It was early dawn. I was looking out from the Port of Nur at the serene sea when I suddenly felt a huge shadow creep up. The night fog blurred my vision, so I couldn’t make out its size, but I could tell that its size far surpassed a normal passenger ship. It swayed in the sea for about two minutes before vanishing into thin air.’", "The mysterious ship attracted an unusual level of attention, and Earthlings flocked to the Port of Nur to solve the mystery. However, the ship didn’t appear again, and the Earthlings disbanded, thinking it was just a simple incident.", "Just like that, the incident seemed to have come to a conclusion. But eight days later… an Earthling appeared, claiming to have seen a mysterious ship at the Libera Lake near the city of Eva.", "Ze Mei’s (China) account corroborated José Sánchez’s story, but it didn’t attract much attention due to the following two reasons:", "1) Nur and Eva were cities on opposite ends of the map, and it was impossible to cross the distance in eight days even by sea.", "2) More importantly, Mariposa and Libera weren’t connected bodies of water.", "However, six days later, an incident arose that took public opinion by a storm. A third account of the same incident came out of Haramark’s Ramman River….』", "Seol Jihu took his eyes off the paper and took a short break. His eyes were starting to get tired, but he also needed some time to organize his thoughts.", "The records showed that the appearances of mysterious ghost ships signaled the start of the Banquet. After appearing and vanishing in the waters of the seven kingdoms for two months, ‘entrances’ would appear all over Paradise.", "Then where did these entrances lead to? And why were Earthlings so enthusiastic about the Banquet?", "Unquenchable curiosity compelled Seol Jihu to turn his gaze to the records.", "『…The entrances all share a few characteristics-", "1) They come in all colors and forms.", "2) Once ten people enter, they lose the ability to admit more people.", "3) Once created, they reappear in the same spot every two years.", "4) People who enter are moved to an unknown place that is different every time.』", "‘An unknown place?’", "This particular phrase caught Seol Jihu’s attention, but remembering the transfer magic circles used in the rescue mission, he guessed that the entrances had a similar mechanism.", "‘So that’s why the Banquet is unpredictable.’", "The fourth characteristic gave a clue as to why the Banquet was unpredictable. The overall structure might be the same every time, but since the place and the detailed contents of the Banquet changed every time, it made sense why there was no clear way to prepare for the Banquet.", "The Banquet was separated into three stages. Although finding the entrances were once considered a separate stage, these days, it didn’t have much meaning because several organizations noticed the third rule during the second Banquet and had secured over 80 percent of the entrances.", "In any case, after moving to the unknown place, the participants had to go through Stage 1 and Stage 2. The goal for these two stages was to safely arrive at a designated location.", "In Stage 2, participants could receive an item called the ‘Dissonant Wish’, and the ultimate goal of this stage was to board a ship.", "To summarize, Stage 1 and Stage 2 were battles of wits with cooperation as the overarching theme.", "If the participants worked together, although it would take them more time, they would be able to obtain equal rewards. However, it was hard to expect people to cooperate in a situation where selfishness was encouraged.", "This was surmised to be the reason for the ‘catastrophe’ that had erupted during the fourth Banquet.", "As for Stage 3, it was unfortunately wrapped in a veil of mystery. Unlike Stage 1 and Stage 2, the requirement for entering Stage 3 changed every time, and almost nothing was known about the goal or the content of this stage.", "That was because the survivors of Stage 3 refused to talk about it. To be precise, they were prohibited from talking about it due to an ‘oath’.", "However, one survivor explained, “That place wasn’t a ghost ship, but a treasure ship.” From this, people guessed that Stage 3 was inside the mysterious ship that appeared all over Paradise and that the ‘Harmonious Wish’ could be found inside.", "‘Dissonant Wish and Harmonious Wish….’", "Seol Jihu mulled over the two phrases. The participants of the Banquet had two opportunities to receive rewards. The interesting thing was that these rewards granted the participants’ wishes.", "Of course, absurd wishes like ‘Give me the entire world’ didn’t work, but even within a set limit, being able to obtain whatever one desired was incredibly alluring.", "‘I see why everyone is so heated up for the Banquet.’", "With his interest piqued, Seol Jihu read through the remaining records. As his eyes went down, they became clouded with tension.", "『—First BanquetStage 3 Survivors: 8 / Escapees: 2 / Deaths: 0Special Note: One of the survivors, Phil Kanoo (Cameroon), announces receiving ‘+4 Rampaging Fierce Longsword’ as Stage 3 reward.", "—Second BanquetStage 3 Survivors: 5 / Escapees: 4 / Deaths: 1Special Note: One of the survivors, Damv Nyam (Jamaica), advances to Level 5 immediately after the Banquet.", "—Third BanquetStage 3 Survivors: 1 / Escapees: 1 / Deaths: 8Special Note: The sole survivor, Baek Haeju (Korea), kills everyone other than the sole escapee. She declared, “Stage 3 wasn’t a cooperative mission, but a battle royale.”", "—Fourth BanquetStage 3 Survivors: 0 / Escapees: 0 / Deaths: 10Special Note: During Stage 2, a catastrophe occurs, in which participants kill each other unconditionally. Nothing about Stage 3 has been confirmed, but seeing that no one made it back….』", "‘…It is estimated that there are no survivors.’", "Seol Jihu fell in thought.", "[That catastrophic incident only occurred once…. And besides, this one is a special Banquet.]", "[What about the Haramark Royal Family? I heard that they planned to ban Earthlings from participating in the Banquet after that incident.]", "[It’s been canceled. The recent high death count among High Rankers seems to have affected their decision.]", "[“If you look at the distribution of participants, a vast majority of them are Level 4s. Almost everyone who is remotely decent will flock to this event.]", "Remembering the words he didn’t understand back then, a corner of his heart turned cold. He didn’t expect the Banquet to be easy, but the huge drop in the survival rate after the third Banquet was something he couldn’t gloss over.", "‘But why?’", "After thinking about the matter for a long time, Seol Jihu’s curiosity suddenly approached the root of the problem.", "‘This Banquet….’", "Who, what, when, where, why, how?", "Without a doubt, every Earthling who knew about the Banquet would have speculated about the same thing. But no one had a clear answer, with only theories and conjectures being known.", "Even Seol Jihu, who had solved one of Haramark’s great mysteries, could not think of anything brilliant.", "‘Whatever.’", "Seol Jihu organized the records and lied down on his bed.", "*", "Two days before the departure, Kazuki held a simple briefing. A detailed strategy couldn’t be formed until the start of the Banquet, but the team wanted to at least make some preparations. They also needed to learn each other’s faces.", "As such, a total of eight people gathered together. Among them, seven would be participating in the Banquet.", "On Carpe Diem’s side were Seol Jihu, Hugo, Chohong, and the Priest Seol Jihu invited, Maria. On Umi Tsubame’s side were Ayase Kazuki and…", "“O-su!”", "A 170-centimeter-tall man whose hair was dyed red and puffed up like a lion’s mane.", "“My name is Sakamoto Jun!”", "The man introduced himself energetically before grabbing Seol Jihu’s hands and vigorously shaking them up and down.", "Seol Jihu was taken aback. Translucent sunglasses, a casual Hawaiian shirt, wrinkly shorts, and sandals…. How could he put it?…. He felt like the man’s attitude and clothes gave off the aura of a free spirit.", "“Hello, hello! You’re one of the three rising stars who’ve been the talk of Paradise, right? The First Star Warrior who gave up on becoming a Magician and even brushed aside Sinyoung!”", "The man shoved his face up close before Seol Jihu could say anything. Exchanging glances at a nose-close distance, confusion set in Seol Jihu’s face. Behind Sakatamo Jun’s black sunglasses, his eyes were gleaming sharply like a wild beast.", "“Hyung-nim, let me tell you something just in case.”", "“Huh?”", "“I love bulgogi. I like kimchi too. I know most of Korea’s famous athletes and I’m a big fan of them.”", "Jun quickly recited with a serious face. When Seol Jihu laughed and replied, ‘Me too’, his eyes widened and he smiled back cheerfully.", "“Iya~! Looks like I’ll get along with Hyung-nim! Great, great. Ah, want one?”", "He put his arm over Seol Jihu’s shoulders and offered him a cigarette. Hugo, who was watching the exchange, went, “Me too, me too!”", "“It’s been a while, Hugo Hyung-nim. I heard you recently got yourself into a rough spot.”", "“It’s been ages since then. Hey, you got anything other than mild?”", "“Just be happy with it.", "“Mmm….”", "Jun and Hugo seemed to know each other well. Frankly, given Jun’s amiable personality, it wasn’t surprising that he would get along with Hugo.", "Jun puffed out smoke before going “Oh, shoot!” and hitting his forehead. He then offered Chohong his pack of cigarettes.", "“I almost forgot about my Chung-dan Cho-dan Hong-dan noonim! Here, want one?”", "“Shut up.”", "“Oh, and it’s been a while, Maria-chan~!”", "“Shut up.”", "“Chet. Aren’t you too cold-hearted? Is it because you’re in front of a celebrity? You’re not mad because I tried to be friendly, are you?” Jun mumbled like a machine gun.", "Chohong must have found him annoying because she massaged her neck and cut in.", "“Whatever. Anyways, who’s that?”", "Chohong’s chin pointed at the grey-robed person sitting quietly in the corner. The robe was large enough to have room left over after covering their entire body. Because this mysterious person also had the hood pushed down, his or her face wasn’t visible. The entire outfit was screaming, ‘I’m a suspicious person!’", "“I dunno.” Jun replied.", "“What? Didn’t you guys invite him… or her?”", "“W-We did, but….”", "Jun shrugged his shoulders before turning his gaze. Kazuki, who was standing with his eyes closed and his back against the wall, finally opened his eyes.", "“There’s a private circumstance.”", "“Kazuki, I didn’t know you liked telling jokes.” Chohong growled with a face that seemed to say, ‘Cut the crap’.", "“She is an excellent Priest. I guarantee it.”", "“So it’s a she. Anyways, excellent Priest or not, you need to introduce her to us since she’s going to be our comrade. At least get her to show her face.”", "Seeing the Priest not say a word, Chohong laughed dumbfoundedly. “Oi, quit cosplaying as some dark religious fanatic and take off that hood.”", "Kazuki’s eyes narrowed. “Chung Chohong, watch your mouth.”", "“What?”", "“Stop there.”", "When Chohong shot up from her seat, Jang Maldong restrained her. He wouldn’t participate in the Banquet, but he was here on the qualification of Carpe Diem’s advisor.", "“Chohong, sit.”", "“What…. Fucking hell. You’re doing this too, Old Man?”", "“I told you to sit. I didn’t tell you to not object.”", "Hearing this, Chohong plopped down on the couch. Jang Maldong let out a short, dry cough before continuing calmly.", "“Kazuki, I can close my eyes if this team is going on an expedition, but it’s a different story if it’s the Banquet.”", "Kazuki remained in thought. Everyone, including Kazuki, knew Chohong was justified in asking the Priest to introduce herself. After thinking about the matter for a long time, Kazuki let out a muffled sigh.", "“She was introduced to us by Lady Seo Yuhui.”", "“What?”", "“I guarantee this Priest’s identity with my own name. Please understand! There is a complicated circumstance preventing us from revealing her identity.”", "With Kazuki putting it this way, even Chohong found it hard to say anything.", "“…Fine, it’s okay if she doesn’t reveal her face. But let us hear her voice. She should be able to tell us her level at the very least, right?”", "The Priest seemed to fall in thought. Soon, she bowed politely before carefully raising her gloved hand and holding up five fingers.", "Chohong stared at this and scowled. “Fucking hell. Is she for real? Hey, I’m this too.”", "She also held up five fingers, provoking the Priest. Kazuki pressed his temples and sent Seol Jihu a glance looking for help. Seol Jihu got up, unable to ignore his plea.", "“Chongchong.”", "“Ah, what…. Wait, what did you call me?”", "When Chohong rebutted, Seol Jihu continued nonchalantly.", "“Kazuki went through a lot of trouble to invite her.”", "“I know that. So what did you just call me?”", "“Let’s think positively. It’s good to have two Priests.”", "“You think I don’t know that? But how am I supposed to entrust my back to her when I don’t even know her name?”", "“I understand, so calm down.”", "“This Priest is acting all high and mighty! She won’t even let us hear her voice! Argh, whatever, fuck it.”", "Seol Jihu’s secret technique - changing the subject repeatedly.", "Chohong had a habit of giving up when a conversation got complicated. This was what Seol Jihu was aiming for.", "As if the entire conversation was a hassle, she harrumphed and buried herself in the couch again. That said, she made it clear that she wouldn’t get along with the Priest.", "A few cracks appeared in the team atmosphere just from the first meeting, but Seol Jihu still greeted the Priest with a smile.", "“Nice to meet you. I’m Seol.”", "“?”", "Tilt.", "“Seol. That’s my name.”", "“?”", "Tilt. She tilted her head again.", "‘Can she not understand me?’", "Seol Jihu tilted his head back.", "“Since it looks like we’re done with introductions—” The awful atmosphere eased slightly when Kazuki opened his mouth.", "“Let us start.”", "Kazuki looked back at the huge map hanging on the wall. He pointed at a specific location before continuing, “I’ll keep it simple. This is the entrance Hao Win handed over.”", "“Question!” At that moment, Jun shouted with his hand up. “Has it been confirmed?”", "“What do you mean?”", "“I heard that the Triads acquired two entrances, with one being used by the organization and the other being sold to another organization.”", "He was asking this question since it was neither Carpe Diem nor Umi Tsubame that bought the other entrance.", "“That is only what’s known to the public.”", "Kazuki must have expected this question as he responded without a thought.", "“There are twenty-six entrances known to the public with twenty-one of them occupied by various forces.”", "“You mean the Triads have entrances kept hidden from the public?”", "“It’s not just the Triads. It’s an open secret. Otherwise, there couldn’t have been over 300 participants in the last Banquet.”", "Jun immediately went “Ah.” Since exactly ten people could enter each entrance, all it took was a simple calculation to know there were more entrances than what were publicly known.", "“The Triads have severe internal conflicts. Naturally, the person who found the new entrance has been keeping it a secret.”", "“Aha, so that’s how it is.”", "Jun sat down, seemingly convinced. Kazuki continued the briefing. “We set off tomorrow morning. We’ll be traveling by carriage for two days using this road.”", "The pen in his hand drew a smooth, curved line.", "“We’ll arrive at the Salt Desert’s second oasis. It’s not a safe place, but we shouldn’t have any trouble with our power…. What is it?” Seeing Seol Jihu raising his hand, Kazuki asked.", "“What about the Triads?”", "“If you’re asking when they’ll be joining us, it will be during Stage 1 or Stage 2 at the latest.”", "“Stage 2….”", "“It won’t be hard. We’ll fight together and support each other if needed. I heard there will be another team helping us as well.”", "“Well, shit, it’s a 4-way co-op mission?”", "Chohong grumbled as if she was still angry about the previous incident. However, that only lasted a moment as she soon fell silent. Knowing how the Banquet worked, she knew they had nothing to lose by having more teams on their side.", "“Finally—” Kazuki slowly continued, “We’ll make a clear identification of friend or foe.”", "*", "Not a single cloud was in the quiet sky, but Carpe Diem’s office was buzzing with noise from early in the morning. Because Kazuki had set the departure time considerably early, they had to hurry before it was too late.", "After putting on his new equipment, Seol Jihu wore the belt carrying javelins and the medicine bottles he got from the hideout. Once he finished readying himself by putting on the robe given by the Federation, he went outside.", "Seol Jihu looked splendid in his new suit of armor, so much so that Hugo stared at him with a genuine look of envy. Unlike Seol Jihu, Hugo didn’t have someone to gift him with a new set of armor. He had to scrape up what little money he had saved up to buy new armor and weapon. Even then, he had to make compromises.", "Because of this, he was determined to use this Banquet as an opportunity to make a fortune.", "Just before their departure…", "“Be careful.”", "“Yes, Sir.”", "“With your current abilities, you won’t die easily, but that’s it. Don’t forget that you always have to stay with your team.”", "“I understand.”", "Seol Jihu took Jang Maldong’s advice to heart. With that, he headed to the rendezvous location with Chohong and Hugo.", "*", "When Seol Jihu, Chohong, and Hugo arrived at the rendezvous location, a bizarre scene was spread out before them.", "Kazuki had borrowed two carriages, yet there were dozens of carriages lined up against the city gate. That wasn’t all.", "‘…What?’", "Even at a glance, he could see hundreds of people waiting nearby. They seemed to be Earthlings judging by their outfits, but the way they were looking at them was… not so friendly.", "“Seol, avoid eye-contact and just look forward,” Chohong whispered into his ears. Seol Jihu also agreed that it was the best thing to do. Just as he sped up his pace….", "“Here! Here!", "He found Sakamoto Jun, waving his hand from a distance. By the looks of it, Umi Tsubame had already arrived.", "“Now, sorry for rushing you when you just arrived, but we gotta hurry. Hyung-nim and Noonim, ride with me. Maria-chan and Hugo Hyung-nim, go on the other carriage. We’re splitting up the Archers and Priests. Makes sense, right?”", "Jun gave a rapid-fire explanation before pushing Seol Jihu and Chohong to the carriage. There was already someone sitting inside— the Priest Kazuki invited. She was wearing the same style of clothes as when they first met.", "“Hello.”", "Seol Jihu sat on the other side of the carriage and greeted her. The Priest cusped her hands together and returned a polite bow.", "‘Looks like she’s a courteous person.’", "“Yes! We’ve got everyone now! Go on ahead!” Jun shouted into a communication crystal before shutting the carriage door.", "“Mister Coachman! Let’s go!”", "Clunk! The carriage shook. Soon, the window frames shook as the outside scenery began to travel backward. They closely followed behind Maria, Kazuki, and Hugo’s carriage.", "“By the way, you look super cool, Hyung-nim.”", "Seol Jihu was thinking, ‘Should I sleep?’ when he heard the sudden compliment and opened his half-closed eyes. He saw Jun checking him out from head to toe with a look of surprise. One thing that he couldn’t understand was that the mysterious Priest sitting next to him was also nodding her head in agreement.", "“Thank you for the com—”", "Dudududu, dudududu", "Before he could finish saying the word ‘compliment’, he was startled by a sudden noise that sounded like a cavalry was galloping forward. When he peeked his head out of the window, just as he expected, the carriages he saw at the city gate were following them.", "“Whew~ Look at all those flies~” Jun muttered leisurely.", "“What… are they doing?”", "“I wonder. Want me to get off and ask them?”", "“….”", "“I’m kidding. Just think about it. There are five entrances unoccupied by organizations. That’s fifty people.”", "“Right.”", "“Now the problem is that there are more than fifty individuals or team members who want to enter the Banquet.”", "Seol Jihu finally understood what Jun meant.", "“They were probably wracking their heads trying to think of a method to enter the Banquet, and lo and behold, a new entrance has been found. What would you do if you were in their shoes? Especially if you knew only seven people were entering it. That’s three empty spots!”", "“How can they be sure that we’re going to an entrance?”", "“Kazuki Hyung-nim would have been disappointed if he heard that. And look, those people aren’t idiots. They’re taking a chance because at the end of the day, they have the highest chance of entering the Banquet this way.”", "Indeed, given Kazuki’s fame, it made sense for them to assume he was participating in the Banquet. Where else would he lead his team this early in the morning when the Banquet was just at the doorstep?", "“Hold on.”", "Seol Jihu was nodding his head when he suddenly arrived at a frightening conclusion.", "“Could they possibly….”", "“Hyung-nim, I know what you’re thinking. Don’t worry.”", "Jun smiled and shook his head.", "“As I said, those people aren’t idiots. Although there are only seven of us, they know they stand no chance against us.”", "“If you say so….”", "“We have three High Rankers, one in each common class, so our team’s balance is perfect as well.”", "Now that he put it that way, Seol Jihu agreed. The team composition of two Archers, two Priests, and three Warriors was indeed well balanced.", "“Then that many people will compete over just three spots?”", "“Well, I doubt they’ll decide with rock-paper-scissors.”", "Jun giggled as if he found his own joke funny. But seeing that Seol Jihu didn’t laugh, he let out a dry cough and once again put on a serious face.", "“Now that I think about it, this is Hyung-nim’s first Banquet, right?”", "“Yes.”", "“Then I guess the shock might be too great. Brace yourself.”", "“Jun, cut the nonsense.”", "Chohong was listening quietly but chose to cut in here.", "“Nonsense? Noonim, this is valuable advice.”", "“Cut the bullshit.”", "“You’re so mean.”", "Jun dropped his head dejectedly but quickly regained his energy.", "“It’s nothing special, but… Hyung-nim, you’ve been doing well in a good team ever since you entered Paradise.”", "He wasn’t wrong. Thanks to his Nine Eyes, Seol Jihu was able to choose a good team and distinguish good people. If he didn’t have this Innate Ability, who knew where he might be right now?", "“Don’t think all teams are like— Ah, don’t misunderstand. I’m not trying to belittle Hyung-nim’s achievements. But I’m sure they wouldn’t have been possible if you didn’t have a certain level of trust and faith in your team members.”", "“Ri…ght.”", "When Seol Jihu easily acknowledged it, Jun raised both of his hands. That was because Chohong’s glaring eyes were getting stronger by the second.", "“Geez, you don’t have to be so protective of him. Anyways, as a senpai who participated in the last Banquet, let me give you a piece of advice….” Jun took a brief pause before saying with a grin, “Don’t expect too much.”", "“Don’t expect too much?” Seol Jihu immediately asked back.", "“Yep. The more you expect, the more disappointed you will be. On the contrary, if you don’t expect anything, you can’t be disappointed.”", "What did he mean by that?", "“You’ll find out soon enough, but to explain it simply… the moment you go through the entrance, you’ll get to meet all sorts of people.”", "His voice became quieter.", "“All I’m saying is that you shouldn’t be too disappointed. With humans.”", "With a grin, Jun stopped talking.", "‘Don’t be disappointed… with humans?’", "It was ambiguous, though he felt like he could understand the gist. With a short sigh, Seol Jihu looked out of the window once again. There were still dozens of carriages following them from behind.", "If there was one thing that caught his attention, it would be that the carriages each had huge distances between them.", "“….”", "Looking at them, he couldn’t help but think, ‘Maybe, for them, the Banquet has already started.’"]}