{"cid": "109", "title": "Chapter 109. At the End of the Hellish Training", "content": ["Time flowed like a stream. On the third week, an incident popped up causing Ayase Kazuki to leave the Huge Stone Rocky Mountain. He seemed to want to stay until the last day, but after he was contacted by his comrades, he showed a rare expression of anger. It seemed something unexpected occurred while preparing for the Banquet. In the end, Kazuki asked Jang Maldong to be excused and left for Haramark on the same day.", "Seol Jihu didn’t hear the details, but since Kazuki personally had to go back to deal with it, he guessed it wasn’t a small problem.", "Once Kazuki left, Evil… no, Agnes also lost her reason to stay as an observer. She didn’t go back right away; instead, she helped Seol Jihu train for another week before returning to Haramark.", "Not knowing the inside story, Seol Jihu carefully guessed that Agnes was running away from Jang Maldong’s training.", "Although the group of five was now reduced to three, Seol Jihu didn’t mind it too much. In fact, he was a bit happy, as this meant that he was spending more time under Jang Maldong’s watch. Now that he had experienced Jang Maldong’s training, he could easily understand why he was called Paradise’s best trainer. He had more than a few good points that made him worthy of his reputation.", "First, he prioritized the process more than the result. It wasn’t that he didn’t care about the result, just that he encouraged his students to make gains from the process.", "He made his students understand the goal of the training and realize what they were lacking. In a way, it was as if he was fattening them up little by little.", "Seol Jihu, who only knew how to train his physical body, fell in love with the new sixth sense training method. He felt like a new horizon was opening up for him every day.", "Jang Maldong didn’t hate it either. Unlike certain ungrateful idiots, this new disciple of his was excited to train and was constantly asking for more. How could he possibly not be pleased?", "As a result, Seol Jihu felt the emotion known as ‘joy’ for the first time in ages. Even though he was both physically and mentally exhausted, he was happy to train without caring about anything else.", "To top it off, he had someone guiding him and he could feel himself getting stronger by the day.", "He didn’t even realize the time passing as he enjoyed spending each and every day on Huge Stone Rocky Mountain.", "Time flew, and the night of the fifth and final week came by.", "*", "The past 35 days were long to Hugo but short to Seol Jihu. Jang Maldong went all out during training, but he didn’t strangle his students for time in their everyday life. He notified Chohong that they would be returning the next day and held a small party.", "He definitely wasn’t the type to take lead and hold such a thing, but he couldn’t help himself because Seol Jihu was so endearing.", "As a result, he personally went out and captured a wild boar that incidentally looked just like Hugo. He prepared the boar, built a fire, and cooked it all by himself. Adding together a whiskey cooled in the mountain’s flowing stream water, he truly felt like he was in paradise.", "“Keu!”", "Hugo took a bite out of the scrumptious meat along with a sip of whiskey. After emptying the glass clean, he became overly chatty, saying he’d have no regrets if he died right now.", "Jang Maldong’s cooking skills were unexpectedly good, so Seol Jihu couldn’t get his act together as he devoured the meat. The meat practically melted in his mouth, giving off a sweet, savory flavor.", "In truth, with only a single dish, the meal could hardly be called a party. However, Seol Jihu enjoyed this moment and made it an unforgettable memory.", "As the night advanced, the fat boar was left with only its bones and the blazing campfire with only flickering embers.", "Seol Jihu couldn’t defeat the after-meal languor and sprawled down on the ground. His body was devoid of tension since he ate and drank to his heart’s content. But rather than staying on the ground and looking at the stars, he jumped up and stretched.", "Wondering why he was fussing around at this hour, Jang Maldong, who was cleaning up the mess, asked, “What are you doing?”", "“Warming up…. Ah, let me help you.”", "Seol Jihu stopped twisting his body side to side and ran to help with the clean-up. From the way he was hurrying so much, Jang Maldong could tell he was dying to start training. On the other hand, he let out a sigh as he glanced at Hugo, who was lying on the ground belly up.", "“Pathetic, don’t you think?”", "“Me? N-No, not at all.”", "“What? Why?”", "“Well… I’ve never defeated Hugo before.”", "Jang Maldong meant to say ‘Hugo was a good-for-nothing who only knew how to eat and drink’, but Seol Jihu seemed to have taken it as Hugo slacking off on training.", "Jang Maldong laughed inwardly. Unless the young man’s head was filled with nothing but training, he wouldn’t have understood it that way.", "“He’s always ahead of me when we’re running, and he can dodge the logs a lot longer than me….” Seol Jihu continued to mutter in his misunderstanding, but Jang Maldong didn’t point out his error.", "Humans were rather simple creatures at times. The moment they were satisfied, they would start to fall behind. If Seol Jihu ever went, ‘I’ve trained so much. I should be more than strong now’, then Jang Maldong planned to teach him a lesson.", "Of course, it was true that Seol Jihu put in a lot of effort. Even by basic calculations, he had done 119 days’ worth of training.", "But from Jang Maldong’s perspective, Seol Jihu had only filled a small portion of what he was lacking. If he were satisfied when he only just built his foundation, his growth would slow down.", "However, Seol Jihu wasn’t satisfied. He didn’t let his guard down or look down on others just because he did some training. Jang Maldong wasn’t sure if that was just how the young man was, but as far as he could see, it was one of his few strong points.", "“Hugo has been doing these for several years now, so it should be second nature to him. To be honest, he didn’t need to come here in the first place.”", "“Mhm.”", "Hugo nodded his head arrogantly while still lying down on the ground. Seeing this, Jang Maldong immediately raised his cane, saying “You idiot….”", "Hugo screamed and ran off.", "“Damned fool.” Jang Maldong shook his head.", "“Let’s go take a walk. It’s not good for your stomach to run right after a meal.”", "Seol Jihu was about to ask, ‘If that’s the case, why did you push me so hard the first week?’ But in the end, he quietly followed him. Thinking about it now, it seemed that he wanted him to face his limits. Of course, the real reason was that he still hadn’t put his cane down.", "Soon, when the duo arrived at a small open area, Jang Maldong opened his mouth. “I heard from Miss Agnes that you were worried about becoming a High Ranker.”", "“Pardon?”", "“You weren’t? Then did Miss Agnes lie?”", "“…No.”", "“Stinking brat, you’re worried about the High Rank when you’re not even Level 4 yet?”", "Jang Maldong snickered. Seol Jihu didn’t know what to say, so he just scratched his head. He thought Agnes was pretty tight-mouthed, so he took this as her way of getting back at him for the butt incident.", "“Well, considering the speed of your growth…. Right, let me ask you while we’re at it. What do you think the High Rank is?”", "Seol Jihu could only blink his eyes at the unexpected question.", "“You don’t have to think so hard about it. High Rank. It’s exactly what it sounds like — a high position. Now, what do you think ‘position’ refers to?”", "“Um… I’m not sure. Now that you mention it, I guess it’s kind of vague. I doubt you’re asking me for the dictionary definition.”", "“Of course not. I think it refers to a realm.”", "When Seol Jihu stayed silent, Jang Maldong changed his question.", "“How many High Rankers do you think there are in Paradise?”", "“I have no idea.”", "Seol Jihu looked as if Jang Maldong was asking him a stupid question. After all, how would he know anything about it?", "“Hm, let’s see…. If you consider this mountain to be the population of Earth…” Jang Maldong raised his cane. “Then this surrounding area would be people who are given the opportunity to enter Paradise.”", "He took a look around their immediate vicinity and said, “The ones who pass the Tutorial and the Neutral Zone, and actually enter Paradise would be here.” He poked the small open space where he and Seol Jihu were standing.", "“And the people who survive for a few years to become Level 4s would be… in here.” He dragged his cane on the dirt and drew a large circle. It was about one fourth the size of the open space.", "“And the people who become High Rankers….” Jang Maldong bent down. He grabbed a handful of dirt and showed it to Seol Jihu, “…Are here.”", "Seol Jihu was watching him slowly and a small lump went down his throat. Seeing Jang Maldong put it like this, he realized just how amazing High Rankers were.", "Kim Hannah’s words suddenly brushed past his head. She’d said that even the gifted needed 4-5 years to get to Level 5.", "“Then—”", "After staying silent for a long time, Seol Jihu asked calmly, “In your opinion, how many among them are ‘true’ High Rankers?”", "Jang Maldong grinned. He opened his palm, and the dirt fell through his fingers. What remained in his hand was only a tiny fraction.", "“And these true High Rankers, you said they’re the ones who learn things on their own and grow without relying on Paradise’s system?” Seol Jihu asked with a hint of anticipation. Jang Maldong thought for a moment before shaking his head.", "“You’re half right and half wrong.”", "“?”", "“I call them true and false High Rankers, but it isn’t as if any wandering dog can become a High Ranker.” Jang Maldong continued, “First, I want to make it clear that I have no intention of undermining any High Ranker. Not a single one of them rose to that position by sitting on the sidelines and taking a dump. They must have had their fair share of struggles.”", "Jang Maldong dusted off his hand. Then, he quietly announced the twist.", "“But… as you might have already experienced, Paradise attracts all sorts of people.”", "“Right.”", "“You can tell just by what goes on in the Neutral Zone. Among the dozens of newbies, there are always one or two special ones. The so-called gifted ones.”", "Seol Jihu was reminded of Odelette Delphine and nodded his head subconsciously.", "“But the funny thing is, there are differences even among the gifted ones. The one who’s more talented, the one who’s more special. You can go on and on, and eventually, you’ll find someone who’s unrivaled among the gifted.”", "‘A heaven beyond heaven.’ Seol Jihu suddenly thought of this saying.", "“People like that will go above learning skills on their own and will tread their own paths. They will enter unique realms no one else has ever reached. I call that Enlightenment.”", "‘An independent path? A unique realm?’", "Seol Jihu tilted his head and asked, “Could Dylan have….”", "“If you’re talking about Dylan’s lightning, you’re a bit off. Infusing electricity into mana — the idea is good, but that only constitutes as thinking outside the box. It’s far from Enlightenment.”", "“What about Chohong?”", "“It’s the same. Chohong is a special case. Because she is originally a Priest, she only strengthened her Manifestation ability.”", "It was quite a stingy evaluation considering that Carpe Diem was one of Haramark’s best teams. Seol Jihu shook his head.", "“I’m not sure I get it.”", "“I don’t expect you to. Well, I’m not trying to discuss martial arts theories with you, but….” Jang Maldong took a brief pause before opening his mouth again.", "“In the past, I’ve seen someone move like his body and weapon were one. That wasn’t something as simple as a movement technique.”", "Moving like the body and weapon were one?", "“Are you talking about the famous One With the Sword?” Seol Jihu asked, remembering the martial arts novels he used to read.", "“I’ve heard that it was something like that.”", "When Jang Maldong agreed, Seol Jihu’s expression waned.", "“One person seeks the path of Formlessness. Another seeks the path of the Thousand Sword.”", "“Puha!”", "Seol Jihu’s laughter interrupted Jang Maldong. The former quickly covered his mouth.", "“Is that funny?”", "“N-No, it’s just that the names….”", "He was okay with ‘Formlessness’, but he couldn’t stop himself when he heard ‘Thousand Sword’. They were both terms he was somewhat familiar with from martial arts novels.", "Seol Jihu put strength into his hand to hold back his laughter. Seeing this, one corner of Jang Maldong’s mouth curled up.", "“Hmph, let’s see you laughing when you face a thousand swords flying straight at you.”", "The smile on Seol Jihu’s face vanished. A thousand swords attacking him simultaneously? By commonsense standard, that was simply impossible.", "But because of his past life-threatening experiences, Jang Maldong’s words didn’t seem like a joke.", "“Brat, don’t ridicule them unless you’ve pioneered your own independent realm and can stand toe-to-toe with them.”", "“Sorry. I’m not laughing because I’m ridiculing them.”", "“I know. The name Thousand Sword is a bit strange. I laughed when I first heard it too.”", "“You too?”", "“Mm. His abilities are the real deal though….”", "Jang Maldong rubbed his forearm as if he was reminded of a bad memory.", "“Anyways, these are who I call true High Rankers.”", "‘If High Rankers are that amazing….’", "Seol Jihu made a tired expression before clearing his throat and asking, “Sir, what about the Unique Rank?”", "“I don’t know,” Jang Maldong answered immediately.", "“I can say this and that about High Rankers because I am a High Ranker myself.”", "He tilted his head up and looked at the sky.", "“But the Unique Rankers… are like the stars in the sky. I can’t get anywhere close to them even if I reach out my hands, so how can I dare to evaluate them?”", "Seol Jihu let out a long sigh. He felt that he still had a long way to go. At the same time, he found out that he was just a frog in a well. The world was wide, and there were many gifted people.", "Seeing the young man’s dejected look, Jang Maldong smiled, “You were laughing before, but now you’re all down?”", "“…It just seems so far out of reach.”", "“What’s there to worry about? You’re also walking your own path and making proper preparations for it. Though, we don’t know what lies at the end of it.”", "“Making preparations? What do you mean? ”", "“Didn’t I tell you? That you have to constantly devote yourself to balance your mind, technique, and body before becoming a High Ranker. This isn’t an easy thing to do.”", "Seol Jihu tilted his head as if he had no clue what Jang Maldong was talking about.", "“Never in my life have I seen someone whose mind, technique, and body are so twisted.”", "“You mean….”", "“Never mind true and false and all that. Just focus on balancing your mind, technique, and body. It’s not an easy path to tread, but I believe it has potential.”", "‘Balancing the mind, technique, and body’— the moment he heard this, vitality returned to his lifeless eyes.", "“I’m going to go running.”", "Seol Jihu immediately turned around. Now that he was shown a way to get stronger, his body became heated until it couldn’t handle standing still.", "“That’s fine, but do it in moderation. It’s still dark, and if you get hurt, you won’t be able to go to the Banquet.”", "Seol Jihu flinched in the middle of putting on his sandbags.", "“And if you get the opportunity, you can attempt Stage 3 as well. Go see what position you’re in.”", "“Sir?”", "Seol Jihu turned his head. Seeing his dropped jaw, Jang Maldong clicked his tongue.", "“Don’t get ahead of yourself. Entering Stage 3 is all up to luck. It’s not like Dylan and Kazuki couldn’t go because they were lacking in skills.”", "Who cared? Seol Jihu was more than happy to hear Jang Maldong giving him permission. Just this single moment felt like a generous reward for everything he had suffered so far.", "“Yes!”", "Seol Jihu shouted with spirit before starting to run. Seeing the young man getting farther away, Jang Maldong revealed his teeth in a grin.", "He had confirmed something with the training in the Huge Stone Rocky Mountain. From what he had observed so far, he could see all sorts of possibilities.", "Jang Maldong put his hand in his pocket and touched his needle case. It was the same case he had vowed to never open again.", "‘If it’s him….’", "His hand fiddled with the case. He knew Seol Jihu was amassing stat points. However, he didn’t know Seol Jihu had several Divine Elixirs along with the Divine Stigmata saved up for when he reached the High Rank. If he did, he might have mulled over his decision a bit more.", "In any case, Jang Maldong’s eyes were clearly burning as he stared in the direction the young man disappeared to. Seol Jihu wasn’t the only one looking forward to the day he became a High Ranker. After all, Jang Maldong was a trainer.", "Just like Agnes, he was thrilled to see a high-quality gem in the rough. And as far as his desire to refine it went, he was confident he wouldn’t lose out to anyone else.", "What would happen when the young man’s chaotic mind, technique, and body became one, or what form it would take— Jang Maldong had no clue.", "And that only made him look forward to it even more.", "Right! In Jang Maldong’s eyes, Seol Jihu was a gem that only now had begun the refining process. As long as he was refined well, Jang Maldong was confident that he would shine brighter than anyone else.", "After bursting out into a hearty laughter, he let out a few dry coughs.", "‘What am I laughing about at this age….’", "He was a bit embarrassed by his childish anticipation, but the fire in his heart refused to diminish. Thus, to cool the heat in his chest, he had to walk around for a long time.", "Just like that, the final night in Huge Stone Rocky Mountain passed, and morning dawned."]}