{"cid": "213", "title": "Chapter 213. A Dream Within a Dream (1)", "content": ["Yuirel finished her story with the Federation banning its members from entering the Pagoda of Dreams’ premises after that incident. They had judged that it was better to not risk anything, lest something they feared happened again.", "“This is everything we know about the Pagoda of Dreams. We wouldn’t be able to tell you more about it even if we wanted to.”", "That was the end of her story. Seol Jihu asked a few more questions before expressing his gratitude and getting up. He went back to the tent to relay the story to his comrades. Once he said everything without leaving out a single detail, a grave expression fell on everyone’s face.", "“Hey… how come the expeditions you come up with are all like this?”", "Even Chohong, who prided herself in being fearless, was uncomfortable with going.", "“A contagious nightmare… and nightmares becoming reality….”", "Kazuki sighed, his head dropped and his arms crossed.", "“Can we get some of the veil that the Sky Fairy was covering herself in? It looked like it had the power to resist the curse.”", "Seol Jihu shook his head.", "“I asked about that too, but Yuirel said it was only a temporary countermeasure. Apparently, it can block the curse seeping out of the pagoda for a moment.”", "“…Yeah, I figured.”", "Kazuki conceded gravely and then raised his head.", "“We have the choice of going back and returning with Invidia’s Priest. Eva is well-known for its Priests, so it shouldn’t be difficult to find one who is well-versed in lifting curses and witchcraft.”", "“I don’t know. Even the Federation gave up on lifting this curse. I’m not sure if even a Unique Ranker Priest can lift it….”", "While it sounded like Seol Jihu was being pessimistic, he was being reasonable as well. It was hard to believe that a large nation formed by the union of five races didn’t have a single power on par with a Unique Ranker. Not to mention, the Federation had once treated this matter with utmost importance.", "“In that case… can’t we just not sleep during the expedition? It might be difficult, but everyone should be fine with staying awake for a day or two. We can endure it no matter how drowsy we get, come out, then fall asleep after being touched by that black tree branch.”", "Hugo gave his opinion carefully, but no one reacted to it positively. In the first place, limiting sleep during an expedition was an extremely dangerous thing to do. Furthermore, this solution seemed too simple to be the right answer.", "It wasn’t as if the Federation was stupid. There was no way they wouldn’t have thought of such a method.", "They must have given up either due to the sheer danger of the pagoda or due to there being really no other option.", "And to be honest, Seol Jihu couldn’t help but think that the answer was the latter.", "Deciding that sitting around debating the matter wouldn’t result in a clever solution, Seol Jihu decided to wrap up the meeting for the time being.", "“We’ll continue for now. We’ll decide once we get there.”", "He now had only one thing to rely on — the Nine Eyes. He had decided to never rely on it again after the war. However, he wasn’t left with any other choice.", "After the meeting ended, Seol Jihu had a hard time falling asleep in his sleeping bag.", "‘I guess it can’t be helped.’", "He remembered what Samuel said.", "[Not every expedition proves to be a success, you see. Many times I returned with nothing to show for all our near-death experiences, and I lost count the number of times I had to give up near the end because we weren’t strong enough.]", "Because there was no ruin after they arrived.Because they weren’t amply prepared.Because it was unimaginably risky.", "It was a common occurrence for expedition teams to come back empty-handed due to such reasons.", "[You should remember this if you want to form your own expedition someday. You should go on one only when you have the financial leeway. An expedition isn’t something on which you bet everything you have.]", "It was just as Samuel said. It was foolish to risk danger when this wasn’t the only place where the Rothschear’s inheritance was buried.", "Seol Jihu witnessed through Samuel’s team what happens when one became blinded by treasures that were right in front of them. He refused to follow in their footsteps.", "And so, he steeled his mind. Or rather, he set a standard for himself.", "To retreat if the pagoda was either orange, red, or black. Yellow was the only color he would continue the expedition with. Because ‘Attention Required’ meant there was a way out.", "‘Any other color of danger… is too much.’", "Since the ironclad rule of Paradise was to preserve one’s life first and foremost, he was sure his comrades would accept his decision.", "‘I wonder what color the Pagoda of Dreams will be…’", "Seol Jihu couldn’t decide until he unknowingly fell asleep, whether he wanted it to be orange or worse, or yellow or the colors of the right direction.", "*", "Seol Jihu woke up in the middle of the night and was extremely taken aback. For some reason, Yuirel was right in front of him, looking down with an expressionless face. As if that wasn’t enough, his face was buried in her bosom.", "“….”", "He simply couldn’t understand how this came to be. But as this wasn’t the first time such a thing had happened to him, he maintained his composure on the outside.", "He then got down on all fours and apologized.", "“I’m sorry.”", "He heard Yuirel chuckle.", "“I was surprised to see you crawling into my tent in the middle of the night. I thought you’re a wild rabbit at first.”", "“So-Sorry… my body sometimes moves against my will…”", "“I thought for sure you would pounce on me once you infiltrated my sleeping bag like flowing water… but you just slept like a baby. With an extremely satisfied face, to boot.”", "It was then that he realized he was in the Cave Fairies’ tent, not his.", "“Well, it was fun looking at your face, so I let it be. You were rather persistent as well.”", "“….”", "When he stole a glance up, he saw Yuirel slowly putting on her jacket. Now that he got a good look, her breasts boasted quite a volume.", "I was wondering why my head was so comfortable…", "Seol Jihu felt his cheeks turn hot and muttered.", "“How can I make up for this… this act…”", "“Hm?”", "Yuirel, who was tying her long hair into a ponytail, glanced at Seol Jihu before smirking.", "“Aaah, it’s nothing. It’s been a while since I got the sensation of breastfeeding. It wasn’t so bad for me.”", "‘S-She’s so cool about it…’", "He would have no words to say even if she slapped him a dozen times. But judging from how nonchalant she was, it seemed Cave Fairies were very open about such things.", "The word breastfeeding stung him a bit, but Seol Jihu was touched by Yuirel’s mercy.", "“By the way, what did you decide to do? I saw you guys talking until late at night.”", "When Yuirel tilted her head left and right, her ponytail fluttered. Seol Jihu slowly got up from his seat.", "“We’re going to decide after getting there.”", "“Hmm. So you’re going, after all?”", "She sounded a bit regretful.", "“Did your comrades not say anything?”", "“They said they were okay with this.”", "Yuirel started.", "“Oh? They must trust you a lot. Well, it’s no surprise, given your achievements…”", "“Will it be okay?”", "He wasn’t asking about the danger of the Pagoda of Dreams. He was asking whether the Federation was okay with it.", "After all, there was a chance that the Federation would be affected if a nightmare came to reality.", "“I’m not so sure…”", "Yuirel tilted her head slightly.", "“I personally prefer that you don’t go. I’ve taken a liking to you. But if you want to go, I have no right to stop you.”", "Yuirel spoke straightforwardly, then turned to the tent where the expedition team was sleeping.", "“From the Federation’s point of view… I think it doesn’t matter all that much. After all, you’re humans.”", "Seol Jihu, who was staring blankly, smiled bitterly. She was saying that it was unlikely for humans to affect the Federation since it was already rare for humans to sincerely worry about them.", "“Well, Haramark’s princess might be different. But I’m sure she’s most worried about her kingdom’s fate. I’m sure the Federation will be fine.”", "“…Right.”", "Seol Jihu had no choice but to accept this bitter reality.", "“Anyways, if you must go, why not receive a little help?”", "“Pardon?”", "When Seol Jihu shot his head up, Yuirel gave a bland smile.", "“Don’t expect anything big. Like I said yesterday, I already told you everything I know. No one knows what’s inside the pagoda or what will happen to anyone who enters. After all, not a single member of the Sky Fairies’ elite expedition team made it out alive.”", "She then pointed at the expedition team’s tent.", "“But— supposing that you do make it out, it would be a waste of time and effort if you’re infected.”", "Seol Jihu finally understood what Yuirel was getting at.", "“Try asking. Personally, I don’t think she will refuse. This will be a good chance for you to get closer to the Sky Fairies as well.”", "“You said yesterday that we shouldn’t involve ourselves with them because they’re tiring…”", "“I was kidding, of course!”", "Yuirel giggled while smacking Seol Jihu’s shoulder.", "“We Cave Fairies might not have the best relationship with the Sky Fairies, but as you know, we don’t have the leeway to be fighting over our feelings.”", "Right. Just like the saying, ‘adversity makes strange bedfellows’, no matter how much one resented and detested someone else, cooperating in front of a powerful enemy was obvious.", "Seol Jihu suddenly became envious of the Federation.", "“Got it.”", "After expressing his gratitude, Seol Jihu left Yuirel’s tent and went to find the Sky Fairy. She was lying atop a tree, reaching her hand out to a chirping bird. She must have felt Seol Jihu’s presence as she lowered her arm and turned around.", "“Ah, um…”", "Seol Jihu stopped a good distance away and explained the situation. That his team might be entering the Pagoda of Dreams, and whether she could wait nearby with the purifying tree branch.", "The Sky Fairy listened quietly before speaking with a clear voice.", "“I understand. Sure.”", "Just like Yuirel said, the Sky Fairy agreed easily.", "“The Branch of the World Tree is the Sky Fairies’ treasure, but I properly got the permit to use it.”", "‘The Branch of the World Tree?’", "“Plus, in the one in a thousand chance you manage to succeed, it will be of great help to the Federation.”", "“Is the Federation in a difficult situation because of the Pagoda of Dreams?”", "“No one likes having a danger zone in their front yard.”", "The Sky Fairy replied simply.", "“Another problem is that we have to take a roundabout way whenever we go to Tigol Fortress. Anyways, waiting a day or two shouldn’t be difficult. I don’t see a reason to refuse.”", "The Sky Fairy lightly jumped down from the tree.", "“Also— I will provide you Flower Robes and stimulants.”", "“Flower Robes?”", "“It’s the robe I am wearing.”", "The Sky Fairy touched her slightly burnt white robe. Seol Jihu’s eyes widened.", "“You don’t need to thank me. The previous expedition team made more preparations than this before they entered.”", "Yet none of them managed to return… In other words, the robes and whatever else they prepared had been ineffective. Still, having them couldn’t hurt.", "“Thank you!”", "“No problem. You’re…”", "The Sky Fairy blurred the end of her speech, then glanced at Seol Jihu.", "There was something that Seol Jihu still didn’t understand completely. And that was how amazing and incredible his slaying of Undying Diligence was.", "It was something no one had ever accomplished since the appearance of the Seven Armies. Even Jang Maldong, who experienced all sorts of hardships, battles, and street fights, had called this a ‘legendary feat’.", "While Seol Jihu was the person behind this absurdity, he stopped thinking much of it now that the war ended. Perhaps this was what was most fearsome about Seol Jihu.", "Because this meant he only saw the Seven Armies, whom the Parasite Queen put her heart and soul into creating, as mere obstacles to be overcome.", "It was no wonder this Sky Fairy was taking such interest in him. In fact, it would be hard to find anyone in the Federation who wouldn’t be interested, except perhaps the Beastmen who opposed humans.", "“As you know, this cooperation request isn’t something that was originally in my schedule.”", "“Right.”", "“I only brought enough food for how long I thought I’d stay here, so I’m currently all out of food.”", "“?”", "Seol Jihu wanted to ask, ‘Didn’t you eat my banquet noodles yesterday? Shouldn’t you have food left then?’ But he decided to just listen.", "“So when you come out alive, I would like to receive a portion of your rations.”", "Seol Jihu nodded immediately.", "“That’s easy. We brought a lot of dried bread and jerky, so you can have those now if you’d like.”", "“N-No, that’s not it.”", "The Sky Fairy waved her hand in a fluster. She seemed rather anxious for some reason. After a long lull, she abruptly dropped her head and murmured quietly.", "“Um… yesterday’s noodles…”", "“…Yes?”", "“Mine got stolen before I could finish them… and it’s been weighing on my mind…”", "She twiddled her thumbs before raising her head with a dry cough. Then, she shouted boldly.", "“I think it’s reasonable to ask for this much given what I’m dwoing!”", "Seol Jihu nodded his head with a wry expression.", "“Yes… well… if it’s only banquet noodles, you can have as much as you want.”", "“Really?”", "The Sky Fairy rejoiced.", "“Then can I have two, no, three bowls? Or even four?”", "She clasped her hands and jumped in delight. Seeing the Sky Fairy’s sharp, thin ears flapping crazily, Seol Jihu scratched his head.", "‘Was it that good…?’", "Somehow, things turned out well whenever food was involved.", "‘Is it Gluttony (Gula)’s influence?’", "This thought crossed his mind, but he laughed it off in the next moment, thinking it was too absurd.", "*", "Breakfast started in a quiet atmosphere as everyone had a lot to think about. Seol Jihu noticed several pairs of eyes stealing glances at him. He especially noticed Phi Sora, who was nibbling on her spoon with her head down.", "She must have remembered the ancient emperor’s villa expedition.", "Seol Jihu didn’t dare to forget about that expedition either. It was a prime example of one’s wrong choice not only killing everyone but negatively influencing Paradise as well.", "Feeling more pressure thinking that the same might happen to him, Seol Jihu vowed to follow through with the standard he set last night.", "After breakfast—", "A guest visited the expedition team while they were cleaning up the campsite. It was Haeryeo and Haeya’s mother.", "“Haeryeo! Haeya!”", "“Mom!”", "Seeing the two sisters embracing their mother put a smile on Seol Jihu’s face.", "“Thank you… Thank you so much…”", "The Foxman sisters’ mother even cried and bowed.", "That was it. She turned around as soon as the girls were back in her hands. Even Haeryeo and Haeya were surprised by how quickly she turned back.", "“Let’s go back. Hurry!”", "“Hm? Now?”", "“Of course. Do you have any idea how worried everyone is? Prepare to get a huge scolding when you get back.”", "“M-Mom….”", "The sisters continued to look back as they were dragged away. Although the mother expressed her gratitude, it felt like a simple show of formality, and she seemed more interested in avoiding this place.", "“Some races of the Federation do not like humans. Beastmen are especially like that.”", "Yuirel explained with a wry expression. Seol Jihu nodded his head without a word. He knew he was lucky to have met the Cave Fairies. He didn’t think for one second that he would be welcomed by everyone.", "“Now then, shall we get going?”", "Yuirel gestured with her chin.", "“We’ll guide you if you’re fine with us leaving afterwards.”", "“Thank you!”", "Seol Jihu didn’t say no.", "*", "“Here it is.”", "The sun was now in the middle of the sky after the group set off in the morning. Yuirel, who was leading the way, stomped on a patch of grass.", "“This is the safezone. A bit further ahead, you’ll find the place where the Sky Fairies held their ritual.”", "In other words, beyond this point was where the Pagoda of Dreams’s influence reached.", "“How is it? It doesn’t look all that different from here, huh?”", "Just like Yuirel said, there wasn’t much information to be gathered from this place. Only trees and shrubbery filled the area, just like the areas they crossed to get here.", "If he had to point something out that was different, it would be the air. The air was no longer refreshing and cool, but damp and unpleasant. Of course, he might just be imagining things.", "‘Go on if it’s yellow or one of the colors of the right direction. Immediately turn back if it isn’t.’", "Seol Jihu reiterated his vow and walked forward with deep breaths. He then roused his mana and activated his ‘Future-Gauging Nine Eyes’.", "Soon…", "“!”", "Seol Jihu’s eyes shot wide open as he stared straight forward."]}