{"cid": "433", "title": "Chapter 433. Past, Present, and Future (2)", "content": ["Seo Yuhui was able to safely return thanks to Seol Jihu carving out a path through the enemy ranks. However, it was at the cost of losing Baek Haeju and other trusted comrades, leaving her to be the sole survivor.", "She only found out the identity of the man afterward.", "That the name of her savior was none other than the infamous ‘Seol Jihu’.", "That ‘Seol’ was not the name of the young man who had carried her bag several years ago, but rather his last name.", "And that the unremarkable young man who had once been used as a mere meat shield was the same person as the Spear Demon who defeated a Parasite Army Commander….", "Seol Jihu escorted Seo Yuhui to the intensive care unit at the Temple of Luxuria. When Seo Yuhui looked for him after recovering from her injuries and mental shock, Seol Jihu was nowhere to be found. He had left without saying anything as soon as he had fulfilled his promise.", "When she tried looking for Seol Jihu just in case…", "“What? Why are you looking for him? That guy is a madman, a total lunatic! He doesn’t know what enough is.”", "“That said, his skill with the spear is amazing. I once saw him rampaging on the battlefield. I’ve never seen a man more aptly described as a demon.”", "“He’s a cold-blooded man. Don’t think of him as a mere Earthling.”", "“He’s very violent and cruel. The Spear Demon treats everyone around him as an enemy. There must be a reason why he wasn’t chosen by the Seven Sins despite his ability.”", "Everyone around Seo Yuhui tried to stop her. They questioned why she was trying to meet someone who had turned his back on humanity and used his allies for his goals.", "Despite all this, Seo Yuhui did not give in and left in search of him. She didn’t understand why, either.", "Why was it that whenever she thought of that man, the lust that had always plagued her vanished like a lie? And why did her heart well up with indescribable emotions?", "She would find the answer if she met him.", "Seol Jihu was in the Federation. Even though the night was deep, he was training in a forest, thick with trees and shrubbery. He was swinging his spear madly as if he couldn’t bear to live without doing so.", "Seo Yuhui stood at the top of the hill, silently watching Seol Jihu sweating profusely, as he thrust and cut with his spear. She immediately wanted to go down and talk to him, but for some reason, she strongly felt that she shouldn’t approach him.", "The night passed, and morning arrived. Seol Jihu’s spear finally stopped when the rays of dawn spilled over the horizon.", "Seol Jihu, who had continuously moved without a second of rest until that moment, suddenly dropped his spear.", "He stood still like a stone statue for a long while before placing his hands on a large tree and dropping his head.", "And from his lowered face, silver droplets started falling.", "He was crying.", "The terrifying man called the Spear Demon was crying. He was shedding tears while repeatedly calling out Baek Haeju and Yoo Seonhwa’s name.", "At that instant, Seo Yuhui realized the source of the uncertain emotions that surrounded her.", "All of Luxuria’s attributes that she shared after being appointed as the Star of Lust were causing a huge ripple inside her.", "It urged her to go down quickly and comfort him.", "Yes, she was going to act according to her feelings.", "Seo Yuhui had already gotten up and was going down the hill by the time she realized this. She approached Seol Jihu, who was silently weeping and slowly stretched out her hand.", "Seol Jihu must have felt her presence as he turned around while wiping his eyes.", "It was strange. She had always rejected making contact with others, almost as if she had mysophobia. However, she felt no hesitation even as her hands wiped the tears from Seol Jihu’s eyes. Instead, she felt a strong sense of longing and pity.", "“Don’t cry.”", "Seo Yuhui quietly spoke as she wiped the tears off the silently blinking Seol Jihu.", "“Miss Baek Haeju isn’t dead. It’s not over yet.”", "“….”", "“It’s not too late. We can save her. You and me, let’s save her together.”", "A glistening pair of eyes gazed back at her.", "A moment later, Seol Jihu took a few steps back. He wiped his eyes with the back of his hand and sniffled before nodding.", "“…Yes.”", "And he spoke.", "“Thank you.”", "Seo Yuhui softly smiled when she saw Seol Jihu’s eyes regain their light.", "", "*", "", "It was the start of an odd partnership.", "As they began traveling together, Seo Yuhui gradually learned more about the person named Seol Jihu.", "She learned that he was a year older than she was, that he had a brusque personality but was surprisingly tactful, that the ramen he cooked once in a while was absolutely sensational, and so on.", "But what surprised her the most was just how much time he spent training.", "It could be said without even the slightest exaggeration that the entirety of Seol Jihu’s daily life was composed of training. He trained while he walked, ate, and even while he slept.", "Once, she had suddenly heard a resounding boom in the middle of the night, and when she had hurriedly gone out to look, an enormous boulder was in the place where Seol Jihu had been sleeping. She was shocked senseless when she saw Seol Jihu tying the boulder back up on a tree before going back to sleep under it.", "“Why… why are you doing that?”", "“…Huh? Ah, I’m trying to raise the rank of my Intuition skill.”", "“Still, isn’t that a bit…”", "“My talent isn’t that good. I need to work hard so that a certain someone doesn’t worry about me.”", "Seol Jihu gave a bitter smile.", "“Well, not that I have anyone who will worry about me anymore…”", "Seo Yuhui looked at the troubled Seol Jihu with a conflicted gaze.", "In the past, when she told him to go back during their first meeting, she meant it to keep Baek Haeju from worrying. However, Seol Jihu had taken her words differently.", "He had trained with the determination to die so that she wouldn’t have to worry about him. From then until now.", "It went to show just how sincere Seol Jihu was about Baek Haeju.", "Just from this alone, she could tell that Seol Jihu wasn’t a bad person.", "However, how Seo Yuhui saw him and how the public saw him went in two completely different directions.", "It wasn’t that she didn’t understand the reason for his rising infamy.", "Seol Jihu was often excessive to the extreme. He didn’t care what means he used to accomplish his goals.", "People badmouthed him. They called him a self-centered bastard who didn’t know how to cooperate with others, a greedy scoundrel blinded by contribution points, and a madman crazed with war.", "However, Seo Yuhui could not speak ill of Seol Jihu. Because she knew why Seol Jihu was like that.", "Above all, Seo Yuhui trusted her eyes. Even in reality, when it came to matters that weren’t related to Baek Haeju, Seol Jihu was a very normal and an honorable man.", "People around her always told her to be careful, but she did not need to worry. It was because Seol Jihu kept a distance by himself.", "She didn’t know whether it was because he was considerate of her identity as the Star of Lust. But he paid careful attention to keep himself from coming into contact with her, unlike a certain someone who would always joke about groping her breasts.", "He also did not speak more than necessary. His blank eyes that occasionally stared into space showed her that his mind was full, always thinking about Baek Haeju.", "In the first place, Seol Jihu did not think of Seo Yuhui as anything more than a helper. And every time she felt this way, Seo Yuhui became a little envious of Baek Haeju.", "One day, Seo Yuhui, bored of his silence, threw a question at Seol Jihu.", "“What’s pipster?”", "Seol Jihu, who was just about to meditate after sitting cross-legged, flinched.", "“How did you hear about that nickname…?”", "“I remember Haeju saying it once.”", "“Really?”", "Seol Jihu was delighted.", "“I’m not sure what it means either, but it’s a pet name that Haeju made for me. She’s called me pipster all the time…”", "A smile bloomed on his face.", "So he can make a face like that. He knows how to smile… Seo Yuhui murmured to herself while nodding.", "“You must truly love Miss Baek Haeju.”", "She said while gently leaning her head on her gathered knees.", "“Rather than love…”", "Seol Jihu smiled as he drew his head back and looked at the sky.", "“There is something I have to say to her… something that I have to apologize to her about.”", "Seeing the lonely eyes reflecting the starlight in the night sky, Seo Yuhui subconsciously replied.", "“I don’t know what happened between you two… but won’t Miss Baek Haeju change her mind if she found out how hard you’re trying?”", "Seol Jihu’s face sank in an instant. Seo Yuhui carefully added, in case she made a mistake.", "“I sure would have… if I were her.”", "Seol Jihu was silent for a long time. After a while, he replied with a short, ‘I see,’ before closing his eyes.", "Seo Yuhui smiled bitterly while looking at Seol Jihu, who started meditating. She then thought to herself, I’ve never seen someone who is more of an iron wall than me.", "*", "Seol Jihu was most definitely a strong person. However, he was also fragile at times as if he might shatter at any moment.", "Seo Yuhui could not leave Seol Jihu alone and devoted herself to caring for him while she was with him.", "On the other hand, she trusted and depended on him. He was a trustworthy companion and a Warrior who was stronger than anyone else. Staying next to him helped calm her body and mind.", "That was right. The two shared a relationship of mutual trust.", "It was fun. The situation in Paradise was becoming worse by the day, but Seo Yuhui ironically felt at peace.", "She felt an inexplicable sense of fulfillment during the times when they had each other’s backs and when she would lean on his back while walking forwards together, step by step.", "It was one of her few moments of happiness in Paradise.", "However, that moment did not last long.", "Their separation came abruptly.", "*", "“There’s a place I need to go to.”", "One day, Seol Jihu suddenly bid her farewell after meeting a Magician known as the last hope of humanity.", "“I’ll go with you.”", "“No. It’s a place I must go alone.”", "Seol Jihu shook his head.", "“Haeju asked me to keep you safe. I can’t protect you there, which means I will be breaking my promise with her.”", "“I don’t mind.”", "“But I do.”", "Seol Jihu stood quietly for a moment before speaking in a calm voice.", "“I’m worried.”", "“…Huh?”", "“You said it once before. That I need to think about how not to make others worry before worrying about them.”", "Seo Yuhui unwittingly shut her mouth. Seol Jihu fumbled for something in his pocket.", "“In any case, it’s not much compared to the help you’ve given me all this time, but…”", "What he took out from his pocket was a brightly shining little orb.", "“This is the divinity that I got after killing Abhorrent Charity.”", "“Why are you…”", "“If I can somehow save her in the future, can I ask you to take care of Haeju on Earth?”", "Seol Jihu continued without waiting for a reply.", "“And even if it’s not because of my request… I’d like you to return to Earth before it’s too late.”", "Seo Yuhui’s heart sank.", "She knew for a fact that humanity’s current situation was irreparably disadvantageous. In other words, he was telling her to escape.", "Seol Jihu handed over the divinity to her. Seo Yuhui tried to refuse, but he forcibly placed it in her grasp. Then, he retreated a few steps.", "“I plan on fulfilling the agreement I made with Eun Yuri. Once I go, I might not be able to return… No, that will most likely be the case.\"", "He refused to take Seo Yuhui because it was too dangerous.", "“I’ll leave Haeju in your care. I’m sorry for repeating this, but you’re the only person I can trust.”", "He wanted her to live before she got caught up in greater danger.", "“Also… thank you for everything until now.”", "Seol Jihu bowed. Then, he immediately disappeared after turning his body around.", "“W-Wait!”", "Seo Yuhui reacted a moment later, but Seol Jihu was nowhere to be found.", "He had really left.", "Her aimlessly outstretched hand grasped at the place where Seol Jihu had just been standing.", "But all she could grasp was air.", "“….”", "Cold air blew past her cheeks.", "Seo Yuhui stood in a daze for a long while before her expression began to break down.", "“Ah…”", "Her eyes grew blurry.", "“Ah… Ah…”", "She had not gotten a chance to say anything.", "A stream of tears filled with sorrow fell down her cheeks and wet her trembling, tightly shut lips.", "*", "Seol Jihu had left.", "Seo Yuhui had no way of knowing what happened afterward. However, she knew that it was a failure, not a success.", "The Parasites invaded Tigol Fortress without reserve and, in the end, succeeded in capturing it. Unable to protect the World Tree, which was their final bastion, the Federation quickly collapsed.", "As soon as the Federation fell, the Parasites turned their weapons towards humanity.", "And humanity, which had been wrapped up in internal conflict until then, collapsed all too easily.", "With Eva as the start, other cities began falling, one by one.", "Eventually, humanity came to their senses and tried to fight back with the capital as their base, but Scheherazade was also easily captured.", "There was no other outcome as the bishop of the Temple of Luxuria, Roberto Servillo, defected and led the traitors to help the Parasites from the inside. In the end, the only city left standing was Nur.", "With Eun Yuri and Odelette Delphine as the center, humanity joined forces with the remnants of the Federation to prepare for their last stand.", "There was no news of Seol Jihu, but she did not want to think that he died. There were talks in the streets that he had appeared in Scheherazade.", "She knew he would appear on the battlefield as long as he was alive.", "And so, Seo Yuhui headed for Nur.", "Then, at last, the final war broke out.", "*", "A bleak wind blew in the area.", "An unpleasant stench of ash, corpses, and all sorts of disgusting odor blanketed the wasteland.", "One woman was desperately searching around the battlefield after the war was over.", "Seo Yuhui wasn’t unharmed, but she did not stop her steps. She frantically scanned the area and sifted through the corpses on the battlefield.", "How much time went by?", "When the rays of the setting sun were at their strongest, Seo Yuhui suddenly felt a dark aura.", "It was a familiar sensation.", "Gula of the Seven Sins had descended on the battlefield.", "Seo Yuhui subconsciously turned her steps towards the place.", "And at last, she found Seol Jihu. No, to be more precise, it was a body that was supposed to be Seol Jihu’s.", "In front of the shimmering darkness…", "Next to a woman with pink hair wearing light armor…", "A lump of meat could be seen in a puddle of blood.", "She wouldn’t have recognized him if it weren’t for the familiar armor and spear.", "“….”", "She wanted to say something, but words failed her. Instead, tears quickly filled her eyes.", "With trembling hands, Seo Yuhui cupped the cheek of the man with his head lowered.", "The skin felt cold as his body heat was gone. Not to mention any vitality, even his soul could not be sensed.", "No matter how many times she stroked him, Seol Jihu showed no response.", "“Hic.”", "The moment she confirmed it, her pent-up emotions broke loose. Tears flowed down without pause as Seo Yuhui quietly wept.", "In the end, things ended like this.", "[There is something I have to say to her… something that I have to apologize to her about.]", "He had tried so hard.", "But without being able to fulfill his wish, he fought like a dog and died a dog’s death.", "“O, Gula!”", "Seo Yuhui shouted after she cried until her tears dried out.", "“Save him. Please… Please save him… I’ll use a Divine Wish…!”", "[I cannot accept that wish.]", "Gula’s voice rang out.", "[This child did not want to revive.]", "[He regretted everything and, at the end of his despair, wanted to restart.]", "Seo Yuhui frowned.", "[This can be called a coincidence.]", "[With just his contribution points, it would have been impossible to send back even his emotions. But, it was made possible through a Royal Oath.]", "[As a result, the child’s wish has been granted.]", "[And because your wish goes against this child’s will, I cannot accept it.]", "Seo Yuhui’s gaze momentarily paused at the pink-haired woman.", "Seol Jihu had hoped to restart. In that case…", "After a long pause, her eyes started shining as if she came to a decision.", "[What will you do?]", "In fact, she did not even need to speak out loud. Gula could read her mind, and Seo Yuhui had given her an answer in her heart.", "Offerings spilled out of the air as Seo Yuhui stretched out her arm. She even offered the holy artifact that she had held dear. The divinity that Seol Jihu had given her was also included. There was no need to keep them since everything was over.", "“Send me back as well.”", "Seo Yuhui spoke with a determined face.", "“The same as this man wished for.”", "Gula spoke after scanning through the offerings.", "[If it’s this much… the level of emotions that can be transported should be higher than my child’s.]", "[But, it won’t change the fact that it’ll only be a fragmented emotion.]", "Gula asked again to confirm it with her.", "[Your wish will be fulfilled in the form of a fleeting dream.]", "[It might not be treated as a significant dream and might even be brushed aside like a single night’s nightmare.]", "[Is that still fine?]", "Seo Yuhui replied without a hint of hesitation.", "“Yes.”", "[Good.]", "Gula did not keep her waiting any longer.", "In fact, Gula had long since known that Seo Yuhui would come to this place and make the same wish as Seol Jihu.", "[Come closer, Child of Luxuria.]", "The darkness bloomed as a blue fragment rose into the air.", "The world that Seo Yuhui saw began to twirl as something crashed over her like a tsunami.", "[I cannot wait until I meet the two of you again.]", "Gula laughed as she raised her voice.", "And so.", "Woong!", "A small noise suddenly sounded as a circular ripple was created in the void.", "The ripple transformed into a fragment that glowed blue before softly dropping down on top of the sleeping Seo Yuhui’s forehead like a kiss.", "When the fragment entered her as if it was submerged in water, Seo Yuhui’s face trembled.", "A moment later.", "“Heuk!”", "Seo Yuhui woke up with a gasp."]}