{"cid": "347", "title": "Chapter 347. The End of the War (1)", "content": ["An uproar erupted behind them.", "The Army Commanders looked back one after another and lamented in unison.", "Their worst fear had become a reality.", "The enemies were pursuing them with great tenacity, clearly unperturbed by the Queen’s power.", "Seeing the Fallen Angels and Sky Fairies rushing at her like a swarm of bees, Exploding Patience hurriedly ordered the remaining parasites and corpse army to charge.", "Unsightly Humility also sent out the Death Knights and what was remaining of his undead army.", "They hoped to buy even a little bit of time, but the result was unsatisfactory.", "There were just too few of their forces left to last long enough against the Federation.", "A dazzling golden light flashed, and immediately, a large opening formed in the battle line.", "Exploding Patience frowned when she saw Seol Jihu racing across the battlefield, smashing his way through the center.", "“Y-Your Majesty!”", "The Parasite Queen did not answer.", "Exploding Patience looked extremely guilty. She couldn’t believe that the Queen had to suffer such humiliation because of herself and the other Army Commanders.", "After a moment of silence, the Parasite Queen spoke.", "—…Leave the mother species behind. All of them.", "“Pardon? All of them?\"", "—Yes. Including Medusas, Temerators, and Reginas.", "“B-But…. I can understand Medusas, but abandoning all three is….”", "Exploding Patience hesitated. She knew that mother species were difficult to produce unlike ordinary parasites.", "The upper-ranked and pinnacle-ranked ones were even more so.", "—We don’t have any choice.", "But the Queen was persistent.", "—Carrying the Nests is difficult enough. We can always produce new mother species at a later time. Right now, their presence is getting in the way of our retreat.", "Under the present circumstances, the Queen was right.", "Though still concerned about the aftermath, Exploding Patience chose to remain silent.", "At the same time, she felt frustrated.", "‘Even though Her Majesty went to such great lengths to descend…!’", "This proved that the situation they were in was far too dangerous.", "In the end, they had to give up all of their mother species.", "Medusa, Temerators, Reginas, and the others roared furiously as they began to spew out parasites.", "There were quite a lot of them. They had led a huge army into this war from the get-go, and on top of that, the Nests had been giving birth nonstop. Protected in the rear, which had been relatively safe throughout the war, the mother species had naturally increased in number.", "“Tsk. They sure are desperate.”", "The white tiger Beastman clicked his tongue.", "The sacrificial parasites and corpses were easy to kill, but the mother species were a different story.", "They were the strongest, the most evolved forms of their ranks. Ganged together, they posed a major threat.", "The parasites they produced also couldn’t be ignored.", "“What are you gonna do?”", "White Tiger asked, raising his head slightly.", "“We can’t break through that. We’ll have to fight….”", "White Tiger spoke evasively, but Seol Jihu understood that under the present circumstances he wouldn’t be able to capture the Parasite Queen.", "Seol Jihu bit his lip nervously.", "He hadn’t expected the Queen to abandon all mother species.", "Of course, exterminating the mother species would be a big achievement on its own.", "However.", "‘No.’", "It simply wasn’t as appetizing as the Parasite Queen.", "Seol Jihu had already forgotten the Army Commanders.", "All he could think about was the Parasite Queen, and nothing else.", "The one who ruined Paradise was only a few steps away from him.", "He knew he couldn’t let her get away intact.", "If only he could get past that assembly of mother species, he would get a better view of the Parasite Queen.", "But how would he do that?", "Even as Seol Jihu wondered, the distance between him and the enemy was rapidly diminishing.", "The mother species seemed determined to take all risks to stop him, and the parasites they spouted were beginning to fill his view.", "‘There’s no way I’ll be able to shatter that.’", "Then, there was only one thing he could do.", "Seol Jihu clenched his teeth.", "‘It’s either do or die.’", "He yelled resolutely.", "“Stop!”", "“Okay!”", "Thinking they had no other choice, White Tiger immediately slowed down.", "At this point it seemed impossible for them to catch up with the Parasite Queen. He thought it better to join forces with the rest of the team and destroy the mother species for good.", "That in itself would be a considerable achievement.", "And so, White Tiger stopped with flexibility unbefitting of his large stature. It was then that he felt the weight of the foot pressing down on his back.", "Toong!", "“Huh?”", "White Tiger unwittingly looked up and was shocked.", "He saw Seol Jihu soaring into the air as if he had been pushed forward by a great force.", "“You…!”", "For a moment, White Tiger thought Seol Jihu had lost his mind.", "Medusas alone were over four meters tall, and Temerators and Reginas were twice as tall as Medusas.", "Above all, the sky was full of flying creatures. There was no way Seol Jihu could leap over all of them.", "But then, White Tiger doubted his eyes.", "Seol Jihu was moving in a straight line, not a curve, up towards the sky from where White Tiger stood.", "This meant he wasn’t trying to leap over, but rather—", "Spark!", "At that moment, electricity engulfed Seol Jihu’s entire body as he soared into the sky once again.", "For a brief period of time, Seol Jihu was above all the mother species.", "And as a result….", "“!”", "He could finally see.", "Nothing else was a concern to him right now.", "He focused all his senses on the Parasite Queen, who was deeply wounded and bleeding.", "The moment he laid eyes on her, just as he reached the apex and was about to fall, in that brief moment, Seol Jihu’s mind went blank.", "He reached the peak of his concentration and fell into a trance.", "[Turn your arm.]", "The only thing he could hear was Jang Maldong’s voice in his head, and his body moved of its own accord.", "[I meant your right arm. Turn it clockwise halfway.]", "He turned his right forearm exactly halfway, bending it back greatly.", "[Start at your feet, then move on to your left arm.]", "He began twisting his left arm, starting from the tip of his finger, and let the movement flow all the way to his right arm.", "His right arm absorbed the rotational force and began moving forward.", "[Now!]", "Seol Jihu opened his eyes wide.", "His right arm quickly shot forward.", "The exploding sensation that began in the palm of his hand spread all over his right arm in an instant.", "His spear felt so flexible that it was like a fish out of water, wriggling away from his hand.", "He’d never thrown a spear in the air before.", "His physical condition wasn’t perfect either.", "Above all, his target was far away.", "But somehow Seol Jihu looked extremely satisfied as he watched the Spear of Purity fly through the air past all the flying creatures.", "“…Huh?”", "Even White Tiger, the Beastman King, couldn’t help but admire his comrade’s flawless posture.", "‘It’s perfect.’ The king thought unwittingly.", "Whoosh!", "The beam of light, surrounded by electricity, crossed the sky diagonally.", "The distance between the spear and its target quickly approached zero until there was none.", "So the moment the spear pierced exactly where the target was about to pass, the Parasite Queen raised her head, realizing that something was wrong.", "Seol Jihu had poured everything he had into this single shot.", "But the Parasite Queen’s face remained expressionless.", "She appeared calm and composed.", "The reason was that the spear was already there the moment she raised her head.", "Swish!", "It began at the top of her head and went down to her forehead, nose, mouth, and finally to her chin.", "The sharpened spearhead drew a straight line.", "At the same time, intense pain overtook the queen.", "The expressionless face twisted in agony.", "—……!", "Crimson blood flowed out of the vertical line drawn from the top of her head to the bottom of her chin.", "The Parasite Queen’s face began twitching.", "She finally realized what had happened.", "She was extremely lucky to have raised her head at just the right time.", "If she hadn’t, the spear would’ve penetrated her head and split her in half.", "Thinking of such a possibility—", "—Ah….", "The Queen felt a chill run down her spine.", "Her head throbbed with pain.", "The Parasite Queen’s eyes dilated with fear as she unwittingly turned her gaze to Seol Jihu.", "Coincidentally, the pain reminded her of the past.", "She recalled the painful and humiliating experience in which her whole body was split in half by a single movement of the Martial God’s sword.", "It was then.", "“Your Majesty!”", "Vulgar Chastity’s voice brought the Queen to her senses.", "But even before she could pull herself together, a new fear struck her.", "The spear, which she thought she had avoided, was coming up again towards her throat.", "The sudden memory of her past had forced her to let her guard down for a moment. That was clearly her mistake.", "Her jaw slowly dropped.", "Swish!", "The Parasite Queen flinched.", "Blood spattered the queen’s face.", "And then, she heard an ear-splitting shriek.", "“Aaaaack!”", "She saw the Spear of Purity pierce Sung Shihyun.", "What happened was that Vulgar Chastity had panicked when she saw the spear move again and unwittingly threw Sung Shihyun, whom she had been carrying, towards the spear.", "“You craaazy biiiiitch!”", "Sung Shihyun, who had involuntarily become the Queen’s shield, screamed as he fell.", "“I’ll get him! Your Majesty, you must hurry!”", "Breathing heavily, Vulgar Chastity flew towards Sung Shihyun in a hurry.", "The Queen looked forward again.", "Her wings began to flap slowly.", "With clenched teeth, she focused all her senses on running away.", "She feared that if she didn’t get out of here quickly, she’d get split in half again.", "And so, shivering with humiliation, she fled without looking back as she did then.", "*", "“Damn it!”", "Kooong!", "Seol Jihu pounded the ground with his fist as soon as he landed.", "He was confident of his success until the Parasite Queen raised her head at the very last moment.", "It wasn’t even ‘close’.", "His spear definitely reached her.", "It just wasn’t strong enough to penetrate her.", "The rest of the army passed by him.", "He heard the footsteps of soldiers rushing towards the mother species, the metallic clangs of their weapons, and the cries of the parasites and mother species.", "But Seol Jihu remained still on his knees.", "He had poured everything he had into that last attack.", "He was tired, but what bothered him more than fatigue was the fact that he failed to capture the queen.", "‘I missed my chance…!’", "It was a miraculous chance created by a combination of coincidence and luck.", "He could have annihilated the Army Commanders.", "And it wasn’t everyday the Parasite Queen paid a visit to the battlefield.", "This could have been the once-in-a-lifetime opportunity to end the long war.", "“Damn it!”", "As the cries of the mother species dwindled, Seol Jihu punched the ground again.", "All the while time continued to pass, and the battle was slowly coming to an end.", "The mother species were powerful, but not powerful enough to defeat the endless rush of soldiers.", "The best they could do was stall for time.", "And shortly afterward, with the last Regina falling with a thud, the mother species were completely annihilated.", "The battlefield erupted in cheers.", "The deafening roar reverberated through the air.", "Everyone witnessed the dreadful Parasites and their Queen flee for their lives.", "When they came, they dyed the whole mountain range gray. But when they left, they had lost everything except the Army Commanders and Nests.", "Today would go down in history as a great victory.", "Gabriel, after confirming that the battle was over, hurried to the star of this great victory.", "Even then Seol Jihu still had his head down.", "‘He must really be disappointed….’", "Gabriel smiled at the human’s seemingly bottomless thirst for victory.", "At the same time his tenacity scared her a little. Despite his great achievements, he didn’t seem satisfied at all.", "‘Hm.’", "Gabriel gave a little cough to attract Seol Jihu’s attention.", "“Thank you. You did really well.”", "“…”", "“I saw that last attack. You were so close.”", "“…”", "“It’s too bad… but we still won. How long are you gonna stay that way?”", "Seol Jihu slowly raised his head.", "Gabriel gave him a gentle smile.", "Seol Jihu stared at Gabriel, who was ruffling her silver hair in a manner unbefitting of a holy angel.", "“It’s not like the war is completely over.”", "Seol Jihu’s eyes lit up.", "‘Ah.’", "He stumbled to his feet.", "She was right. The enemy retreated but that did not mean the war was over.", "There remained a much more important issue than that.", "Suddenly, Seol Jihu remembered his comrades and looked around.", "Most were busy rejoicing, but there was one spot that was oddly noisy.", "There, some soldiers were pulling at what looked like a tower.", "‘Haramark’s infantry?’", "He spotted Jan Sanctus in the crowd.", "It seemed that he and his men had joined the chase and helped defeat the last wave of the Parasites.", "‘But why are they all gathered in one place?’", "Neither the general nor the soldiers looked happy.", "‘It can’t be.’", "Seol Jihu pushed his way through the crowd only to be greeted by the cruel reality.", "He gasped in disbelief.", "What he thought to be a tower was actually a Medusa’s body.", "And there was a familiar figure underneath it.", "“…Princess?”", "Teresa Hussey.", "As crimson blood slowly drenched the ground where she lay, Seol Jihu fell to his knees.", "“P-Prin….”", "Her glossy pink-colored hair was soaked with parasite fluids, and her face and her armor were spattered with blood. This made it a bit difficult to recognize her at first, but the girl lying in the pool of blood was definitely Teresa.", "Holding on to faint hope, Seol Jihu placed his finger under Teresa’s nose.", "But she wasn’t breathing.", "“What happened…?”", "Seol Jihu glanced around, demanding an explanation.", "“W-Well….”", "One of the soldiers stammered nervously.", "“W-We’re not sure, sir. We defeated all the parasites and moved on to the mother species… and then we heard the princess scream….”", "Seol Jihu’s heart sank again.", "That meant she was alive until the Parasite Queen fled.", "And that she died during the final chase.", "“Princess….”", "Teresa looked so peaceful with her eyes closed.", "Seol Jihu’s hand was shaking noticeably.", "They were in a war and a massive one at that.", "He knew it was ridiculous to hope no one would die.", "However, he had hoped Teresa would be an exception.", "He wanted her to live.", "Seol Jihu reached out his trembling hand and caressed Teresa's cheek.", "It was then that a deep voice rang out behind him.", "“Why don’t you hurry up and move the damn thing. The princess is gonna suffocate.”", "“?”", "Seol Jihu looked back.", "Jan Sanctus was clicking his tongue with an annoyed expression on his face.", "When he turned his head again, he saw the princess glancing at him with only one eye open.", "Their eyes met.", "“…”", "“…Huu—”", "He heard a breathing sound.", "“I’m alive!”", "Teresa chirped playfully.", "“…Princess?”", "“Ah, you see, I was fighting the Medusa when a Cockroach suddenly jumped at me from behind.”", "“Princess?”", "“I must have missed it the first time. Anyway, it took me by surprise, and I was rolling on the ground to get it off when the Medusa fell on top of me.”", "“Princess?”", "“So I’ve been stuck here ever since, and these soldiers have been trying to pull me out. Then I saw you coming towards me….”", "Teresa’s voice slowly faded to a whisper.", "She noticed that Seol Jihu’s expression was rapidly getting cold.", "“Well… you know, I’ve suffered a lot because of that contract, too… Observatio Vitae, I mean. So, I….”", "The princess mumbled in a small voice, averting her eyes.", "She blinked quickly and glanced again at Seol Jihu. Slowly, her lips pursed.", "“H-how about a kiss?”", "Seol Jihu stared at Teresa with a blank face before bending over and headbutting her across the face.", "A squeal escaped Teresa’s lips.", "“Ow! That was mean!”", "Tears welled up in her eyes as she rubbed her forehead.", "“Good! You did good.”", "Jan Sanctus gave Seol Jihu a pat on the shoulder.", "“You scared me… for real.”", "Seol Jihu lay on the ground with his limbs stretched out. It felt like the latest incident had taken years off of his life.", "As his body cooled down, weariness set in.", "Seol Jihu looked up at the night sky with eyes full of fatigue.", "The orange tinge of sunset was already fading from the quiet sky.", "All that happened a few hours ago, when the sky was dyed in various colors, seemed like a lie for a moment.", "‘…Is it over?’", "For real?", "Overtaken by a sense of unfamiliarity, he asked himself.", "It was a strange feeling.", "What should he call it? Confused? Nervous?", "Somehow none of this felt real.", "He hadn't had a day off since he went over to the Spirit Realm.", "Just lying here doing nothing made him feel strange.", "‘It took long enough….’", "The cheers were still going on.", "The cries of joy mixed with cheers helped him realize that their victory was, in fact, real.", "Seol Jihu relaxed slightly and drew a long breath.", "‘We really won….’", "It was finally starting to set in.", "Yes, the Federation and humanity were victorious.", "Together, they defeated the Parasites in an all-out war.", "They stopped the fall of Paradise.", "Though, more precisely, what they did was press the pause button.", "The Parasite Queen would surely come up with another scheme, but at least they successfully avoided the inevitable destruction that would follow after the fall of Tigol Fortress.", "‘It’s over….’", "Seol Jihu’s eyes slowly closed from extreme fatigue.", "The sky, which was colored crimson only a few minutes ago, had moved on to a calmer indigo as night fell.", "‘…A star?’", "He thought he saw a twinkling star, but his view soon became blurred.", "Amidst the cheers and the voices of his comrades calling his name, Seol Jihu closed his eyes.", "A faint smile crossed his lips as he fell into a deep sleep.", "Instead of the moon, a strikingly bright star shone down on Seol Jihu lying in the field."]}