{"cid": "428", "title": "Chapter 428. Supernova (2)", "content": ["There was something Seol Jihu heard a long time ago when he was a low-leveled Earthling who could only dream of becoming a High Ranker.", "[In that case, allow me to ask you a question.]", "[Warfare is quite a different beast from expeditions. As a strategist, you’re risking hundreds or thousands of lives if we’re talking about a small scale, and hundreds of thousands, even millions of lives if we’re talking about a greater scale conflict.]", "[Are you offering this strategy, fully aware of the implications?]", "What filled up Seol Jihu’s head and heart in this disastrous life-or-death moment wasn’t nervousness or a sense of crisis.", "Funnily enough, it was guilt.", "He felt sorry because he was the one who came up with this plan.", "He wanted to make up for it if he could, even if he had to throw away his life.", "If he was going to die anyway, he wanted to become the sacrificial lamb that would help his comrades escape.", "However, he knew he couldn’t do this.", "The point of Philip Muller’s escape plan was breaking up the Parasites’ forces.", "If he caused a scene and made the enemy realize that he didn’t have the stele, they would focus on pursuing the other groups, and he would have ultimately caused them harm.", "Moreover, he remembered how Phi Sora told him not to draw the enemy’s attention stupidly. She must have said it out of concern, having experienced something similar during her time as White Rose’s team leader and thus knowing how he must be feeling at the moment.", "In the end, it was simple.", "He had to run. That was the only way he could help his comrades.", "He had to help his comrades survive. And the only way to do that was to run.", "Seol Jihu heaved out a long sigh.", "He slowly opened his eyes and gazed at the dark earth.", "Then…", "“…I guess I have no choice.”", "He finally hardened his resolve.", "To flee with all his strength and live.", "And so, he didn’t leave anything in reserve.", "Now was the time to use what he had saved up until so far.", "[Your Status Window][3. Physical Level]Strength: High (Low)Endurance: Intermediate (High)Agility: High (Low)Stamina: High (Low)Mana: High (High)Luck: Intermediate (Intermediate)Remaining Ability Points: 19", "Seol Jihu’s hand moved toward his status window.", "[You used 3 Ability Points.][Your Endurance stat increases from Intermediate (High) to High (Low).]", "[You used 4 Ability Points.][Your Mana stat increases from High (High) to Pinnacle.]", "Seol Jihu’s quickly moving fingers paused. He knew how to maximize the efficiency from the Ability Points and the Divine Elixirs as he had contemplated using them multiple times in the past.", "But, he had to choose between Strength, Endurance, and Agility to exceed the Pinnacle rank.", "Logically speaking, choosing Endurance was the right choice since being able to take blows for longer would help increase his chance of survival.", "Agility wasn’t a bad choice either as the escape plan focused on speed.", "However, Seol Jihu had other thoughts.", "He couldn’t deny that Endurance and Agility were both important stats, but it was a different story if the question was what to concentrate on.", "Even if he could last longer, could he escape soundly if the assumption was to endure a heavier beating?", "It was the same for Agility. He couldn’t just run day and night. There would be a moment when he would have to fight the Parasites.", "There was a saying, the best defense is a good offense.", "So, rather than becoming a tougher meat shield or running away like a cornered rat, he needed power, the power to make a head-on breakthrough when he met an opponent he couldn’t run from.", "And so…", "[You used 10 Ability Points.][Your Strength stat increases from High (Low) to Pinnacle.]", "Seol Jihu invested into Strength without hesitation.", "With this, he only had two Ability Points left. He couldn’t use them to increase any stat even if he wanted to.", "Seol Jihu let out a short sigh.", "‘I hope I’m doing the right thing….’", "He wasn’t without worry, but the die had been cast. The only thing left to do now was to consume the items in the pouch.", "“Just how long are you going to make us…?”", "Little Chick, who was anxiously waiting, blinked.", "Crunch, crunch. Seol Jihu was taking out five-colored pills and eating them one by one.", "‘Those are…’", "Divine Elixirs.", "Little Chick knew about them as it had overheard Seol Jihu and Jang Maldong talking about them from time to time.", "Seol Jihu had purchased them from the Neutral Zone and had been preciously saving them for when his physical level hit its limit. Now, it seemed he was finally using them.", "[Your Strength stat exceeds the human limit.][Your Endurance stat increases from High (Low) to Pinnacle.][Your Agility stat increases from High (low) to Pinnacle.]", "After taking the Divine Elixirs for strength, endurance, and agility…", "[Your Stamina stat exceeds the human limit.]", "He took two Divine Elixirs of Stamina.", "[Your Mana stat exceeds the human limit.]", "When he ate the Divine Elixir of Mana, Little Chick noticed the change at last.", "Seol Jihu’s energy, which had already been massive like a sea, expanded like an endlessly vast ocean.", "Little Chick had served many masters until now, but he had never seen a human that emitted such ridiculous energy. In fact, it was hard to see him as a human any more.", "[Your Luck stat increases from Intermediate (Intermediate) to High (Low).]", "Seol Jihu finished by taking the last pill, the Divine Elixir of Luck.", "And so…", "[Your Status Window][3. Physical Level]Strength: EXEndurance: PinnacleAgility: PinnacleStamina: EXMana: EXLuck: High (Low)Remaining Ability Points: 2", "As of this moment, Seol Jihu’s physical level far surpassed what Black Seol Jihu had managed to achieve in his final days. Only Agility and Endurance were at the same level. In terms of points, the difference was equivalent to 59 Ability Points.", "“You….”", "Little Chick dropped its tiny lower beak.", "“What?”", "Seol Jihu smiled while glancing to the side.", "“What do you think?”", "When he asked suggestively, Little Chick lowered its head and stared at Seol Jihu with a serious face. It then muttered quietly.", "“Just based on the energy you’re giving off… it’ll be fine even if I unlock the fifth… no, the sixth stage.”", "“Just based on my energy, huh.”", "Seol Jihu gave a bland smile. He had steeled his resolve for what was to come. He used up a little bit of time to use his Ability Points and to consume the Divine Elixirs.", "Now, it was time to go.", "“Alright, you ready?”", "Seol Jihu kicked off the ground.", "[Eh? Are you sure? I thought we were going to fly.]", "“It’s fine.”", "Seol Jihu could hear Flone’s voice behind him, but he shook his head.", "“I think it will be faster if I run.”", "He knew the state of his body better than anyone else.", "He could feel his muscles brimming with tremendous strength that seemed ready to burst out and soar to the sky like an ascending dragon.", "He could feel that his skin and organs had gotten more elastic as if his cells had scrupulously gotten together to form tighter bonds.", "His body had gotten extremely light, so much so that he believed he could fly, and endless vitality surged from his body that made him feel like he could fight forever.", "And then there was mana.", "Seol Jihu examined the change in his body the moment his mana rose to the EX rank and couldn’t help but gasp inwardly.", "His mana, which had always flowed through the circuit around his dantian and heart, shattered its path. After getting rid of the circuit on its own, it made Seol Jihu’s entire body its home.", "Setting aside the exponential increase in the density and amount, the feeling of becoming one with mana made Seol Jihu feel an inexplicable high.", "Wondering just how powerful he had gotten, Seol Jihu roused his mana slightly and increased his speed.", "The result was immediate.", "Swooooosh!", "“Uwuuuuh!”", "Little Chick screamed in surprise as a sudden gust of wind struck its face.", "[W-Wait for me!]", "And Flone hurriedly flew after Seol Jihu from a distance.", "‘I might really be able to escape…!’", "A sharp glint flashed in Seol Jihu’s eyes.", "After making Flone return to his pendant, he put more strength into his legs.", "Soon, a storm scattering sharp blades of wind began to cross the land.", "At last, the curtains rose to a great escape.", "*", "After about ten minutes, Seol Jihu caught sight of a wave that looked like black wastewater. It was obviously the Parasites.", "There was still some distance between them. Seol Jihu expected to run into them within an hour or two, but they arrived much quicker than he anticipated.", "‘Should I break through? Or should I ignore them and take a roundabout way?’", "Of course, he had increased his Strength stat to EX rank for the purpose of directly breaking through the enemy, but that was with the Army Commanders in mind.", "Although Seol Jihu had gotten incomparably stronger than before, at least two Army Commanders were still transcendents above Seol Jihu.", "If the other four released their divinity and fought seriously, Seol Jihu had no way to stand against them.", "Moreover, he had to be wary of the Parasite Queen making an appearance.", "There was no way to tell who he would be facing.", "Even though he was brimming with energy from having consumed the Divine Elixirs, he had to conserve his strength as much as possible for the upcoming battles.", "It was then.", "Just as Seol Jihu decided to take a detour, another swarm of Parasites appeared from the left.", "No, it wasn’t just the left. A faint fog was quickly moving toward him from all directions. Not just from the ground, but also the sky.", "In truth, Seol Jihu didn’t think it would be particularly difficult to throw these pursuers off. But after running for a little longer, he was forced to change his mind.", "It was because he saw larger layers of Parasites placed behind the first wave.", "Seol Jihu had been surrounded before he realized.", "‘This….’", "Setting aside the countless number of enemies besieging him, Seol Jihu felt something was off.", "The enemy soldiers were moving in perfect order following his path of travel. It was like he was looking at a well-trained army moving under the orders of an experienced general.", "To be able to command such a large army meant a high-ranked being was present at the scene.", "An Army Commander, for example.", "Seol Jihu’s conjecture was quickly proven to be correct.", "Soon, he saw the enemy commander that was leading his army and blocking his path. The being, protected by an entourage of twenty Death Knights, was none other than the Parasites’ Second Army Commander, Unsightly Humility.", "“It’s been a while.”", "As Seol Jihu slowly came to a stop, Unsightly Humility greeted him.", "“This must be our first face-to-face meeting since the valley war. I don’t believe we ran into each other at the Tigol Fortress War.”", "When Seol Jihu didn’t respond, Unsightly Humility let out an awkward chuckle.", "“Fufufu, are you surprised that I arrived so quickly? Are you wondering why I am here when I should be at the Hiral Mountain Range?”", "Seol Jihu still didn’t say anything.", "Unsightly Humility shrugged while staring intently.", "“You seem a little mad. Well, don’t feel too bad. We’ve given up on a lot of things for this plan.”", "“…Given up?”", "Seol Jihu finally reacted.", "“My, it seems you haven’t realized yet.”", "Unsightly Humility murmured as if he was looking at a pitiful creature.", "“Well, I’m sure it doesn’t matter. Anyway, I heard that you were a hero.”", "Seol Jihu furrowed his brows at the seemingly random comment.", "“It’s a simple story, really. We dug a trap to kill the elusive hero who hinders our queen’s plan every time.”", "Unsightly Humility spread his arms out.", "“In other words, everything, starting from the invasion of Nur, has been a show. It was all a ploy to bait you into our territory.”", "Seol Jihu’s eyes widened.", "“You might find it hard to believe, but it is absolutely the truth.”", "Seol Jihu wasn’t a fool. In fact, he was rather quick-witted when it came to things like this and instantly realized that Unsightly Humility was telling the truth.", "“You will come to find out soon that the entirety of the Parasite army is rushing to your location.”", "Unsightly Humility continued while cackling.", "“You can be proud. As of this moment, the Queen, the Army Commanders, and even the lowest of the low lifeforms will spare no cost to kill you.”", "Seol Jihu was only dazed for a moment. Soon, laughter escaped his mouth.", "He chuckled as if he found the whole thing ridiculous, then shook his head and spoke.", "“Thanks.”", "“Hmm?”", "“This failed operation has been weighing on my mind, you see. But if you’re telling the truth, doesn’t that mean my comrades can safely escape?”", "“Hmm… I suppose so. The other Army Commanders are chasing after them, but they’re only pretending so that they’d distance themselves from you.”", "Unsightly Humility nodded his head without denying it.", "“They should be able to return alive. As long as they don’t do anything stupid, like purposely picking a fight with an Army Commander or coming back to help you.”", "“That’s why I said thank you. I can fight at peace, knowing that.”", "Seol Jihu slicked up the hair covering his forehead and stretched his arms.", "“…Plus.”", "With a refreshed look, he rested his spear on his shoulder and scanned the surroundings with a grin.", "“Wouldn’t you guys be taking a huge blow if even I escape alive?”", "“Hoh.”", "Unsightly Humility exclaimed quietly.", "The increased chance of Seol Jihu’s comrades returning alive naturally meant there was a greater chance that Seol Jihu would die.", "He must know this, yet his expression didn’t change in the slightest. In fact, he spoke with a face full of confidence and hubris.", "“I applaud your heroism, but…”", "Clack, clack, clack! Unsightly Humility clattered his teeth and unsheathed his longsword at his opponent.", "“Do you think it will be that easy?”", "Seol Jihu smirked.", "Unsightly Humility tightened his grip on the longsword. Since Seol Jihu was so confident, it was only natural to want to confirm it.", "[Charge!]", "Unsightly Humility gave the command, and his army began to march forward.", "At the same time, the innermost group of parasites surrounding Seol Jihu rushed in from all sides. It was like watching a swarm of ants flocking to an ant hole.", "Seol Jihu’s expression instantly turned serious.", "Pzzt!", "Electricity crackled from the spear resting on his shoulder, and a powerful lightning energy formed around his body.", "“…Hm?”", "It was around this time that Unsightly Humility felt that something was off. Perhaps it was a sense of déjà vu.", "As Seol Jihu’s hair shot up, an intense vibration rippled out around him. The grains of sand on the ground flew up one by one as if they were attracted by something.", "Moreover, powerful monstrous energy emanated out. It far surpassed that of Unsightly Humility, who had received a divinity.", "As the King of Death Knights did a double-take, the surroundings had gotten eerily quiet. Seol Jihu’s boundless mana had shrouded the land, turning it into a strange space where sound could not be heard.", "In the next instant, Seol Jihu raised his spear and slammed it into the ground.", "Although no sound was heard, a shockwave of unprecedented power swept past Unsightly Humility’s body.", "Then, a spherical orb radiating a light brighter than the sun shot up through the ground.", "Amidst an intense, blinding pool of light, formless undulations instantly swept past Unsightly Humility, spreading out everywhere.", "The terrifying mana made even space sink in on itself.", "The orb got bigger with each pulsation it underwent. After the short heralding phenomenon, the orb buzzed like a beast trapped in a snare and turned bumpy.", "Its surface then cracked open, a golden yellow radiating out…", "KWANG!", "And it instantaneously caused a huge explosion.", "Tremendous energy like an exploding supernova burst out.", "The rings of electricity swirling around the orb shot out and cut down every flying species that was rushing in.", "The burst of energy also spread out far and wide on the ground. Thunderbolts brimming with lightning discharge swam through the ground like dolphins, pulverizing the enemies that were charging in.", "Going past the first layer of encirclement to the second, third, and then the fourth… the grand show of destruction made both Unsightly Humility and his spectral horse step back.", "Soon, the exploding light turned into a pillar of light within the mushroom cloud caused by the explosion before subsiding gradually and announcing its extinction.", "Guoooooo…", "An acrid smoke flowed through the area. Unsightly Humility became speechless as he looked around his surroundings after the explosion.", "Not a single soldier that charged forward was left standing.", "Even the soldiers that were standing by were forced down en masse.", "All that remained were piles of ashes.", "The troops that he had brought to the Hiral Mountain Range to keep the Federation in check had all been wiped out in an instant.", "“Just… what…”", "Unsightly Humility stammered before coming to an abrupt stop.", "Seol Jihu pulled out his spear from the ground and raised his head. When the eyes that were looking straight at him glinted with a crimson light, Unsightly Humility realized that this was only the beginning.", "That the previous show was only a trailer.", "With eyes gleaming with a blood-red light, Seol Jihu opened his mouth.", "Level 7 Star Seeker, Awakening Skill — Berserk.", "HUUAAAAAAAAA!", "A roar of a beast shook the heavens and earth. In the next moment, Seol Jihu kicked off the ground, rushing toward Unsightly Humility, and struck down his spear.", "Unsightly Humility hurriedly swung his longsword in shock.", "The spear and sword clashed."]}