{"cid": "158", "title": "Chapter 158. Connections Call Connections (2)", "content": ["Seol Jihu first brought Marcel Ghionea into the cave.", "Not only did he suddenly get on his knees, but he also requested to enter Carpe Diem, saying, ‘Please give me a chance to repay my debt.’", "Seol Jihu didn’t think it was proper to decide this as if to bake beans on lightning, so he asked Jang Maldong— who was scolding the Yi siblings— to join in on the conversation.", "In truth, Marcel Ghionea’s overly serious manner made Seol Jihu feel uncomfortable, so he was asking Jang Maldong for help.", "“I thought you’d retired…. It’s an honor to meet you.”", "Even a man as aloof and masculine as a snow field’s white wolf showed great respect and manners in front of Jang Maldong.", "‘Who the heck is this?’ was the reaction Jang Maldong first revealed, but when he heard Marcel Ghionea’s story, his face turned serious and solemn.", "A Romanian Earthling titled the Archer of Steel, a member of Haramark’s line of elite Archers following Edward Dylan and Ayase Kazuki.", "Marcel Ghionea had a brilliant career that didn’t lose out to Seol Jihu, yet he had come to join Carpe Diem on his own under the pretext of paying back his debts.", "The Nine Eyes revealed Marcel Ghionea to be colorless.", "As for his Status Window….", "[Marcel Ghionea’s Status Window]Summoned Date: 2016. 03. 18Marking Grade: BronzeHeight/Weight: 178.8cm/72.4kgCurrent Condition: HealthyClass: Lv 4. The First Steel SniperNationality: Romania (Area 2)Affiliation: N/AAlias: Archer of Steel, Ace Marksman, Tundra Wolf", "[2. Traits]1. Temperament—Cold-Hearted (Cold and unaffectionate)—Calm (Does not show nervousness, anger, or other strong emotions)", "2. Aptitude—Effort (Endeavors with both body and mind to achieve a goal)—Superior (Above average talent)", "[3. Physical Level]Strength: Intermediate (Intermediate)Endurance: Low (Intermediate)Agility: High (Low)Stamina: Intermediate (Low)Mana: Intermediate (Low)Luck: Low (Low)", "Remaining Ability Points: 0", "[4. Abilities]", "1 Innate Abilities (0)", "2. Class Abilities (6)—Steel Bow And Arrow [Intermediate (High)]—Sharp Aim (Pinnacle)—The First Steel Combat Manual—Nighthawk’s Step", "3. Other Abilities (2)", "[5. Level of Cognition]Stubborn (Not correcting or changing one’s dogged determination, attitude, or position) / Conviction / Persistent (Fights harshly to endure pain)", "‘Incredible!’", "His physical level boasted stats that seemed nothing like a Level 4’s, but what was even more eye-catching was his Agility, which had entered the High-rank realm.", "It seemed that he invested all his ability points on Agility without raising his Endurance.", "Not only that, but his class was also one Seol Jihu had never seen or heard of before, and came with a unique modifier called ‘The First’.", "Seol Jihu would have to experience it personally to be sure, but he could tell Marcel Ghionea specialized in combat just by looking at his Status Window.", "That was what made this situation stranger.", "An Archer of such caliber was asking to join a team purely out of gratitude? Even though Seol Jihu had saved his life, he went so far as to hire a Pathfinder to search for several days?", "No matter how Seol Jihu thought about it, he couldn’t help but think, ‘Was there a need to go this far?’", "After silently watching for a while, Jang Maldong spoke with a resounding voice.", "“Is there a request you’d like to make or a condition you’d like to add for joining the team?”", "“You don’t have to be so formal, Master Jang.”", "“It’s fine. I would like to hear your answer first.”", "“Not at all. If you give me a chance, I will give my all and do what little I can until I return the favor I received.”", "The conversation seemed to be going in circles. Seol Jihu let out a small sigh, while the simple and honest Marcel Ghionea fixed his posture. Although he was told to sit comfortably, he knelt down again.", "Looking at Seol Jihu, he spoke a bit more carefully.", "“Was my request too impolite…?”", "“No, it wasn’t impolite at all. Just a bit sudden is all….”", "Shaking his head, he wondered what to do before deciding to be straightforward.", "“To be honest, I’m doubtful. It’s a bit embarrassing to say, but I never thought someone was being held captive by those monsters. That’s why I just walked by.”", "“Yes.”", "“Since neither of us knew about each other, it would have been fine to gloss over the fact. But taking all this trouble to find me, just to repay me is a bit confusing. I’m wondering what your… intention is.”", "Seol Jihu was about to say ‘ulterior motive’ but changed his word choice. After all, if Marcel Ghionea really was here with good intentions, asking him such a thing would be extremely rude.", "“…I don’t know what you will think about this.”", "After listening attentively, Marcel Ghionea calmly opened his mouth.", "“It is my conviction.”", "“…Conviction?”", "The Archer of Steel…", "“Return vengeance like the blade, return kindness like the ocean.”", "…revealed his true intention.", "“An older brother I used to know made this his personal creed.”", "It was a bit frightening to take as a simple creed.", "“And this is also how I chose to live in Paradise.”", "But when Seol Jihu heard this, the cringe he was feeling vanished in an instant, and he was touched by Marcel Ghionea’s sincerity.", "In a way, Seol Jihu had a similar conviction. Their values might differ slightly, but didn’t he also decide to live by the Golden Rule?", "It was this conviction of his that made him destroy White Rose when he really didn’t need to.", "Seol Jihu uncrossed his arms and nodded his head.", "“You’ll give us time to think, right?”", "“Of course. Should I wait outside?”", "“It won’t take long.”", "“You can take your time.”", "When Marcel Ghionea left, Jang Maldong chuckled.", "“Really! You….”", "“Why?”", "“You brat. I was just thinking it would be nice to have an experienced veteran Archer. I’m just amazed that one showed up on his own.”", "“Because of Seol-Ah?”", "“That’s right. As you know, Trackers have many things they need to learn. Physical training is my specialty, but I’m not knowledgeable about teaching how to detect enemies approaching or how to read traces they leave behind. That’s why I was concerned.”", "Jang Maldong looked back at the entrance of the cave.", "“He’s a fine man. Although he seems to be pursuing combat abilities more than tracking, he should at least know the basics. It will be fine as long as he can help Seol-Ah with that.”", "At that moment, Seol Jihu realized the identity of the uncomfortable feeling wriggling deep inside him.", "He was subconsciously against bringing in a new, skilled Archer when he had finally brought an Archer who listened to him.", "‘Was I being too egotistical…?’", "He was slightly embarrassed for being relieved when he heard that Marcel Ghionea didn’t specialize in tracking.", "“What are you thinking about so much?”", "“Ah, I just find it interesting.”", "“Interesting? What is?”", "“We had difficulty finding an Archer at first… and recruiting Seol-Ah and Sungjin was hard too….”", "One could never predict everything in life, and life was bound to be full of ups and downs, but now that he had experienced this irony of fate, he couldn’t help but feel bewildered.", "On the other hand, he felt a bit creeped out. Ian told him about this. That an action he considered insignificant might cause huge waves. Seol Jihu just hadn’t expected things to turn out this way.", "“What are you going to do?”", "“I don’t have a reason to refuse. In fact, I should be thankful.”", "“He’s a rare righteous person. If he’s being sincere, that is.”", "“That’s why I need to confirm something.”", "Seol Jihu called the unexpected guest back in and asked directly.", "“What is your goal for coming to Paradise?”", "“Goal?”", "Seol Jihu slowly explained the reason he was asking this question. It was more or less the same as what he had told the Yi siblings back in Scheherazade.", "The point was that it would be hard to work together if they didn’t share the same purpose.", "Although Marcel Ghionea could just leave after repaying his debts, Seol Jihu felt it was better that they make this clear from the beginning.", "Marcel Ghionea’s confused look slowly turned into that of understanding, and he soon opened his mouth.", "“I see my benefactor follows a great cause.”", "Seol Jihu smiled bitterly. Being called a benefactor was one thing, but Marcel Ghionea’s overly respectful manner of speech was hard to listen to without getting embarrassed.", "“To be completely honest, I don’t have a goal as grand as yours.”", "“Yes.”", "“But overall, I believe our goals match. I dare say that there won’t be any problems.”", "“…You don’t have to dare to say it.”", "Unable to bear listening any longer, Seol Jihu gave a pleading look, and Marcel Ghionea’s complexion darkened.", "“Do you know what happens to Earthlings who die in Paradise?”", "“Don’t they lose their memories and revive on Earth?”", "“That’s right. Then you should also know that there have been cases where Earthlings fall into a state of being neither dead or alive, unable to return to Earth.”", "Seol Jihu’s eyebrows twitched.", "Marcel Ghionea’s story went as follows.", "He had a team he worked with in the past, and they had received a draft notice when the Parasites launched a large-scale attack.", "And as a result of participating in the war, the team had suffered a significant loss due to the enemy’s overwhelming might.", "The problem wasn’t just that the teammates were killed, but that one of them had apparently been Parasitized.", "To be precise, one of the leaders leading the Parasites’ army had taken interest in his comrade and turned this person into its servant.", "In front of the collapsed, groaning Marcel Ghionea.", "Seol Jihu asked carefully.", "“Could this person be the older brother you mentioned before…?”", "“No.”", "Marcel Ghionea hesitated for a moment before speaking up again.", "“It was someone precious… whom I promised my future with.”", "He clenched his teeth, and the killing intent in his eyes became a level thicker.", "“There is currently only one goal I wish to achieve in Paradise.”", "He clenched his hands hard enough to tear his skin and muttered.", "“To save my fiancée and return her to Earth.”", "In other words…", "“To kill Vulgar Chastity who has her shackled.”", "Hearing this, Jang Maldong let out a deep sigh.", "“Ah… Vulgar Chastity….”", "Marcel Ghionea bit his lower lip as if just thinking about this brought him pain.", "‘Did she become a mutant?’", "Seol Jihu wanted to ask for more details but kept his mouth shut. He didn’t think it was proper to ask when Marcel Ghionea was trembling so much from withheld rage.", "Marcel Ghionea’s face was distorted to the point that even the dullest fool would see through his thoughts.", "In any case, Seol Jihu understood what he was saying.", "Seol Jihu wanted to save Paradise. To achieve this, the eradication of the Parasites was essential. And Marcel Ghionea held terrifying hatred for the Parasites.", "Although their ultimate goals were different, since they wanted to do the same thing, there was no reason they couldn’t cooperate.", "Deciding to grab this opportunity, Seol Jihu waited for Marcel Ghionea to calm down before slowly putting his hand out.", "“Welcome to Carpe Diem.”", "When Marcel Ghionea raised his slightly lowered head, Seol Jihu continued with a smile.", "“I look forward to working with you. Also, being called a benefactor makes me feel uncomfortable, so just call me by my name.”", "“…It’s my pleasure. I’ll bear in mind, Leader.”", "With that, Seol Jihu and Marcel Ghionea shook hands.", "Paradise’s problem-solver had chosen to bring the Archer of Steel in.", "*", "[I will deploy ten Nests.]", "An aloof voice rang out in a grand royal palace.", "Undying Diligence, the existence that kneeled in front of the Corrupted Throne, asked.", "“Nests… you say? If it is about the invasion of the Tigol Fortress, we have more than enough—”", "[I am not done talking yet.]", "Undying Diligence quickly shut his mouth.", "[You will not be going to the Federation.]", "Undying Diligence racked his brain quietly. The target wasn’t the Federation, yet the Parasites’ First Army and ten additional Nests were being dispatched?", "‘Could it be?’", "“Have you finally decided to crush the puny insects!?”", "[It is too early to celebrate.]", "Compared to Undying Diligence’s excited voice, the voice of the Parasite Queen was calm. Undying Diligence tilted his head and asked again.", "“Shall I wipe out Haramark?”", "[No.]", "“Then is it Arden Valley?”", "[If it is necessary.]", "He wasn’t going to annihilate the humans or seize control of Haramark, and even conquering Arden Fortress had a condition attached to it?", "“Then…?”", "Undying Diligence asked carefully, but no answer came back.", "When he carefully raised his head, he saw the Parasite Queen seated on her throne, looking up at the ceiling.", "This was a habit of hers whenever she looked at the movement of the stars.", "After staring intently at the stars, the Parasite Queen gently closed her eyes. Her eyebrows trembled faintly.", "‘I’m afraid?’", "She couldn’t think of the cause no matter how much she thought about it.", "It wasn’t that she was afraid of that star. But whenever she stared at it, parts of her body would convulse.", "It was as if her instincts were signaling her about an abnormality.", "The problem was that every time this warning rang, a memory she wanted to forget was forced out, creating fear.", "The Parasite Queen was once the ruler of a planet but had experienced near extermination due to one wrong choice.", "Everything began from the birth of a demigod.", "Starting as a human and having achieved divinity on his own, the Martial God had led his forces and invaded both the Great Realm and the Heaven Realm.[1]", "The Parasite Queen was shocked when the Great Realm followed their prophecy and surrendered without a fight, but when the Martial God even invaded the Heaven Realm, she could not sit still.", "It would be correct to say that she was on the lookout for an opportunity.", "An opportunity to devour the divinities that had recently been born and expand her influence.", "But when the Parasite Queen entered the Heaven Realm after waiting for it to be conquered, she was met with a sight that surpassed her wildest imaginations.", "She had made a mistake. Who would have thought that there would be two Ninth Heaven Rank Gods, who were in the league of the Creation God, by his side? There were even two Tenth Heaven Rank Gods, a rank she didn’t even know existed!", "A single flick of the finger by the Crimson Goddess had created ‘Eternally Burning Flames’, which instantly turned the Parasite Queen’s army into ash.", "And facing the following ‘Cosmos-Destroying Hellfire’, the Parasite Queen had to endure horrifying pain that could not be described with words.", "Then…", "When the Martial God, wearing a suit of black armor and adorning a fluttering crimson cape, took up the challenge with an amused face and caused a gale with a swing of his invisible blade, the divinity she had carefully amassed for thousands of years was cut in half in an instant.", "[Huh? I thought you’d at least entertain me a little…. Why is a so-called God so weak?]", "While the Parasite Queen was screaming in despair, she heard these words clearly.", "How could she forget the humiliation of that day?", "Undying Diligence, who was quietly studying the Parasite Queen’s face, suddenly felt a breath-seizing pressure descend in the area and slammed his head down on the ground.", "The Parasite Queen’s bone wings shuddered.", "‘Why?’", "Why did looking at that star evoke this memory?", "Because she couldn’t figure it out no matter how many days she spent thinking about the matter, she grew more and more frustrated.", "[It will be good to pull out any sprout that might grow to become a source of trouble in the future.]", "Speaking firmly, the Parasite Queen stood up from the Corrupted Throne.", "Soon, a voice carrying rage shook the grand hall.", "[I hereby command ‘Unsightly Humility (Humilitas)’ to participate as well.]", "“…My Queen?”", "Undying Diligence voiced out subconsciously.", "The Nosferatu army, vying for the top position among the Seven Armies and often called the strongest Parasite army, had already been summoned for the task, yet even Unsightly Humility was being dispatched?", "[Furthermore…]", "However, the Queen was not done yet.", "The Parasite Queen’s eyes narrowed like a snake’s.", "[I shall also be calling upon ‘Vulgar Chastity (Castitas)’.]", "Undying Diligence’s face became dyed in shock.", "1. A small reference to the author's previous novel, M E M O R I Z E. The Martial God is the MC of that novel. "]}