{"cid": "22", "title": "Chapter 22. A Star Shining Again (2)", "content": ["[Break through the siege and survive! (Remaining number of attempts: 15/15)]", "Survive the encirclement of the group of skeletons!", "Difficulty: HardWhen successful: +1000 Survival points.When unsuccessful: Death*Cooperation possible (up to 6 participants)", "'A siege? Skeletons?'", "The mission parchment screamed 'danger' even through a cursory glance. The fact that the mission allowed up to six people to form a party told the same story, as well. Quite likely, Seol would find himself surrounded from all sides the moment he ripped the parchment in half.", "However, no matter how long he stared, the mission's color remained yellow. And that color, without a doubt, signified that he should pay attention. Seol stood there, hesitating somewhat thanks to the word 'siege', but then he remembered that Kang Seok also glowed in yellowish color as well. If the creatures he'd encounter were on that guy's level, then….", "'I have to take the risk.'", "If he could survive and succeed, then he could potentially earn up to 15,000 points. He'd get to amass almost half of his goal of 34,000 points with this one mission alone. Besides, other survivors showed no sign of even touching this parchment, so it seemed perfect for his current situation.", "'I should still be careful, though.'", "After making up his mind, Seol pulled out all the spell balls in his possession.", "'Will poison work against skeletons?'", "Seol deliberated for a while, before deciding to use them even if they proved to be ineffective. He did confirm the crucial fact during killing the Gaekgwi, that the poisonous fog seemed to possess some elements of explosive gas. If he combined that with Ignite, then there was a good chance that he'd reap huge benefits – just like the last time.", "'So, it should be better to combine these two….'", "He carefully checked each of the spell balls and divided them into two groups – ones that would be used in combination and the rest that would be used by themselves. It was a shame that there were no spell balls related to holy or divine magic.", "It'd be a lie if he wasn't feeling nervous. Still, he shoved the spell balls inside his pockets and grasped the steel bar as tightly as he could, before ripping the parchment up with his teeth.", "The already-familiar sensation brushed past him and the scenery changed in an instant.", "The location for this mission was set inside an underground cavern-like space. His vision immediately took in the ceiling above that seemed far too low for his liking.", "“….”", "And, right in front of his eyes…. Several dozens of skeletons stood there, as he expected they might, and were glaring at the intruder.", "'They all look rather hostile, don't they….'", "The disparity between what he saw in things like video games and that of reality was as great as heaven and earth.", "Whatever the case may have been, his plan was to start his assault with a bang. Seol pulled out the combination of Poison Fog and Ignite – the very combo that worked so splendidly against the Gaekgwi – and was about to throw the two, before his hands hastily froze mid-action.", "“….Huh.”", "Suddenly, he had a thought. He was standing in a completely different environment compared to when he was killing the Gaekgwi. He glanced behind him and saw a solid wall. There wasn't a lot of space around him, and worst of all, there was no room to retreat.", "But, he was thinking of using a poisonous gas here? And to make it explode, too?", "He nervously swallowed down his saliva after realizing how close he got to inadvertently killing himself. From the very beginning, things were going sideways.", "Kwaaahhhaaa!!!", "Right at the back of the undead horde, a skeleton wearing a battle helmet roared out. Then, dozens of 'normal' skeletons began to repeatedly clatter their teeth in unison; they raised their weapons and began inching closer to Seol's position.", "Realizing how urgent his situation had become, Seol quickly chucked the Ignite spell ball first. It caused a small explosion and knocked out two skeletons. Maybe because it was used independently, its overall prowess was far lesser than what he was hoping for.", "Seol tried to remain calm and pulled out his second combination from the pocket – Spiderweb and the Hydrochloric Acid.", "The thrown spell ball rapidly spun in the air, before tens of silvery threads exploded out. Ten-odd skeletons were tied up by these threads. Seol chucked the Acid ball a beat later; the acidic liquid rained down on the immobile monsters. The skulls, ribs, pelvic bones, femurs, etc, got melted in the blink of an eye, taking care of the first wave.", "The overall effect was more or less acceptable, but the problem was that he still had to take care of twenty-plus remaining skeletons. These monsters continued to advance forward while their teeth noisily clattered, even though the flames from Ignite spread around and caught a few of them on fire.", "All these were still within Seol's calculations, though. He had to decrease their numbers as much as he could before he was pushed up against the wall. While cautiously retreating, Seol pulled out more spell balls from his pocket.", "Strong beams of light exploded out from the fourth ball he threw in the air.With a loud buzz, the ball exploded in a blinding shower of arcing electricity which spread out to everywhere, causing a chain reaction of sorts. The skeletons trembled non-stop before they collapsed to the ground like puppets with their strings cut. Somehow, Seol managed to bring down the second wave.", "Guaaaah", "From the back, the helmet-wearing skeleton roared out in anger once more. Since it seemed to be the leader of this undead horde, its anger was more or less understandable, what with its subordinates decreasing by over half in only a few breaths' time.", "The leader skeleton grasped a large ax and rushed forward, before powerfully kicking off from the ground.", "The boney hand arced back and then, shot downward as if the monster wanted to slice apart the rude intruder in one go.", "Seol didn't expect the enemy to perform an aerial assault like that and stood there blinking in a daze. Meanwhile, the distance between him and the monster shrunk rapidly. He was about to pull three more spell balls out but had to urgently raise the steel bar to defend himself, instead.", "Although he was slightly caught off-guard, as long as he could defend this attack and hit the skeleton with lots of spell balls, then he'd be….", "CLANG!!", "Seol's body tilted to one side rather unexpectedly. His eyes grew wide in disbelief.", "The airborne attack that carried the downward momentum contained destructive power that easily exceeded his expectations. The angle of defense allowed him to deflect the descending ax, but at the same time, the impact force shoved his own arm away as well.", "The ax was swung again in a diagonal line and smacked away Seol's steel bar like it was nothing. Then, it swung back towards his now-exposed ribcage.", "His eyes instinctively spun and took in the sight of the powerful arc the ax was drawing. Seol's head blanked out, then.", "I'm going to die here?Just like this? Really?But, it was only 'Attention Required', wasn't it?I still have spell balls left to use, and I am not in a disadvantageous position yet….!", "As thousands of thoughts entered and left his head, his instincts screamed out. It told him it was too late now.", "Seol gave up on counter-attacking right away and spun around with what little reflex he could muster up. While exposing his back, he crouched forward as much as he could.", "Slice!!", "The sharp blade of the ax didn't cut the intruder's back but sliced up the object slung across his shoulders – the thick bag that contained pretty much every little thing from a certain convenience store.", "At the same time, the skeleton's head was reflected on the smooth, polished surface peeking out from underneath the gap cut open by the ax.", "Suddenly, a light beam shot out from the bag and penetrated the skeleton's eye sockets.", "Kieeeeeee!", "The skeleton screamed. Seol nearly toppled over from the impact but managed to prop himself up by placing his hands against the wall. He turned his head around to look. Although he was dazed and stunned silly, he still got to see the skeleton screaming out in pain as it was burning away. The moment of quick thinking had saved his neck, but he couldn’t hide his shock from the sudden change of situation.", "'W, what happened?'", "He managed to survive, but that didn’t mean his troubles were over. He quickly pulled the bag that served as a wonderful shield to his front and rummaged through its contents. He then figured out the cause of the change. A beam of bright light was coming from the sliced gap of the bag.", "“….Oh.”", "The Mirror of Understanding. It was the SPECIAL item he drew from the drawing machine, supposedly for dealing with the Deceased.", "Thinking ‘what if’, Seol pulled the mirror out and shined its light on the still-burning skeleton with the helmet. Every single bone on its body began to change color right away. Very soon, the monster completely became ash and scattered away like dust.", "It wasn't the only that monster, though. Even the ones trapped within the Spiderweb, even the ones hastily retreating… as soon as the light touched them, they turned into ash while crying out in sorrowful wails.", "He only had to shine the light once around the cavern, but the tens of skeletons all became dust in less than one minute.", "When all of its targets were gone, the mirror's surface cracked as if to signal that it had achieved what it was designed for.", "[You have successfully completed a 'Hard' difficulty mission.][1000 Survival points has been added to your tally.][Current SP: 28,100 SP]", "*", "When Seol returned to the plaza, a small commotion rose up.", "After the 'first placed survivor' vanished from the plaza, the crowd quickly checked what mission he had chosen, only to be shocked out of their minds. Not even one person among them dared to attempt a Normal difficulty mission yet, but this youth was challenging a Hard difficulty already? Not only that, all by himself?", "The opinions were evenly split. Some were saying that he had bitten off more than he could chew, while others said that they should wait and see. And as everyone could see, Seol returned to the plaza in less than five minutes.", "Since there was only one possibility upon failure of the mission, which was death, his re-emergence meant only one thing.", "“I can't believe it.”", "Hao Win muttered out softly in disbelief.", "It could be said that Hao Win's surprise was on a different level compared to other survivors here. He had managed to complete a few missions already, and while doing so, he got to form a certain view, an educated guess of sorts, regarding how one should go about surviving in the Neutral Zone.", "He was convinced that, if he wanted to undertake missions, he would have to make adequate preparations first by purchasing various items through many stores found here. And also, even if he could form a party with other people possessing similar level of abilities as himself, he should not, under no circumstances, attempt to clear missions that had difficulty rating higher than 'Normal', at least not for now.", "That was probably why Odelette Delphine went to chat with the first-placed young man from Korea. Of course, she still got refused rather grandly, though.", "But that man from Korea had complete a mission with a difficulty rating two rungs higher than 'Normal' this quickly?", "“How did he do it? Is able to use magic already…. Hmm?”", "Hao Win was thinking of inching closer to Seol and ask, but he ended up tilting his head instead. Seol was standing in the same spot, unmoving like a stone sculpture. There was a strange, awkward atmosphere surrounding him.", "It was as if Hao Win was looking at a soldier who barely managed to return from a bloody and brutal warzone. When Hao Win took a closer look, the golden bag he was so envious of was split almost in half, and Seol's expression seemed to be lost and contemplative at the same time.", "Then, Seol began moving his feet in silence.", "The crowd could only stare at the back of the young man wordlessly climbing up the staircase in unsteady steps.", "*", "Seol couldn't recall how he returned to his room. His head hurt and he felt dizzy as if he had too much to drink. Upon regaining his focus, he found his entire body soaked in cold sweat.", "A chill crept up his back. His breathing seemed normal on the surface, but his heart kept pounding. His throat felt so dry and clammy that he thought it might crack into pieces at any second. He pulled out a two-liter bottle of water and drank from it non-stop.", "His Adam's apple danced up and down for a long time. Seol drank almost half of the bottle in one go, then forced his shaking legs to move. Soon, he fell on top of the bed.", "Only then, this sensation of returning alive from the abyss came washing over him. Honestly speaking, had he ever felt this enervated since the Tutorial began?", "Tok, tok…", "He heard someone knocking on the door and raised his head, but then, decided not to care and dropped his head back down the sheets. He didn't feel like talking to anyone at the moment.", "The knocking continued for a while, but when there was no response, it stopped.", "Seol just lay there and wordlessly stared at the ceiling. The checkered pattern on the ceiling above seemed to be spinning in his view.", "How much time went by?", "The thick and enduring silence continued on. Seol's fearful and shocked eyes slowly closed until only a sliver remained open.", "'Did I place too much blind faith in my ability?'", "The parchment was glowing yellow. He thought he could definitely clear the mission given his previous experience with Kang Seok.", "'Or was I too careless?'", "It wasn’t that he thought it would be a walk in the park. He knew it would be very dangerous. He simply thought that he could handle the risk.", "'Maybe, I was too relaxed…'", "But didn't he make preparations? He checked each spell ball and even divided them into possible combinations….", "Seol thought up to here, and then….", "'Was I too hasty….?'", "….He completely closed his eyes shut.", "The more he tried to analyze his actions, the more foolish he looked to himself.", "At least, he had successfully completed the mission. Or, more correctly, he could only manage to barely clear it. The wrong choices he made came back to bite him in the ass and he nearly lost his life. Actually, being able to return alive and in one piece was a miracle in itself already.", "His 'Nine Eyes' didn't lie. When he thought about it carefully, that mission was on the level where he could have cleared it if he was being very careful. He even had in possession the necessary answer to clear the mission, too.", "What would've happened if he pulled the Mirror of Understanding out the moment he got there? Whether it was a Deceased or a skeleton, they both were undead, so why couldn't he think of this obvious similarity beforehand?", "Or, what would've happened if he came up with different types of spell ball combinations?", "Only by relying on that pathetically small level of experience of killing the Gaekgwi, he went and picked the Poison Fog as his first line of attack out of the ten spell balls in his possession. Meanwhile, he didn't even stop to consider just what kind of location he might find himself in after the teleportation.", "In the end, his mind was to blame. He pretended to be not relaxed. He pretended to be not overconfident. His mind, his greed, blinded him with the need to amass the Survival Points as quickly as possible.", "At a bare minimum, he wouldn't have acted this complacent back during the Tutorial.", "'….No, that's not right, is it?'", "Even back then, was there anything he did with his own power?", "More and more questions naturally reared their ugly heads as Seol was pulled along by this chain of logic.", "When he chased away the Gaekgwi at the assembly hall, was that through his own power? Or, when he broke past the second mission full of traps alone?", "They were both due to his 'Future Vision' ability. He didn't even know how to activate that thing right now. And more importantly, it wasn't as if Seol made the conscious choice to act. He was simply overwhelmed by the emotions at the time.", "And when he killed the Gaekgwi?", "That was only possible because of the absolute safety the safe zone provided.", "What about when he earned the highest amount of points during the Tutorial, then? That was all thanks to the diary of an unknown student.", "Most likely, he had become too cocky. As soon as he stepped into the assembly hall, he got recognized as the holder of the hallowed Gold Mark and everyone was super respectful of him. Everyone tried to follow after his footsteps and some even worshipped him. Even the smallest things he did garnered so much attention. They all said that he was someone very special.", "He must've been enjoying all this attention, this acknowledgment of his being, even though outwardly he denied it, did not want it, didn't even like it….", "[2. Traits]", "1. Temperament:—Weak-willed. (Possesses a weak will, thus unable to make decisions alone nor sticks to ones already made)—Short-tempered.", "2. Aptitude:—Average. (Normal in every way; possesses no particular talent or qualities)", "[3. Physical Level]", "Strength: Low (Low)Endurance: Low (Extreme)Agility: Low (Intermediate)Stamina: Low (Low)Magic: Intermediate (High)Luck: Intermediate (High)", "Remaining Ability Points: 0", "In reality, he was weak. If one took away this and that, then he had nothing and was nothing.", "He already knew what happened to him the moment he lost his ability. He knew so well what kind of useless wastrel he was, yet…. Also, wasn't he given so much more this time? Besides his own supernatural ability?", "“You stupid son of a bitch….”", "He found it hard to endure this sense of shame.", "Seol stood right back up and gripped the water bottle the other way, then he poured the water over his head. The cooling liquid rained down from his head, rushed past his face and wetted his upper torso. This was him mocking himself. He told himself, ‘you find yourself in a such a favorable position, so much better than compared to other people, yet is this all you can do?’", "Even after the bottle emptied, Seol remained standing there with his eyes closed. He focused on every drop of water falling from the tips of his hair. When he did this for a long time, that whirlwind of boiling emotions deep inside the pit of his stomach began to cool down just a tad.", "Only then did he reopen his eyes.", "“Fuuuu…..”", "The light of greed was completely gone from his eyes now and the original glow returned.", "'This can't go on.'", "He began reflecting from the very beginning, a detail by every small detail. Not just when he started doing the missions, but the moment he stepped foot inside the Neutral Zone.", "'Why am I so hung up on getting the Ambrosia?'", "His obsession started the moment when Maria handed over the pamphlet…. No, that wasn't quite right. He knew the existence of the VIP store even before he got here.", "[Maybe you might be able to use the VIP store….]", "….The Guide, Han.", "When Seol recalled Han's face, he also remembered something he'd forgotten until now. Why did that guy choose that time to whisper those words to Seol? Why did he go out of his way to mention the VIP store in the first place?", "The water drops still fell from Seol as he moved to grab the bag. He flung it open and rummaged through the contents until he found three neatly-folded pieces of paper inside.", "He picked one up and cautiously unfolded it."]}