{"cid": "51", "title": "Chapter 51. Forest of Denial (1)", "content": ["The place Samuel led the group to was none other than the inn Alex introduced to Seol Jihu.", "When they climbed past the floor he stayed the night before and went up to the third floor, Seol Jihu got a huge shock after he saw the three individuals waiting for them.", "“Hugo?”", "“Huh? Seol?!”", "Hugo also showed a similar reaction. Chohong's eyes went round as she spat out a surprised groan herself, and meanwhile, Dylan let off a wry chuckle as he crossed his arms.", "“Oh my god, I had no idea we'd meet each other again less than an hour later.”", "“They were searching for a porter when I was in the pub, so I applied right away.”", "A bitter smile floated up on Seol Jihu's face. He recalled Dylan's advice from earlier on.", "“What's this? You know the folks from Carpe Diem already?”", "“Well, something like that. Let's say that we know who each other are.”", "“Huh, this fella.”", "After hearing Dylan's reply, Samuel took a sweeping look at Seol Jihu with a renewed interest.", "“Nothing we can do but take it as a trick of fate, I guess.”", "Dylan raised his hands up in defeat.", "“In any case, time is gold. We'd like to hear that delicious deal of yours right away, if possible.”", "“Hehe. Gimme some time to start cooking, will you? However, I'm sure you can pick up on the delicious scent already, yeah?”", "Samuel joked for a bit and dragged a big table to the middle of the room. He then spread out a map on it.", "While the crowd gathered around it, Seol Jihu stayed in the corner, unmoving. He wondered whether a porter like himself was even allowed to butt in here.", "“Hey, you. What are you doing?”", "Chohong looked at Seol and pointed at the table with her chin.", "“Hurry up. The meeting's about to get started.”", "She even took a step to her side and opened up a spot, too. When Seol stood next to her, Hugo began giggling hoarsely.", "“Whenever she owes someone an apology, she suddenly becomes considerate to that person. It would be simpler to say sorry once, to be honest.”", "Keuk. The tip of Chohong's nose reddened slightly, but she kept her mouth shut as Samuel began his explanation while pointing at a spot on the map.", "“Since I know how you guys are like, I'll make my explanation as brief as possible. Our starting point will be the south gate. From there, we will use carriages to travel along the Rahman River for a day or two.”", "Samuel's finger traveled along the river as marked on the map.", "“This road is comparably safe, so we'll travel as quickly as we can on this part of the journey. We need to conserve our stamina for what's to come anyway. If we don't run into any unexpected incident, we should safely disembark around here. We’ll then go over the Napal Hill….”", "His finger stopped by the image of a huge, sprawling forest.", "“The Forest of Denial. This is our destination. Most likely, we will have to go past the entrance and carry on until some sort of an interruption halts our progress.”", "The moment he heard the words 'Forest of Denial', Dylan's complexion hardened, but he didn't say anything. Samuel licked his lips and formed a confident smile.", "“I've heard this information from a very reliable source. Apparently, there is a pretty sizeable tomb within the Forest of Denial.”", "“A tomb, you say?”", "“That's right. And no, it's not your regular tomb, either. There is a very good chance that it's a tomb related to the ruined Empire.”", "“Are you suggesting that we raid the tomb and loot the grave goods?”", "“Exactly! If it's true, then we might be able to acquire amazing artifacts for ourselves!”", "Dylan rubbed his chin in contemplation.", "“I was wondering why we were going so far down south, but I see now. It's plausible. This place is indeed within the old Empire’s territory.”", "“It's not only that. You know that Sicilia has put up a mission of scouting the Forest of Denial, right?”", "“I'm aware of it, yes.”", "“There is also that mission from the royal family to consider too! If everything goes smoothly as planned, we will be able to receive rewards from three sources!”", "“Okay. I see what you're trying to say here, Samuel.”", "Dylan calmed down Samuel as the latter began jumping up and down in excitement.", "'So, this is how an expedition is arranged.'", "Seol Jihu had been listening in very attentively as he didn't want to miss out on a single thing, but now, he was feeling somewhat confused.", "This sounded like a tempting offer. Unless nobody else access to this information, he found it rather suspicious that no one had conquered this Forest of Denial, seeing that it was no more than four, five days of travel from Haramark.", "In other words, there must have been some kind of a problem to worry about.", "Dylan took his time to deliberate before raising his voice.", "“There are three things I want to ask you about, Samuel.”", "“Go ahead.”", "“This information…. Who else knows about this, besides us?”", "“Let me be honest here. I went to speak to Kahn's team first before calling you. They refused though. Still, they will definitely keep it as a secret.”", "Dylan nodded his head.", "“Fine. Then, can you tell me the identity of this reliable source?”", "“When are you going to ask me for what my countermeasure for the Forest of Denial is?”", "The corner of Samuel's lips arched up. Dylan was taken aback before a wry smile formed on his face.", "“Well, aren't you a surprising one. Ever since Chief Priest Rebecca barely managed to return alive from that place, I was thinking that Forest of Denial is pretty much impossible to tread.”", "“From the get-go, their method of approach was all wrong. The Forest of Denial isn't about curses. No, it's magic.”", "“Magic?”", "“That's right. You have to counter magic with magic, but Rebecca failed because she relied on divinity. Well, we should still give her credit for walking out of that place alive.”", "Samuel spoke up with a certain amount of confidence before taking a cautious look around him. It was as if he was being very careful of making sure that there was no one listening in on them.", "“Dylan? I'll answer the last two questions in one go. The person who told me about the tomb is none other than Master Ian.”", "At this declaration, the trio of Dylan, Chohong, and Hugo displayed a bit of shock.", "“Master Ian?”", "“That's right! Not only that, he's planning to join us on the expedition himself!”", "“Hmm. Hmm….”", "Inwardly, Dylan hadn't been too sure of it until then. But now, he was slowly tapping on the table with his fingertip. Seol Jihu lightly poked the side of Hugo as the big guy's mouth bobbed up and down like a goldfish.", "“Hugo.”", "“Uh, uhm?”", "“Who is this Ian?”", "“What, how do you not know…. Oh, wait. It's your first time here.”", "Hugo began whispering to Seol as if he understood the youth's plight.", "“Master Ian is a Level 4 Alchemist. He's a skilled Magician who is close to becoming a High Ranker.”", "Only then did the youth more or less understand. No matter which class it was, reaching Level 4 afforded some amount of acclaim. And if that person also had the rarest class of a Magician, then it was clear how valued he would be.", "Dylan finally opened his mouth to speak.", "“So we’re not scouting the Forest of Denial but going on an expedition. But since we're nominally scouting the area, we don't even have to apply for the expedition licence, is that it?”", "“Fufufu. It's a really delicious deal, don't you think so?”", "“I agree. I'm already salivating at the prospect.”", "Samuel began stamping on the floor with his feet as if he couldn't wait anymore, causing Dylan to form a toothy grin as well.", "“Good. What about the finer details?”", "“Don't be like that. You know how I operate. I'll take the lead and guide you forward, but you take over during the battles. As for the loot, they will first go to the person whose class is most compatible with it. If the suitable classes overlap, then the higher level person gets it. Other than that, the reward will be distributed equally.”", "Samuel recited everything as if he had memorized already.", "“Excellent.”", "As soon as Dylan agreed, Samuel turned his head to look at the others.", "“What about you two?”", "“Do you even need to ask? The decision's been made already.”", "“I agree!”", "Chohong agreed disinterestedly, while Hugo was very energetic.", "Samuel formed a satisfied grin and shifted his gaze over to Seol Jihu.", "“Friend! I take it that you’re also okay with this?”", "“Oh, I'm…..”", "Seol Jihu stopped himself from speaking further.", "Inwardly, he definitely wanted to be a part of this expedition. However, didn't he promise Kim Hannah that he would not go any further south than Haramark?", "Sensing his hesitation, Samuel's eyes opened up wider.", "“Hey, is there a problem? This isn't an exploration, you know. It's an expedition parading around as an official mission. I'm sure that you'll earn a crap ton of experience points by accompanying us.”", "“The Forest of Denial is pretty close to the frontier, so won't it be dangerous?”", "Seol Jihu pointed this out, causing Samuel to let off a soft chuckle.", "“Aha. That is true. However, you don't have to worry about that one! Technically, you could say that the Forest of Denial is on the border of the human territory, but actually, that place is much closer to a neutral zone more than anything else. The magic cast over the forest is so strong that not only us humans but pretty much all the other species don't even think about getting close to it.”", "Samuel explained it at length, before clenching his fist tightly.", "“However, we're different. We have Dylan, who is a High Ranker, and the Magician Master Ian. That ancient magic cast over the forest or whatever? We're going to break it apart, for sure.”", "Rather than placing his trust in those words, Seol Jihu activated his Nine Eyes instead. Samuel was still devoid of any colors.", "“So, how about it? You're coming, right?”", "A short deliberation later, Seol nodded his head.", "“Yes, I will.”", "“Okay!!”", "Samuel slapped the table's surface and stood up.", "“We depart tomorrow! Let us meet up by the south gate early in the morning!”", "*", "The morning dawned.", "Seol Jihu woke and lightly washed up, before hurriedly putting on his gear. Now that he thought about it, his sense of time had become a bit blurry ever since he started his life in Paradise. Since there was no clock here, it couldn't be helped, but still, it was pretty tough to figure out when this 'early in the morning' for their meeting would actually be.", "He picked up his bag and left the inn. He then headed straight to the South gate via the route he memorized yesterday.", "He was unsure until then, but his fears turned out to be true. Nine people were already waiting for him by the gate. Thinking that he was late, Seol ran with almost everything he had before Samuel noticed him and waved his hand at the youth.", "“Woah, woah! Calm down, calm down! You are not late, so you don't have to rush like that.”", "“Oh. That’s how it was.”", "“Master Ian hasn't arrived yet, you see.”", "Samuel lightly tapped on Seol's shoulder before going ‘Oops’ and handed over a pretty large bag.", "“This is the luggage you'll be in charge of. Please look after it. We might encounter big trouble later on if you somehow misplace it.”", "“Is this all?”", "“Yeah. We also hired two other porters, you see. They are local residents, so you don't have to worry too much about them.”", "Seol Jihu nodded his head, easily picked the luggage up, and slung it over his other shoulder. He felt its weight, but it wasn't heavy enough to impede him. Meanwhile, Samuel stared at the youth with a slightly dazed expression.", "“I-Isn't it heavy?”", "“Not really, no.”", "“Hoh…. As expected, I was right to trust Alex's judgement.”", "While Samuel was sagely nodding to himself, Seol Jihu took a look around his surroundings. Near the gate, he saw two carriages, members of Carpe Diem, as well as Samuel's team.", "If there were some things different from yesterday, then that would be how they were kitted out today.", "Seol Jihu had already seen Hugo's large battle axe and the hefty armor during their journey to Haramark. Samuel in front of him looked rather cool with a brightly-colored studded leather jacket on him, as well as a blue cape extending down to his waistline.", "Dylan was supposed to be an Archer, but he was decked out in a coat-style brigandine that Warriors should be wearing. The way it softly reflected silver light under the morning sun's glare, the armor couldn't have been a simple item, either.", "By the time Seol Jihu noticed the coldly gleaming longsword and the silver buckler as wielded by Grace, he couldn't help but feel that his own equipment looked a lot shoddier in comparison.", "It was as Cinzia had said before; the gap in quality between the Neutral Zone and Paradise was noticeably wide, without a doubt.", "'One day, I will….'", "The youth made up his mind to raise his level, get himself better equipment, and jump in among these amazing individuals as soon as he could. It was then, Chohong walked over to where he was. Her outfit was so unique that Seol Jihu couldn't help but do a double take.", "She wore a white robe similar to Alex's, but there was a layer of chain mail on top of that. Also, her chest, arms, and legs were all covered in layers of metallic protection as well. It was a somewhat complex arrangement of equipment, to say the least.", "'Is she a Priest or a Warrior?'", "Chohong didn't even take a second glance at the confused Seol Jihu and tapped on Samuel's shoulder.", "“So, when is that pervert coming?”", "“Uh-huh. What do mean, 'pervert'? You should watch what you say in front of Master Ian.”", "“It doesn't matter, does it? He's not here yet, anyway.”", "“Well, I wonder about that.”", "Samuel grinned refreshingly and began waving his hand around. Seol Jihu followed his line of sight and spotted a man walking towards the group from afar.", "His height was about average, his physique on the lean side. His hair wasn't completely ash-white, but much closer to salt-and-pepper. Seeing all those wrinkles near his eyes, he must've been way past the forties and well into the fifties.", "Most importantly though, the long, long white beard that extended down to his navel reminded the youth of a certain wizard from a famous movie franchise.", "“Oi~ii!”", "The man wearing an ivory-white robe waved around his hand carrying a wooden staff with its slightly bent tip. This man was none other than Ian.", "“You've come, Master Ian.”", "Samuel greeted the Magician with a clean-cut bow.", "“Sorry, sorry. I got held up slightly. Been a while since I've been in Haramark, and the streets felt so refreshingly open, you see.”", "“Well, I hear you. I've been to the royal palace a few times myself, so I know how stuffy that place can be.”", "“Very true. If it weren't for the princess's appearance, I'd have died from stuffiness.”", "“Ah~. You mean, that prim princess, yes?”", "Ian began chuckling as he chatted to Samuel. Seol Jihu had formed something of a general impression on the older man from the story he heard yesterday, but today, he couldn't help but think that Ian's easy-going personality came across as slightly more friendlier than expected.", "“In any case, let's depart. If I stay here any longer, the royal family might try to hunt me down. They have been persuading me to change my mind right until this morning, you see.”", "“Oopsie daisy. That definitely won't do. Shall we get going right away, then?”", "“Should I get on that carriage over there?”", "“Yes. Oh, and by the way….”", "Just as Samuel spotted Seol Jihu and hesitated slightly, Chohong grabbed the youth's arm and spoke up.", "“This kid is riding with us.”", "“Oh, that should be fine.”", "Samuel nodded his head. Ian smiled brightly as soon as finding Chohong, though.", "“Oh~, Chohong! It's been too long. You look good as always.”", "“Shut up, you perverted geezer.”", "Chohong raised her mace and growled in a threatening manner, before spinning on her heels. Seol Jihu was helplessly dragged away by her and ended up climbing aboard the Carpe Diem's carriage.", "And shortly afterwards….", "“Let's go!”", "Along with Samuel's shout, two carriages slowly departed from the South gate.", "It was the beginning of Seol Jihu's first expedition.", "*", "The inside of the carriage was silent.", "Dylan said he wanted to feel the passing breeze on his face and climbed up to the roof; Chohong only stared outside ever since the trip got on the way. Meanwhile, Hugo was grinning like a fool for some reason on the side.", "Chohong then suddenly spat out a lengthy groan and began rummaging through her inner pockets, before a frown formed on her face. A cuss leaked out from her lips next. Seol Jihu had been watching her quietly until then, and pulled out a packet of cigarettes out before pushing it to her.", "“Here.”", "“Eh?”", "Chohong blinked several times before her head creakily turned towards him.", "“No… I'm fine. I don't like those flavored cigarettes….”", "“If you don't like the flavor, you can avoid it by not breaking the capsule inside the filter.”", "“….R, really?”", "Hmm, hmm. Chohong faked a cough and took one cigarette out of the pack. Right away, Hugo covered his eyes and began laughing out loudly. He grasped Seol Jihu's shoulder and spoke.", "“Seol, you gotta be more understanding here. She'd been living a hard life until now, so when she's on the receiving end of a nice treatment, she becomes all shy like that.”", "“Shut up, Hugo.”", "Chohong shot him down and began puffing on the cigarette while complaining.", "“I'm surprised, though. You don't look like a smoker.”", "“I'm a chain smoker, actually.”", "“That's nothing to be proud about. In any case, thanks. By the way, why did you look like you stepped on shit back then?”", "'I did what?'", "It kinda felt like that she was trying to change the subject, but still, he shrugged his shoulders and replied.", "“Well, it's…. I was just looking at everyone's equipment. They all looked pretty cool to me.”", "“But, your own stuff isn't so bad, either.”", "Chohong rested her chin and primly narrowed her eyes.", "“Isn't that boiled leather armor? That's the best one available among the leather armors, isn't it? I see that you also wear a chain mail underneath too, although that's rare. A bit cheap looking, but you got all the important parts covered up, too. And your spear looks good too.”", "“Really?”", "“Yeah, really. Didn't you see Clara? Your equipment is many times better than hers, especially that spear. I think you can use that right up to Level 3 if you maintain it well.”", "“Pu, puhaha~hahaha!!”", "As soon as Chohong was done with her speech, Hugo began laughing his head off again. She began gritting her teeth.", "“Why are you laughing? Did you forget your brain or something?”", "“Hey, you. Why don't you just say that you're sorry? It's just one word, but is it that difficult for you? Do you have any idea how funny you look from the side?”", "“What are you talking about? I'm just telling him what I see.”", "“My~ ass. It must be really tough on you to sound so considerate to someone, right? What with your personality and all.”", "Chohong's eyes became blurry, and madness began to settle in.", "“There's something I'm curious about, though.”", "It looked like a fight might break out if things were left as it was, so Seol Jihu hurriedly intervened.", "“What is Miss Chohong's class?”", "Kyyaachk! Chohong suddenly cried out loudly and stood up from her seat. She rushed to Seol Jihu and grabbed his shoulders before yanking him closer. The cigarettes in their mouths nearly touched and he flinched from the sudden closeness.", "“Hey…. I was just gonna to endure it, but I gotta ask you for a favor. Can't you do something about the way you speak?”", "“The way I speak?”", "“That's right!! It'll be fine if it's just me, okay? Please, please speak informally, okay? Calling me Miss Chohong?! I’d prefer Fucking Chohong! You're creeping me out, you know!!”", "Seol Jihu had no idea why she hated it so much, but it wasn't really a difficult favor.", "“Okay, I will.”", "Chohong returned to her seat only after that. She formed an expression that said she'd finally be able to survive now.", "“Fuwooo….. Ah, right. My class? It's 'Divine Champion'. I'm Level 4.”", "“Divine Champion?”", "“Yeah. You start from Level 1 Priest, then at Level 2, Combat Nun. Then, at Level 3, Holy Warrior.”", "“You gave up on the path of a Priest?”", "“There's a reason for that, though.”", "Hugo suddenly butted in there.", "“You see, this girl's starting Mana stat was pretty high. I hear that she could have been a Magician, even.”", "Seol Jihu was surprised by that revelation. The minimum requirement for becoming a Magician was to have the Mana stat at Intermediate (High) or higher. Of course, both the personality and the talent had to be there, too.", "“She was far too unrefined to become a Magician. Gods were apparently unhappy about the missed opportunity and decided to make her a Priest. But even then, the gods have made a big mistake.”", "“A mistake?”", "“Yup, a mistake. I'm sure you've basically figured it out after seeing her walk the path of a Warrior even though she's supposed to be a Priest, right?”", "“Hugo, I told you to shut up. This is your final warning.”", "Chohong began glaring at the big man. However, Hugo didn't even pay her any mind and simply tapped on his head with his finger.", "“You see, even the gods had no idea that this girl was completely soft in the head! And with that rough personality of hers, never mind being a Magician, you think being a Priest suits her? Ah? Puhahahaha!”", "Hugo threw his head back and began guffawing again. It was right at this moment that Chohong, with her nails all ready to attack, pounced on him.", "The carriage rocked hard, so much so that Dylan on the roof enjoying the breeze nearly fell off from there.", "“Dylan!! Dylan!!”", "Dylan could hear someone desperately calling for him from the carriage, but he just quietly gathered his hands together and murmured.", "“Sorry, rookie.”"]}