{"cid": "49", "title": "Chapter 49. Carpe Diem (1)", "content": ["—Carpe Diem is searching for a new member.", "There was a single line of text on the parchment and nothing else – not even an address. However, Seol still liked the fact that it seemingly didn't speak of any restrictions whatsoever.", "'Going there straight away is foolish.'", "It was always better to have plenty of information at hand.", "Seol Jihu left the plaza and began walking around without a destination in mind. He was thinking of walking into the first restaurant he spotted to take care of his brunch.", "As he looked around his surroundings, he eventually spotted a worn, shabby wooden signboard in the distance.", "'Eat, Drink And Enjoy.'", "Eat, drink, and enjoy. Alex said that this place was a multi-purpose pub yesterday. Hugo wanted to come here along with everyone, but Alex said no right away to the idea.", "'I guess the Synchronization doesn't translate signboards, huh.'", "Seol Jihu tilted his head slightly before heading straight to the pub.", "He pushed open the door with anticipation bubbling in his heart and was immediately greeted by the noises of people loudly talking to each other. At the same time, his nose was assaulted by the combined odor of cigarettes, booze, and sweat, as well as some other unidentifiable smell.", "When he stepped inside, he was faced with a tightly-packed 'saloon' that one might see in a movie set in the Wild West. People were sitting around round wooden tables, noisily chatting among themselves with booze in their hands, or whispering softly with serious looks on their faces.", "Seol Jihu stepped in and walked past the ash and cigarette butts on the floor, before his eyes nearly popped out of his sockets when a woman sped past him, her blonde hair dancing in the air as she did so.", "She wore the type of a brassiere that exposed over half of her abundant bosom, and not only that, a pair of pink stockings and the matching garter belt; and her swaying derrière was in full display through her see-through underwear.", "She wasn't the only one, though. He finally spotted many more ladies kitted out in just as shockingly revealing outfits walking around here and there in the pub.", "'….This was the meaning of ‘Enjoy’ in the name, huh.'", "He kind of understood what Alex meant when he said that this place wouldn't really suit Seol.", "'It's not like I don't like this, though.'", "He just wasn't used to it, that was all.", "A short while later, Seol finally found an empty spot by the corner of the bar, and he cautiously settled down there. It was perhaps obvious that he shouldn't really expect a speedy customer service in a place like this one.", "Seol Jihu spent some time observing the variety of beverage bottles on display on the shelves, before spotting a slightly-thin man resting his chin on his elbow on the far side of the bar. Seeing that the man was decked out like a bartender, he obviously worked here.", "“Excuse me.”", "“?”", "The man with a bored face and a cigarette hanging loose in his lips glanced back at Seol.", "“I'd like to ask you a couple of questions.”", "The man breathed out the cigarette smoke and slowly straightened his bent back. He then trudged closer to Seol and asked with half-closed eyes.", "“You want to order something?”", "Seol wasn't a dummy; he immediately figured out that the bartender was telling him to buy or order something if he wanted his questions to be answered.", "“What's good to eat here?”", "“A light meal or something more fulfilling?”", "“Something more fulfilling, please. Haven't had breakfast yet, you see.”", "The bartender opened his eyes a little wider.", "“How does a bowl of tasty soup, a loaf of soft bread, and a lightly spiced grilled sausage sound to you?”", "“Sounds good.”", "“Ah, right. We also serve a big serving of steak too.”", "“Give me that as well. Rare.”", "The bartender silently gazed at Seol. Seeing this, the youth produced a Silver coin and presented it before the man. Only then the bartender smiled amiably and returned 8 nickel coins as change.", "“Looks like I'll have to roll my sleeves up for the first time in a while. Wait here.”", "The bartender entered the kitchen, and soon, emerged with the bowl of soup and a large loaf of bread first.", "The old saying went that hunger was the best appetizer there was; the food tasted amazing. Seol Jihu finished the savory soup and the soft bread in the blink of an eye. The skewered sausage was overflowing with juicy fat, and when he bit into it, the succulent meaty taste exploded in his mouth.", "The bartender exited the kitchen while carrying the still-sizzling steak on top of a metal plate, before stopping still with a surprised expression on his face after seeing the youth busy licking his fingers in satisfaction.", "“Y, you seemed to enjoy the food.”", "“Yeah, they were really good. Give me that as well.”", "'…Was my cooking skill this good?'", "The bartender was taken aback by the sight of the youth unhesitantly cutting into the steak and shoving the meat into his mouth. He still managed to take a bottle of booze from the shelf, though.", "“This is on the house. Its alcohol percentage is low, but it's pretty sweet and should go well with the food.”", "Seol's mouth was full with meat so he could only nod his head as his thanks. He then grabbed the bottle and chugged the liquid down. A feeling of satisfaction filled him up as the thick aroma of raw honey melted on his tongue. Tasty food possessed this ability to enlighten the mood no matter the occasion.", "“First time seeing you in Haramark.”", "The bartender asked, his expression more relaxed than before.", "“I arrived yesterday. It's my first time in the city.”", "“From Scheherazade?”", "“Yes, that's correct.”", "“Aha. Oh, right. You said you wanted to ask me some questions, right?”", "Seol Jihu nodded his head and asked.", "“Is there any work to be found in Haramark? I don't mind whatever it is.”", "“Hmm, I wonder? If you're not talking about part-time jobs, then…. How about visiting the plaza? There should be quite a few jobs listed on the noticeboard.”", "“I was there just now, but there weren't a lot of jobs I could take.”", "“In that case, you should start as a porter first. You go around together with others and get some experience, learn a few things from them, and eventually raise your levels and grab some proper gear along the way.”", "The bartender glanced at Seol's spear and continued on.", "“A Warrior’s gotta be at least Level 3 if he wants to try his luck joining an expedition. Well, unless you are in a team already, that is.”", "“So that's how it was.”", "“Ah, I remember now that Samuel's team was looking for a new member….”", "Seol Jihu played around with the booze bottle with his fingers a little before asking the bartender.", "“Do you perhaps know Carpe Diem?”", "“Mm? Carpe Diem?”", "The bartender's eyes widened slightly as if he didn't quite understand where this question was coming from.", "“Of course I know. If you don't who Carpe Diem is, then you'd be considered a spy from elsewhere in Haramark. I mean, aren't they the ones who live for today?”", "“?”", "'Carpe Diem' literally meant 'seize the day'; however, the bartender said that the 'group' lived for today.", "“What are they like?”", "“Mm…. Carpe Diem is a team made up of four, no, wait – three people. There’s no need to mention how skilled they are, of course. Even Sicilia and Triads would occasionally request them with missions. As a team, they would rank in the top five in Haramark, no question about it.”", "They were an amazing group of people, as it turned out. Haramark was a bustling, thriving city on its own right. So, if a group was ranked as one of the best in this city, it meant that even if the entire Paradise was taken into account, they would still be rated as one of the best.", "“Every member is known for their good skills, but most importantly, their leader is someone quite remarkable. He's a High Ranker, as you might expect.”", "“Where do I find Carpe Diem?”", "“Why? You wish to join them?”", "Seol Jihu nodded his head, prompting the bartender to shake his head around wildly.", "“Better give that notion up. That team is….”", "But, he blurred the ends of his words and spat out a soft groan, instead. The bartender then lowered his head slightly.", "“…Don't mind me. I'm not in a position to say anything, anyway.”", "The youth got to hear the location from the bartender. Saying thanks for the food, Seol got up and left the pub.", "*", "After leaving the pub and walking for around ten minutes, Seol found himself in front of his destination.", "There were no signboards. Seol thought the bartender's words of “An old white building, about so-so in size” was a pretty unfriendly description, but now that he was here, there was only one white building in the entire neighborhood.", "Seol got closer to the building and took a peek inside the ground floor before letting out a soft gasp of admiration.", "'A training facility?'", "He got to glimpse the sight of a gym that easily exceeded the one found in the Neutral Zone. The entire ground floor was converted to facilitate indoor training, it seemed.", "'I wanna get back to training again….'", "Seol heard that the second floor was the reception office, and sure enough, there were worn-down stone steps to the side of the structure.", "As he looked up, he continued to chew his blameless lower lip. As he approached ever closer to the steps, his heart began beating faster and faster.", "'Maybe I shouldn't have asked.'", "If he didn't know anything, then he might have marched straight in, full of spirit. No matter how hard he thought about it, there was no reason for this team to accept him. Even if he considered it from their perspective, the end result remained the same.", "He suddenly recalled Odelette Delphine, the Magician girl who always seemed full of too much energy. If she were in his shoes, would she be hesitating like this?", "'I mean, I'm not a little kid anymore.'", "It was obvious that he'd be refused, but he simply couldn't just let the lone 'Golden Commandment' opportunity slip through his fingers yet.", "He needed to at least give it a shot, regardless of what might happen.Seol ended his thoughts there and rapidly climbed up the stairs. He stared at the closed-shut second-floor door for a little while, before knocking on it.", "—Who's there?", "He heard a voice coming from inside.", "—Come in. The door's open.", "The voice sounded a bit less than enthusiastic, actually.", "Seol Jihu breathed in deeply and pushed the door open wide. And then, saw it.", "….The tilted face of a woman staring at him as she sat on an old, old couch with her back to him.", "“Who're you? I've never seen your face before.”", "Her skin was pure-white as if she'd painted herself with milk; her black hair was long enough to reach the floor. More importantly, though – her clean, pure and elegantly-shaped eyes, and a cigarette hanging loose between those softly-pink lips…..", "'Eh?'", "Seol's eyes blinked as he stood there completely dumbfounded. The woman with a cocked eyebrow began frowning deeply after seeing him behave like this.", "“I said, who the hell are you, you dumb shit?”", "She even started swearing right off the bat, too. The woman reminded Seol of Maria – should that be chalked down to him momentarily being confused?", "“Who is it?”", "Sounds of heavy footsteps could be heard, then a big black man suddenly showed up from around the corner.", "The big guy and Seol looked at each other and opened their mouths simultaneously.", "“Seol!”", "“Hugo?”", "Hugo must have emerged from the shower or something as water was still dripping off him.", "“You…. Ah, first, come on in!”", "Hugo gestured with his hands before actually pulling Seol Jihu inside. He then made the youth sit down on the couch. The woman looked at him while puffing out cigarette smoke.", "“What, so you two know each other?”", "“I told you yesterday, didn't I? There was a guy I came to Haramark with.”", "“Wasn’t that Alex?”", "“Not just Alex. I told you there was another guy.”", "“Hmm…” The woman nodded and swept her gaze over Seol, before letting out a small “Ahh!”", "“Is he that newbie you were talking about? Coming to Haramark for the first time?”", "Hugo ignored the woman and talked to Seol instead.", "“Seol, what brings you here? I'm really surprised to see you here, you know?”", "“Yes, me too. I had no idea that you were a member of Carpe Diem, Hugo.”", "‘Hiiik~!’ A rather adorable scream came from the side. The woman hugged herself with her arms and formed a scared expression as if something horrified her.", "“Uuuu~ Hey you. Can't you do something about the way you speak? It's been so long since I last heard polite speech and it's giving me these nasty goosebumps.”", "“….Ignore that girl. Besides all that. What brings you here?”", "“…Oh.”", "Seol glanced at the woman who was wearing a sleeveless white T as well as a pair of hot pants and started talking.", "“I came here after finding the notice for a job posting.”", "“A job posting?”", "Hugo's eyes grew extra-wide, and he turned his head to look at the woman.", "“Did we ever place a job posting before?”", "The woman shrugged her shoulders.", "“Beats me. But I did hear that, what with the old man retiring and all, we would search for a substitute.”", "“Who told you that?”", "“Don't be an idiot. Who do you think it was? It was Dylan, obviously…. Anyways.”", "The woman killed her cigarette by rubbing it against the ashtray and disinterestedly told Hugo.", "“Hugo? You ask him to leave, okay~?”", "“You want him to leave?”", "“Obviously. How can he enter our team? We ain't gonna humor a newbie, right?”", "As expected, joining them was not possible. Seol thought as much, but the reality still tasted bitter in his mouth.", "The woman lit up a new cigarette and cocked an eyebrow. She saw that Hugo was deliberating on something with a serious look on his face. It was a rare thing to see this idiot whose brain was entirely made up of muscles to think this hard.", "Just as Seol Jihu was about to get up from the couch, Hugo reached out and grabbed the youth's arms.", "“Wait, wait. You came here after checking out the job posting, right? Then, wait for a little while longer, okay?”", "His next words surprised the woman even more.", "“What?! Hey! You want to admit a Level 1 to our team?!”", "“Keep quiet, will you? Hey, Seol, our leader should be here any second, so can you wait for him? I'll put in some good words for you.”", "“Hah!”", "The woman spat out an exasperated groan of disbelief.", "It was then. The door creaked open, and….", "“Mm? A customer?”", "Seol heard a deep, husky, and rather dignified voice coming from there.", "Seol Jihu turned his head towards the doorway and spat out a shocked gasp at the sight of the man entering the premises.", "He was a darkish man carrying a brown envelope in his hand, and he also happened to boast an enormous physique. He was taller than Hugo by another head, and his body, packed to the brim with muscles, could have come straight from an NBA player.", "A devil would show up if it was mentioned, as they say. Hugo raised his hand and welcomed the man in.", "“Oh, good timing, Dylan!”", "“Who is he? A client?”", "“A Level 1 Warrior saw one of our job postings and came to pay us a visit~.”", "The woman spoke with a tired voice while resting her chin on her hands.", "“A Level 1?”", "Dylan tilted his head in confusion.", "“Job postings…. Hmm. I must have posted those a while ago.”", "Dylan studied the youth in front of his eyes with unfathomably deep eyes. Seol Jihu began feeling a strange sense of pressure as the man swept his gaze all over him.", "'He is… a High Ranker Archer?’", "He looked more like a Warrior simply from his physique alone.", "Dylan spoke up soon afterwards.", "“Well, it doesn't matter.”", "The woman looked like she'd been punched in her gut as she faced Dylan.", "“You being serious?”", "“Yeah, I am. It's true that we're looking for a new team member, and I haven't placed any restrictions on who may join us. That is why it's not a problem.”", "“….Hey. I know that you're the leader and all. But still, aren't you supposed to listen to other's opinions too?”", "“We just have to 'look' at the person, That's all. The old man personally said those words, Chohong.”", "With that, the woman named Chohong shut her mouth. She still frowned unhappily while puffing on her cigarette though.", "“Tsk. Do what you want. Besides that, what happened to the job?”", "“I can't even call it a job, actually. I just popped into the Triads for a bit, that's all.”", "“I heard that they just welcomed a new executive there.”", "“Right. I checked him out, so I could remember his face. His name is Hao Win. He's a pretty friendly character.”", "Dylan toothily grinned.", "'Hao Win?'", "When a familiar name was mentioned, Seol's eyes glittered for a second.", "'Hao Win is also in Haramark?'", "“In that case…. Ah. Where's my mind at, I wonder.”", "Dylan was about to settle down on another couch, before he hurriedly got back up again.", "A bit later, Dylan reappeared from around a corner while carrying a pair of teacups with steam rising up. He handed one over to Seol and grinned.", "“A guest came by, but I've forgotten all about being a good host. My apologies.”", "“No, it's alright. Thank you.”", "Seol Jihu carefully received the cup. Dylan sipped the tea first, and a frown formed on his face.", "“Don't mind it if the tea tastes a bit bland, okay? I've been practicing making tea lately, but I can't seem to get any better.”", "Seol smiled softly at Dylan's gentle voice. The youth sensed the other man was trying to be considerate, basically telling him to relax.", "“Oi, Dylan.”", "Hugo was about to butt in, but Dylan raised his hand to stop him.", "“I've heard a bit about you from Hugo. You must be Seol, the Level 1 Warrior. First time in Haramark, huh?”", "“That's correct.”", "“Summoned March this year, yeah?”", "“That's also correct.”", "“Oh, so you might know Hao Win then. He too graduated from the March class, apparently.”", "Finally, they moved into the main topic. Seol thought that he'd be chased out of this place, but it seemed like they would at least listen to his story first.", "Could this be thanks to Hugo? Seol Jihu inwardly promised to buy the man a drink at a later stage and stared straight at Dylan.", "“Okay, Seol. Do you know what kind of a team ours is?”", "“I've heard some things.”", "“From where? From who?”", "“From 'Eat, Drink And Enjoy'. I didn't ask the person's name, so I can't be sure.”", "Dylan nodded his head. The youth didn't just show up with no plan whatsoever, but actually bothered to gather some basic information first. Considering that he had exited from the Neutral Zone not too long ago, this would've been considered a positive. At least, it said that the youth was the type to think things through.", "“Cool. Well, then. How were your records in the Tutorial and the Neutral Zone like?”", "“My records?”", "“Well, you can tell us the amount of Survival Points you got at the end of the Tutorial, and up to how far you went with the mission's difficulty in the Neutral Zone, that sort of stuff.”", "Dylan raised his teacup, signaling to the youth to relax and be open.", "Seol Jihu spoke up.", "“The total amount of Survival Points I earned at the end of the Tutorial was 26,500.”", "Dylan was about to tip the cup towards his lips, but….", "“As for the missions in the Neutral Zone, I've cleared up to the Impossible difficulty.”", "….His hands came to a stop.", "Hugo's nervously jittery legs also stopped shaking around.", "It wasn't only those two, though.", "Even Chohong, who was grandly yawning out while covering her mouth with her hand until then, began glaring at him, too."]}