{"cid": "338", "title": "Chapter 338. Freeze, World! (2)", "content": ["Same time.", "A woman and two men were looking down at the battlefield from a mountain ridge.", "The woman, wearing a thick coat, was the Star of Sloth, Taciana Cinzia.", "And the two men next to her were each the Star of Pride and the Star of Wrath.", "“Iya~! That’s a pretty sweet first attack!”", "A burly man carrying a greatsword on his back, the Executor of Ira, could not hide his astonishment.", "The cavalry led by Teresa was one-sidedly slaughtering the corpse army.", "However, Cinzia was apathetic as she chewed on the cigarette in her mouth.", "While it was true that the cavalry was on the winning end, at the end of the day, the enemy was only the corpse army, the cannon fodder of the Parasites.", "The enemy’s main force had yet to make a move.", "“I doubt the Parasites will stay still…”", "Thinking the same as Cinzia, the Star of Pride gazed at the enemy camp attentively.", "At that moment, the three Executors noticed a change.", "The holographic image in the sky was swaying greatly. Within the undulating screen, the Parasite Queen was shouting something while shaking.", "They couldn’t hear her due to being so far away, but judging from her appearance…", "“What? She’s angry?”", "The Star of Wrath spoke with widened eyes.", "However, this was only the start of the change.", "Immediately after they saw the Parasite Queen’s rage, the enemy’s movements fell into disarray. No, should he say the Parasites became urgent?", "“The Nests are throbbing at a faster rate. The mother species are also reproducing twice as fast as before.”", "The Executor of Superbia, the god overseeing the Archer class, quickly relayed the situation.", "“It looks like they’re going to start an all-out war…”", "Soon, his prediction was proven to be spot on.", "“The Army Commanders are coming!”", "With the undead army of Unsightly Humility leading the way, a total of four Army Commanders began to move.", "The burly man’s jaw dropped.", "The Succubus and Banshee army flew up simultaneously, and beneath them, Blood Golems chased after the Death Knights with loud thumps.", "Not to mention, all sorts of parasites dashed out of the Parasites’ camp.", "Just like he said, the Parasites were starting an all-out attack.", "“Isn’t this… strange?”", "While the burly man was at a loss for words, the Star of Pride furrowed his brows.", "“Even with the three of us here, the Parasites should still have the advantage. I doubt the Parasite Queen is oblivious to this.”", "He then glanced sideways.", "“So why is she suddenly like this?”", "“…Who knows?”", "Cinzia pulled out the cigarette in her mouth and let out a long puff of smoke.", "“Maybe she’s grown tired of playing house and is planning on ending this once and for all.”", "Even as she spoke dismissively, she turned her gaze and looked down at the paper in her left hand.", "It was then.", "“Uuuuuhh!!”", "The burly man screamed.", "Unsightly Humility’s army was about to clash with humanity’s well-aligned cavalry.", "Then…", "“They passed through!?”", "Without pouncing on the cavalry, they instantly turned translucent and phased through them.", "Fluidization. It was one of Unsightly Humility’s Authorities— being able to turn his army into a state between liquid and gas.", "Because of this, the second round of boomerang blades fired under Arbor Muto’s command missed, and the cavalrymen, who were determined to die fighting, were left in the dirt.", "That wasn’t all. Vulgar Chastity and Exploding Patience’s armies also passed by humanity’s reinforcements. Even the Blood Golems took a roundabout way to avoid the human army.", "The confused cavalry tried to stop the Parasites’ advance, but they had no choice but to watch the Parasite army leave as they were attacked immediately by the parasites that flew in after them.", "The main armies that had passed by the cavalry only had one destination — Tigol Fortress.", "Cinzia’s eyes narrowed. Looking at the Parasites’ decision in an isolated space, it wasn’t all that strange.", "But just like what the Star of Pride said, their sudden change in tactics was something to question.", "“Uh…”", "The burly man blinked rapidly.", "“Is this the end?”", "He didn’t know how many Thunders were left in the fortress, but there was a good chance that he was correct.", "The earlier battle had left the Federation’s forces weakened and battered. While it was true that hundreds of Nests were supporting the attacking parasites and corpse army, the Federation could only barely hold their ground against them.", "There was simply no way they could last against the simultaneous all-out attack of the four Army Commanders’ armies.", "Not unless the World Tree came back to life this instant.", "And thus, Tigol Fortress fell into a perilous situation once again.", "The silently watching Cinzia slowly raised her left hand.", "Observatio Vitae, a contract that reveals the life of its pledger.", "The contract that Teresa gave her was in a pitiful state. There wasn’t a single moment where it wasn’t burning hot. There were multiple instances where Cinzia was worried it would burn out completely.", "The smoldering paper had burned away until it reached the size of a thumb. But since then, it had returned to its original clean appearance, no longer burning.", "If Seol Jihu had died, this contract would have become a handful of ash. The fact that it recovered revealed that he was safe.", "And so, it wasn’t all that difficult to piece together what must have happened in the Spirit Realm.", "“Hmm….”", "The sudden change in the Parasites’ actions and the recovery of the contract were more than enough evidence.", "The Parasite Queen was enraged, and the Parasites started an all-out attack. The four Army Commanders also led their armies to the battlefield, even passing by the human reinforcements as if they didn’t exist.", "It was almost as if they were chased on time.", "In such a situation, what significance would the contract returning to its original appearance represent? The answer was obvious.", "“….”", "Of course, there was currently no reason for Cinzia to participate in the war.", "The condition for her joining the war had yet to be confirmed. In other words, the World Tree had not revived.", "However, Cinzia was no fool. She had more than enough insight to know what would happen to the Federation and then humanity once Tigol Fortress fell.", "She also knew what position the Federation and humanity would hold if the World Tree revived and they successfully defeated the Parasites.", "And thus, Cinzia realized that she was at a crossroads of extreme significance.", "Although it might not overturn the general trend, she was struck with the premonition that her choice would affect it greatly.", "“Ha.”", "And the moment this thought crossed her mind, she couldn’t help but laugh.", "The fact that she had this thought showed that she saw a sliver of hope in this situation. The progress of the war had changed her previous thought, ‘It won’t matter even if I join the war.’", "[I just wanted you to know…]", "Suddenly recalling what Teresa said to her, Cinzia grinned.", "[That is the only hope we have left.]", "Whether it be the only hope or the final chance, she acknowledged it in the end.", "“Well… I guess I was looking forward to it ever since I let Agnes go.”", "Cinzia smacked her lips and put the folded contract into her pocket. Then, she spoke.", "“I have a question.”", "The two Executors turned to her simultaneously.", "“Suppose you’re playing a card game and you’re about to lose. But if you hold out just a bit, you’re guaranteed to get the card that will reverse the situation. What would you do?”", "“What?”", "“Will you give up? Or wait just a little longer?”", "“…I don’t know why you’re asking us that, but I would wait.”", "“I see. I thought as much.”", "The Star of Pride replied casually at the sudden question. On the other hand, the burly man furrowed his brows.", "“What are you talking about? What are you gonna do about that?”", "“What am I gonna do?”", "Cinzia smirked and twirled her left index finger.", "“Isn’t it obvious?”", "Then, she quickly chanted a spell.", "The two Executors, who blinked their eyes in confusion, quickly did a double-take and turned their gazes up.", "An enormous magic circle was forming above Cinzia’s head.", "Of course, it was on top of their heads as well.", "The Star of Pride muttered in shock.", "“You…!”", "Cinzia shrugged and spoke.", "“I’ll explain later.”", "At the same time, the magic circle spun and descended on the three Executors.", "Teleportation was activated.", "**", "Unsightly Humility charged forward.", "From the moment he set out as the vanguard, he ignored all else and only rushed forward.", "The creeping apprehension in the corner of his heart refused to disappear.", "What Exploding Patience said was not wrong. The Parasite Queen was not emotional in making her decisions. She must have had a reason for urging the capture of the fortress.", "Worried that this reason was related to that frightening demon, Unsightly Humility steeled his resolve.", "The Parasite Queen possessed an indomitable personality and always made cool-headed assessments of the situation.", "She was especially like so in war.", "If she did not see a chance of victory, she would have ordered them to retreat without a moment of hesitation. The fact that she ordered an all-out attack meant that they still had a chance.", "Once his thoughts reached this point, Unsightly Humility emptied his mind completely.", "From this point onward, there was only one thing he needed to do.", "He was approaching the fortress wall.", "There was no need to break it.", "He could simply phase through it.", "Then, he’d climb up to the command post, and—", "“Hmm?”", "It was then.", "With only about a hundred meters left to the fortress gate, a magic circle suddenly appeared in front of him. At the same time, the circle instantaneously multiplied to several hundred.", "Before Unsightly Humility could do anything about it, Battle Maidens shot up from each magic circle. They instantly got into a formation and simultaneously rushed toward Unsightly Humility!", "“!”", "The greatly astonished Unsightly Humility swung his longsword in a hurry.", "Although he fended off a couple of the Valkyries flying at him, soon he had no choice but to pull the reins of his mount as the Death Knights that clashed with the Battle Maidens all fell down or were knocked backward.", "Hearing the cries of the spectral horses ringing out in his surroundings, Unsightly Humility looked straight ahead.", "He then shut his mouth, seeing the woman standing in front of the gate, adorning a thick coat.", "“…I did not think you were so foolish.”", "Pretending to be calm, Unsightly Humility clattered his teeth.", "“Do you truly believe stopping me at this point will accomplish anything?”", "“Would I be here if I didn’t?”", "As Cinzia retorted glibly, Unsightly Humility fixed his grip on his longsword.", "“How arrogant of you. Did you forget about your pitiful defeat in the valley war?”", "“How could I?”", "“I don’t see your Servant from back then either… I wonder where your confidence is coming from.”", "“It’s not like I didn’t bring her on purpose. She just can’t be here right now.”", "Smiling blandly, Cinzia called the Valkyries and got into a formation again.", "“Well, I’m thankful that you’re worried about my intelligence. But it isn’t as if I’m lacking in learning ability.”", "Unsightly Humility flinched just as he was about to rush forward. It was because Cinzia raised her arms and pointed left and right.", "Immediately afterward, two men landed on the ground next to her.", "It was the Star of Pride and the Star of Wrath.", "“I figured I wasn’t enough, so I called these two over… What do you think? Is this enough to satisfy you?”", "Cinzia winked and then revealed her teeth in a grin.", "“…Damn it, you better give a proper explanation later, Taciana Cinzia.”", "The young man wearing a hat gritted his teeth and nocked a chained arrow to his bow.", "“Well… I’m sure a woman as calculating as you, has a good reason.”", "The burly man also had a slightly dumbstruck expression, but he soon pulled out the greatsword on his back.", "“….”", "Clack, clack, clack. The clattering of teeth rang out once again.", "“…There are other Army Commanders as well.”", "Although he spoke calmly, his expression slowly darkened.", "For some reason, the gears that should be turning in perfect sync seemed to be twisting out of place at every important moment.", "“You’re too late!”", "Tang! Gabriel slammed down on the fortress wall as she looked down.", "She was in conflict watching Unsightly Humility relentlessly charging forth. Just as she was about to explode from frustration at the Executors’ refusal to act, they finally made a move.", "She let out the breath she had been holding in as she saw them appear in front of the fortress wall, but the feeling of relief only lasted a moment.", "Soon, she opened her eyes sharply and looked up at the sky.", "Unsightly Humility might have stopped, but he wasn’t the only Army Commander present.", "Abhorrent Charity was following closely behind him, and more importantly, Vulgar Chastity and Exploding Patience were unhindered as they flew across the sky.", "The only silver lining in this situation was that they could use the few remaining Thunders for an aerial interception.", "And so, just as she was about to order the attack, a Sky Fairy rushed up to her.", "“U-Urgent news!”", "“What is it!?”", "Gabriel reacted temperamentally from being on the edge.", "The Sky Fairy winced but soon continued with a clear voice.", "“Humanity’s troops have arrived at the rear gate of the fortress! There are hundreds of soldiers, and a person proclaiming to be the queen of Eva has requested to be let in!”", "“…What?”", "Gabriel’s voice softened slightly.", "The Sky Fairy quickly wrapped up her explanation as Gabriel knit her brows.", "“She’ll carry… what in?”", "**", "“There we go.”", "Roselle suddenly spoke as she looked up at the sky.", "Eun Yuri, who was sitting cross-legged in meditation, opened her eyes.", "“Really, Teacher?”", "“Yes, I’m positive.”", "Roselle pointed up at the sky.", "“Look. The star that turned red from the invasion is regaining its blue hue.”", "Eun Yuri nodded her head in a daze.", "“It isn’t easy for a dead star to come back to life.”", "Roselle smiled brightly.", "“Regaining its light in such a splendid fashion can only mean that the World Tree grew to adulthood and regained control of the Spirit Realm. The Spirits must have recovered their strength and come back to life by now.”", "Eun Yuri’s complexion brightened.", "“Then!”", "“All that’s remaining is connecting to the Middle World.”", "Roselle shook her head, unable to hide her admiration.", "“Incredible. Truly incredible. To think they’d really succeed…”", "Then, she suddenly tilted her head.", "“But it’s strange. Given the situation you described, it should have been near impossible to achieve. Not unless the Parasites did something completely brainless…”", "It wasn’t as if Roselle didn’t have questions, but success was still a success.", "With this, the conditions that were out of their control were all met.", "All that remained was for them to do what was within their control.", "Taking her eyes off of the sky, Roselle looked back at Eun Yuri. She had already gotten up and was collecting her breath.", "“Yuri, your body and the stele—”", "“They should have arrived at Tigol Fortress by now.”", "“Charlotte must have done a good job.”", "Roselle stretched.", "“Great. This teacher will make contact with the World Tree. You should go back and prepare.”", "“…Yes!”", "“Don’t be too nervous. Just do as you learned, and this teacher will take care of the rest. Fufu.”", "With a soft laugh, Roselle’s eyes turned hazy.", "“I’m looking forward to it~ You see, my competitive spirit has been burning since I heard about them. I wanted to fight and see just how strong they are…”", "“….”", "“Fufu, that’s not all. Those sons of bitches destroyed the revenge plan I prepared for hundreds of years—! Hehehehe!”", "Her eyes flashed as she cackled sinisterly.", "Eun Yuri shrunk back but also nodded. At least for today, Roselle’s madness-filled eyes felt incredibly reliable.", "“Oh my, pardon my language. My true feelings came out, hoho.”", "Roselle snapped out of her momentary madness and gave a ladylike laugh.", "She then raised her hands as she stared at the anxiously standing Eun Yuri.", "“Now then.”", "As her two hands came together in a quick clap, Roselle gave a cute wink.", "“See you in the Middle World!”", "Then.", "Chak!", "The moment she clapped—", "“…!”", "Eun Yuri’s eyes shot open."]}