{"cid": "124", "title": "Chapter 124. Seol Jihu", "content": ["By the time people found out about the incident, the Plaza of Sacrifice had already spat out six corpses.", "The perpetrator and mastermind had to be the slick-haired man, as he and five others were nowhere to be seen. It was later found out that he had approached low-level participants offering to join hands. Clearly, he had subdued them and forced them into the pit before running away by using the Plaza of the Dissonant Wish.", "The number of remaining participants diminished from 128 to 116.", "However, the problem wasn’t with the number of people left. The aforementioned incident, in which the strong had sacrificed the weak, had enough influence on the participants to temporarily stop all talks of beating the Stage’s system.", "After all, it was proven that another method existed to escape Stage 2.", "The minority didn’t stay still either. They gathered together and remained on high alert, clearly refusing to become scapegoats.", "When Seol Jihu saw the minority representative from the first conference walking around and uniting people, he felt relieved inwardly. Like the saying, ‘united we stand, divided we fall’, if the weak gathered their forces, the strong shouldn’t be able to touch them so easily.", "However, that way of thinking was too naive.", "Members of the majority faction and the minority faction were all human beings. No matter how careful they were, an opportunity could be made artificially.", "Furthermore, not all strong were evil, and not all weak were kind.", "It wasn’t until late that night that Seol Jihu came to realize this truth.", "*", "People made their camps as far away from the pit as possible. This was because the two plazas were only 10 meters away from each other. If someone managed to throw six people into the Plaza of Sacrifice, escaping through the Plaza of the Dissonant Wish was practically guaranteed. And there wasn’t a single person present who didn’t realize this.", "Seol Jihu got to witness the second attempt by pure coincidence.", "After remembering the white-headband girl, who gave him valuable advice during Stage 1, he went out to look for her in hopes that she could do the same.", "Since he couldn’t see her among the majority, he walked towards the minority. It was then…. He suddenly felt a strange current in the air. To be precise, he smelled a sticky, unpleasant odor that seemed to drain the energy from his body.", "Soon, he heard muffled groans coming out from the campsite of the minority faction. He had a hunch that an incident similar to that of the evening was unfolding.", "Noticing that the surroundings were eerily quiet, Seol Jihu chose to run towards the pit rather than look around the campsite. Wishing in his heart that he wasn’t late, he ran at full speed.", "Things were exactly as he expected.", "Seol Jihu caught sight of six shadowy figures in the distance. One or two people standing in the front seemed to be throwing something into the pit.", "Then, when he spotted a white headband amidst the darkness, he followed his instincts - activating the Festina Earring and throwing a Mana Spear.", "“Uuup!”", "“Hurry…! Fuck! Are you sure she inhaled the incense?”", "“Uuuuup!”", "“I, I am. She was next to the injured one….”", "A man was busy trying to block the girl’s mouth; seemingly worried that noise would leak out and expose them. But in the next moment, he scowled harshly.", "“Eii!”", "Puk! The man punched the girl’s stomach with his giant fist and turned around when he sensed a murderous intent. Seeing a spear of mana flying toward him, he reflexively moved his head.", "A sharp sensation brushed past his nose, and the terrifying gale that followed made his expression distort.", "“Fuck! Hurry and throw her in!”", "Seeing a shadow charging towards him at lightning speed, the man passed the girl over to his comrade and took a battle stance. Seeing a blue spear thrusting straight at him, he swung his blunt weapon in full force.", "CLANG!", "Along with the ringing of metallic sound, the man’s eyes widened. He was confident in his abilities and had fully intended to send the spear flying, but instead ended up almost letting go of his weapon.", "When his eyes met the attacker’s sharp, gleaming eyes, his body froze automatically. He took a small breath to drive the fear away and clenched his teeth. But the figure refused to move, even after he put enough strength to bulge up the veins on his muscles.", "‘H-How can such a skinny guy…!’", "“Uuuuuk!”", "‘H-He’s not a low-level Earthling.’", "Seol Jihu also grasped the situation. Judging by the pressure he was feeling in his hands and the equipment the man was wearing, he guessed that the man was at least a Level 4.", "‘The minority faction should have been on guard, so how?’", "He couldn’t help but wonder how the man sneaked into their camp. However, he didn’t have time to be worrying about that at the moment.", "“Help!”", "“Fucking bitch! Just go in there already!”", "“Ak! Aaaaak!”", "The man requesting for help and the girl’s desperate, screaming voice mixed together to torment Seol Jihu’s ears.", "Without hesitation, Seol Jihu utilized his full strength.", "“U-Uhhh?”", "After hastily rousing his mana and striking the man’s blunt weapon up, he swung his spear in an almost twisting maneuver and smashed the man’s head. As the man collapsed helplessly, he could see a girl chest-deep in the pit, hanging by the skin of her teeth using both of her arms. Next to her, he spotted another man furiously stomping on the girl’s hands.", "Pang! Completely enraged, Seol Jihu activated the Festina Earring again. At the same time, the grass the girl was clutching onto was pulled out.", "“Yes! I—”", "Thwack! He kicked the rejoicing man away, and immediately, Seol Jihu’s jaw dropped open.", "He saw the man’s face. He was wondering who was committing such heinous acts in the wake of night, and he turned out to the representative of the minority faction, who made an impassioned speech during the conference.", "He couldn’t believe that the perpetrator was within the minority faction, and their leader to boot. However, that moment of disbelief only lasted a second.", "Seol Jihu quickly bent down and reached his hand into the pit. He couldn’t tell whether he grabbed onto the girl’s hair or some other part, but thankfully, he was able to grab onto something meaty.", "Worried that the door would close, he quickly pulled her up.", "“Keeeeu!”", "Suddenly, a massive, muscular arm shot up. The moment it grabbed onto the earth, a giant climbed up from the pit in a swimming fashion. He was carrying the white headband girl on his shoulder.", "‘He is….’", "In a fluster, Seol Jihu remembered that the giant was the man who last reached the mountaintop in Stage 1. It seemed he had been thrown into the pit unconscious but had woken up and climbed out.", "He glanced at Seol Jihu before spitting out a rough breath.", "“Those damned sons of bitches….” A hate-filled voice similar to a ghost’s cry flowed out. “They dare… to use… a sleeping incense…?”", "His eyes were bloodshot, either from the drugs or from his rage. Regardless, he was viciously glaring at the collapsed man as if he was ready to tear him to shreds.", "Then, he staggered a bit before carefully placing the girl down.", "“KUAAAAAA!” He bellowed like a wounded beast. His roar resonated throughout the entire field.", "That wasn’t the end of the trouble. For the Plaza of the Dissonant Wish to open, six people needed to enter the Plaza of Sacrifice. Since the pit came to lack two people, there was no way the Plaza of the Dissonant Wish would open.", "Soon, people who noticed the uproar came out like a swarm of bees. The perpetrators behind the attack were left with nowhere to run.", "Everyone who fell into the pit was rescued. The six perpetrators were then killed by the enraged crowd.", "With no way to stop the killing, the number of participants fell to 110.", "This second failed attempt ended up pouring oil onto a burning house. It was shocking enough that only a few hours had passed since the first successful attempt, but the fact that the perpetrator was the representative of the minority faction came as an even bigger shock.", "Who would have imagined that the man who fought against the strong for the benefit of the weak would give in to such temptation?", "Now, an almost irreparable crack formed among the minority.", "*", "Seol Jihu opened his closed eyes.", "“It’s my fault….” The girl raised her head slightly and muttered in a quiet voice.", "In Seol Jihu’s eyes, the girl was just a human being. Seeing her eyes moist with tears and her reddened cheeks, he felt sorry about relying on her one-sidedly.", "“Oppa got hurt trying to save me….”", "The giant and the girl were brother and sister. Although they looked nothing alike, Seol Jihu wasn’t so insensitive as to bring that up.", "The man was already in a sorry state after Stage 1, but apparently, he had fought while protecting his younger sister during the battle against the Lioners and ended up worsening his injuries.", "To recover, he had fallen asleep after taking a healing potion, and the perpetrators had apparently used this opportunity to spread the sleeping incense and bring them to the Plaza of Sacrifice.", "“If it weren’t for me….” The girl sniveled, unable to continue talking. Seol Jihu placed his hand on the girl’s frail shoulder.", "“No.”", "In that instant, the girl flinched for some reason. Her head began to tremble.", "“It’s not your fault, nor is it your brother’s.” When he continued calmly, her shaking began to subside. “It was just that those six were despicable criminals.”", "The girl sniffled and asked as she looked up at him, “Oppa will be okay… right?”", "“Of course.” Seol Jihu got on his knee and smiled gently. “I requested a High Ranker Priest to treat him, so he will recover in no time.”", "Seemingly consoled by the young man’s kind words, she burst into tears and threw herself into his embrace. Seol Jihu gently patted the girl’s back and let out a small sigh.", "Just what was the Banquet? He couldn’t understand why it was given a welcoming name like ‘banquet’ in the first place. Wouldn’t it be more appropriate to call it ‘a living hell’?", "Seol Jihu activated his Nine Eyes while consoling the sobbing girl. The two pits in the distance were still glistening in a golden light.", "‘Why?’", "He could understand why the Plaza of the Dissonant Wish would be gold. However, he just couldn’t wrap his head around the Plaza of Sacrifice being gold.", "Why wasn’t such a dirty, dangerous place shining in the color of danger?", "Did the Nine Eyes not judge it to be dangerous? Or… was there something encompassing this Stage 2 that went beyond any level of danger?", "He couldn’t rule out the former, but he was strongly leaning toward the latter.", "He had a feeling — that perhaps his Nine Eyes were overlooking the entire Banquet from the very beginning.", "Seol Jihu stared at the Plaza of Sacrifice vacantly.", "‘Right.’", "There had to be a reason. A reason it was appearing as the Golden Commandment.", "*", "The hourglass stopped after the first successful battle and did not move again.", "The remaining participants were happy at first, thinking they escaped being forced to make their move. But looking back, the stopping of the hourglass provided more leisure, and that leisure mutated into betrayal and tyranny, creating widespread distrust.", "This was easy to see by looking at the minority faction.", "There was no group more disingenuous and double-faceted than this one. Its members stayed together due to necessity, but what they were thinking on the inside had to differ from how they were acting on the outside.", "Time was flowing by meaninglessly. Cooperation was necessary to conquer the Stage, but the notion was completely out of the picture with how much the atmosphere had deteriorated.", "What was important to the people wasn’t conquering the Stage, but survival.", "Seol Jihu smoked one cigarette after the other. He tasted nothing but bitterness in his mouth. Although it was a little, he even felt a sense of shame.", "‘I couldn’t do anything again.’", "When he first entered Stage 2, he was full of spirit. He vowed to do something, to show a better side of him, even if only a little.", "But now that he faced reality, he was repeating the same thing he did in Stage 1.", "Of course, Seol Jihu knew he wasn’t anywhere near enough to take on the role of a leader in this place.", "Unlike Stage 1, Stage 2 was targeted for all participants. Naturally, there were many who vastly surpassed him in strength, intelligence, and leadership. Even some High Rankers couldn’t speak out casually, having to look for the right timing.", "As a mere Level 3 Warrior, Seol Jihu had no choice but to stay put.", "‘But….’", "Was being a spectator on the sidelines the right choice? He didn’t do anything that would make him feel guilty, but he was afraid of how this result would return to him.", "After all, this was the Golden Commandment. And in Stage 1, he had personally watched and experienced how the Golden Rule functioned.", "This fear made his heart beat faster. All of his senses were telling him that he couldn’t let things be like flowing water, and that he needed to change its course no matter what.", "This wasn’t such a baseless hunch.", "Only 110 people remained. It was lacking, in a sense, but he felt that this was the line of no return.", "Assuming that everyone joined hands, he could see a way out just barely. But if the number of participants decreased even a little… then conquering the Plaza of Sacrifice would become impossible.", "Since the number of remaining people was decreasing by the day, he no longer had any time to waste. He couldn’t think of any bright idea, but it wasn’t as if he was completely in the dark. A way out had to exist.", "In truth, this was something that everyone present knew, not just Seol Jihu. It was just that no one was stepping up. Knowing that reaching this way out would be extremely difficult and full of obstacles, they had simply given up.", "Seol Jihu had been the same. The situation had already been twisted so much, and with the interpersonal chasm becoming wider by the hour, just thinking about where to begin gave him a headache.", "“Haa….” He sighed yet again. No matter how many times he thought about the matter, doing it alone seemed impossible.", "Thankfully, Seol Jihu wasn’t alone. He had comrades he trusted.", "[What’s wrong about using something you’ve built up fair and square?]", "He was suddenly reminded of Kazuki’s words.", "‘I can do it. No, I have to do it.’", "Seol Jihu took a deep breath and walked forward.", "*", "“Hm?” Kazuki looked surprised by the sudden visitor.", "“Mister Kazuki.”", "“?”", "“What is your plan from now on?”", "“I don’t know.” Kazuki readily raised the white flag hearing the abrupt question. “Several incidents broke out before anything could be done…. This Stage is likely the hardest the Banquet’s second Stage has ever been. I can’t even begin to think about how to go about it.”", "Kazuki looked a little embarrassed. Of course, it wasn’t his fault that things had turned out like this, but he couldn’t help but feel frustrated inside.", "“I do think we need to hold another conference.”", "“Will we come to a decision?”", "“…No.” Kazuki shook his head and smacked his lips before abruptly widening his eyes. He sensed something out of place from the young man in front of him. Seol Jihu’s expression was strangely sunken in.", "He didn’t have his usual bright, playful face. His expression was… hard to read. The way he looked almost entranced, Kazuki felt he was looking at a different person.", "‘Could it be?’ Kazuki’s eyes flickered with light.", "“Do you have a good idea?” He asked feeling hopeful. However…", "“The good ideas all went out the window,” Seol Jihu replied coldly.", "“…I guess you’re right.” Kazuki folded his arms and rubbed his chin.", "The way and method of doing something naturally changed depending on the situation. What Seol Jihu was saying was that they had already lost the opportune moment to make the ideal move.", "“A method that fits this situation….”", "“There is only one.”", "Kazuki stared at the young man fixedly, and Seol Jihu started talking.", "Once the young man finished his explanation, Kazuki fell into deep thought.", "“Now that’s surprising. I didn’t think you would choose such a straightforward approach.”", "“It’s not like I can always think of good, unique ideas.”", "“No, that’s not what I meant.” Kazuki shook his hand. “I agree with you. That is the only way. I think everyone knows that.”", "“Right.”", "“But they’re keeping it in their heads,” Kazuki spoke calmly.", "“The majority faction isn’t sitting still because they don’t know what needs to be done.”", "He hesitated for a moment before speaking with difficulty, “…It’s the same for me.”", "“….”", "“Even if everyone cooperates, Level 4s and Level 5s will need to stand in the frontlines of the battle. If we do as you say, each side will have to give up one thing that can’t be yielded…. The majority side will not accept an equal trade. They will voice their opposition without a doubt.”", "“I don’t think that’s necessarily the case.” Seol Jihu spoke, “In Stage 2, the relationship between the majority and the minority shouldn’t be parasitic.”", "“I know, but there is a definitive difference between those with a choice and those without.” Kazuki spoke bluntly. However, Seol Jihu couldn’t deny that it was true. “The minority faction is at a dead-end. Even if they disagree with your plan, they have no choice but to agree. But that’s not the case for us.”", "The light in Seol Jihu’s eyes grew fiercer.", "“I have a plan.”", "“…What is it?” Kazuki, who had maintained his calm the entire time, furrowed his brows.", "Seol Jihu opened his mouth, “I have a way of changing the apparent parasitism to symbiosis.”", "Kazuki was about to say something when he hurriedly closed his mouth. It was a known fact that having more people made conquering the Plaza of Sacrifice easier. However, the majority faction knew that there was no need to take the difficult way, when they knew it was easier to simply devour the minority forces.", "Seol Jihu saying this had to mean that he had a method of overturning this status quo.", "‘What could it be?’", "If such a thing really existed, it could turn the tables in one fell swoop.", "“Then why didn’t you….” Kazuki was about to say something when he saw Seol Jihu hesitating and realized why he had not said anything until now.", "“I can’t be sure,” Seol Jihu muttered. “But it’s worth confirming. Three or four times… no, once or twice is enough.”", "Seol Jihu emphasized his last point one more time, “Once or twice is enough.”", "“….”", "“Please help me.” His voice carried a sense of sincerity and conviction.", "Kazuki raised his hands and rubbed his face. After thinking for quite some time, he opened his mouth with an exhausted voice. “…We’ll have to persuade the minority first.”", "“Mister Kazuki.” Seol Jihu’s complexion brightened.", "“I’ll have to rethink my decision to cooperate with Carpe Diem next time. Every time I’m with you, it feels like I’m walking on a tightrope.” Kazuki smirked.", "Next…", "“Seol.” He suddenly turned serious. “I hate to say it again, but there will be opposition. You asked me because you expected as much, right?”", "“Yes.”", "“Then promise me one thing.” With an intense stare, he put more strength into his voice.", "“If you’re going to do it, do it properly.”", "Strength entered Seol Jihu’s eyes.", "“Now, it’s do or die. It’s unacceptable to half-ass things like in Stage 1.”", "“I know.”", "Kazuki looked surprised as if he hadn’t expected the young man to answer immediately.", "“I think I kind of get it.” Seol Jihu smiled faintly. “What you told me… about finding clothes that fit me.”", "“…Oh yeah?” He tilted his chin up slightly and examined the young man. He didn’t seem to be lying.", "“Then try it.” The corners of his mouth curled up.", "“I’ll set the stage for you.”"]}