{"cid": "187", "title": "Chapter 187. An Unexpected Change of Pace (2)", "content": ["“…I should have banned this topic too.”", "Phi Sora murmured with a bitter smile. She then heaved out a long sigh before nodding her head.", "“Alright, go ahead.”", "She agreed, much to Seol Jihu’s surprise.", "How should he start? It was a fairly sensitive topic, so Seol Jihu had some hesitations. In the end, he decided to reaffirm her future plans first.", "Her thoughts might have changed since the last time they talked. After all, some pretty significant incidents had taken place since then, and it had also been a while back since they had their talk. If this were the case, there was a chance Seol Jihu was worrying about nothing.", "He asked blatantly.", "“What’s the reason?”", "“?”", "“The reason that you’re staying with Carpe Diem.”", "Phi Sora retorted with a glum look.", "“Even though I never spelled it out, I thought I showed you more than a few times through my actions.”", "This likely meant her plans had not changed.", "“I just can’t understand why. Someone like you should easily be able to enter a bigger organization than Carpe Diem.”", "“That’s true.”", "Phi Sora agreed without sounding arrogant in any way.", "“But it will be hard to find a place with the same atmosphere as Carpe Diem. And to be honest, I think Carpe Diem is a good match for me.”", "“Good match?”", "“It’s not my style to enter an already established team and put my spoon in the utensil box. Dear, did you know that I entered Paradise as a Red Mark?”", "Seol Jihu nodded his head, remembering seeing this info in her Status Window.", "“You know how men are like, right? They always go on about how hard it was for them being in the army, but they also say it wasn’t so bad. I kind of understand what they mean. It was really hard when I first entered Paradise. Working like a dog, being scorned at like a slave…”", "Phi Sora smirked before putting her pinky in her glass and swirling it around.", "“I risked my life countless times and, in the end, I got everyone to shut up with my skills alone. That was surprisingly fun.”", "The word fun got on Seol Jihu’s nerves slightly, but he didn’t really pick a problem with it. After all, in a gaming environment there were people who enjoyed the process of reaching the max level rather than starting out at the max level and sweeping through everything.", "That was probably what she meant.", "“And in a way, I think I grabbed the perfect time to join the team.”", "“What do you mean?”", "“Don’t you get it? With you around, Carpe Diem’s potential for growth is infinite. There’s a chance it will become a massive organization that people wouldn’t be able to get in even if they wanted to.”", "Phi Sora took her pinky out and sucked on it.", "“I don’t know what you think about this, but I think I can offer a lot to the current Carpe Diem. And if I play a pivotal role in a team that’s just now starting out, I might be treated as a founding contributor in the future.”", "“Founding contributor?”", "“Yep. Unless I’m mistaken in my judgment of your character, you wouldn’t mistreat me when you eventually become the head of an organization that acts as one of the pillars of Paradise.”", "Phi Sora smiled as if just thinking about this made her happy.", "Seol Jihu couldn’t help but laugh at her honest confession.", "“Isn’t it too early to be dreaming of a rosy future?”", "“One can dream. I’m confident.”", "Well, her confidence was justified, given that she was the core member who grew the White Rose guild.", "Taking Phi Sora’s skills into account, Seol Jihu should be welcoming her with open arms. But there were a few things that stopped him from happily grabbing her hand.", "To be frank, Phi Sora, in Seol Jihu’s opinion, was an Earthling who was more suited to being a leader than an officer.", "“Can’t you just form your own team, Miss Phi Sora? With your experience, you have more competent—”", "“No.”", "But before he could even finish his sentence, Phi Sora waved her hand and denied it.", "“It’s not like I hate compliments, but I think you’re overestimating me. I know me. I’m not fit to be a leader.”", "She shook her head and continued.", "“Moreover, I won’t be leading anyone in that place ever again. Why? Because I don’t want to. Ever.”", "She reaffirmed her decision, emphasizing her point and even repeating the word ever twice.", "While Seol Jihu was taken aback by her unexpectedly intense denial, a hint of sorrow flit past Phi Sora’s face.", "Although it only lasted a split second, Seol Jihu did not miss this show of emotion and finally guessed what she was really feeling.", "‘A trauma.’", "Because of a single wrong choice, she had indirectly caused the deaths of the comrades she had shared joys and sorrows with. This must have changed her outlook somehow.", "Seol Jihu had mixed feelings, but he soon shook them off by shaking his head.", "He wanted to draw a strict line between his public and private life.", "Though it was hard to say he was making a good effort at that, he decided to tell Phi Sora the truth as well.", "“I know you told me not to talk about this topic, but let me say this. Thank you so much for participating in the war. I’m sincerely grateful.”", "“Thank you for saying that. I was worried you’d make fun of me since I was knocked out in one blow after boasting so much.”", "Seol Jihu shook his head. That was the furthest thing from his mind.", "The appearance of the Seven Armies was something no one had expected, and an Army Commander wasn’t any ordinary being.", "Seol Jihu had also heard that Phi Sora refused to rat him out until the very end, even though Undying Diligence promised not to kill her if she complied.", "In other words, she had been loyal as a comrade. Just like the saying, someone’s true nature can only be seen in extreme situations, Seol Jihu now saw Phi Sora in a different light.", "At the very least, she was a thousand times better than the bastard who shot his hand up and shouted to try and reveal his identity.", "“You ignored me at the Huge Stone Rocky Mountain too. Looks like it was worth risking my life.”", "…Well, her temper seemed to be the same though.", "Seol Jihu clicked his tongue inwardly, then spoke up.", "“The reason I wasn’t pleased with you then was due to Seol-Ah and Sungjin. As you can guess, the two of them don’t feel comfortable around you. They even fear you to a certain extent. I’m sure you know why.”", "“Yes, I do.”", "“Of course, considering Bok Jungsik and Miss Phi Sora’s relationship, I understand why you acted like that at the time. But only the reason, and nothing more.”", "At that moment, the shrugging Phi Sora’s eyebrows twitched slightly.", "“What’s important now is that this past political relationship can no longer affect the siblings. Because Carpe Diem doesn’t have factions.”", "“….”", "“I’d love it if Miss Phi Sora can get along with the Yi siblings, but… I know that isn’t something I can enforce. But I’m hoping the relationship will improve so that it won’t affect our future missions….”", "Seol Jihu examined Phi Sora’s facial expression as he talked. Up until this point, her face was a little stiff, but he didn’t catch any glaring changes.", "It was a rather positive reaction given her nickname, so Seol Jihu slowly continued what he was saying.", "“Since we’re talking about this….”", "He poured soju into his empty glass and continued.", "“What do you think about apologizing to them? In my opinion, Seol-Ah and Sungjin will accept your apology if you’re sincere about atoning for your actions.”", "Because he was preoccupied with something else, he couldn’t see Phi Sora’s eyes twisting into a frown momentarily.", "“If you’re worried about it, I can help too. They’re kind, so once I talk to them, I’m sure they’ll be—”", "Tak! The clang of a utensil being slammed down rang out.", "Seol Jihu, who was in the middle of tilting his glass of soju, looked up with blinking eyes.", "Phi Sora was staring at him with an enraged expression.", "“Miss Phi Sora?”", "“I just don’t understand it—”", "She complained immediately.", "“I mean, don’t fight, don’t argue, don’t purposely make them uncomfortable. I would have accepted those, but what? Apologize? Atone?”", "She suddenly began to bitch. Seol Jihu stared at Phi Sora with a dumbfounded look.", "“Fine, I’m the sinner. I committed a grave sin.”", "Seol Jihu narrowed his eyes.", "“…What did you say?”", "His tone got a notch deeper.", "“I said I committed a grave sin!”", "When Phi Sora yelled sharply, several gazes fell on her. Seol Jihu’s mood sank.", "“You’re talking like you don’t think you did anything wrong.”", "“No? When did I say that? All I’m asking is why I should be the one walking on eggshells!”", "“Funny. If you don’t like walking on eggshells, why did you make the Yi siblings do the same thing?”", "“Because they deserved it!”", "Phi Sora shot her eyes open and shouted defiantly.", "“Miss Phi Sora.”", "Seol Jihu furrowed his brows.", "“Do you not want to talk to me?”", "“You call this talking? It’s a one-sided command!”", "“What—”", "“I was going to hold it in, but I just can’t bear to hear it anymore.”", "Pew! Phi Sora spat out a sigh before starting her engine.", "“Those kids, they should be thankful all they had to do was walk on eggshells. Well, since you’re on their side, I’m sure you want to go ‘ooh~ my babies~’. But will you be able to act the same way if they’re complete strangers? I mean, have you ever thought about the matter from my perspective?”", "The reason Seol Jihu wasn’t saying anything back…", "[You’re praising her unceasingly. But can you say the same if you hadn’t known her?]", "…was because of what Jang Maldong had said to him in the past.", "“You said you understand why I acted that way? No, not at all. You don’t know a thing.”", "Seol Jihu reined in his own temper and crossed his arms.", "“Then what’s the reason?”", "“Reasonsss. There are too many to count.”", "Phi Sora took a short breath, crossed her arms just like Seol Jihu, then tilted her chin up arrogantly.", "“First of all, I didn’t like the fact that they were brought in by that Bok bastard.”", "“The girl could have come alone, but she insisted on bringing her younger brother along and made us use twice the necessary amount of contribution points.”", "“And, becoming a Level 2 in just three months? Aigooo~ With how much Bok Jungsik invested in her as White Rose’s future, only a retard wouldn’t reach Level 2 within that time.”"]}