{"cid": "171", "title": "Chapter 171. Dispirited", "content": ["[Don’t go too overboard and come back.]", "Suddenly, a somewhat imposing voice rang out in the air. The voice was screechy and bothersome, almost as if someone was talking with a microphone extremely close to the ear.", "“…Hmph.”", "Vulgar Chastity clicked her tongue unhappily but obediently turned back around. Before leaving, she waved her hand at Marcel Ghionea, who was gritting his teeth so hard that they might break at any moment.", "Seol Jihu watched Vulgar Chastity hastily fly away while feeling a terrible sense of helplessness.", "‘Impo… ssible…’", "Setting aside how unruly her actions were, he couldn’t even think to do anything even when the enemy was right in front of him.", "‘How…’", "His Intuition skill told him that the difference in their strength was like heaven and earth… no, like the universe and a speck of dust.", "‘How are we supposed to fight something like that…?’", "He couldn’t help but become dispirited.", "Was that a god who descended on earth? Or was it a being who had received the power of a divinity?", "Seol Jihu’s teeth clattered. And to hide this sound, he clenched his teeth hard.", "Unable to bear looking at her, Seol Jihu moved his instinctively dodging gaze to the front. There, he caught a glimpse of a figure sauntering forward from the Parasites’ central army.", "The figure draped in a black cape was well over two meters tall, but rather than burly, he looked willowy and slender.", "He looked like a noble from the Medieval Era, but his pale-blue skin and sharp ears that seemed to have been cut with scissors showed that he wasn’t human.", "And…", "[Fear and confusion…. These are the emotions I love.]", "So did the sharp blood-colored fangs that were visible when he opened his mouth.", "[But.]", "He stopped moving.", "[Humans.]", "One of the Royal Guards of the Parasite Queen and the leader of the Nosferatus– Undying Diligence– spoke in a solemn voice.", "[Do not be afraid.]", "He scanned the fortress with an arrogant gaze.", "[The reason we have come here today…]", "[Is not to drive humanity to extinction…]", "[Nor is it to conquer Haramark.]", "The voice calmly rang out.", "Seol Jihu doubted his ears. If they weren’t here to destroy humanity or conquer Haramark, what the hell were they here for?", "Undying Diligence spread his cape open as if to explain his words.", "[The Queen is magnanimous.]", "He raised his arms up high like he was extolling a deity.", "[And she is also merciful.]", "A thin, vaguely visible smile appeared on his face.", "[Hear me— Humans—! The Queen has commanded us to return quietly once we have achieved our goals!]", "Then, he crossed his arms and shrugged.", "[Well… we have to hurry back because of Tigol Fortress.]", "Teresa’s forehead wrinkled up. She looked completely baffled. It was surprising that the Seven Armies were initiating a conversation in the first place.", "“…He seems to be telling the truth, at least in part.”", "Ian muttered as he stared at the light fading away from a communication crystal.", "“The Federation has begun their operation to take back Tigol Fortress. Also….”", "His lips pursed before letting out a struggling mutter.", "“The Parasites seemed to have retreated from all of the cities other than Haramark.”", "“What did you say?”", "Teresa turned her head in shock.", "“Reports say that the Parasites’ armies retreated from the other cities in the direction of Tigol Fortress….”", "Teresa clutched her head. She had a difficult time processing these recent turn of events.", "With this news, it became clear why the Parasite Queen besieged the entire human territory.", "It was a show of force to prevent the cities from sending reinforcements.", "But… why?", "Why did they risk Tigol Fortress and send three of the five Parasite Armies that remained in the Material Realm here?", "It couldn’t be because of Arden Fortress. But no matter how hard she thought about it, Teresa couldn’t come up with an answer. In the end, she let out a curse.", "[One.]", "It was then that Undying Diligence raised his finger.", "[We only need one.]", "He raised his index finger high up into the sky for everyone to see.", "[Amongst you should be a human who recently began to make a name for himself.]", "Undying Diligence continued calmly.", "[If you hand over that person…]", "Teresa’s eyes abruptly widened to full circles as she listened in a daze.", "She subconsciously turned her head half-way before going ‘Ah’ and stopping.", "[We will go back quietly. I shall promise with my name.]", "The Parasites had finally revealed their intention.", "Mumble, mumble! The fortress grew loud in the blink of an eye.", "Chohong furrowed her brows.", "“What did that bastard just say?”", "“A human who recently began to make a name for himself…?”", "Phi Sora tilted her head before…", "“Ah.”", "Dropping her jaw.", "She wasn’t the only one who noticed. Soon, dozens of gazes fell onto one young man. Just as Undying Diligence was about to stealthily follow the humans’ gazes…", "“CUT THE BULLSHIT!”", "Teresa’s angry roar resounded.", "The gazes falling on the young man all turned to the princess.", "Undying Diligence smacked his lips.", "‘Whatever.’", "He couldn’t determine who the target was due to Teresa’s interference, but the humans’ reaction had revealed that the target was present.", "Of course, he could bring a mere fortress to ruin in ten minutes if he so wished. However…", "‘Should I shake them once more?’", "[Bullshit? Why do you refer to it as such?]", "Undying Diligence opened his mouth.", "[This offer is not a command, nor is it a request. It is a negotiation.]", "He emphasized the word ‘negotiation’.", "[Your safety will be guaranteed if you hand over just one person. How can there be a better condition?]", "Teresa wanted to shout something back, but Undying Diligence didn’t give her the chance.", "[Ah, of course, you might think that we are deceiving you. But think about this. Whether this one person exists or not, do you lot think we are asking because we cannot do anything?]", "When he added, “All because of a mere fortress?” Teresa looked speechless.", "[It might look similar~ But compared to Tigol Fortress, this is a toy~]", "Vulgar Chastity remarked mockingly.", "[I will say it again.]", "Undying Diligence raised his arms once again.", "[The Queen is magnanimous, merciful, and benevolent.]", "[Two chances are more than enough. We are busybodies. There will not be a third chance.]", "Undying Diligence openly admitted that Tigol Fortress was under attack. He was saying it in a roundabout way that another refusal would result in an all-out war.", "He even revealed confidence in being able to crush the humans with ease.", "Undying Diligence’s ultimatum turned the entire fortress dead silent.", "While everyone was waiting for someone else to break the silence, a bearded man carefully opened his mouth.", "“What… what other choice do we have?”", "“What did you say?”", "Teresa quickly turned around.", "When the man met her furious gaze, he flinched. However, he continued firmly.", "“I-Isn’t that right? Three of the Seven Armies are here. We’ll die if we fight and we’ll die if we run. Since these are the only options we have, wouldn’t it be better to sacrifice one person to….”", "He looked around as if to ask for assent.", "“Shut up.”", "Teresa spoke curtly, no longer able to bear to listen to him.", "The man grew angry.", "“W-What did you say!?”", "“I said shut your mouth. Our only options are what?”", "Teresa growled as if she was ready to brawl.", "And just as Seol Jihu was about to open his mouth, having detected the worsening atmosphere…", "“Just stay put.”", "Phi Sora quickly whispered to him.", "“That bastard— He’s looking at us.”", "She pretended to look around while stealthily moving in front of Seol Jihu and hiding him. She whispered silently.", "“Pretend to be looking too. Like them.”", "By them, she was referring to Chohong and Hugo. The two of them had been looking around the fortress wall since a while ago. The only difference between them and the rest was that their eyes clearly said ‘We’ll kill anyone who looks this way.’", "It was only then that Seol Jihu realized what they were doing and why Teresa had yelled so loudly to attract attention.", "“Absolutely not.”", "Ian also stepped up.", "“There is no guarantee that Undying Diligence will follow up on his promise. He is asking for a sacrifice using safety as bait.”", "“But Master Ian!”", "“Of course, they really might return quietly, and we might be able to breathe a sigh of relief and go back with our lives. But what then? Accepting the Parasites’ offer and sacrificing a fellow Earthling to make them retreat, while the Haramark Royal Family tolerates all of this. What do you think will happen to the Haramark Royal Family when this rumor spreads? Have you thought about this!?”", "Ian blurted out a flurry of words.", "“Sure, people might say it couldn’t be helped— but both Earthlings and Paradisians will lose faith in the royal family. Furthermore, we don’t know how the other royal families and the Seven Gods will think about such an action. Think carefully about how much of an adverse effect that decision will have on the future of the Haramark Royal Family.”", "The man seemed confused, but he quickly shook his head and protested again.", "“B-But… we have no choice! The Haramark Royal Family may face backlash, but people will understand! It’s the Seven Armies we’re talking about! And three of them are here!”", "“Young man.”", "“One person. We only have to sacrifice one person! Are you saying we should all die together!?”", "Now that his fuse had been lit, the man blabbered on.", "Ian’s eyes turned sharp.", "“If you insist, why don’t you volunteer yourself first?”", "“Huh? Why me? I’m—”", "“Didn’t you gloat about finding a ruin recently? You made quite a name yourself because of it.”", "“D-Don’t joke like that! It was just a single ruin!”", "“Like I said…”", "Ian’s tone went down a notch.", "“There is no guarantee that Undying Diligence will follow up on his promise. It’s likely that he will say we gave him the wrong guy and ask for another. Right, we’re facing the Seven Armies. Missing a person or two won’t affect the grand scheme of things, so go ahead. As the instigator, you should volunteer yourself first, no?”", "“That’s sophistry!”", "“Sophistry? Maybe it is. But as far as I’m concerned, if it works, it works. If it doesn’t, that’s fine too.”", "Ian shrugged.", "“Don’t you agree?”", "The man’s face grew as red as a tomato, but his mouth closed shut.", "“…Do not push onto others…”", "Ian spoke shamelessly with his eyes glaring straight at him.", "“What you cannot do yourself.”", "This final line was directed at everyone present.", "Only then did the sideway glances disappear one by one. But there was one thing not even Ian expected. The quivering and steaming man abruptly raised his hands into the air.", "“Undying Diligence! I will reveal the truth!”", "Ian flinched and immediately turned back to him.", "“He ishhhhik!”", "But he couldn’t finish his sentence. Marcel Ghionea had shot toward him like a bolt of lightning and slit his throat.", "“You crazy piece of shit.”", "He kicked the stomach of the man violently rolling on the ground coughing. Then, he raised the Laurel of Triumph he received from Seol Jihu and aimed it at the enemy outside the fortress wall.", "The groaning man’s eyes shot open.", "“Stop…!”", "Turururu! The sound of crossbow bolts firing rapidly resounded, making the man reaching out with his hand feel awkward.", "The man gritted his teeth and screamed, and none of the bolts managed to scratch even a hair on Undying Diligence’s body, but Marcel Ghionea didn’t stop attacking.", "Teresa didn’t stop him. When she caught sight of Vulgar Chastity, who was standing next to Undying Diligence with her hand over mouth and her shoulders shaking from cackling, Teresa’s eyes flared up.", "Soon, she unsheathed the silver longsword Seol Jihu had gifted her and shouted.", "“Blade Ballista! Load—!”", "Kiirik! Kiirik! The sound of a pulley spinning rang out.", "Undying Diligence quietly watched the situation unfold before heaving out a sigh.", "“The brains of these insects… even when we gave them a method of survival….”", "“Didn’t I tell you? That they’d be too proud of their tiny accomplishments to see the big picture.”", "Unsightly Humility giggled.", "Undying Diligence shook his head before cracking his neck and wrists.", "“I guess there is no other choice. If they want to die so much, I’ll grant their wish.\"", "“Let’s finish this quickly and return. If the Federation recaptures Tigol Fortress, we’ll have to conquer it all over again….”", "Unsightly Humility shuddered as though just thinking about it gave him the chills.", "Undying Diligence nodded his head in agreement.", "“I will entrust the lower half to you.”", "“No worries. I will charge to the fortress gate in one fell swoop.”", "With that, Unsightly Humility…", "[Ooooooooh!]", "…kicked his spectral horse and howled.", "His imposing command summoned the black-armored Death Knights that had been standing by in a line to howl back with piercing voices. Soon, with Unsightly Humility marching forward as the start, the army began to charge forward in the shape of an arrow.", "Terrifying rumbling shaking heaven and earth.", "Fierce vibrations akin to an earthquake.", "Facing the army rushing forward with enough force to split the valley in half, Teresa valiantly raised her longsword.", "“From the left! In order! Fire!”", "Tong, tong, tong, tong! Boomerang blades flew into the sky.", "“Oho! This weapon….”", "Unsightly Humility let out an exclamation of surprise, but he kicked off the ground even harder rather than slowing down.", "At the same time, two balls of light flickered from the skeleton’s eye sockets visible behind the helmet.", "And just as the two forces were about to collide…", "Unsightly Humility’s army turned translucent, and the boomerang blades simply phased through the enemies.", "Teresa clenched her teeth and shouted with fiercely glaring eyes.", "“Archers! Fire!!”", "It was the same for the flurry of arrows that flew in parabolas.", "The spectral army even phased through the bodies of Haramark’s infantry, crossing their line of defense and swinging their weapons freely.", "At a glance, it looked like thousands of Flones were charging forward.", "“You thought we would clash with you?”", "Unsightly Humility beheaded a screaming soldier while bursting out with laughter.", "“I don’t see why we can’t! But we’re busy, you see!”", "Amidst the clamor of dying soldiers, Unsightly Humility enjoyed the sight of their body parts flying everywhere and rushed forward like an envoy of death.", "It was then. When Unsightly Humility quickly approached the fortress, blue light flickered in his empty eye sockets.", "A tall woman was standing in front of the fortress gate, staring back.", "Around her were hundreds of magic circles radiating intense purple light.", "“Hoh…?”", "Just as Unsightly Humility sensed the powerful aura emanating from the woman and clattered his teeth…", "The magic circles shone even brighter, and Valkyries wearing winged helmets shot out of the circles, revealing their fluttering purple capes.", "“Go!”", "The woman waved her hand and shouted sharply.", "When hundreds of Valkyries instantly got themselves in a formation and fiercely charged forward with their spears and shields, even Unsightly Humility had to quickly pull his reins back.", "“This power….”", "A Valkyrie avoided the spectral horse’s stomp, spinning to the side and thrusting her shining spear.", "Unsightly Humility waved his longsword and easily brushed off the attack before calming down his spectral horse and opening his mouth.", "“Could it be…? Did I not exterminate the Executor of Sloth in the past?”", "The position among the Seven Sins that was thought to be empty until now — the Executor of Sloth (Acedia).", "Taciana Cinzia spat out the cigarette in her mouth and, with a deep gaze, glared at the enemy who had stopped his charge."]}