{"cid": "5", "title": "Chapter 5. March 16th, 10:30 PM (2)", "content": ["", "“You won’t die even if you fall in there.”", "A silvery voice rang out. Her voice sounded louder than usual, perhaps because there wasn’t anyone around.", "Soon, a figure appeared from the darkness. A white blouse, a black jacket, and a grey H-line skirt that clearly outlined her curves. With a leather office bag in her hand, the woman looked to be a typical young businesswoman.", "“The water isn’t deep here. It’s only really good for a light swim.”", "Her tone went up towards the end of her sentence. Despite her appearance as a serious businesswoman, she spoke somewhat playfully.", "When Seol slowly stepped out of the water, the woman gave a faint smile.", "“Are you Seol….”", "“Who are you?”", "The woman swallowed her words and approached Seol with slow, relaxed steps. With an experienced gesture, she took out her business card and pushed it towards him.", "“This is me.”", "Seol glanced at the card.", "[Sinyoung Pharmaceuticals]", "[Department Head Kim Hannah]", "When Seol showed no signs of accepting the card, Kim Hannah withdrew her hand, as if she was feeling somewhat awkward. Then, she handed him a handkerchief.", "“Take it. Personally, I’m not a big fan of seeing a grown man cry.”", "Seol didn’t take the handkerchief and wiped his eyes with his sleeves. Others might have been disgruntled, but Kim Hannah seemed to find Seol’s alertness interesting.", "“I once heard that a gambling addict wouldn’t move a finger even when beautiful women threw themselves at him naked. I guess it’s true.”", "Seol examined the bespectacled woman with otherworldly beauty. He felt like he had seen her in his dream.", "To be specific, he remembered seeing her in the very first scene. A woman had approached him while he was drinking beer by Tancheon River.", "She had said that she had great news to tell him. And it really was great news. She said she would give him enough money to pay off his debts and help him make more so long as he worked hard. When she handed over an envelope full of cash, the dream version of Seol was completely entranced.", "Although he had to sign a ‘contract’ in return, the dream Seol didn’t care about it at all. After all, money had practically rolled into his pocket, when he was thinking about becoming a medical test subject for extra cash.", "Of course, it wasn’t until later that he found out he had been tricked. He was dragged away to a place he’d never seen before, and the contract had actually been a slave contract.", "Although this happened within the dream, he shuddered when he recalled how he had toiled away like a dog.", "‘No, wait.’", "Seol suddenly realized something. Things he had regarded as a mere dream were happening in reality. Once he recognized this, his heart turned cold and his alertness peaked up.", "“You’re a lot calmer than you look.”", "“?”", "“I thought you would react if I mentioned gambling.”", "Certainly, Seol’s current reaction could only be a surprise to Kim Hannah. It was just that his attention was focused elsewhere at the moment.", "“Well, that’s better for me anyway. Looks like it will be easier to talk to you than I thought.”", "“Talk?”", "“Yep. I came to deliver gre~at news.”", "Kim Hannah snickered as if she found herself funny. Meanwhile, Seol couldn’t hide his shock.", "I came to deliver great news.", "Those were the exact words he had heard in his dream. Now, he was starting to believe that his dream wasn’t just random nonsense but a premonition of things to come.", "“Hey.”", "Kim Hannah put down the leather bag hanging on her right wrist. When the handle of the bag drooped down, the contents of the bag were exposed, and neatly tied stacks of 50,000 Won bills revealed themselves.", "“Why don’t we make a bet?”", "She got down to business. She had already finished investigating the young man’s background. All that was left to do was to throw the bait.", "Gambling addicts were some of the easiest people to reel in. However, she was a perfectionist. She always sought to move at the perfect timing, so that her targets would never refuse.", "And that was today.", "Seeing the young man staring at her bag fixedly, Kim Hannah was fully confident that she would succeed.", "Seol slowly raised his head. Kim Hannah clasped her hands as if to urge him to speak.", "“No thanks.”", "“Great, the game we’ll play is….”", "Kim Hannah paused mid-sentence.", "“I quit gambling. I won’t do it.”", "When Seol doubled down, Kim Hannah regained her composure. She blinked her eyes quickly and tilted her head slightly.", "“Even though this can all become yours if you win just once?”", "“Not interested.”", "“What if I told you it’s yours regardless of whether you win or lose? If I remember correctly, you have quite a lot of debt to pay off.”", "“I’ll take care of it on my own.”", "“Then aren’t you interested in why I’m making you this offer?”", "“….”", "“I’ll explain everything. All you have to do is play a game with me. Of course, you can have the money too, regardless of whether you win or lose.”", "To be completely honest, it was an enticing offer. Even at a glance, Seol could count at least forty stacks of bills. The woman seemed trustworthy from the confident way she spoke. Hearing her out didn’t seem like such a bad idea.", "Just as Seol was about to nod his head in agreement, an alarm bell resounded in his head. The leftover emotions from his dream from earlier in the day shook violently in fierce defiance.", "At the same time, he could feel a strange attraction. Inside the contradictory swirl of emotions, Seol took heavy breaths.", "‘Did I almost… make another huge mistake?’", "No matter how vivid a dream was, one would quickly forget about it after waking up. Since Seol remembered her even now, didn’t that mean she played an important role? Seol told himself to remain cautious.", "Seol’s suspicion was correct. Her words, ‘All you have to do is play a game with me’, could be interpreted in all sorts of ways.", "“I refuse.”", "Oh yeah? Kim Hannah mumbled inwardly.", "His reaction was a surprise for sure. Kim Hannah had expected Seol to jump at her like a starving beast the moment he saw the stacks of money. That was the Seol that Kim Hannah knew.", "But this situation wasn’t completely unexpected either. Occasionally, there were those like him, fools who acted tough to get more out of her.", "Kim Hannah adjusted her internal evaluation of Seol. He didn’t seem all that bad. At the very least, he seemed to be better than reckless idiots. Unfortunately…", "‘You picked a wrong opponent, you bastard.’", "This wasn’t her first rodeo. She knew full well how to convince people like him.", "“How troublesome….”", "Kim Hannah pretended to cross her arms and pressed the inner pocket of her jacket.", "Buzz— Something vibrated.", "“Ah, sorry, hold on a moment.”", "She took out her phone and skillfully put on her earbuds.", "“Yes, this is Kim Hannah. Ah~ Yes, I’m talking to him right now. Yes, yes…. Really? So we’re recruiting that person?”", "Glance. Kim Hannah snuck a quick glance at Seol. Then…", "“Yes! Of course, that’s fine. My client refused. Anyways, I’ll head back then~”", "She took off her earbuds and smiled.", "“What a coincidence. The last slot we had was filled up just now.”", "Kim Hannah emphasized the phrase ‘last slot’.", "“Well, since you refused, I guess it works out. Excuse me, then. I sincerely hope you can achieve everything you’ve set out to do.”", "Kim Hannah picked up the leather bag and turned back without a shred of hesitation. She then began to walk away, step by step.", "From her experience, she expected one of two things to happen. He would either stop her immediately or wait a bit until hurriedly running after her.", "“Wait.”", "Kim Hannah smirked.", "“Yes, what is it?”", "She turned her head slightly. Her teasing expression that seemed to say ‘what’s up?’ was just a bonus.", "‘You were a bit different from my expectation, but you think the likes of you can win against me?’", "She made a triumphant smile. It was then.", "“If it isn’t the Contract….”", "Seol opened his mouth.", "“If it isn’t the Contract, I’ll hear you out.”", "That was it. With just that single sentence, Kim Hannah’s train of thought completely paused.", "Blink, blink. She stared at the man in front of her with her jaws open.", "“…Come again?”", "She barely managed to eke out a reply.", "“What I want….”", "What followed afterward…", "“…is an Invitation, not a Contract.”", "…completely destroyed every scenario she had imagined.", "“…You.”", "Kim Hannah’s smiling face vanished completely. She slowly took off her glasses as her expression turned icy cold.", "“Who are you?”", "Her way of talking changed. A hint of hostility could even be felt from her tone.", "“You already know.”", "Seeing the woman drop her polite manner of speech, Seol also talked more casually. Kim Hannah’s glaring gaze turned sharper.", "“You’re already from that side?”", "“You should know that’s not true better than anybody else.”", "Kim Hannah almost agreed. She had picked out Seol as one of her targets half a year ago. Until now, he had not acted strangely in any way.", "Moreover, if he had gone over even once, he should have that on his body. However, she couldn’t feel the aura of the ‘Mark’. This was clear proof that Seol had no direct relationship with the other world.", "Faced with a situation she hadn’t imagined in the slightest, Kim Hannah wasn’t quite sure what to do. As far as she was aware, this couldn’t be happening.", "“You want me to believe that? Even though you know the difference between an Invitation and a Contract?”", "“What about it? Am I not allowed to say ‘invitation’?”", "Seol’s shameless response made Kim Hannah bite her lips.", "“I’m not here to play with words. Who was it? Who contacted you first?”", "“That’s not important.”", "Seol purposely changed the topic. Everything he said until now came from his dream. Both the Invitation and the Contract.", "He had just thrown it out there as his feelings told him to. Since there was no way for Kim Hannah to know the truth, he figured it was better to let her misunderstand. After all, this was the only weapon of deception he had against her.", "“What’s important is that I want an Invitation, not a Contract.”", "Hearing this, Kim Hannah took a deep breath.", "“Fine, don’t tell me if you don’t want to. I’m curious, but I have no reason to hear you out.”", "One, two, three, four. Kim Hannah counted numbers in her head to calm herself down. She had the feeling she was being swept away at the young man’s pace.", "“Other than that, tell me why you would want an Invitation.”", "“Because I’m not interested in taking the Contract and living as a slave.”", "Seol answered simply. Kim Hannah’s eyebrows twitched.", "“Tell me why I have to use my precious Invitation on a worthless gambling addict!”", "Seol flinched. Before he even realized it, he was treating the morning’s dream as reality. With that in mind, he couldn’t help but wonder if he should continue.", "It wasn’t too late. He could end the conversation now and pretend today’s talk never happened. He had already resolved himself to quit gambling. He could start to regain the trust he’d lost by getting an honest job and working earnestly.", "However, when he declared he wasn’t interested in taking the Contract, the unknown sense of repulsion he’d been feeling vanished. Now, the strange sense of attraction was the only thing that remained.", "He was curious in his own way. There was something he wanted to confirm as well.", "Seol recalled the dream’s final scene. The dying man’s emotion of regret was now pushing Seol forward. It was telling him to go forward.", "Seol finally understood what he previously felt. In order to go there, he had to absolutely refuse to take the Contract.", "Seol clenched his teeth. He scavenged through his memories with all his focus.", "“You might regret it if you don’t give me an Invitation.”", "“What?”", "“You said you were Shinyoung Pharmaceuticals’ Manager Kim Hannah, right?”", "“So?”", "“Shinyoung is famous for continuously developing new medicine these past few years… It has something to do with that world, right?”", "Seol’s bid for victory worked. The calm expression Kim Hannah had been trying to maintain crumbled down.", "Before having today’s dream, Seol knew nothing about the other world. It was obvious that information about it was being kept a secret from the public.", "He didn’t know whether Kim Hannah was forced to keep silent or doing so voluntarily, but he assumed it was a weakness worth prodding. Since the current Seol was an ordinary civilian with no restrictions on his freedom, he didn’t need to hold back.", "“I wouldn’t even need to open my mouth. The 21st century is known as the Information Age, after all.”", "“You’re threatening me?”", "“You’re the one who tried to trick me first. What comes around goes around.”", "“Funny. You think anyone would believe you? A gambling addict of all people?”", "“…Well, I guess you’re right.”", "When Seol readily admitted his error, Kim Hannah felt a sense of unease rising in her heart. Just how was he so relaxed?", "“But would your superiors think the same way?”", "Crack. The sound of gritting teeth rang out.", "“Can’t even complete a simple Contract, can’t keep an important secret… I’m sure they’ll love you.”", "“You son of a bitch!”", "Kim Hannah finally dropped her façade. Seol could tell he was getting close. He knew getting a scammer to curse was no different than making them wave the white flag.", "He briefly considered provoking her further but quickly decided against it. Now that he had whipped her a few times, it seemed like a good idea to gently appease her. After all, she was the one who held the final decision.", "“Of course, I don’t want to go that far either. You just have to give me one Invitation.”", "Seol took a step back. Kim Hannah was still gritting her teeth with a vicious face.", "“A Contract and an Invitation are two completely different matters. I can complete Contracts with my authority, but not an Invitation.”", "“Didn’t you say something about your ‘precious Invitation’ just now?”", "Motherfucker. Kim Hannah bit her lower lip.", "‘Some motherfucking deity you are. You said a time would come when I would have no choice but to use it. Is this what you meant?’", "Kim Hannah ruffled her neatly combed hair as she cursed out another world’s god.", "“I’m not lying. I have to receive permission for a normal Invitation.”", "Seol shrugged. Seeing his calm demeanor, Kim Hannah’s boiling head gradually simmered down.", "The Contract was a business. The Invitation carried a different meaning, but it was technically an extension of that business. In that sense, Seol had surpassed Kim Hannah’s expectations. He seemed to be a real talent rather than a slave. He made her feel like she was dealing with a veteran who had toiled away on that side for several years.", "Of course, she knew that couldn’t be the case.", "After collecting her breath, Kim Hannah opened her phone. But before she pressed the call button, an intense internal struggle stopped her.", "‘Damn it, just how did I end up with this son of a bitch…’", "Changing a Contract to an Invitation wasn’t an easy thing to do. No matter how much she embellished her words, it would be difficult to escape being blamed. As a career-centric woman, Kim Hannah couldn’t stand having her record get blemished.", "She spoke, with her phone still turned on.", "“You have to agree to three conditions.”"]}