{"cid": "186", "title": "Chapter 186. An Unexpected Change of Pace (1)", "content": ["Paat!", "Light flashed. When Seol Jihu opened his eyes, he saw an unfamiliar room. Only after looking around a few times in awkwardness did he realize, ‘Ah, this is my room.’", "Drrk. The cityscape that revealed itself when he opened the window felt way too unnatural and strange.", "The cars on the side of the road, the densely populated houses, the students walking around in their uniforms… Seol Jihu stared at the cityscape in a daze before scratching his head hard.", "His scalp itched, perhaps because he had not washed his head in several days. He immediately took off his shirt and headed to the bathroom.", "Chwaaaa! Water poured down from the showerhead. Feeling the hot water striking his body, Seol Jihu softly closed his eyes as a soft moan escaped his mouth.", "‘Hot water comes out this easily, huh….’", "It wasn’t as if hot water was hard to come by in Paradise, but there was an annoying process involved when it came to acquiring enough for a nice bath.", "Only now did Seol Jihu really feel like he was back on Earth. Everything that happened while he was in Paradise felt like a dream.", "“Whew….”", "He plopped down as he let the shower water pelt his head.", "While Seol Jihu had no way of knowing this, he had just experienced the second of his four most dreadful, fierce battles. It was only natural for his legs to go limp.", "He felt refreshed once he washed every inch of his body, but he was soon confronted with a difficult problem that he had long anticipated he’d run into.", "He had absolutely nothing to do.", "Rather, he had no clue what he should do.", "He opened the fridge without much thought, then closed it feeling troubled. Even when he turned on some loud music and wandered around the room or when he picked up a book that caught his eye, nothing seemed to hold his attention for more than 10 minutes.", "He opened his laptop and read the latest news, but it was nowhere as interesting as reading the news report from the assassin organization.", "When he realized there was nothing to do, an unbearable silence descended upon him.", "In the end, he turned on the TV, took out a can of beer rolling around in the fridge, put a cigarette in his mouth, then leaned against the wall. Meanwhile, his head was filled with all sorts of thoughts.", "Kim Hannah and Jang Maldong’s requests echoed inside his ears.", "“So boring….”", "Seol Jihu murmured to himself as he lit the cigarette. However, he did not drink even a sip of the beer he’d opened, and even the cigarette only let out white smoke.", "Seol Jihu glared at the celebrities laughing and joking on the TV screen with empty and lifeless eyes.", "“They don’t even know anything.”", "Soon, as the unused cigarette burned to the end of the filter, and the screen changed to an advertisement…", "“….”", "He lowered his head dejectedly. He didn’t understand why he was like this, but he felt as if all energy had been sucked out of his body the moment he returned to Earth.", "Less than half a day had passed since he left Paradise, so why was he feeling this way?", "Seol Jihu looked down at the plain floor and muttered briefly.", "“…It’s so lonely.”", "**", "After sitting lethargically on the couch for a long time, Seol Jihu left the room as if he was escaping from something.", "Time flowed and soon it was dinner time, with dusk slowly blanketing the sky.", "Seol Jihu walked aimlessly, though he clearly did not have a plan or a place to go. He simply walked without a destination or a goal.", "His half-reflexively moving steps stopped when a bright light touched the tip of his toes. Seol Jihu, who had been contemplating deeply while fiddling with the piece of paper in his pocket, raised his head.", "Hongik University Station Exit 2.", "‘Oh right!’", "His darkened complexion regained a little bit of life.", "Without hesitation, Seol Jihu mingled into the crowd of people walking up and down the stairs.", "After exiting the subway at Exit 8, he walked around without a plan again. He thought he would have to search for a while, but he found what he was looking for quicker than he expected.", "‘Good Pork Belly Place.’", "Seol Jihu looked up at the sign on the three-storied building rather dumbfoundedly. The light was still on, but perhaps because it was late at night, he couldn’t see many people inside.", "Chime. He opened the door and went in.", "“Welcome— Oh, my!”", "The waitress flinched when she saw Seol Jihu.", "“Are you still open?”", "“…Yes! We’re closing in an hour though. How many people are in your party?”", "“It’s just me.”", "“Just you? Alright, this way please.”", "Seol Jihu muffled his voice in embarrassment, but the waitress guided him to his seat indifferently.", "“What would you like?”", "“I heard the meat here is great.”", "“Of course~ It’s delicious~ So you’ll have pork belly?”", "“Yes, two portions please.”", "“Got it~”", "Once the very cheery waitress left, Seol Jihu observed the restaurant thoroughly. He figured there had to be a reason Jang Maldong told him to come here. There had to be something related to Paradise in some way.", "However, he couldn’t find anything no matter how many times he looked around the place. Just as he was considering walking up to the second floor, the food he ordered arrived.", "He wasn’t sure if this place was normally like this, but the cheery waitress grilled the meat for him without looking tired or annoyed in the slightest.", "When the sizzling sound of the meat being grilled flowed out, accompanied by a savory smell, the thought of looking for any clues disappeared.", "Now that he got a closer look, the pork belly boasted a chunky thickness with the perfect ratio of fat and meat. He couldn’t lie. It looked incredibly mouthwatering.", "Gulp. Seol Jihu swallowed the saliva pooling in his mouth, then asked.", "“Can I get a bowl of rice too?”", "“Sure~ A bowl of rice here please~”", "Why not worry later on a full stomach?", "Seol Jihu took a spoonful of rice and a piece of meat that the waitress cut into bite-sized chunks. Seol Jihu moaned as he tasted the harmony of the chewy meat and the well-cooked rice.", "To think it would be this good…", "Like the saying, ‘hunger is the best sauce’, Seol Jihu finished the two servings of meat and the bowl of rice in the blink of an eye. When he next ordered another four servings of pork belly, the waitress asked back in a startle.", "“F-Four servings?”", "“Yes, don’t worry. I can finish it.”", "As if to prove these words, Seol Jihu devoured the pork belly as soon as it finished grilling. Sweating profusely, he focused only on eating.", "He knew it wasn’t good for his health to eat so much this suddenly, but he was struck by an unbearable hunger the moment he smelled the meat.", "Once his stomach got a taste of the pork belly’s fatty oil, it demanded more and more of it. In the end, Seol Jihu ordered extra servings.", "Only after finishing 10 servings of pork belly, four bowls of rice, one soybean paste stew, and naengmyeon[1] did he finally feel full.", "“Whew….”", "‘That was a good meal.’", "Perhaps because he ate to his heart’s content, he felt a bit more energetic. After wiping off his sweaty forehead with a tissue, he suddenly blinked his eyes.", "Because he was so focused on eating, he only now realized that the restaurant was much darker than before. Most of the lights had been turned off, and the few other customers who were in the restaurant had left long back.", "The only thing he could see were the arms of the waitress, who was cleaning the oil from the dirtied grills.", "“You have a really good appetite.”", "Her unenthused tone snapped Seol Jihu back to reality. By the looks of it, she had waited a considerable amount of time for him to finish eating.", "“S-Sorry! I was really hungry.”", "Seol Jihu hurriedly took out his wallet. Just as he grabbed a few extra bills to tip her for her troubles…", "“Ei~ Only 50,000 Won?”", "A jabbering voice rang out.", "“Didn’t I tell you before? That I’m pretty expensive.”", "‘What?’", "Only then did Seol Jihu raise his head, and he immediately became dazed. The waitress who guided him to his seat was nowhere to be seen, and a somewhat familiar face was the only one remaining.", "“I stayed overtime for an hour to grill you meat, you know.”", "The reason he did not recognize her at first came from the stark difference in her attire while in Paradise and her casual clothes on Earth.", "“…Miss Phi Sora?”", "“Wow, thanks for noticing so quickly.”", "Phi Sora laughed, threw her apron off, then sat down on the chair on the opposite side from him.", "Never having imagined meeting her here, Seol Jihu asked unwittingly.", "“Why are you here?”", "“That’s what I want to ask. How did you find out about this place?”", "“Master told me to go.”", "“Grandpa did? He’s come here once, but why did he tell you?”", "She then shrugged her shoulders as if it didn’t really matter.", "“Anyways, I guess you woke up?”", "Seol Jihu gave an affirmation reflexively.", "“I’m glad. I was worried you wouldn’t wake up forever.”", "“….”", "“Well, I’m sorry. I wanted to stay a little longer, but something urgent came up and I had to come back. And since I’m here, I thought I might as well run a few errands.”", "Seol Jihu shook his head.", "“There’s nothing for you to apologize for.”", "Seol Jihu had no reason to prevent his team members from going back to Earth. It was just that the timing wasn’t so good.", "He had so many things he wanted to do once he was discharged from the temple, so he wasn’t in such a good mood being carried away by the atmosphere to go back.", "“Pft.”", "Suddenly, a laughter rang out. Phi Sora’s shoulders were trembling, her white teeth revealed in full view.", "“Ah, anyways, that sure was hilarious.”", "“?”", "“Soorim, I mean. The girl who was standing here the whole time. You didn’t notice her?”", "Seol Jihu tilted his head. She seemed to be talking about the waitress who guided him to this seat, but that was all he could recall about her.", "“I was wondering why she was suddenly working so hard… ah, she isn’t like that normally. She usually zooms out of this place when her shift ends, but she kept insisting she’d stay and clean up. I came down, wondering if she ate something wrong, and boom—”", "Phi Sora gestured at Seol Jihu with her chin.", "“When I told her to go, she pouted like a little kid. You should’ve seen the way she was glaring at me as she left.”", "Phi Sora giggled, noting how cute this Soorim girl was.", "Seol Jihu listened to her without a word before quietly murmuring.", "“You should have just let her stay….”", "Phi Sora’s laughter immediately stopped.", "“What did you say?”", "“Ah, well, I’m just saying.”", "“What, are you interested in her? You have a girlfriend, don’t you?”", "“I don’t have a girlfriend.”", "“Lying again… fine, let’s say you don’t. Why did you say I should have let her stay?”", "“Because she’s pretty.”", "Seol Jihu said flat out.", "“You know, whether you’re a guy or a girl, if you see an attractive person, your eyes keep chasing them and you want to talk to them. Ei, what a shame.”", "When Seol Jihu spoke regrettably, Phi Sora’s eyebrows immediately went up in anger.", "“Did I hear that correct? Way to ruin my mood. So what, you’re saying I’m not attractive?”", "“No, it’s not that. But you know, people have different tastes.”", "“Ha, different tastes aside, how is that girl prettier than me? Both my face and figure are superior.”", "Seol Jihu widened his eyes and dropped his jaw.", "“…Wow….”", "When Phi Sora saw his reaction, she truly looked flabbergasted.", "“Wow? Wooow? What’s up with that reaction?”", "Seol Jihu spectated Phi Sora’s popping reaction for a moment before chuckling.", "“Whatever. Get up if you’re done eating.”", "“I’ll help you clean up.”", "“Is that supposed to comfort me? I don’t need it, so go back. Do you think I don’t know that you are saying it just to annoy me to death?”", "“Alright, then I’ll pay and leave. Thanks for today!”", "Seol Jihu got up without hesitation. When he got to the counter to pay, a dumbfounded sigh rang out from the back.", "“You’re really leaving?”", "Phi Sora made clicking noises with a pen in her hand.", "‘Didn’t you just tell me to leave?’", "When Seol Jihu looked back at her with a confused face, Phi Sora pouted her lips.", "“I mean— didn’t you say Grandpa told you about this place?”", "“Yes, I did.”", "“Then don’t you have something you need to tell me?”", "“No, nothing. He just told me to come here.”", "“The heck…? I mean, there has to be a reason, right?”", "“What reason?”", "“I don’t know!”", "Seol Jihu stared fixedly at the confident Phi Sora.", "“But—”", "She twiddled her fingers as though she had something to say. Then…", "“…Drink with me.”", "She lowered her arm with an I-give-up face.", "“I got hungry seeing you eat. I gave you an hour of my time, so you can do the same for me, right?”", "She began to clean up the table without waiting for his reply.", "Seol Jihu quickly said, “I never said I’d leave—”", "“Playing hard to get is fine, but keep it to a moderate amount. It doesn’t look like you have anything to do anyways.”", "This time, it was Seol Jihu’s turn to be frozen.", "“Don’t just stand there and come help. I’ll pay for what you ate.”", "This woman. Seol Jihu grumbled inwardly, then shook his head side to side.", "‘What does she want from me?’", "He had thought the same thing in the past, but she really was whimsical.", "**", "After closing up the restaurant, Phi Sora checked multiple times to see that the door was locked before turning around.", "She led the way saying that she knew a good Korean army stew place nearby, and she really stopped in front of a restaurant named ‘Good Korean Army Stew Place’.", "‘What’s up with the restaurant names near here…?’", "While Seol Jihu was standing around in a fluster, Phi Sora grabbed the young man’s hand and pulled him inside.", "“Alright, hold your glass up. Cheers!”", "“…Cheers!”", "The clanging of two glasses of soju rang out.", "“Keu!”", "Phi Sora emptied the glass into her mouth, then shrunk back with a slight frown.", "“…Strange. It’s the same ramen, so how can it taste so different?”", "After taking a slurp of the well-cooked ramen, she tilted her head. Meanwhile, Seol Jihu fiddled with the half-finished glass of soju.", "Seeing Phi Sora murmuring to herself, eating and drinking, he suddenly grew curious.", "“Miss Phi Sora.”", "“Hold on.”", "Phi Sora raised her hand before he could even finish.", "“Can we stop talking about that?”", "“About what?”", "“What do you think? The war, obviously. I have a lot of questions for you too, but I’m holding it in. Grandpa told us not to dig into it too much, but I’m still jolted awake from my sleep whenever I remember my head twisting back.”", "Seol Jihu was about to make fun of her by saying, ‘You told me to have faith in you, but you got knocked out by a single blow from Undying Diligence.’ But he decided to hold his tongue.", "He didn’t have much to say about the war, and since the questions he was going to ask her had nothing to do with it, he agreed readily.", "“Why are you working part-time at a restaurant?”", "“Why? Am I not allowed to work part-time?”", "Phi Sora was overly chatty as if she was feeling good. Seol Jihu let out a sigh.", "“You know that’s not what I meant.”", "“I know. Can’t I even joke?”", "Ssp! Phi Sora took a spoonful of the ramen soup, then smacked her lips.", "“That restaurant… it used to be mine. I sold it to an acquaintance cheap to get money to pay my kids though.”", "‘I see.’", "Phi Sora was poor because of the incident with Bok Jungsik, but she must have amassed quite a fortune before then.", "But Seol Jihu still had doubts.", "Was she so poor that she needed to work part-time to make money?", "“They’re nice people. They let me work part-time whenever I want. I told them that they didn’t need to pay me, but they still do anyways.”", "Just as Seol Jihu was having all sorts of thoughts in his head, Phi Sora continued talking.", "“The reason I’m working is… to not forget myself? I can’t really describe it that well, but it’s something like that.”", "“To not forget yourself?”", "“I mean, think about it. I’ve been toiling away in that place for years… the longer I stay there, the stranger it feels when I come back to Earth. It gets harder to discern which place is the reality, like I’m some sort of a gaming addict.”", "Seol Jihu couldn’t help but agree with this statement.", "“I didn’t like that. This feeling of… being devoured by the world. Well, something like that.”", "Phi Sora grabbed four sausages and threw it in her mouth. Then, she spoke.", "“That’s why I’m working part-time.”", "Seol Jihu, who was listening attentively, furrowed his brows.", "“…I feel like you skipped a lot of the important steps in between and jumped to the conclusion.”", "“Well can’t you understand what I mean even if the explanation is lacking? I lived half of my life working part-time. For me, there really isn’t much to talk about if you take that part of my life out.”", "“Oh… really?”", "“Yep. I’ve pretty much done everything other than illegal activities and adult entertainment. I grew up really poor, you see.”", "Phi Sora munched on the sausages with puffed up cheeks, while Seol Jihu stared at her in a daze.", "“When I’m working part-time, I really feel like I’m on Earth. That’s why I do it for a day or two every time I come back. There, satisfied?”", "Seol Jihu thought about what to say, then nodded his head.", "He remembered bad-mouthing Phi Sora, talking about how she must have grown up in a well-off family to be so spoiled and bratty. But it seemed he really shouldn’t have judged a book by its cover.", "“Let me give you a piece of advice while we’re at it. You should do something like this too. At the very least, write a diary.”", "“A diary?”", "“Imagine what would happen if you died in Paradise. How confused would you be when you wake up on Earth? To lessen the sense of disconnection, you should do something.”", "Seol Jihu wanted to refute her, but he really couldn’t think of anything to say as she was being realistic. After all, even if he abandoned Earth and decided to live in Paradise, things wouldn’t be that different from the status quo.", "He would simply be at a higher risk of dying.", "If anything, that was the one thing he learned from this war.", "What if just one more of the Seven Armies came?", "“….”", "Then he would be agonizing in a hospital bed with a memory loss right about now.", "‘Did Master Jang tell me to go to Miss Phi Sora’s restaurant so I can hear this?’", "He couldn’t think of any other reason.", "‘Wait a minute.’", "Thinking about Jang Maldong’s true intentions, an idea crossed his mind. He remembered that there was something to talk to Phi Sora about.", "‘Maybe?’", "He wasn’t sure, but he soon came to a decision.", "“There’s something I want to ask.”", "“What is it?”", "“It’s not about the war, but you might not be comfortable talking about it.”", "Phi Sora swirled her chopsticks in the pot, then raised her head slightly.", "“Mm… Now I’m curious since you put it that way. Go ahead. I’ll decide afterwards.”", "Seol Jihu calmly spoke.", "“It’s about Seol-Ah and Sungjin.”", "Phi Sora’s complexion quickly turned sour.", "1. Korean cold noodles. "]}