{"cid": "192", "title": "Chapter 192. Doubt (2)", "content": ["", "Seol Jihu screamed at the top of his voice. He looked so desperate from the outside that every passerby gave him a pitiful glance.", "‘Is she not here?’", "Seol Jihu brought his ear to the door starting to get hopeful. And when he strained his ears…", "Roll! Crash! The sound of something rolling and crashing rang out from the inside followed by hurried footsteps. Then, the door burst open.", "“Jihu!”", "Seo Yuhui ran out with a flustered face.", "“What’s the matter? Did something happen?”", "Her worried tone made Seol Jihu pressed for an answer, so he scratched his head and spoke.", "“Oh, nothing. I just wanted to see Noona…”", "“Whaaat?”", "Seo Yuhui’s spotless forehead furrowed slightly. Next, she put her hand over her chest and then sighed.", "“Whew, geez… I thought something happened….”", "‘As I thought.’", "Seol Jihu breathed a sigh of relief seeing Seo Yuhui at home. On the other hand, he tilted his head. Sure, Seo Yuhui must have run out in a rush, but her breathing was a bit too rough and her forehead was glistening with tiny beads of sweat. It was as if she had run at full speed to finish a race.", "“Sorry.”", "“Uun, it’s fine. You don’t feel sick or anything, right?”", "“No.”", "“That’s good to hear…”", "Rest assured, Seo Yuhui pinched the blankly staring Seol Jihu’s cheeks.", "“Geez, you little rascal. You only think about how to pull pranks. Do you know how shocked I got while in the middle of a cleaning?”", "‘Cleaning?’", "Seol Jihu peeked inside. The areas he could see were spotless without even a speck of dust.", "“Are you finished?”", "Seo Yuhui wiped her forehead with the back of her hand, then shook her head.", "“No, I’m not even halfway done.”", "“I’ll help you.”", "“Mn… Thank you, but it’s fine. I’m cleaning the basement right now, and there are many items you have to be wary of. It will be easier if I do it alone.”", "Seo Yuhui rejected Seol Jihu’s offer, then tilted her head slightly before continuing.", "“Did you really come because you wanted to see me?”", "Her tone didn’t sound particularly investigative. But because it sounded like she was asking, ‘You had an ulterior motive, right?’, Seol Jihu stammered like a kid who got caught red-handed.", "He then remembered the heavy bags in his hands and found a suitable excuse.", "“Actually, I came to give you this.”", "Seol Jihu put the bags down and took out the gift for Seo Yuhui. Once he politely handed it to her, she immediately fixed her gaze on the shopping bags.", "“Oh, wow….”", "Was she not expecting a present? Seol Jihu smiled when he saw the embarrassed look on Seo Yuhui’s face.", "“I felt bad expressing my gratitude with just words. After all, you saved my life.”", "“No, I—”", "“It’s nothing big though.”", "Seol Jihu smiled brightly, telling her she didn’t need to think about it too much.", "Seo Yuhui whispered, “Oh, my. Oh, my.” Acting flustered and at a loss for what to do, she only received the present when Seol Jihu convinced her.", "“What should I do? I didn’t prepare anything….”", "“I’m not expecting anything back.”", "When Seol Jihu waved his hands, Seo Yuhui looked sorrier than before, and her eyes wavered slightly.", "“This is just too sudden. If I knew, I would have gone back to Earth to bring you something.”", "She even wiped her glistening eyes with her finger. She looked like she was profoundly moved, like a mother who just received the first present from her son.", "‘As I thought, they’re not the same person.’", "Seol Jihu nodded his head.", "“What is it? Can I open it now?”", "And then when Seo Yuhui looked inside the shopping bag and asked curiously, he shook his head strongly.", "“No, take your time with it. Please.”", "“…Please? That makes me even more curious.”", "“Then I’ll have to hurry up and leave.”", "When Seol Jihu began to pick up the bags he put down, Seo Yuhui narrowed her eyes suspiciously.", "“Why? We can’t look at it together?”", "“Eii, of course not. It’s embarrassing.”", "With that, Seol Jihu turned around saying, “Sorry for causing a scene.”", "‘It’s a good thing I prepared this gift.’", "The happier the receiver was, the happier the gifter got. While Seol Jihu left to avoid being embarrassed, he was secretly confident in his gift. He had no doubt that Seo Yuhui would love the gift and use it well.", "After all, it was a necessary item for daily life and also a gift that had never failed him before. Plus, it was also the only present he was praised for while he was happily dating Yoo Seonhwa. He still remembered her saying, ‘It’s a pretty sensible gift, considering it’s from you.’", "‘I hope she’ll be happy!’", "Seol Jihu rubbed his nose as he hopped down the stairs with a bright smile.", "On the other hand, Seo Yuhui, who was chasing Seol Jihu climb down the stairs with her eyes, turned her gaze down at the shopping bag with profound affection.", "The way her smile never left her face, it seemed she was really happy. Then again, how could she not be happy with a surprise gift?", "“I can’t believe it.”", "Pledging to invite him to dinner and treat him to a sumptuous feast, Seo Yuhui went back inside and closed the door.", "‘I wonder what it is.’", "Enjoying the beating of her fluttering heart, she opened the box excitedly. And in that instant—", "“….”", "Seo Yuhui blanked out.", "Soon…", "“?”", "A sparkling question mark popped up in her head.", "*", "Seol Jihu was always the first one to return to Paradise whenever everyone went back to Earth. And so expecting the office to be empty, he almost screamed the moment he opened the office door and went in.", "Jang Maldong was sitting on the couch, looking at him with a solemn look.", "“You came back in exactly seven days.”", "“W-When did you get here?”", "“Four days ago.”", "“Four days ago…? That was really quick. You should have rested a bit more.”", "Jang Maldong put on an odd expression. He asked, feeling unsure.", "“Oh yeah? Then why don’t we go back together? We can stay there for a month.”", "“A month? I might be able to do two weeks, but a month is too much.”", "Seol Jihu laughed, telling him not to joke around too much. Jang Maldong stared at the chuckling young man before crossing his arms and nodding his head.", "Sending Seol Jihu home the moment he was discharged from the temple was mostly for his benefit, but it was also for the team’s benefit.", "While Seol Jihu took the role because they couldn’t find anyone else who was suitable, Seol Jihu was, unequivocally, the leader of Carpe Diem.", "And with the last war, he solidified his position completely. Never mind his team members, not even the team advisor, Jang Maldong, could easily mess with his authority. Of course, he didn’t plan to mess with it if he could help it. The point was that the leader determined the color and the atmosphere of a team.", "If Seol Jihu, who was the nucleus of Carpe Diem, was overly serious and focused, the burden his teammates felt would increase as well.", "As the team had just completed a major event successfully, a change of pace was needed. That was why Jang Maldong had forced Seol Jihu into going back, and it seemed more effective than he had thought it would be.", "The proof was ‘two weeks is a bit too much’ changing to ‘I might be able to do two weeks.’", "‘Now this is a bit more acceptable.’", "Just as Jang Maldong leaned on the back of the couch with a relieved look…", "“Master!”", "“Hm?”", "A large shopping bag popped into his view. Looking inside reflexively, he saw two words written in golden words.", "“…Red ginseng?”", "“Yep!”", "“What’s this all of a sudden?”", "“What do you mean? It’s your present, of course.”", "Seol Jihu smiled brightly and gently put the gift down on Jang Maldong’s lap.", "“I heard from Seol-Ah. Though it’s a bit late, thank you for saving me.”", "“No… you’re the one who’s had it rough.”", "Jang Maldong let out a dry cough and turned his gaze.", "“Why did you bring something like this? You’re making me embarrassed.”", "“What’s there to be embarrassed about? Just think of it as a gift from a grandson.”", "“Oh, please, grandson? That’s gross. Shoo.”", "He said this apathetically and then moved the shopping bag to the side, but Seol Jihu didn’t miss the corner of Jang Maldong’s mouth wiggling. The way his face stretched horizontally— he was very clearly smiling.", "“Anyways, I need to talk to you about your body and your direction of growth.”", "Jang Maldong suddenly changed the topic. He was clearly embarrassed and trying to change the subject, so Seol Jihu restrained his laughter.", "“I want to hear your thoughts first.”", "“Ah, yes, here it is.”", "Seol Jihu took out a notebook from his bag and handed it to Jang Maldong. Seeing the densely written words in the notebook, Jang Maldong’s eyebrows wiggled.", "Silence fell for some time. Flip, flip. Only the sound of pages being turned resounded.", "‘This brat.’", "Jang Maldong glanced at Seol Jihu, who was staring back with a nervous face, then shifted his gaze back down to the notebook.", "How to grow in the future and the reasons to do so were written down in the notebook in minute detail, without missing a single thing. The problem was that it was too detailed.", "Seol Jihu had revealed his intentions so clearly and openly that Jang Maldong was a bit taken aback while reading. While it wasn’t such a bad feeling to be trusted so much, he had to do what he needed to.", "Tak. Cramming the content of the notebook in his head, Jang Maldong closed the notebook and ripped it to shreds.", "“You fool. What if someone gets their hands on this notebook? Have you not learned about protecting your Status Window privacy?”", "“I planned to burn it after showing it to you.”", "“Go burn it. Now.”", "Jang Maldong handed him the chopped up pieces of paper. While Seol Jihu went to burn them, Jang Maldong organized his thoughts. He started speaking once Seol Jihu came back.", "“You seem to be in a hurry.”", "Seol Jihu remained calm. He didn’t affirm or deny Jang Maldong’s statement, but his silence meant his answer was closer to the former.", "While he had written a detailed note, it was rather easy to summarize it.", "First, he would have to restore his lowered physical stats. Then after leveling up in the temple, he would use the Divine Elixirs and Ability Points to balance his mind, body, and technique as much as possible. Finally, he would offer the Divine Stigmata to receive a Divine Vestige.", "It was the quickest way to getting stronger in the shortest amount of time.", "Jang Maldong understood where he was coming from. After meeting the Army Commanders in a huge war, it was no surprise that Seol Jihu would want to get stronger as soon as possible.", "He did not have even an inkling in his mind to criticize his plan as foolish.", "After all, he must have come to this decision after what he experienced and felt during the previous despair-filled war.", "There was just one thing….", "“You understand that you will suffer significant losses with this choice, right?”", "“Yes, and I plan to bear the burden of that loss.”", "Seol Jihu replied seriously. There was no longer any sign of laughter in his voice.", "Jang Maldong sighed, then spoke.", "“I’ll be honest. Reading this note, it feels more like a desperate struggle to correct your distorted mind, body, and technique, rather than a plan for proper growth.”", "Seol Jihu smacked his lips when Jang Maldong correctly pointed out his intention.", "He did not regret putting all of his Ability Points into Mana. After all, he was in a situation where he had no choice but to do so. This was also why Jang Maldong didn’t criticize him for making such a rash choice.", "But that didn’t mean the problem at hand was magically gone.", "“I can’t help but think that it’s a bit of a shame. No, not a bit, but a lot.”", "“….”", "“Frankly speaking, it’s because of the effect of the Divine Elixir. You should know it better than anyone else.”", "Seol Jihu quietly nodded his head.", "Divine Elixir — an extraordinary elixir that instantly increases a physical level by one rank.", "Seol Jihu’s current Stamina stat appeared as Intermediate (High). Here, the ‘Intermediate’ part referred to the rank and the ‘High’ part referred to the stage.", "This was what Jang Maldong was pointing out.", "Taking the Divine Elixir at Intermediate (High) would increase his physical stat to High (Low), and taking it at Intermediate (Low) would likewise increase it to High (Low).", "In the case of the former, it would be losing out on two whole stages. In terms of Ability Points, the loss would be greater, the higher-ranked the stat was.", "“I understand, but—”", "Seol Jihu continued quietly.", "“At my current state, I don’t have the confidence to increase my physical level with just training. Of course, if I put my life on the line to put in effort, it might be possible to increase it by one or two stages. But I can’t begin to think just how long that will take.”", "Seol Jihu’s plan was reasonable given the current situation. However…", "“There’s something I want to tell you.”", "Jang Maldong argued back immediately.", "“Do not underestimate what you’ve accomplished. I’m not just talking about killing Undying Diligence. Three of the Seven Armies suffered near-annihilation, and the Nosferatus lost their ability to regenerate.", "“Unsightly Humility was forced to use Divinity Manifestation, and the Federation recaptured Tigol Fortress, which the Parasite Queen spent painstaking efforts to conquer.", "“The Federation is supposedly brimming with determination to never lose it again, focusing all their efforts on reconstructing the fortress.", "“The Parasites also stopped their advances for the first time and went on the defensive. What do you think is your greatest gain from all of this?”", "Seol Jihu shook his head in a daze.", "“It’s time.”", "But the moment he heard this— Ian’s final words flashed across his mind.", "[So… run!]", "[I know it’s hard. I know you don’t want to. But you have to endure it. No matter what, run away… and live! That is the only piece of victory and hope we can recover from this war.]", "Seol Jihu interlocked his fingers and closed his eyes. A stream of doubt descended on his fair complexion.", "“I’m not sure. Time is one thing… but I don’t know if I have any more hidden potential….”", "He still sounded diffident. In a way, it was an accurate diagnosis. After all, he should know the state of his body better than anyone else.", "It wasn’t as if Jang Maldong didn’t understand this, but he cupped his chin on his hand and curled the corner of his mouth up.", "“What if you do?”", "“?”", "“Ah, my bad. I shouldn’t have put it that way. What if your body’s hidden potential increased since the war?”", "Seol Jihu’s eyes shot open. For some reason, he remembered the densely packed needles that were sticking out of his body when he woke up from his coma.", "‘In that case…’", "It was a different story.", "Jang Maldong spun his cane.", "“Using the Divine Elixirs and Ability Points at Level 5… I agree and empathize with this decision fully. While we may have bought time, it doesn’t mean we have an infinite amount of it. It may be better to get stronger while you can.”", "“Right.”", "“But—”", "Jang Maldong suddenly gripped the cane hard.", "“What if we change the order around a bit? You have precious treasures you may never be able to acquire again, so shouldn’t you at least try to use them without any wastage?”", "Seol Jihu nodded his head, unwittingly convinced by Jang Maldong. Although a small seed of doubt still remained in his heart, if what Jang Maldong was saying was true… if he could raise his Strength, Endurance, Agility, and Stamina stats to High (Low)…", "‘And if I used the Divine Elixirs then….”", "Pinnacle![1]", "For the first time since he entered Paradise, his physical stats may overpower his mana!", "That wasn’t all.", "[I see. So that’s what comes after Pinnacle….]", "As he had two Stamina Divine Elixirs, he could even aim for the rank after Pinnacle.", "Feeling like a fog had suddenly been lifted off his head, Seol Jihu looked straight at Jang Maldong.", "“Is it possible?”", "“Of course! If you want, I will modify this plan of yours to the best of my abilities.”", "Seol Jihu realized his question was pointless. Given Jang Maldong’s personality, he wouldn’t have promised him a rosy future if it wasn’t possible. He must have mentioned it because it was!", "“I promise. I will ensure you do not waste even a single one of your Divine Elixirs and Ability Points.”", "“….”", "“I’m not forcing you, of course. But since we have time, I’m suggesting we postpone using the Divine Elixirs and Ability Points.”", "Saying this, Jang Maldong gave a meaningful smile. It was then—", "“How about it? We can talk again after you come back from the temple—”", "Jang Maldong suddenly turned his gaze in the middle of talking. Seol Jihu, who was listening attentively, also turned to look at the door.", "1. Taking suggestions. Peak High, High (Peak), Highest, etc. The word has been used before (in various contexts) and has generally been translated as ‘highest’, so I will be keeping it this way for now. (Update: This has been changed to Pinnacle to make it sound better!) ", "Happy new year everyone! ", "Here's to another year of excellent storytelling and enjoyment!"]}