{"cid": "89", "title": "Chapter 89. Evil Phantom-catching Vengeful Spirit", "content": ["Not a sound could be heard. There was no prelude, either.", "Still, Seol Jihu could clearly sense it. He sensed the enormous air pressure rushing at him in an instant as if to shut his mouth up for good. If the Sky Fairy didn't hold him with her arms tightly interlocked behind his back, he might have been flung away by now.", "'So, this is the Wind Spirit….!' ", "It was a completely different type of experience compared to the Festina Earring. The whirlpool of gushing winds seemed to push against his entire body.", "Increase their speed as much as possible before emerging from the mountain range and, at the precise moment they leave the relative safety of the mountain, borrow the powers of the Spirits to surpass their top speed to go faster – that was their plan. ", "And so, eight flying figures, gathered into one group, crossed the sky as if to split the heavens itself.", "Previously, the Fallen Angel called this plan 'Sink or Swim' considering that they needed to overcome two large hurdles. Even if they could somehow survive the first hurdle, she said that they would need to leave the second hurdle to luck.", "Even then, there was a reason Seol Jihu's plan was chosen. That was because they had something to block the pursuers.", "'With this speed…!' ", "Would it feel like this if he stuck his head outside the window of a sports car driving fast enough to overheat its engine? It was as if his face was about peel off from the air resistance. ", "He forced open his eyelids that were trying to close by themselves and kept glaring at his front. The mountain range passed by in an instant, and they arrived at the huge expanse of the forest stretching endlessly before their eyes.", "Just before they entered it….", "Kyahaaaaaah-!!", "From somewhere below, a loud screech exploded forth. Seol Jihu inwardly clicked his tongue. He would have much preferred to not get discovered, but it seemed that was not meant to be. After all, they were dashing past the wide-open sky as if to shout out, “Hey, look at us!”", "Unless the Parasites were blind, they would definitely discover the escaping party for sure.", "Rumble-!!", "The sound of a swarm running on the ground resounded out. Innumerable strange shadows appeared from everywhere near the entrance of the forest.", "That wasn’t all. Noises of powerful flapping wings and unpleasant insect-like buzzing began their vicious assault.", "Not too long afterwards, Seol Jihu witnessed the horde of Parasites gathering into a swarm right in the escaping party's path and cleared his mind. Everything would be decided in a single moment.", "The distance between his group and the enemies disappeared in the blink of an eye. He kept his eye open and got ready to deal against the impact force.", "Just before the two sides were about to clash, the Fallen Angel and the Sky Fairies chanted out another spell.", "Woong, woong!!", "The first thing to make contact with this wall of creatures was the roundish barrier that suddenly appeared around the Fallen Angel. At the same time, the gust of wind picked up the pace by a notch, and an explosive elasticity was added to Sky Fairy’s already-fast speed.", "Crack!", "Kwang!", "Along with something loudly breaking apart, noises of explosions resounded in the air. His ears were deafened, and his vision was filled up by a sudden splash of darkness. But a second later, the darkness was lifted, and the blue sky greeted him once more.", "It was at that point that Seol Jihu knew they had safely navigated past the wall. Parasites flying around the vicinity were urgently gathering, no doubt having received a telepathic summon, but they simply weren't going to delay the group’s determined effort to break through a single point. ", "In other words, choosing to pierce through with a frontal assault resulted in them safely overcoming the first hurdle.", "'Euhk…!' ", "The residual impact from that forceful breakthrough caused Seol Jihu’s body to shudder. However, he didn't even have time to pull himself together.", "The situation up until here had unfolded as they had expected. The reason the Fallen Angel deemed their escape impossible was the existence of snipers called ‘Evil Phantoms’. To make matters worse, there were apparently hundreds of them hiding in the area. ", "Long story short, they had succeeded in entering the Forest of Denial, but it was still too early to celebrate because they all knew what kind of attack would follow next. They created as much distance as possible with everything they had while breathlessly chanting one protective spell after another.", "Seol Jihu nervously swallowed his saliva as he watched barriers upon barriers being stacked on top of each other. It was then. He suddenly felt his breathing come to a stop. For some reason, his wounded left shoulder began aching again.", "A certain ominous sensation began to creep up on him. If he were to put it into words, it felt like a very sharp needle was softly brushing against his ankle.", "Unfortunately, that sensation didn't stop there, and it now felt like it was softly scratching at his flesh while creeping up higher and higher. Their flying speed was so fast that his hair was threatening to pull out from their roots, yet never mind shaking it loose, the unpleasant sensation clung onto him even worse than before.", "'This….' ", "The moment his brain rang the alarm bells…", "Tang, tang, tang, tang!", "An unknown number of gunshots rang out and echoed in the air. He could vividly see what happened next. Sky Fairies flying at the right-hand side as well as at the rear suddenly broke away from the group's flight path. The meaning behind that action was clear. Their barriers had all been shattered.", "The two fairies powerlessly fell to the ground, like butterflies with soaked wings. A portion of the pursuing horde of Parasites rushed down and had them surrounded. ", "After seeing all the fairies’ bodies full of holes, they laughed loudly. As for the Sky Fairies, they smirked even as they shivered from the intense pain. ", "Seeing those ridiculing grins, the Parasites stopped laughing. The escape attempt was a failure, so why they were grinning?", "They soon found out. Summoning up the last dregs of strength, the Sky Fairies raised their trembling hands. Before anyone could do anything about it, the bluish stones held in their hands suddenly began emitting blinding lights.", "Rumble! Rumble!", "Two 'thunders' rumbled loudly enough to rock the world with a short interval in between. Seol Jihu squeezed his eyes shut involuntarily at the blinding flash of light. If he could, he would have covered his ears too.", "However, that line of thought lasted only for a brief moment. Even though the first sniping attempts had ended just now, that unpleasant poking sensation still remained. Rather than stopping, this feeling brushed past his heart, past his face, and then towards the front….", "'….Front?'", "He quickly opened his eyes and realized the source of this strange sensation. He was shocked out of his mind as he stared straight up. Upon activating Nine Eyes, he found that the empty air before him was a mix of red and black colors. Before he could shout out, “It's dangerous-”", "Tang-!!", "A gunshot rang out. It didn’t hesitate or wait for Seol Jihu’s to finish his thoughts. ", "“Aaaak!”", "A short scream pierced Seol Jihu’s ear. His line of sight suddenly tilted to the side. He was now falling, while the others were still flying. His eyes caught the Fallen Angel carrying Teresa getting further away with every breath.", "'N-No….'", "The intolerable pain assaulted the Sky Fairy and her focus shattered. Naturally, the gust of wind scattered as well. She somehow didn't let go of the arm holding on to the young human man, but that was about it. She tried hard to flap her wings, but with one wing half-blown away, all she could do was to ease the arc of descent.", "Eventually, they crashed into the forest like a paper plane having lost all of its momentum.", "“Fuuuph!!”", "They didn’t make a safe landing. As soon as they touched the ground, both of them tumbled around like a hoop. It was as if they were being swept away by tidal waves powerfully crashing into them. ", "Although Seol Jihu was suffering from a severe case of dizziness, he gritted his teeth and held onto the thin thread of wavering consciousness. He refused to give up here. ", "“Heuuuuu…!”", "He felt dizzy. He felt like the world was spinning around him, but he managed to force himself back up. He turned around instinctively, and his narrowed vision discovered the Sky Fairy near his feet, moaning out in pain. Her hood was pulled back during their somersaults, and her azure-colored hair had scattered messily about.", "For a brief moment, a flash of hesitation brushed past his mind. But after he remembered how she held onto him tightly even during their crash-landing, he moved his left arm. ", "His wound hadn't been perfectly healed yet, so when he moved, the pain intensified almost immediately. The sounds of him gritting his teeth were so scary that it was as if he was actively trying to grind his molars down to nothing.", "'We need to get out of here.' ", "He barely succeeded in pulling up the Sky Fairy. He then activated the Festina Earring. Just a little bit further. Just a bit further – that singular thought drove his feet to kick the ground.", "Unfortunately, time was fair to everyone and reality was cold and uncaring. All the time spent falling, tumbling on the ground, standing back up, and lifting the Sky Fairy up was more than enough for the 'Evil Phantom' to prepare a new round of sniping. Furthermore, it was also more than enough time for the crazily-pursuing Parasite horde to catch up to them.", "Before he could take a few more steps, the sound of gunshot cruelly rang out.", "“Ahk!!”", "Seol Jihu was shot cleanly through in his thigh and fell back down to the ground. To make matters worse, he sensed the noisy presences getting closer.", "“…Haa.”", "The pain was crippling beyond imagination, yet a hollow chuckle still leaked out of his lips. Didn't someone tell him this before? That Parasites were a bunch of bastards that always managed to exceed one's expectations. Those words came back to haunt him now. Should he say this was far too cheaty?", "No, he had been too greedy, hoping for his enemies to be lax. The Parasites were famous for being vicious and cold-hearted; they weren't gracious enough to wait for the main character of an anime to power up or for a giant mech to finish its transformation.", "'God damn it….'", "He had no way out. Truly. No matter how hard he wrecked his brain, he couldn't think of a way to save himself. He couldn't even tell where he was right now. Worst of all, the 'Future Vision' that always seemed to kick in during moments of danger showed no signs of activating at all.", "'Is this the end?' ", "Once his thoughts reached there, tears suddenly began welling up around his eyes. The past eight days of hardship brushed past his brain. Thinking about all the unimaginable hurdles he had to overcome to get here, he felt angry and resentful. Sorrow rushed in like a tidal wave.", "“…Keuk!” ", "Tears that he thought had long evaporated trickled down his cheeks. Even then, his arms flailed about as he crawled on the ground. How wretched and pathetic did he look right now?", "Still, he didn't care. Even if he had to roll around in dog shit, he preferred it over death. He didn't care if others berated him for being pathetic or for acting like an insect.", "'I want to live….!' ", "As long as I can survive. He couldn't let go of that desire, even as death's footsteps continued to draw closer and closer.", "So….", "“…He….” ", "With his trembling lips…", "“….Help….”", "Grasping the grass below like straw….", "“….Please…..”", "As he gasped and wailed softly under his breath….", "“….Help, please….!” ", "He loudly cried out.", "CLUNK!!", "The noise of a certain door opening resounded out.", "*", "Near a large tree among the many within this forest, a certain hidden creature slowly raised its body up.", "It was about two meters tall. At a casual glance, it resembled a human, but it also had a large red eye covering half of its face and a pair of pointy fairy-like ears. Its long arm was shaped like the barrel of a rifle; at the end of this arm, there was a hole designed to look like the muzzle of a gun, or perhaps the open end of a pipe, instead of an actual hand.", "Kiik, kiik!", "Seeing the human crawling on the ground like an insect, this creature began cackling to itself. Although a few did slip out of its net, it didn't care about that anymore because it had already performed its mission admirably.", "Seeing its kind rush towards the targets, the Evil Phantom slowly raised its body. And just as it was about to take a leisurely walk…", "“?”", "Ssssk….", "Something brushed by its cheek. It reflexively turned around but could see nothing. But then, just as it thought there was indeed nothing here, a similar sensation brushed past its other cheek. The Evil Phantom froze up on the spot.", "“….”", "The unknown thing's presence couldn't be detected. However, that sensation was crystal clear. Even now, that thing was brushing past the creature's face constantly.", "What was stranger was that its body didn't want to move. Inexplicably, every little portion of its flesh threw out urgent warning bells. Do not move a muscle, they said.", "It was then that the Parasite sniper noticed how the forest had grown quiet. ", "Blink, blink.", "Its large red eye blinked several times. The Evil Phantom eventually shifted its gaze to the side. It sneaked a glance and discovered a certain small foot right next to it. ", "Sway, sway…. The identity of the thing brushing the Parasite's cheeks was that human foot, swinging back and forth like a rocking pendulum.", "The Evil Phantom stared dazedly before it flinched. It looked up subconsciously, only for a jet-black figure dangling on a tree branch to fall on top of it.", "“!!”", "CRACK!", "That was the end. The Evil Phantom didn't even get to take a closer look at the falling figure before its neck was torn off from its body. It died instantly, unable to even squeak out a scream.", "The problem was, this creature wasn't the only one to sense the strange phenomenon unfolding around them.", "“Kiereuk…?”", "The horde of Parasites surrounding the collapsed male and female also froze in their spots. As they stood there unmoving, one of them cautiously took a look around. ", "Woooo-….", "A quiet, eerie call rang out. After hearing this unknown, chill-inducing cry, the Parasite began stepping back inch by inch.", "Heuuuu…..", "However, as if the owner of the voice wasn't going to permit them to leave, another chill-inducing cry rang out.", "They couldn’t see anything. They couldn’t hear anything. They couldn't even feel anything. However, the Parasites could acutely sense it.", "They could sense the horrifying malicious intent permeating in the entirety of the forest.", "They sensed the approach of a ghastly murderous intent large enough to crush every single Parasite here like worms.", "It was inevitable that these creatures could sense this change. After all, they were monsters. A monster knew better than anyone else regarding other monsters. And manufactured monsters could never win against a 'real' monster.", "It was then.", "Crack!", "The neck of one of the Parasites suddenly snapped to the other side. Its eyes remained wide open as its head rolled on the ground. Soon after, the eyeballs of another one began spinning around before its entire body trembled pitifully.", "Puk!", "In the blink of an eye, its body exploded, flesh and bodily liquids spraying out everywhere.", "“Kiiie…. Puwaaaak!!”", "The creature opening its mouth got its jaw completely ripped apart. Then….", "“Kuaaaa!”", "Another one's limbs were all torn apart from their sockets.", "Even before the remaining Parasites could blink their eyes in shock at the deaths of their kin, jet-black smoke rushed at them like a poisonous snake. This smoke proceeded to tightly wrap around their bodies before lifting them up high into the sky as if it was a whip.", "“Kiiieek! Kiiieeek!!”", "“Grrrr, grrrr!”", "The Parasites belatedly struggled and resisted, but the smoke didn't scatter away.", "Instead, the horde remained tightly wrapped by the black smoke and rose up higher and higher in the air before they were thrust back down on the ground, heads first.", "Koong, koong, koong, koong! The earth rocked violently as vicious and horrifying sounds exploded out.", "Then, they were raised back up to the sky before smashing down to the ground once more. As if to say that once wasn't enough, the 'whipping' motion continued on for several times more.", "The spectacle of dozens of heads being smashed apart like watermelons to the point where they now resembled minced meat was grotesque enough to avert one's eyes.", "Kyahhhh…", "Kyahhhh…..", "Perhaps the black smoke thought this wasn’t enough as the aura that managed to massacre dozens of creatures in an instant spread out to all corners of the forest.", "Soon, numerous screams resounded out from every corner of the forest. They sounded so sorrowful that one couldn't even imagine they were made by monsters.", "*", "Teresa Hussey safely made it to the tomb and was quickly making her way back, but upon witnessing this cruel scene of the massacre, she just couldn't bring herself to close her slack jaw.", "“What on earth is…..” ", "All those terrifying Parasites had been turned into bloody mush.", "She dazedly stared at the bits of broken flesh and bodily fluids forming a thick river on the ground before spotting the young man nearby and gasping out in horror. He had been injured greatly already, yet another heavy injury was inflicted on him. The panicking Teresa hurriedly ran towards him. No, she tried to, but then…", "Kywaaahk!!", "“Seol…Ah-ahhk?!”", "A shapeless aura sharply poking her from all sides forced her to plop down on the ground. She didn't even mean to, but her body fought against her control and began trembling non-stop. She would never be scared of anything under most circumstances, yet she was so terrified that her teeth clattered all by themselves.", "Kyahrurururu….!", "Teresa heard that supernatural growling and lowered her head before nodding it like crazy. She didn't have to hear any words to figure it out.", "That black smoke circling around the young man was absolutely furious, so much so that it didn't even permit the approach of another human being.", "A short while later…", "Tap, tap… She could hear soft footsteps crossing the grass. And then….", "“Heave-ho.”", "'…Heave-ho?’", "Teresa blinked her eyes several times before cautiously raising her head to look.", "She saw a slender, feeble-looking woman… No, that figure was definitely not feeble at all. Seeing the evidence of massacre staining the hands and the white gown of this unknown figure, the terror she forgot for a moment was revived in her head again.", "While Teresa's mouth bobbed up and down silently, this woman with a brilliant waterfall of silver hair cautiously held the young man and disappeared back into the forest.", "Her direction was towards the tomb."]}