{"cid": "33", "title": "Chapter 33. A Misunderstanding (3)", "content": ["Hot and stuffy air rushed out from the open door. The acrid and bitter odor of blood and sweat also faintly brushed by Seol's nose.", "The two maids that entered before him were supporting the completely exhausted Maria from her sides while leaving the room.", "Maria's previously-radiant blonde hair looked as if someone doused it with a bucket of cold water as drops of liquid fell from the strands. Her thin, white ceremonial robe was completely soaked through as it clung onto her figure and revealed more than a hint of her skin.", "“Ueek…!”", "From her cherry-colored shapely lips, a mouthful of blood spewed out. The white robe rapidly got stained in the dark crimson hue.", "“Miss Maria!”", "When Seol ran up to her, Maria weakly raised her head up. As if she was already suffering from a high fever, her once-pale cheeks were reddening up.", "“Are you alright?”", "“Fuck…. Can't you see for yourself….?”", "“….”", "“My head's ringing, so please don't shout near me…. I really feel like I might die soon….”", "Maria coughed and vomited out two more mouthfuls of blood. She regulated her breathing and then shot Seol a fierce glare.", "“Don't forget.”", "“….”", "“I did you a big favor with this.”", "Seol wasn't a dummy so he quickly replied.", "“I understand. I'll never forget about today's matter.”", "Maria lowered her head again. She was helped along by other maids and soon, they disappeared beyond the bottom of the stairs and out of sight.", "Still worried, Seol continued to look on before shifting his eyes away after hearing the loud exclamation of joy coming out from his quarters. It was the sound of the Yi siblings crying out.", "“Time for the main character to make his entrance.”", "Hao Win lightly patted Seol's back. Although the questions regarding why this guy followed him here remained, Seol was more curious to find out Yun Seora's condition, so he hesitantly took his first step inside.", "'Ho!'", "Hao Win followed Seol into the room and ended up gasping out in admiration after seeing the figure of the woman sitting on top of the bed.", "The way she sat up on the bed while leaning slightly against the wall reminded him of a beautiful snowflower shyly blooming within a hidden crevice in the middle of winter.", "She continuously raised her right arm and then lowered it. Her actions were somehow like that beautiful flower not knowing what to do when the rays of warm sunlight fell upon it after it was forcibly taken out from its deep hiding place and into the open plain.", "‘Indeed, I see why he fell for her.’ Hao Win silently mused to himself, and then he lightly pushed Seol forward. Thanks to that, the youth ended up stumbling a couple of steps forward, which inevitably drew in the attention of Yun Seora. She flinched slightly and met the youth's gaze.", "“H, how are you feeling?”", "“….”", "“Is your arm okay?”", "“…Ah.”", "Her small but shapely lips parted slightly before closing shut again.", "All sorts of emotions flashed in her eyes, but her lips could only tremble softly. Judging from her small and nearly indecipherable hand gestures, it seemed as if she desperately wanted to say something, but at the same time, she was at a loss as to how she should proceed. So much so, the ones watching on could feel their hearts melt into a puddle.", "'Man!'", "Now how heartwarming and wonderfully refreshing was this!", "Hao Win was deeply admiring this sight, but then….", "“May I know how you managed to gather 82,000 points?”", "….Yun Seora’s words brought him back to his senses.", "Hao Win quickly stuffed a cigarette in his mouth and shoved his hands down his trouser pockets. Then, he cocked his head exactly at the angle of 30 degrees and jutted his chin out just a bit as if he was looking down on his opponent.", "“Oh, that. This is….”", "“Hiya~~. Congrats, congrats.”", "Just before Seol could introduce Yun Seora to Hao Win, Hao Win seized the initiative and stepped forward while walking in an extravagant fashion. He placed a hand on Seol's shoulder and scanned the crowd.", "“I see that you're all nicely healed and stuff. You can move your arm now, yeah?”", "“Y, yes. It's all thanks to Mister Hao Win…”", "“Sure, sure. It's all good, all good. But…”", "The ends of Hao Win's lips twisted up slightly. As a clearly slimy smile surfaced on his face, Yi Seol-Ah couldn't help but form a deep frown.", "“We've held up our side of the bargain, so…. It's your turn to keep your side of the promise, no?”", "“Of course.”", "“Oh, good. You see, I just wanted to make sure. I mean, if you somehow forgot, things might have gotten a bit troubling for both sides.”", "“You don't have to worry.”", "Seol confidently replied. He received a lot from them already, and he was planning to pay them back in full.", "Of course, that was just from Seol's perspective. The others, who weren't aware of the details, could only tilt their heads in confusion from those ambiguous words.", "“Uhm, excuse me…. What promise are you talking about?”", "And sure enough, Yi Seol-Ah took the bait.", "“Oh, that….”", "“That's right, it's a promise.”", "Seol was about to explain himself, but Hao Win cut him off again.", "“It's nothing much. Let's just say, it's kinda like we made a deal?”", "He said it was “nothing”, yet the tone of his voice or the way he said it indicated otherwise.", "“This friend here, I saw him running around like a headless chicken in the morning, you see? And I thought him working his butt off like that didn't look so nice. So, after I heard his story, I decided to lend him a hand.”", "“T, Then….”", "“He said there’s this girl he needs to save and that he needed 82,000 points for that. Cool, so cool! I was so moved that I even asked my family to pitch in to meet that amount!”", "“Y, your family?”", "Yi Seol-Ah's dumbfounded gaze landed on Seol, but he could only look back at her without saying anything.", "What Hao Win said wasn't wrong, technically. It was true that Hao Win went out of his way to help and he really did reveal himself to be an unashamed romantic. Also, one could refer to one's teammates as “family”, too.", "But because Hao Win had his back to her, she couldn’t see his facial expression.", "“But, here's the thing, little lady. We aren’t running a charity operation, so we reached a proper business agreement. Know what I mean?”", "In an instant, the whole room became deathly quiet. Seeing Hao Win cackle like some sort of a cartoon villain in an apparent display of joy certainly got on the nerves of almost everyone present.", "“Oh well. For today, celebrate away! But from tomorrow onwards….”", "When he intentionally blurred the ends of his sentence, the unsettling atmosphere got heavier.", "“In any case, you've got a lot~ of work to do. I'm sure you know very well that you gotta work hard to keep my family safe and sound, yeah?”", "That was also true. Delphine's team did want Seol's overwhelming attacking prowess, after all. And it was common sense for a Warrior to take to the frontlines.", "“I know. I'll see you tomorrow morning.”", "“Very good. I’ll get outta here now…. Oh, right.”", "Hao Win turned around to leave, before turning back again to face Yun Seora as if he just remembered something. She wasn't stupid – no, on the contrary, she was incredibly sharp. As if she had sensed what was going on, the seriousness of her expression was clear to see.", "“Before I go, I should say my thanks first. Your name's Yun Seora, right? Thanks a bunch.”", "“….What do you mean?”", "Her voice was sharp enough to cut human flesh, but Hao Win simply cackled on.", "“All thanks to you, the number one man in the Neutral Zone has landed in my hands!”", "Hao Win theatrically mimicked grabbing and fondling motions with his fingers and ominously laughed out.", "It was only then that Seol realized something was off, but before he could respond, Hao Win's rough hands violently grabbed his collars.", "“A word of advice. Don't even think about running away. If we don't get back our investment here, then we'll get it back in Paradise. If not, then, well, we'll just get it when we're back on Earth.”", "Just as Seol was about to ask what the heck he was on…", "“Well, I’ve yet to meet a fool who would do that after hearing the name of the Triads…”", "Hao Win released Seol's collars, leaned in closer, and winked at him. With a refreshing smile on his face, he strode right past the confused and stunned Seol. Soon enough, the noise of the door closing was heard.", "Seol fixed his clothes and let off a soft sigh. Not only was that man noisy, he was also quite indecipherable sometimes, as well.", "In any case, today was the day for celebration. Yun Seora needed a few more days of recuperation, but by healing her arm, Seol certainly did wonders for Kim Hannah's reputation. Now that the most difficult task was over, the rest should be comparatively easy as pie.", "Conveniently enough, it was now around dinner time. Seol was about to suggest that they should enjoy a feast to celebrate Yun Seora's recovery, but then….", "“?”", "….He couldn't help but fall into deep confusion.", "The complexions of both Yi Seol-Ah and Yi Sungjin were poor. They stood around like a pair of statues, gazing at Seol with eyes rapidly moistening up.", "“Actually, I…. thought it was strange….”", "“Eh?”", "“Just how…. You were able to gather so many points in such a short time…. I was so curious….”", "Her halting words were wet with emotions.", "“All…. All because of us….”", "As if all strength abandoned her legs, Yi Seol-Ah suddenly plopped down on the floor. And finally, from her reddening eyes, thick teardrops began pouring out. Now in panic mode, Seol hurriedly waved his hands around in denial.", "“No, no!! Wait a minute!! You guys are misunderstanding something!”", "“It's a misunderstanding?”", "“That's right!”", "“But, you had to borrow the points, right?”", "“Yeah, but….”", "Seol became rather speechless. It was true that he borrowed points. Suddenly, he didn't know where to even begin his explanation. However, as soon as Yi Seol-Ah's elegantly defined facial features began crumbling and soft sniffling noises came from her nose, Seol couldn't help but hurriedly blurt out.", "“I didn't borrow a lot. I already took care of the 82,000 points, and they just added a few more so I can get a couple of equipment for myself. I'll be able to make that up through a handful of missions.”", "“R, really?”", "“Of course.”", "“But he said you fell into his hands….”", "“He was just messing around. I'm telling you, you don't have to worry. Really.”", "“But, what about you meeting up tomorrow morning…?”", "“Seriously now, it's nothing to worry about. I've joined his party, that's all. They needed my strength, so we're going to carry out missions together.”", "It was at this point where Yi Seol-Ah completely broke down and cried even harder.", "He had to use his body to get those points – that was how she took it, no matter how hard Seol tried to explain. She made up her mind simply through the actions of Hao Win.", "'It's all because of me!'", "In Yi Seol-Ah’s mind, her orabeo-nim, who was better than anyone else in the Neutral Zone, had fallen to become a mere meat shield all because she spoke up carelessly. The crashing tidal wave of guilt forced even more tears out from her eyes.", "Since Seol had no idea what she was thinking, he tilted his head in confusion. The whole thing was like a lightning striking him out of the blue.", "'Why?!'", "The more he tried to pacify her, telling her that everything was okay, the more she seemed to cry.", "“Yi, Yi Sungjin….?”", "Seol shifted his gaze over to Yi Sungjin, wanting to egg him to do something about his sister. However, Yi Sungjin wasn’t much different.", "With his head was lowered, he had his fists clenched tightly while shaking in rage.", "'What's the matter with him?’", "Seol's neck creaked noisily like a rusted machine as he turned his head around.", "Yun Seora was in the middle of wordlessly staring at Seol. When their gazes met, she flinched grandly and hurriedly avoided him and then began glaring at the poor bed sheets.", "It was the first time Seol saw such a display of raw emotion from a girl who always seemed taciturn and disinterested from the short time he had known her.", "However, he felt a sense of deja vu when even Yun Seora began biting her lower lip.", "“Sob…”", "Yun Seora couldn't hold back anymore, and she too began crying. She covered her face with those thin pair of hands, and her shoulders began quivering ever so gently.", "“I'm…. I'm sorry….”", "She quietly sobbed, and after seeing her like that, Seol could only glare at the ceiling in helplessness.", "'That guy, really….'", "On a day well-suited for celebration, the whole room became a sea of wails, instead.", "On the other hand, as the multiple choruses of crying escaped from the room, Hao Win let off a long smoke out from his lips as he leaned against the door, his arms across his chest. Now that his work was done, he flung the dying butt of the cigarette away and moved on.", "The expression on his face as he climbed down the stairs was one of satisfaction.", "He sniffed and wiped his nose once while slowly nodding his head.", "'Yup, humans are emotional animals.'", "**The following morning.", "Unable to win against the sorrowful atmosphere of his room, Seol made his escape at early dawn. He decided to get his gear ready in time for the meeting later in the morning.", "'Let's see…. The remaining points are….'", "….14,780 points, although he gave 600 away for his guests and their meals for the day, so now, 14,180 remained. Yi Seol-Ah completely refused to take the points, but when he used Yun Seora's recuperation as the excuse, she took them with thick tears in her eyes.", "'What should I buy?'", "Normally, the pricing of defensive equipment started from around 1000 points. Since they were designed to keep you alive for as long as possible, they were naturally quite expensive.", "After entering the store, Seol looked around hesitantly before an Asian maid discovered him and trotted to his position. She was a cute girl with braided hair.", "“Hello there~! What brings you here today?”", "“I came to buy defensive gear.”", "‘Hm~.’ The maid swept her gaze over Seol and nodded her head.", "“What is your allotted budget?”", "“It's around 14,000 points….”", "“Since you're a Gold Mark, you get a 30% discount! So, we can budget you for around 20,000 points, yes?”", "'She knows who I am?'", "Seol stared blankly for a bit before asking her.", "“By any chance, do I also get the first-place discount as well?”", "The maid smiled refreshingly.", "“Why? Do you want the ownership of the Neutral Zone too?”", "Of course, Seol knew that the additional discount of 70% only applied to regular facilities. He still had to ask though, just in case.", "“If it's fine with you, may I act as your coordinator?”", "Although Seol didn't mind looking around, there was no time. He was originally planning to come here last night, but all thanks to Hao Win causing mayhem, he had to suffer the consequences the whole night. He even failed to calm them down.", "“Please.”", "“Roger, roger! And what type of armor are you looking for?”", "“Uh…. For the whole body?”", "“I see that your class is Warrior. So, do you focus on mobility or defense?”", "“I guess, uh, mobility? Wait, I think defense is also important.”", "“Yes, yes~. And your weapon is a spear?”", "“Yes.”", "“You aren't planning to change it?”", "“Nope.”", "He wasn't thinking of changing a weapon when he'd just about gotten used to it. Besides, his budget was already too tight, anyways.", "“Roger that! I'm your coordinator, Aragaki Yuzuha!! Ikimaaaaasu!”", "The maid suddenly raised her arm up high and ran deeper inside the store. Which left Seol with a slight sense of panic.", "While the rustling noises of her searching for stuff resounded out from the back, Seol leisurely browsed through the available items on the list provided.", "The names of the items appearing on the store's list were pretty simple. For instance, the spear Seol bought from the store for 580 points was named the 'Sharp and Sturdy Spear'. Although it featured no special attributes, Seol found its simplicity rather pleasing, and more importantly, its length nearly matched his own height – which he preferred – so he bought it right away.", "“Here I am!”", "The maid, Aragaki Yuzuha, brought along several articles, carried on both of her hands.", "The first item to be shown off was an armor coloured in a deep brown hue.", "“This here is the boiled leather armor. It's the best one available here among the leather armors. After bringing the oil containing paraffin into a boil, you repeatedly dip the leather in there for a few hours and then take it out. That makes the leather super strong! Touch it and see for yourself.”", "Seol touched the shoulder pad, and sure enough, not only was it stiff, it also felt reassuringly solid as well. He put a lot of strength on his fingers, but he still failed to bend the armor out of shape.", "“That's why, it offers great resistance against cutting attacks, but that still doesn't mean it's omnipotent, you know? If you receive an impact that the armor can't handle, it'll simply break apart, unable to disperse the force behind the attack, you see? So, you gotta be especially careful about attacks from blunt weapons!”", "And then, she went, That is why!!, and presented the next thing in her hand. It was also an armor, formed from small and roundish metal rings interlocking with one another. However, to call it an actual armor, it seemed a bit too small.", "“I strongly recommend that you put this on under the leather armor.”", "“Is this the so-called chain mail?”", "“Wee~ll, it's a wee bit, you know, small to call it a proper chain mail, but you can think of it as the miniaturized version. It's lighter than normal because it's been designed for Magicians and Priests to wear under their robes, but still, its defensive capability is excellent. Even if your luck's bad and the boiled leather armor gets broken, this little guy can save your life.”", "Doubling the layers of armor – Seol thought that wouldn't be such a bad idea, and so, he asked.", "“How much for both?”", "“The boiled leather armor is 5,700 points, while this is 6,900. Ah, that's the discounted price.”", "“…The latter's more expensive?”", "“Of course! That's leather and this one's metal, after all!”", "“Mm.”", "“And then~.”", "Thanks to Yuzuha's rather excellent salesman skills, Seol ended up also buying leather protectors for his arms and shins, as well as leather gloves and long boots adorned with cleats.", "“And~ the total is 13,980 points, dear customer!”", "Seol didn't say anything else and duly handed over the points; Yuzuha seemed to be very happy about that.", "“♥ Kimochi~!”", "“….”", "The mini chainmail barely covered him from his shoulders to just below his navel. The boiled leather armor could be worn like a T-shirt, so putting it on wasn't very difficult. While he squatted down to replace his shoes with the leather long boots, Yuzuha busied herself by checking out his spear, before her eyes began narrowing to a slit.", "'….I don't have any points left, though…'", "“Are you properly maintaining your spear?”", "“….Maintaining?”", "“Yes. I can see that the blade edges have become quite dull. Have you sharpened it ever since the day of purchase?”", "“Do I really need to do that?”", "After hearing his reply, Yuzuha formed an expression of total disbelief and asked back.", "“Do I really need to keep breathing?”", "“….I guess I understand what you're trying to say.”", "In the end, he had to spend another 20 points to buy a whetstone and a towel. All 14,000 points got sucked out from him in a blink.", "“Thank you very much~! We still have Named weapons available, so please, pay us a visit again after earning lot~s of points! Okay~?”", "Leaving behind Yuzuha's words, Seol went down the stairs to the first floor. His body felt a bit hefty now, but at the same time, he was feeling a bit excited as well.", "Buying equipment for himself indeed was a long time coming thing. Finally shedding the clothes he'd been wearing from Earth and kitting himself in the proper armor, his heart was stirring restlessly.", "'I'll earn lots more points and make sure the kids get suited up properly, too.'", "Even before he'd noticed it, he was treating the Yi siblings and Yun Seora as kids he was looking after.", "Seol found a quiet spot for himself on the first floor, and with a clumsy hand, began polishing the blade edges of the spear, while waiting for the arrival of his new party members.", "*", "[Ambush (Remaining number of attempts: 10/10)]", "Ambush and annihilate the group of Bugaboos walking past the mountain road!Difficulty: Very HardWhen successful: +10,000 Survival PointsWhen unsuccessful: Death*Cooperation possible (up to 6 people)", "*", "Seol hid in the thicket over a small hill and stared at the mountainous trail not too far from him. There was a group of the so-called Bugaboos busy walking on the narrow path located between two hills. Even at a casual glance, there seemed to be at least over thirty of them.", "A Bugaboo was an exceptionally furry monster that had a roughly human-like body but with a head of a bear. It was around 150 cm tall, but its entire body was made up of rippling muscles, so it was certainly not something one could take lightly.", "Seeing their sharply-jutting out fangs and the scary claws on their hands and feet, even Seol tensed up.", "'Also, why are they carrying so many weapons?'", "Not only such things as swords, shields, and spears, he could see blunt weapons and bows and arrows, which he hadn't seen in a mission until now.Most eye-catching, though, was this two-meter tall Bugaboo walking in the middle of the group. It carried a huge mace in one hand, and Seol judged it to be the leader of this group.", "'Good thing I didn't try the mission alone.'", "The thing about the difficulty spiking up incredibly high during the 'Very Hard' ranked missions was indeed true. He could now understand why the mission was called 'Ambush', as well. If he or his group were to clash head on with these creatures, they wouldn't even last five minutes.", "Finally, the group of Bugaboos was walking past below the hill Seol was hiding in.", "'Not yet.'", "Right then, the once-quiet mountainside was filled with a powerful gust of wind. The stormy winds formed at the end of the narrow path and began to violently overturn everything as they rushed past, eventually pouncing on top of the Bugaboo monsters. This was, of course, all due to Delphine's magic.", "GuakGrrrr, Grrrrrr", "The leader Bugaboo stumbled unsteadily, before falling on its butt with a loud thud. It was the same situation for the other monsters. They all fell and rolled around the ground, their ranks completely collapsing.", "As the wind slowly died down, Seol grasped his spear tightly. The leather of the glove seemed to glue to the spear shaft. He crouched and placed strength on his ankles, getting ready to pounce at a moment's notice.", "Not too long thereafter, a sharp whistling noise came from the hill on the other side. A Bugaboo, while trying to get back up, screamed in a shrill voice with an arrow stuck to its neck. Leorda Salvatore and Tong Chai, the two archers, began sniping the Bugaboos at the rear that carried bows.", "The majority of the monsters hadn't gotten back up yet. But those that did regain awareness of the situation turned their heads to look at the direction of the hill where the arrows were coming from. Hell, three were already up and running towards that direction.", "It was right here that Seol raised his body up. He rushed down the hill like a streak of lightning and stabbed the head of a Bugaboo trying to get up. He pulled his spear out before the dead monster's face greeted the ground, then in the blink of an eye, stabbed to his side, and caused a bloody hole to appear on the temple of another Bugaboo still regaining its balance.", "Confirming that his attacks worked, Seol relentlessly used his spear. His role was to reduce the monsters' numbers as much as possible while their attention was robbed by Delphine's magic and the arrows from the two archers.", "After sending six, seven monsters to hell literally in the blink of an eye, Seol quickly retreated. The Bugaboos finally realized that there was another enemy to their backs and tried to pounce on his position with their weapons.", "From here onwards, a proper battle unfolded.", "Seol deflected away the incoming blade with 'Strike' and rapidly attacked with 'Thrust', causing yet another monster to fly away while spewing blood. And as he went with 'Cut' to his side….", "Clang!", "With a loud metallic clang, his spear was blocked. A Bugaboo had raised its shield in time and managed to block him.", "Unlike the undead skeletons, these Bugaboos did not stupidly try to rush in front. No, they spread to either side of him and tried to surround him.", "Clang!", "When his spear clashed with the axe of the monster, Seol's eyes widened in surprise. Not only the power behind the axe swing surprisingly great, even before he could counterattack, blades and spears of other monsters were already closing in on his position. When he managed to pull back and avoided getting hit, an axe came flying at him as if it was waiting for him to move.", "And so, instead of attacking, Seol gradually got mired deeper into a defensive battle. Surrounded by six aggressive monsters and their weapons, he had no choice but to constantly be on the backfoot.", "It wasn't only that, though – as he wholeheartedly concentrated on defending against the monsters' weapons, he flinched and came to an abrupt halt when an impact landed on his chest.", "An arrow couldn't penetrate his armor and bounced away. A Bugaboo holding a bow was taking aim at Seol and was pulling at the string.", "It was then.", "Swish, swish!!Accompanying the clear sounds of air being parted, two monsters running up the hill screamed out. Arrows penetrated the back and the thigh of those monsters. Leorda began lending his aid just as Seol found himself in a spot of bother.", "'But, they also have archers…!'", "Soon enough, Seol's eyes became wider still. From behind the archer's back, a pair of bronzed hands suddenly appeared and wrapped around the monster's neck like snakes, then a dagger sliced its neck open. As the dead Bugaboo collapsed, the sight of Tong Chai wielding the bloodied dagger was revealed.", "It was like transferring aggro to and fro. When their rear became noisy, the monsters chasing after Seol had to stop and hesitate. On top of this, the arrows continuously flying in were enough to delay the Bugaboos, even if it was only for a second. Some of the arrows even managed to land in the monsters' weak spots and disabled them from continuing on.", "Now that Leorda was helping out, while Tong Chai cut the number of enemy archers down, Seol stopped retreating up the hill, changed his grip on the spear shaft, and reverted from defending to attacking.", "He rapidly took care of the blindly rushing pair of monsters with 'Thrust' and 'Strike', then went to town with the ones looking back in confusion. By the time he got back to the bottom of the hill, he managed to further kill two.", "Guaaaak!", "It was at this point in time that the leader Bugaboo stopped observing in silence and stepped forward. It took aim at Seol, loudly roared out in anger, and raised its massive mace up high into the sky. It was understandably pissed off, seeing that over half of its subordinates were cut down in no time at all.", "'Should I dodge this?'", "Even if it was Seol, he had no confidence in completely defending against this attack.", "The monster's mace descended violently enough to blow away the dust on the ground. In the following moments, just as Seol prepared to retreat, a dark shadow leapt in front of him.", "Boom!", "A thunderous metallic noise exploded out.", "“Puhup!”", "Hao Win wielding a large steel shield gritted his teeth as his feet slid on the ground. Seol quickly propped him up and opened his mouth.", "“I was going to dodge that.”", "“And I'm trying to block it for you!”", "Hao Win shoved the mace away with his shield and retreated with Seol in tow.", "“That damn Priest is always slow with his spells, you see.”", "Seol wondered what Hao Win was on about, but then, a semi-circular barrier with them in the center suddenly materialized. The leader Bugaboo powerfully slammed its mace on this barrier, but other than it trembling violently for a bit, nothing else happened.", "“Oh, well. His mana must be pretty high since the barrier is useful and all.”", "“Didn't a few monsters go over to that side?”", "“I took care of them. But thanks to that, I kinda got held up before coming here to help you.”", "The leader Bugaboo and its ten-plus underlings surrounded the semi-transparent barrier. It was unknown how long this magical defense would last, so they needed to do something about it. However, Hao Win seemed to be rather relaxed.", "“In any case, aren't you really amazing? How many did you take care of by yourself? Fourteen? Fifteen?”", "“It's fourteen. Aren't we in the middle of a battle?”", "“No need to sweat it. It's about time Joker makes her entrance.”", "Hao Win pointed at the other hill. Seol could just about catch the glimpse of Odelette Delphine, currently decked out in a blue robe. She also happened to be aiming her wooden staff at the leader Bugaboo.", "“Avar – Ava – Avaritia.”", "Seol heard a loud buzzing noise. And at the same time, a sizzling ball of flames struck the head of the leader Bugaboo.", "Guaaaaaaak!", "Crackle. The flames caught on the monster's fur and spread out quite rapidly. The leader dropped the mace to the ground, covered its face, and began rolling around on the ground like a madman.", "“Take care of that big guy! We'll take care of the rest of the small fries!”", "The protective barrier was still in place. Staying behind in the safe space, Seol began wildly stabbing the leader Bugaboo that was rolling around in pain. By the time the barrier became visibly thinner, there were several dozen bloody holes on the monster's body.", "There were other monsters still left, but their ranks had been broken into disorder a long time ago. Leorda continuously shot arrows with his bow, while Tong Chai went around silently with his dagger; Hao Win, too, was concentrating on relentlessly attacking his enemies as well.", "For Seol, this first cooperative battle proved to be….", "'….Easy.'", "It might have been a bit tough in the beginning while trying to aggro the monsters, but by enduring, things got progressively easier as time passed by. If he were alone, he would have never been able to clear this mission, no matter how hard he tried. Also, he thought that, if the composition of the team was off by just a little, this mission would've been a lot harder. This battle proved to him why a Magician was valued so highly.", "“You all worked hard!”", "Right after the last creature fell, Delphine raised her hand from the hill over yonder and called out.", "“A Magician is really something else, isn't it?”", "When Seol spoke in an admiring tone, Delphine stopped jumping up and down in delight and tilted her head to the side. From her perspective, all she did was to cast two spells while receiving absolute protection. And she couldn't help but feel that he was being sarcastic, since he had not only blocked the combined attacks of the monster group, but also managed to eliminate almost half of them, too.", "However, she became slightly abashed soon after realizing that Seol was being sincere.", "“Since you Warriors protected me, things were definitely easier.”", "Delphine humbly replied.", "“So? How was it?”", "Hao Win shook the blood off his sword and excitedly asked.", "“Playing with a team ain't bad, right?”", "Seol smiled in reply.", "[You've successfully completed a 'Very Hard' difficulty mission!]", "[1,667 Survival Points have been accredited to you.]", "[Current SP: 1,847]"]}