{"cid": "357", "title": "Chapter 357. A Hero in Paradise, but on Earth (2)", "content": ["FLASH!", "Light scattered everywhere.", "A tall, young man suddenly appeared in the middle of an empty room.", "“….”", "Seol Jihu looked around his room feebly.", "This was already his fourth time.", "It was only natural that he wasn’t particularly moved.", "After standing absent-mindedly for a while, Seol Jihu finally began to wander around the room.", "When he slid open the window, sunlight poured down on him and the cries of cicadas filled the air.", "Out on the street, people were dressed in short sleeves and shorts.", "The year had changed and summer had come without him knowing.", "Only then did his brain really register the passage of time.", "Seol Jihu gazed out the window then lowered his head with a deep sigh.", "He proceeded to skim through a random book, then turned on his laptop and clicked through a few websites.", "Finally, when he finished exploring all the other options, he sat against the wall and turned on the TV.", "—Ah~ Ah~ Ah~ Aqua lipstick~", "Watching a lipstick commercial featuring four celebrities, he smoked cigarettes, one after the other.", "The two eyes staring at the TV screen were totally blank, as was his head.", "It wasn’t until his ashtray was full of cigarette butts that Seol Jihu realized his hand was inside his pocket.", "His fingers were fidgeting with the tiny piece of paper he had received when he left Paradise.", "His lips twisted in a self-derogatory smile.", "“Fuck, I’m bored….”", "This was why he didn’t want to return.", "He had so many things to do in Paradise.", "If there was no work, he could always train.", "But he didn’t have anything to do on Earth.", "Or rather, to be precise, he didn’t know what to do.", "‘…Should I go back?’", "Seol Jihu bit his lips.", "A look of distress flashed across his face.", "It wasn’t like he was running away. He was just paying a short visit to Paradise.", "All members of Valhalla would’ve left Paradise by now.", "And, it didn’t really matter if he got caught.", "He figured he’d just tell them that he forgot something in Paradise and stopped by to get it.", "Spending a day or two in Paradise would surely calm him down. It seemed like a good idea.", "‘I mean, Noona could be back. Also, I have to feed Little Chick holy power….”", "The corner of Seol Jihu’s mouth curled up.", "Just thinking of Paradise made him feel better.", "That’s right. A short visit wouldn’t hurt.", "He concluded and grabbed the small piece of paper in his pocket.", "It was then.", "Ding-dong!", "The notification sound startled Seol Jihu.", "He quickly pulled out his hand like a child caught making a mistake.", "His cell phone, which he had connected to a charger earlier, was blinking.", "“Damn it. Who is it?”", "Seol Jihu frowned and reached for his phone.", "The timing was too good. Someone — probably Kim Hannah — must have predicted that he’d do something like this and sent a threatening text message.", "However, contrary to his expectations, the sender wasn’t Kim Hannah.", "More importantly, his phone was bursting with lots of unread text messages. There were at least a dozen.", "“What the…?”", "Seol Jihu quickly skimmed through the texts.", "Most of them were from the same person, who was neither his family nor his friend.", "[Oppa. What’s up?]", "It was Yun Seora, the youngest daughter of Sinyoung.", "[Are you busy?]", "[Oppa, are you asleep?]", "[Is this Jihu Oppa’s phone number?]", "[You said you’d treat me to dinner….]", "[I thought you’d be back by now…. Are you still over there?]", "[I hate you.]", "[No, I don’t hate you. I miss you.]", "[:‑P Ehehehe. I’m so drunk♡ I hate youuuu.]", "[I heard the news. Congratulations on your victory. Ah, the most recent text was from my sister. Just ignore it.]", "…And so on.", "Two-thirds of the texts were from Yun Seora, even though he never replied.", "She was like a stalker.", "“Scary….”", "Yun Seora’s tenacity terrified Seol Jihu, but he quickly shook off his fear and began reading through the messages.", "He saw several long texts from his mother and several from his brother.", "[Working?]", "[Text me when you get off work. I got a call from the district office today about your military training. Apparently the Reserve Forces is preparing to suspend your ID. You know busy work is no excuse for skipping training.][1]", "[Why is it so hard to get in touch with you? Mother misses you a lot.]", "[Just how busy are you…? Give me a call. I know you’re working to pay off your debts, but it won’t be worth it if you collapse from overwork.]", "The most recent text was also from his brother.", "[Tomorrow’s Mother’s birthday. Did you get her text? Come home. Don’t worry too much. At least give her a call if you can’t make it.]", "Suddenly Seol Jihu came to his senses.", "It was like a bucket of cold water had just been poured over his head.", "‘What was I… just about to do?’", "One of the things he regretted most was that he never listened to his family.", "If he hadn’t gone when his family told him not to go. If he hadn’t done this or that when his family told him not to do so. Then, his life would never have been that bad.", "Just now, he almost made the same mistake as then.", "If Jang Maldong had known that Seol Jihu had returned to Paradise less than an hour after returning to Earth, he would’ve been so disappointed.", "When that thought came to his mind, he didn’t want to rip the paper anymore.", "“Haaaa.”", "Heaving a sigh, Seol Jihu brought his finger to the call button.", "Then he stopped.", "‘Wait a second.’", "Again, he almost acted without thinking.", "His brother thought he worked for Sinyoung, but he actually worked in Paradise.", "Until now he had never really cared about this.", "He just assumed that Kim Hannah had taken care of everything. But he knew he shouldn’t be so lenient anymore.", "Seol Jihu immediately searched every nook and cranny of the room for the data he’d received long ago.", "He also checked all the entries in his passbook and calculated dates.", "‘Okay. I can tell him I’ve paid off all my debts, and that I have money now….’", "Finally, he pressed the call button.", "He didn’t have to wait long. He heard a familiar voice almost immediately.", "—You.", "The voice sounded a little angry.", "—Why did it take you so long to…", "Seol Jihu deliberately spoke in a cheerful tone.", "“Hey, Hyung! It’s me.”", "*", "That evening, a family gathered at the table for dinner.", "“Oh, right.”", "The air in the dining room was quiet and serene like it often was in temples. Seol Jinhee was the only one speaking.", "“I want to talk about Jihu.”", "It was then that Seol Wooseok dropped a bomb without a warning.", "“I’m so pissed off. I’m a senior now, but the professor is still…?”", "Seol Jinhee’s voice thinned before she let out a sharp shriek.", "The sound of silverware scraping against the plates stopped.", "The father froze with his spoon halfway to his mouth, and the mother opened her eyes wide.", "“Damn it. Why did you have to bring him up? I just lost my appetite.”", "Seol Jinhee slammed her chopsticks down on the table.", "“Tell me why!”", "“Lower your voice. Our parents are here.”", "“D-Did you get in touch with him? How is he? He’s not sick or anything, is he?”", "Noticing the tense atmosphere, their mother asked in a hurry.", "“Yes, I talked to him on the phone during lunch today. He sounded well.”", "“Why didn’t he call sooner? I was so worried….”", "“I told you before that Jihu cleared his credit line, right?”", "“Yeah, you said that’s where he got the money from before….”", "“When I met him at a cafe a while ago, he said he wouldn’t contact us until he paid off his debts. Maybe that’s why he didn’t call. You know Jihu is quite diligent about things like that.”", "“That’s right. He’s always been stubborn.”", "“Well, he told me he’s cleared his debts now.”", "“Really? Ah, but I wish he’d called at least once….”", "Her voice sounded a little disappointed, but her face told a different story.", "She heaved a sigh of relief, her hands smoothing down her chest.", "“And.”", "Seol Wooseok slowly put down his chopsticks and clasped his hands.", "On the surface, he appeared calm, but on the inside, he was looking for the courage to say what he was going to say next.", "“He’s going to come home tomorrow, to celebrate Mother’s birthday.”", "Seol Jinhee’s eyes widened with astonishment.", "“W-What? Who’s coming where?”", "“He was very careful about it. He said he’d just call, but I insisted that he come.”", "“Are you out of your mind? Did working day and night finally make you take the wrong pill?”", "“Keep your voice down.”", "“Why should I? This is my house!”", "“It’s our parents’ house, not yours. And tomorrow is Mother’s birthday, not yours.”", "“What….”", "Seol Jinhee clenched her teeth and turned her head.", "“Dad!”", "She yelled at the middle-aged man who was silently pouring water into his cup.", "“Dad! Are you just going to keep silent? Say something!”", "The father gulped down the water and slammed the cup down on the table.", "He then let out a deep sigh and turned his nonchalant gaze to Seol Wooseok.", "His emotionless eyes made Seol Wooseok nervous.", "“Did you take a look at the data I sent you? Jihu’s paychecks, credit line score, and others.”", "“I ripped them up and threw them away.”", "“Why?”", "“He even borrowed his friend’s passbook to deceive us. Do you expect me to trust that scoundrel again?”", "“Of course, I remember that incident.”", "Seol Wooseok nodded.", "“But that’s not the case this time. I’m sure of it.”", "“How do you know?”", "“When Jihu brought us his friend’s passbook, Mother and Jinhee believed him right away. I was the one who insisted on keeping him in check. Do you remember that?”", "His father did, so he let out a sound of affirmation.", "“When I met him at the cafe, I made sure to double-check everything. The numbers worked out. He would have to be extremely thorough to deceive me with those numbers, and I don’t think Jihu would go that far.”", "His father snorted.", "“Truth or not, it doesn’t matter! I can’t trust him ever again. I won’t. I don’t understand how he was able to pay off his debts so quickly.”", "“You know Sinyoung is famous for its workplace wellness and high salary. He also works overtime every day and goes on a business trip at every chance he gets.”", "“Business trip? Don’t kid with me. He probably made all that money from gambling.”", "“Jihu applied for an entry ban to Seorak Land in March last year. I called them yesterday. They said he hasn’t come back since.”", "“God, you can be so naive sometimes. Are there casinos only in Korea? Don’t they have them overseas, too? Ah, maybe he went on an overseas business trip as an excuse to visit a casino. Yeah, that sounds about right. Everything makes sense now.”", "Seol Jinhee remarked sarcastically, her voice confident because her father had sided with her.", "“You’re wrong.”", "Seol Wooseok adjusted his glasses.", "“Jihu’s never left the country.”", "“How do you know?”", "“I got a call from the Hongeun-dong Reserve Army a while back. They said Jihu didn’t come in for training. Because they couldn’t get in touch with him, they’ve been handling his case as notice non-deliverable. At first, I thought he was on a business trip abroad, but they said no. Military training is automatically postponed when you’re abroad, but the Military Manpower Administration’s immigration records show that he has no history of leaving the country.”", "Seol Wooseok continued.", "“Which means he went on a domestic business trip. And Seorak Land is the only casino that citizens can access in our country. He really did quit gambling.”", "His argument was perfectly logical, and Seol Jinhee hesitated.", "The truth was that Seol Jinhee knew how meticulous Seol Wooseok was.", "The fact that her brother was so sure meant that he had sufficient grounds to believe what he said.", "Still, her past experience advised her not to trust her brother. Seol Jihu had betrayed them far too many times.", "Her mind understood, but her heart simply wasn’t convinced.", "“Don’t you think you’re being too lenient? Casinos are hardly the only places to gamble. What about horse racing? Illegal sports betting? Illegal casinos?”", "“I don’t know. Even at the height of his addiction, he would only play Blackjack or the slot machine at Seorak Land. Never anything else.”", "“But you can’t be 100% sure, can you? And— what was it again? Sinyoung? That’s weird, too. Why would Sinyoung Pharmaceuticals want someone like him?”", "“It’s true that he joined the company. There’s no room for doubt. You know Jihu’s resume has always been quite impressive. And I even called Sinyoung to check.”", "“You called them?”", "“Did you really think I’d just take his words for granted? I asked them and they immediately confirmed his position as a sales team employee. The team leader, Yun Seora, said a lot of good things about Jihu.”", "‘No way.’", "Seol Jinhee gave a snort.", "“What’s her name again? Yun Seora? Well, maybe I should give her a call myself. Obviously she’s one of his friends or acquaintances.”", "“That’s impossible. Sinyoung’s security is airtight. And I did look into it more closely. I was surprised when I found out that Yun Seora is the youngest lady of Sinyoung Pharmaceuticals.”", "“…W-What?”", "Seol Jinhee blinked in surprise.", "“She’s a direct family member of Yun Seojin, the Chairman of Sinyoung Pharmaceuticals. Well, I suppose that’s how she was able to become a team leader at such a young age.”", "Seol Wooseok continued.", "“But that’s not the end of it. When I met Jihu at the cafe next to the Sinyoung building, one of Sinyoung’s directors stopped by to say hello.”", "“Director?”", "“I recognized her. It was Yun Seohui, the eldest daughter of the Yun family.”", "Seol Jinhee quickly grabbed her cell phone and searched for the name.", "She frowned.", "“This makes no sense…. Didn’t he say he was just an employee? Oppa, are you lying to us, too?”", "“I’m not lying. I wouldn’t have believed it myself if I hadn’t seen her with my own eyes. He must be getting a lot of attention at work.”", "Seol Wooseok raised his voice.", "“My point is that I don’t think Jihu could’ve asked those people to lie for him.”", "It did sound far-fetched that an ordinary person like Seol Jihu would make a personal request like that to the daughters of Sinyoung.", "Seol Jinhee closed her mouth.", "On the contrary, her mother was all smiles.", "Her eyes were slightly wet from tears of joy.", "“I believed in Jihu. I knew he could do it if he put his mind to it.”", "She nodded and sniffled.", "“…Father.”", "Seol Wooseok cleared his throat and turned his eyes to his father.", "The man was silent.", "He was looking down at the table with expressionless eyes.", "“…Let me ask you something.”", "Suddenly, their father’s voice broke the uncomfortable silence.", "“Why are you doing this?”", "“Pardon?”", "“It’s not only me or your mother or Jinhee who’s been betrayed by that bastard. He also abused your trust and even hit you. So why are you so eager to help him?”", "“He’s right. Do you know what my friends call you? A pushover and a wuss!”", "Despite Seol Jinhee’s insults, Seol Wooseok remained calm and even.", "He lowered his gaze and replied in a low voice.", "“That still makes me angry when I think about it, but… I used to hit Jihu a lot, too.”", "“Hit him? You?”", "“Yes, when we were little. At one point, it got so bad that I almost strangled him. But Jihu’s not the type to snitch, so you wouldn’t know.”", "Seol Wooseok gave a bitter smile.", "His father listened to his son's confession with a dumbfounded look on his face.", "“And frankly… I’m not the only one who did Jihu wrong. You guys are accomplices, too.”", "“Us? When did we treat him wrong?”", "“When Uncle and Aunty passed away and we took Seonhwa and Seunghae under our wings.”", "His father’s face hardened.", "“I understand your feelings now. It couldn’t have been an easy decision for you to take responsibility for the children of your friends who passed away in an accident. But at that time, Jinhee and I were young. We were too immature to understand your decision.”", "It was just like he said.", "Their intentions were noble, but the reality wasn’t kind to them.", "The Seol family wasn’t poor at the time, but they weren’t rich either.", "Accepting two children into their home put a considerable financial burden on the family.", "Seeing their parents work overtime, struggling to make ends meet, Seol Wooseok and Seol Jinhee couldn’t bring themselves to look at the Yoo sisters in a favorable light.", "And there definitely was a time when they hated the sisters for taking their mother’s attention away from them.", "“Jihu and I fought because of Seonhwa and Seunghae.”", "Seol Jihu was the one who stopped them whenever they tried to act out on impulse.", "“It’s all thanks to Jihu that Jinhee, Seonhwa, Seunghae and I were able to grow together without things going wrong. Father, you know that.”", "His father bit his lips.", "Of course, he knew.", "It was Seol Jihu who opened the hearts of the sisters who refused to communicate with the world after their parent’s death.", "Seol Jihu was the one who acted as a mediator between Seol Wooseok, Seol Jinhee, and the Yoo sisters, making sure they all got along.", "He did what his parents couldn’t do, and did what was essential to bringing the family together.", "Through all that, the little boy never once complained.", "“See you later, boss.” His son used to say that phrase whenever he left for work. And when he came home at night, the boy would smile playfully and ask, “Did you make a lot of money today, Daddy?”", "His son’s smile was what comforted him when the weight of reality crashed down on him both at home and at work. He was proud of his son, though he never really said it out loud.", "“Wooseok’s right. Jihu may be a funny man, but he’s always been quite mature since he was a kid. Whenever Wooseok and Jinhee fought over the seat next to me, Jihu would sit alone, saying he was fine.”", "Their mother commented.", "“Once I fell asleep while looking after Seonhwa and Seunghye, and Jihu crawled in next to me. But I was half asleep and so tired that I pushed him away. I can't imagine how much it’s hurt him. He was just a little boy… but he massaged my hands and shoulders without a word of complaint. Just thinking about that time, I….”", "She wiped her eyes, wet from tears of reminiscence.", "Their father screamed with a grimace.", "“Why do you keep bringing up the past?”", "“Fine! You don’t have to see him if you don’t want to, but I will. Just be quiet and stay in your room, okay? Don’t disturb us like the last time.”", "“What?”", "The father raised his voice.", "“I know! I know how he was as a little kid. But why do you keep talking about the past? The bastard took advantage of my trust not once, not twice, but at least a dozen times! What more could he want? How long are you going to live in the past? The past is the past. Both you and Wooseok need to drink a glass of cold water and come to your senses!”", "“I understand how you feel, Father. You’re right, Jihu made a big mistake. He left a huge scar on our family that probably will never be erased.”", "“How can you talk to me this way knowing that?”", "“You know how I am.”", "Seol Wooseok replied.", "“I know how you feel. I know. That’s why I’ve been waiting so long to tell you this. I spent a lot of time thinking and finally, I’m convinced. I hope you’ll give him one last chance.”", "“Again? How many last chances does he need?”", "His father glared at him, but Seol Wooseok was persistent.", "“Father.”", "He continued in a calm voice.", "“He wasn’t like that from the beginning.”", "“You….”", "“You’re right. Jihu is no longer the person he used to be when he was little. He’s changed. But that means he can change again.”", "“…Ha!”", "“I’m not asking you to forgive him right away. But can you deny that Jihu is trying? Please, at least listen to what he has to say—”", "Their father shot up from his chair.", "He turned and headed for his room, refusing to hear what his son had to say.", "“Darling!” The mother shouted, but he slammed the door on her.", "“…See, I knew this would happen.”", "Seol Jinhee remarked sarcastically and got up from her chair too.", "“Fine. Do what you want, I’ll do what I want. Try me if you want, but be prepared for the worst birthday ever.”", "“Hey.”", "“I’ll never forgive that bastard! I just won’t!”", "“Jinhee!”", "Mother called but Seol Jinhee stomped up the stairs.", "Seol Wooseok ran his fingers through his hair.", "He never thought it was going to be easy. Still, their reaction was far worse than he’d expected.", "But in a way, it was only natural.", "He understood their side of the story.", "Whenever he recalled the recent past, even his blood would start to boil with anger.", "Seol Wooseok heaved a quiet sigh.", "For what it’s worth, he did everything he could.", "Now it was up to him….", "*", "After he hung up the phone, Seol Jihu left his apartment.", "Tomorrow was his mother’s birthday, and also the day he’d meet his family for the first time in a long time. He didn’t want to meet them empty-handed.", "His hands quickly became full with all the gifts he had carefully chosen for his family, as well as for Yoo Seonhwa and Yoo Seunghae.", "Of course, these gifts came at reasonable prices and weren’t worth tens of millions of won, like the ones he used to buy.", "At last, the long-awaited day dawned.", "That evening.", "“…”", "A young man in a neat suit, carrying six shopping bags in his hands stood in front of the Seol residence.", "1. In Korea, soldiers (civilians) who complete their mandatory military service are automatically put into the Republic of Korea Reserve Forces and must first serve 4 years in the Mobilization Reserve and then 4 years as a Homeland Reservist. "]}