{"cid": "23", "title": "Chapter 23. A Star Shining Again (3)", "content": ["—A Note from the Guide (49/50)", "1. Advice to remember when in the Neutral ZoneDo you wish to quickly increase your physical level?Why not use the special 'Competence'?Available in: the VIP store", "Again, another mention of the VIP store.", "'Competence?'", "Now that he had taken a look, the note turned out to be just that, a note that had neither a beginning nor a proper ending.", "Seol still decided to leave his room, however. The only way to satisfy his curiosity was to check this Competence with his own two eyes.", "The VIP store was located on the eighth floor. When he pushed the door open, he found a small room, a counter, and a maid sitting behind it. Her eyes grew wide as soon as she saw him.", "“Eh?”", "“?”", "“Oh, my apologies. I didn't expect to see a survivor to enter through those doors so soon…. Are you perhaps here to window shop?”", "“Is this the VIP store?”", "“If you wish to purchase an item, please enter through here.”", "The maid pointed towards a small door to her side. It seemed that there was another room behind the one they were in.", "“Unfortunately, it isn't possible to window shop in this store. You also need a minimum of 30,000 SP to enter, as well. If you're curious about the products available in here….”", "“Do you have an item called Competence on sale?”", "Seeing the maid about to pick up a familiar-looking pamphlet, Seol hurriedly interjected. The maid flinched and stopped. She then spotted the piece of paper gripped in his hand and an unreadable light flickered in her eyes.", "“Ah~ of course. The Guide's…. Well, then. The story changes a little bit in that case. Please give me the note.”", "After receiving the Guide's note, she opened up the huge closet right behind her. The interior of this wooden closet was packed full with rows upon rows of adult finger-sized potion bottles.", "The maid pulled one out and placed it on the counter. Seol stared at this small bottle containing a milky white substance. He activated 'Nine Eyes' but couldn't see any color.", "“You will also find Competence in the regular stores down below. However, they pale in comparison to the ones found in this VIP store – the price, the effects, etc.”", "“What differences are there?”", "“Mm…. Well, the most expensive Competence you can find in the regular stores is priced at 250 SP. Its effects last for 12 hours. The maximum amount of boost you will receive is four times the normal. That's not so bad if you consider the cost-effectiveness. Don't you agree?”", "“…..”", "“Oh, you meant the VIP store's? There isn't even a need to say it out loud becuase the potion's effects and its duration are doubled. For a low, low price of 400 SP, the duration lasts for 24 hours while you receive eight times the boost! Training one single day will give you the same results as training for eight days straight, guaranteed.”", "Seol had to wonder whether he made a mistake when he thought the tone of her voice shifted subtly as if to ask, 'You'll buy it, right? You will definitely buy it after this sales pitch, right?'", "“Isn't that just impossible? How can such a thing be….”", "Seol displayed a strong sense of disbelief. While she was laughing with her eyes, the maid's overall expression was calm and composed.", "“This is the Neutral Zone.”", "“Yes, so?”", "“This is the divine sanctuary created through the combined might of the seven deities. As long as you are trying to complete the tasks found within this zone, no effort will be spared in supporting you.”", "“…..”", "“Of course, a part of this zone's reason for existence is to test you. But the main objective is to help you develop your skills even further and to increase the odds of your survival outside.”", "The maid tilted her head slightly to the side and smiled radiantly.", "“….That's what I'd like to say, but well, it's true that this potion is a little bit peculiar. Only 60 bottles are made available during each of the Neutral Zone's openings. Also, not everyone can buy one. There are even restrictions placed where one needs to bring along these 'notes’ from the Guide. That's just in case an Invited hears of the potion's existence before arriving at the Neutral Zone.”", "Seol thought about this carefully. He felt like he could see the answer to his quandary. Until now, he had been blinded by the VIP store to have realized it, but the words 'trying to complete the tasks found within this zone' continued to tug at his mind.", "“Will you buy one?”", "The maid placed both of her hands on her waist and confidently asked him. Seol organized his thoughts for a bit, then raised his head to meet her gaze.", "“Yes.”", "*", "After leaving the VIP store and heading back to his room, Seol ran into someone he was rather familiar with. And that was Yi Seol-Ah, looking somewhat anxious as she paced up and down in front of his door.", "“Miss Yi Seol-Ah?”", "“Orabeo-nim!” (TL: Highest form of honorific used to denote one's elder brother, used by females)", "‘Orabeo-nim?’", "While Seol stood there confused, Yi Seol-Ah ran to him with a look of worry on her face.", "“Are you alright? Are you really alright?”", "“W, what do you mean….?”", "“You looked like you were in pain before. I was worried, so I followed you and tried to see if you were okay, but you weren't in your room….”", "Seol realized that the knocking noise he heard earlier belonged to Yi Seol-Ah. She was most likely referring to the time when Seol came back looking haunted after completing the 'Hard' difficulty mission. He was out of it back then, so he must have looked rather odd. Seol could understand now why she was behaving this way.", "“…Have you been crying?”", "‘Crying?’ Seol unconsciously touched around his face and found that the spring water he poured on himself hadn't fully dried yet.", "“….I guess so.”", "“B, but, why?”", "“Because I’m pathetic.”", "“Orabeo-nim isn't pathetic at all!”", "Yi Seol-Ah jumped up and down on the spot. She hurriedly scuttled towards him and carefully grasped hold of his arms.", "“N, no, you are simply amazing, that's all. You even completed a Hard mission by yourself. Because of that, a huge chaos is unfolding downstairs.”", "Seeing her worry-filled eyes staring up at him, Seol felt like he was feeling a little bit better than before. Just a little. He slowly shook his head.", "“That mission was not something I should've tried in the first place.”", "“The mission was… that difficult?”", "“I attempted it without even realizing my own limits. And I almost died because of it. To be honest… it's a miracle that I'm standing here.”", "Yi Seol-Ah was about to say something, but she chose not to after seeing Seol's deeply wounded facial expression.", "“I shouldn't have carried on like that. I shouldn't have tried that mission. Until now, I've only….”", "His furrowed brows deepened even more. He closed shut his mouth for a second or two, the sounds of gritting teeth escaping from between his lips.", "“I was… using my own life as collateral in a stupid gamble.”", "And I even swore to myself I'd never, ever gamble again…", "“O, Orabeo-nim….”", "Yi Seol-Ah fidgeted and fretted about while wondering whether there was something she could do to aid him. She then grasped his sleeves a bit tighter and tugged. Seol raised his downtrodden eyes, only to find Yi Seol-Ah and her gentle smile looking back.", "“Would you like to run with me for a while?”", "“Uhm, excuse me?”", "“Yes, we should have a foot race!”", "Seol ended up slightly panicking after that suggestion literally came out of nowhere.", "“A race? Why a race, all of a sudden…?”", "“Running is really great, you see! Your mind clears up when you're in the middle of your strides, and you'll definitely feel better after sweating a lot.”", "“But, uh, there is no space around here to run, though? And to run on the corridors is just….”", "“Take a look at this~.”", "[A foot race (Number of available attempts: ꝏ/ꝏ)]", "Lap the track ten times!", "Difficulty: BasicWhen successful: noneWhen unsuccessful: none*Cooperation possible (up to 6 people)", "These were the contents from the mission parchment the girl produced. And it wasn't just one or two pages, either – she was holding at least thirty of them. Seol looked at the bundle with a dazed expression, prompting her to go, ‘Oops!’ and explain herself.", "“It's okay. The number of attempts for this mission is infinite, so I think it doesn't really matter if I take a few more than usual.”", "“But still, isn't that a bit too much…?”", "“Oh. Uh, well, I need to run around for a while before I go to bed, or I won't be able to fall asleep.”", "She poked her tongue out and waved around the mission parchment slightly. Seeing her bright, innocent smile, Seol couldn't bring himself to say no.", "The method of 'cooperating' was rather simple. Whether it was by holding hands or touching shoulders, it was fine as long as there was some kind of body contact when the parchment was torn in half.", "The location they moved to was an athletic field. It was no bigger than what one might find in a middle school. Seol thought that doing ten laps around the track found here shouldn't be too hard, but well, he had to revise his assessment soon enough.", "'W, was my fitness level this terrible?!'", "He had no problems up to fourth and fifth laps. However, he began gradually slowing down on the sixth lap, and by the time he barely managed to complete the seventh, he couldn't even see Yi Seol-Ah's back anymore, never mind thinking of catching up.", "He couldn't even tell whether he was running on the track or the track was running him out; his breathing was beyond rough, and his heart pounded incredibly hard while loudly demanding more and more oxygen to be delivered. Sweat poured out from his back as if it was raining, and a bittersweet odor leaked out from his throat.", "'I… I… I can't… do… this!'", "He wanted to plop down on the floor and pass out, but then again, that would be just too embarrassing. Why? Yi Seol-Ah had already finished all of her 10 laps and was waiting by the start/finish line while carefully regulating and calming down her breathing, that was why.", "However, this was unsurprising. For many, many years, his body had been poisoned by the constant stream of late-night gambling, alcohol intake, and non-stop smoking. So, there was no way he would be in a healthy state at all, especially when he never exercised in the first place.", "“Change the way you breathe! Don't breathe through your mouth, but through your nose! Like this, hu-hu, ha-ha! Hu-hu, ha-ha!”", "Seol heard her encouragements and gritted his teeth. Only now, the answer that was just within his reach became crystal clear.", "Just like his own words muttered out not too long ago, Seol had been doing things by simply gambling with his life as the collateral. Sure, he had received a favorable hand thanks to his Gold Marking, but if one single thing went wrong somewhere, then he'd end up dead without a doubt – like when he collapsed from the skeleton's jumping attack, for instance.", "Also, the maid was right, too. The Neutral Zone wasn't designed to be a place where you must find a way to survive. No, it was designed to help one learn how to survive.", "Everything had an order to follow.", "Seol finally managed to complete all ten laps and stopped just before the finish line. He crumpled to the floor like a collapsing building, and roughly wheezed in and out. Yi Seol-Ah trotted to where he was and advised him to slowly regulate his breathing, before tilting her head a bit, looking somewhat surprised.", "“I didn't expect Orabeo-nim's fitness level to be this low….”", "“H, how come…. Miss… Yi Seol-Ah… can run… so well?”", "“Well, I've been delivering milk in the early mornings, you see? I did that for about one year straight.”", "“Sounds… rough….”", "“Oh no, not at all! I've always enjoyed running, you know? Even when I was at school, I entered the athletics club and ran track and field almost everyday~.”", "Yi Seol-Ah drew a victory sign with her fingers. Seol always thought her demure, shy demeanor and her good looks matched up pretty well, but as it turned out, she was a bona fide athlete, instead. He gladly accepted her extended helping hand while opening his mouth.", "“Thank you.”", "“Eh?”", "She became flustered as his gratitude came out from nowhere.", "“My mind's a lot clearer now.”", "“Oh, I… It was nothing. If I was able to help somehow, then I'm glad…. Besides, you… have saved me, so…. I should be, instead….”", "She quickly lowered her gaze and her cheeks reddened softly. Seeing her at a loss and not knowing how to respond, a certain streak of mischievousness tickled Seol's fancy.", "“In any case, thank you.”", "“N, no. It's nothing at all….”", "“Thank you. I mean it.”", "“No, it's really nothing at all. It's me who's….”", "“I really don't know how I should repay this debt to you.”", "“….Orabeo-nim.”", "Yi Seol-Ah puckered her lower lip in a pout and cutely glared at him.", "“You are doing this only because of what Sungjin and I did, yes?”", "“Am I busted?”", "Seol winked at her and stood up straight.", "This was quite surprising. During the run itself, he felt like a dying man, but now that it was over, his mood had improved dramatically.", "“It's not bad, this running thing.”", "“Right? Running is easily the best way to increase your fitness level. It increases your lung capacity, improves the way your lungs function, and it strengthens your heart. Plus, it even improves your blood circulation!”", "Seol's eyes gradually grew wider as he listened to the virtues of running. He genuinely had no idea that something as simple as running could be this beneficial.", "“In that case, shall we run together one more time?”", "“Mm…. I'm happy with that, but…”", "Yi Seol-Ah tilted her head this way and that before she spoke to him in a low voice.", "“You have to drop the honorifics, okay?”", "Seol let off a soft chuckle at her unexpected request.", "*", "After ending the running session with Yi Seol-Ah, Seol rechecked the noticeboard, and sure enough, he could see them. Right at the bottom of the board, he found huge stacks of parchments with 'Basic' written on them. With no Survival Points offered up as rewards, everyone had been ignoring them until now.", "Seol revised his plans completely. The first thing he did was to visit the VIP store again. He then ignored the pleas of the maid there and bought the remaining 59 bottles of Competence. After drinking a bottle, he began running again.", "'Healthy citizens make a strong nation!'", "Shouting the famous slogan that encouraged people of Korea to exercise, Seol solely focused on improving his fitness level. He figured that before he could start doing any missions, he needed to be healthy and fit.", "As days passed, other survivors began to think Seol's actions were odd. After all, to their eyes, he possessed enough abilities to solo a Hard-ranked mission. Even so, he was only doing ‘Baisc’ training regimes that offered no rewards. Not only that, he was repeating them over and over, completely stopping other missions.", "Seol also found it pretty hard in the beginning. His weak physique demanded rest way too often. And inevitably, he grew bored of repeating the same thing all the time. He was constantly haunted by thoughts that told him, ‘This is enough, you can stop now.’", "However, when he sensed the gradual change his body was going through, he was able to throw away all doubts and temptations.", "On the same track that he could barely run around ten times at the start of it all, now he could complete the distance without decreasing his speed one bit. His breathing would be ruffled only a little, too. In the end, he thought this wasn't going to be enough, so he proceeded straight into the next training mission.", "And that was to run 20 laps around a slightly longer track. There was one thing different for this 'mission' than the previous one, though – there was a reward of 1 SP. Regardless, he repeated this mission diligently for a while, and he could feel his body developing ever so gradually.", "Maybe it was all due to the effects of the Competence potion, he could definitely feel the improvements the more he exercised. And since the results were so tangible and palpable, he no longer found the training routine monotonous and boring anymore. They had become much more interesting and fun. Every time he succeeded when he thought he couldn't, every time he endured and achieved his goal, something within him was changing.", "He got addicted to this euphoria of success. And he began pouring all of his focus on training like a madman. He spent two-thirds of a day strictly on training.", "The big reason why he could continue doing this, though, was his room – the room that Maria personally declared as the 'best in the Neutral Zone for resting'. Just one hour of rest washed away all the fatigue, and he only had to sleep for four hours to recover his stamina completely.", "Soon, Seol realized that time was too precious to waste on anything else and thus became interested in how to recover his stamina even faster. Since there were potions like Competence, he figured there could be something else similar to improve one's recovery rate as well.", "He didn't hesitate to spend his SP in this regard. After all, he had no other place to spend these points, what with his meals and sleeping quarters being free to use. Soon, his exercise time increased to nearly 20 hours. He believed that he had finally begun making good use of the great starting conditions he was given, not just relying on them as if they were his crutch.", "Yes, he felt envious of other survivors forming teams to tackle various missions. He still felt some attachment towards the Ambrosias, too.", "But, when he ran around with all his might, all the negative thoughts filtered out of his system and he could control his mind better. He was determined not to take on any missions until he felt confident enough to tackle them again.", "And so, two weeks went by, just like that.", "For everyone else, it was 14 days, but for Seol, the past two weeks were more like 112 days, instead.", "*", "“He's insane.”", "Cinzia concluded as so while watching the footage. She was resting her chin on one hand at the same time. On the screen, Seol was running on the track without taking a break.", "“Spending half of the month only on training his basic fitness…. Hah. I really did not expect that someone like him would pop up. I'm sure the gods are really happy right about now.”", "“Shouldn't we think about informing the survivors soon?”", "The maid courteously waiting behind her spoke up. It was Agnes, the maid who offered to guide Seol around in the beginning, only to be kicked to the curb rather rudely by Maria.", "“What? Oh, you mean the fake deadline?”", "“The Neutral Zone is in turmoil at the moment. The deadline has been shortened far too drastically. If the survivors learn of the original deadline, then….”", "“Then? What can they realistically do?”", "Cinzia extracted a cigarette from her inner pocket. Agnes expertly lit it up.", "“Don’t worry about it. We’ll just relax and wait and then tell them, 'Oh, you’re all so pitiful. I decided to generously extend the deadline’. Simple.”", "“But still….”", "“Enough.”", "Agnes shut her mouth right away. A thin smoke slowly drifted out of Cinzia's mouth.", "“There's no problem. Besides, didn't I already send the word out that the Neutral Zone's deadline will be left to my discretion?”", "“There has been a debate as to whether you changing the rules as you please is wise….”", "“Hmph. Well, then. Tell me, what do you think would have happened if I told them that they can stay in here for three months?”", "Agnes could only sigh out after being on the receiving end of that pointed question.", "“It's too obvious. They would take it bloody easy. I mean, even those with 0 points would only need to get 30, 40 points a day to pass. Don't you know just how much price we had to pay to establish this Neutral Zone? You think I'll just sit here and watch such a thing unfold?”", "“That is… true, as well.”", "Agnes reluctantly agreed.", "“Even the most worthless fool can complete the Normal difficulty mission by the deadline as long as they build themselves up step by step. More promising eggs would be able to go beyond that. You’ve heard of Sung Shihyun who started off from the Basic difficulty and cleared the 'Impossible' difficulty on the final day, right?”", "“Yes, I’ve heard the story.”", "“That's right. This place is designed to speed up growth. But what's the point of telling them that it's important when they don't even bother?”", "“….”", "“Hearing it thousands of times is far worse than seeing it once. If they can't feel it and sense it by themselves, there's no point telling them the truth hundreds of times. At least now, with the short deadline, they’re forced to desperately give their all.”", "‘But they will reach their breaking point soon’ was what Agnes was about to say, but she kept silent and just lowered her head. She didn't 100% agree with this notion of forcing people because there weren't enough of them voluntarily going for the optimal. But she didn't have any sound rebuttals to offer. The countless cases of the past Neutral Zone openings were ample enough proof of Cinzia's assertion.", "Most importantly, though – the manager in charge of the summons of March 2017 was Cinzia. Besides the basic rules that needed to be adhered to, the rest was left to her sole discretion.", "“Well, I shouldn't be saying those words out aloud, right? I too used to complete these missions like a loon, after all.”", "Cinzia returned her gaze to the screen and licked her lips slightly. Rather than dissatisfied, she looked somewhat envious, instead. Agnes covered her mouth and smiled softly.", "“If I trained as hard as he did when I came to this place…. Then, I’d be twice as strong as I am by now.”", "“I also think so.”", "“Ho? Even the famous Agnes thinks so?”", "“Of course. Every time I’m faced with my limits, I have regrets. If I could buy a chance to start from the beginning, then I would not hesitate to spend millions and millions.”", "Cinzia smiled brightly. She seemed to be really enjoying this.", "“Returning in time, huh. That's an interesting topic. So, how would you do things differently?”", "“Mm, first, I’d try to amass as many Survival Points as possible in the Tutorial. Then once I reach the Neutral Zone, I'd drink one bottle of Competence from the VIP store every day while fully utilizing the sleeping quarters provided to the top survivor. Since I’d have points left over even after that… well, I’d probably do the same thing that man is doing right now.”", "“That's right. That's why I'm kinda envious.”", "Cinzia nodded her head and shifted her gaze away from the screen. Within the eyes of Agnes busily staring at the footage, an odd desire was visibly burning bright.", "“I guess your instincts as a craftsman haven’t gone away. It's fine if you wish to help him out.”", "Cinzia’s sudden consent made Agnes blink her eyes in surprise.", "“Pardon? Ah. But, that man is….”", "“I know, he was invited by Miss Foxy…. Here's the thing, though. I've heard of something interesting.”", "While still smoking her cigarette, the ends of Cinzia's lips began arching upwards."]}