{"cid": "270", "title": "Chapter 270. Jackpot (1)", "content": ["Charlotte Aria was only able to escape from Sorg Kühne after two hours.", "“Haaaaaah.”", "This was why she did not want to grant him an audience. Ever since her second brother Campbell Aria died, he nagged her constantly whenever he saw her.", "After experiencing it for a few years, just seeing his face made her heart sink and her stomach churn. Sometimes, Charlotte Aria would fail to hold back her temper and lash out, and whenever that happened, the desire to chase Sorg Kühne out increased.", "Of course, it always stopped at just a mere thought, and she never tried to actually carry it out.", "Charlotte Aria was young and immature as a ‘queen’, but it was difficult to consider her a bad ‘person’. She wasn’t so heartless as to chase out an old servant who had served the royal family in times of need for dozens of years.", "Nicely put, she was innocent. Badly put, she was indecisive and weak-willed.", "To be a wicked woman, one needed a strong resolve. In this sense, not being an evil ruler wasn’t necessarily a good thing.", "“Whew…”", "Charlotte Aria sighed once again before looking around. The grand hall of the palace was quiet and lonely.", "“….”", "Thinking about it now, other than Jung Sua and Sorg Kühne, she had no one else. No one tried to approach her, nor did they ask anything of her. To be precise, there was one more person, but that person always left her very exhausted.", "In the end, she stayed cooped up in the palace every day.", "Thinking this way, an indescribable sense of emptiness and loneliness crept up inside her.", "She had already sent Jung Sua off after consoling her and had sent Sorg Kühne out after yelling at him. She wanted to vent her frustration at someone, to get her pitiful situation off her chest and be consoled.", "After wandering around the grand hall meaninglessly, Charlotte Aria walked to her bedroom hastily.", "“Damn it, where did I put it?”", "After rummaging through her room for a long time, she found the item she was looking for— a communication crystal.", "Hesitation flickered in her eyes as she saw the crystal, but she soon steeled her resolve and sat down at the edge of her bed.", "Wavering slightly, she placed her hand on the crystal ball. While she never put in any effort to train, a royalty was still a royalty. Moreover, Charlotte Aria was the direct descendant of the Thunder Monarch and the Aria family, known for their mastery in magic.", "She at least had the ability to activate a communication crystal. Though, it was really the most basic of skills.", "As she stared at the flickering crystal with worry, a clear light suddenly flashed. After seeing the person reflected in the crystal, Charlotte Aria’s complexion brightened.", "“Un-Unni….”", "—Oh? What’s gotten into our crybaby queen to give me a call?", "When a less-than-enthusiastic voice flowed out, Charlotte Aria quickly turned sullen.", "“I’m not a crybaby…”", "—Why did you call?", "“I wanted your advice regarding something…”", "—Advice? Hah, didn’t you speak all high and mighty last time about never calling me again? What happened all of a sudden to make you change your mind?", "The woman twirling her hair and speaking indifferently was none other than Teresa Hussey.", "Eva and Haramark. The two royal families were in close contact since earlier generations and had solidified their friendships.", "Even in the current generation, they had maintained their close relationship by arranging Soel Aria and Olivia Hussey’s marriage, while Charlotte Aria and Teresa Hussey also developed their relationship into that of a younger and older sister by having known each other from a young age.", "That was, until the war broke out.", "At first, Teresa did her best to understand Charlotte Aria. This non-blood related younger sister of hers was only four years old when the Parasites appeared, and the Empire that she had trusted so much in, fell when she was only eight.", "Since she lost her parents at such a young age and was forced to escape for her life, it was understandable how that would have been a traumatic experience for her.", "But all matters had a bottom line.", "Would reality change if you lament your misfortunes and stayed drowning in sorrows? No!", "Teresa realized this early on. As such, she used the Royal Oath to receive the same power as the Earthlings and jumped into the battlefield.", "Looking back, she was so busy that having even ten of her wouldn’t have been enough. She already had her hands full with fighting the Parasites, dealing with the Earthlings, and taking care of government affairs.", "In her busy schedule, Charlotte Aria, who constantly complained and cried to her, was a huge source of stress. Even after time passed and she ascended to the throne, she’d say, “Unni~ Unni~” and try to rely on her like a kid. Naturally, Teresa went beyond being annoyed with her, growing tired of her as a person.", "In the end, Teresa blew up. The two had a huge fight before they cut off their relationship.", "The two of them had not talked since then. At least, until Charlotte Aria contacted her today.", "—If you’re trying to treat me like your emotional outlet, I’ll have to refuse.", "“Emotional outlet?”", "—It’s fine if you don’t know. Anyway, I’m hanging up if there’s nothing important.", "“Are you still angry about that… Ah, Unni!”", "When Teresa really tried to hang up, Charlotte Aria shouted hurriedly.", "“This time, it’s a really important matter!”", "—Well, good luck. Don’t you think I know that you’re just going to say things are hard for you?", "“That’s not it! Um, who was it again… Seol…. It’s about the Earthling who is Carpe Diem’s leader!”", "—Hmm?", "Teresa widened her eyes in surprise.", "—Oh, my Seol?", "“My?”", "—Aren’t you talking about Mister Seol Jihu? He’s not Carpe Diem’s leader, but Valhalla’s representative.", "“Y-Yeah?”", "—This is a surprise. I didn’t think my dear’s name would come out of your mouth.", "Charlotte Aria was a little surprised to hear the words, ‘my dear’, but she quickly continued seeing that Teresa had the intention of hearing her out a bit.", "“The palace has been in an uproar recently. That Earthling named Seol Jihu apparently—”", "—Really? Then kick him out.", "Teresa cut her off before she even finished.", "“H-Huh?”", "Charlotte Aria was taken aback.", "—What a joke! Do you think I don’t know? I’m hearing and seeing everything. Just what are you unhappy about? He’s cleaned up the leeches existing at the city’s expense and helped the people dying from these leeches. He’s trying every means possible to save the city from destruction, even going as far as to spend his own money. Hah.", "Teresa suddenly snorted.", "—Even kowtowing a hundred times would not be enough, and you have the galls to complain just because things are a little noisy?", "“L-Listen to me…”", "—Yeah, no, I don’t want to. Just kick him out. You’re the queen so you should have that authority. Once he’s gone, it will be quiet again. Yep, there’s your solution.", "“….”", "—I just don’t get it. It’s not just Haramark; Grazia, Nur, Scheherazade, Odor, and Caligo, these six royal families are all dying to invite him to their city. Why is it Eva…? Argh, you don’t even know your luck.", "Teresa said all this extremely quickly. A flustered look flashed across Charlotte Aria’s face. She knew Teresa had changed a lot ever since she began to interact with the Earthlings, but she still wasn’t used to this side of her.", "—Oh, try to kick him toward Haramark’s direction if you can. Do you know how many days I spent wetting my pillow with tears when he left? This is great. Give him back. If you chase him out to Haramark, I’ll listen to your complaints for the next 10 years. Really.", "Words shot out of Teresa’s mouth like arrows, and Charlotte Aria didn’t have the time to process it all.", "“Unni, don’t be like this and listen to me. My royal administrator—”", "—Yeah, yeah, expel him too.", "No matter what the queen said, Teresa kept saying the same thing.", "—Arbor Muto is dying from all the work anyway. Every capable person is valuable right now. Sorg Kühne will be of great help. Alright, expel him to Haramark too. You’ll also be happy since you’ll be free from his nagging, and I’ll be happy too. How about it?", "Charlotte Aria opened her mouth dazedly. Of course, she wasn’t a complete fool. She understood what Teresa was trying to say by making such sarcastic remarks.", "“Unni, what about Evangeline’s leader, Jung Sua?”", "When she asked just in case…", "—Are you mad?", "A negative answer immediately came flying back.", "—You hold on to her until the end. Don’t release that shit to some poor city.", "“Shit?”", "—It’s not even funny. Don’t you dare pour that bucket of feces and urine anywhere else.", "‘Bucket of feces and urine, she says.’ Charlotte Aria was shocked by the degree of insult Teresa flung toward Jung Sua.", "Narrowing her eyes, she glared at the crystal.", "“That’s going too far. How can you compare someone with feces and urine?”", "—I can say worse things. That bitch ruined the cute, lovable little sister I used to have.", "Charlotte Aria seemed genuinely angry, but she suddenly felt better hearing the words ‘cute’ and ‘lovable’.", "“Kuhum, that’s because you don’t know her well, Unni. She’s…”", "—Whatever. I know the situation more than well. You don’t need to explain it.", "Teresa said firmly before crossing her arms.", "—Now that I think about it, didn’t we have a similar conversation before?", "When Teresa turned serious, Charlotte Aria nodded carefully.", "—I don’t know what you were expecting when you called me again, but my answer won’t be any different than last time.", "“No, I just…”", "—I’m tired of consoling you, especially when you don’t give a shit about my genuine advice. I have nothing more to say.", "As Teresa spoke coldly, Charlotte Aria bit her lower lip.", "“You’re being too harsh!”", "Teresa pressed her forehead and shook her head. But seeing this only angered Charlotte Aria more.", "“You’re just like the royal administrator, Unni! You never try to understand my feelings! You never listen to me and always, always—”", "—That’s because you make absurd demands.", "“It’s not absurd!”", "—Stop barking whatever comes out of your mouth and think sensibly. A criminal will always say they’ve been unfairly charged. Which criminal is going to say, ‘That’s right! I did it!’? But you’re only listening to the criminal and saying, ‘Ith'sh noth abshurd!’ It’s no wonder you’re driving the royal administrator insane.", "“Don’t mock me! I never said it like that!”", "—Ehew.", "Teresa felt like it was a total waste of her time to even talk to Charlotte Aria, but she still opened her mouth to generously speak her mind.", "—You want me to take a guess? You want to keep that bucket of feces and urine and have it stay with you, right?", "“Don’t call her that! She has a name!”", "Charlotte Aria shouted in fury. Regardless, Teresa continued.", "—You don’t care whether that bucket of shit is in the right or wrong. You’re shutting your ears and eyes off and closing your mouth because you don’t want to believe it.", "The fuming Charlotte Aria flinched slightly.", "—’But Queen~ I didn’t do anything wrong~’ You’re shaken by these utter nonsense of words when all the evidence says otherwise.", "“Hmph… so what, you’re saying it’s all my fault? I’m the queen, but I should just do whatever Sorg Kühne says?”", "—Oh please, you don’t know what being a queen is.", "Teresa dropped her head. She heaved a deep sigh that was clearly meant for Charlotte Aria to hear. Then, she smacked her lips.", "—What’s the point in me saying anything? You’re only going to pick up what you want to hear and see anyway.", "“Again! Again!”", "—I’m sure the late king is tossing and lamenting in his grave. Same for Brother Soel and Campbell. You should be ashamed of yourself.", "At that moment, Charlotte Aria’s expression changed. She hated being compared to her family the most.", "“Keuk!”", "She wanted to retort, but she didn’t know what to say. Her face reddened in an instant as a light flickered past Teresa’s eyes.", "—Why? Am I wrong?", "“You’re wrong!”", "—Then show me.", "Charlotte Aria frowned.", "—Right, Sorg Kühne isn’t always correct. There might be a misunderstanding like you said.", "“Right! That’s what I’m trying to say.”", "—If you want to convince me, or anyone for that matter, at least have some evidence.", "“?”", "—Judge with your own eyes. ‘I looked into it personally, and this was how it was. I heard about it personally, and that was how it was. So I think it’s better to do this.’ If you reason in this way, do you think Sorg Kühne would still say the same thing? I don’t think so.", "“…What if he still says the same thing?”", "Charlotte Aria asked carefully. Teresa furrowed her brows heavily.", "—Just do it first.", "Paat! The light on the crystal ball flickered off. Teresa had hung up one-sidedly.", "“Unni? Unni!”", "Charlotte Aria quickly grabbed the communication crystal. She poured her mana into it again, but the call did not connect.", "Teresa was obviously not picking up on purpose.", "“Wuuuuuuuu!”", "Vexed that she was not able to properly speak her thoughts, Charlotte Aria fell on her bed and rolled around. She threw a tantrum by herself and tried to calm her anger, but Teresa’s words kept bugging her.", "She remembered the saying, three men can speak a tiger into existence. Even a lie would seem real if enough people said it.", "Not to mention Sorg Kühne, who had been with her for a long time, with even Teresa, who used to be like her elder sister, saying the same thing, Charlotte Aria had complex feelings.", "On the other hand, a small bulb of curiosity began to grow inside her.", "‘My dear?’", "Though a digression, Teresa was very, very picky when it came to picking a potential partner. Even the two elder brothers, whom Charlotte Aria admired to death, were only evaluated as ‘so-so’.", "Although it was a memory from when she was a child, whenever the two of them were alone, Teresa would often tell her that she would choose her own marriage partner and that she would rather run away than go through a political marriage.", "Capable, renowned, hot-bodied, heroic, kind, handsome, and thoughtful. If even one of these were missing, Teresa said she would not marry even if a knife was held to her neck.", "Furthermore, this Earthling was supposedly wanted by the other six royal families…", "‘I think I heard the rumors before…’", "In any case, with what Teresa said about this Earthling named Seol Jihu, Charlotte Aria couldn’t help but get a little curious.", "[Just do it first.]", "“…Hmph.”", "Recalling Teresa, the defiance she managed to quench shot up again, making Charlotte Aria pout.", "‘You think I can’t!? Fine, I’ll judge with my own eyes!’", "Half in defiance and half out of curiosity, Charlotte Aria steeled her resolve and raised her body. Then, she suddenly remembered something and fell into thought.", "‘Wait, if I talk to Sorg Kühne before going, he might try to show only his good sides….’", "A person’s true character was only revealed when they were bare naked. Suddenly, she had the thought, ‘Should I go secretly?’", "Soon, the hesitating Charlotte Aria must have come to a decision as the corner of her mouth stealthily curled up.", "She now had something to do.", "For some reason, she was starting to have fun.", "*", "Tak. Seol Jihu let out a long sigh after flipping through the last page of the document.", "The report that Yun Seohui left behind as a present. As thick as it was, a tremendous amount of information was written inside it.", "Starting from Charlotte Aria’s life to the process of Jung Sua becoming her aid, it recorded everything in-depth.", "Seol Jihu could only be surprised at how Sinyoung managed to find out about matters from tens of years ago.", "In any case, there was a lot written in the report.", "‘But if I were to summarize Charlotte Aria in one sentence…’", "The report was basically saying this.", "—Eva’s queen is a goddamn buffoon.", "And if he were to add another sentence…", "—It’s a mystery how such a moronic brat could come out when the first and second son were both outstanding.", "Seol Jihu was not exaggerating. This was really the overarching tone of the report.", "He could tell that whoever wrote this report was dumbfounded enough to mix in a little bit of their personal thoughts.", "‘If Eva’s ruler wasn’t Charlotte Aria, but someone like the late king…’", "According to the report, Charlotte Aria’s father was a powerful magician titled the Thunder Monarch.", "Seol Jihu couldn’t help but think how nice it would have been if this late king was alive like King Prihi.", "‘It’s not that I don’t understand her plight since she experienced war from a young age…’", "But staying at the same spot for more than ten years was going overboard.", "It was simple. There were people like Teresa Hussey who chose to face reality and unsheath their swords, but there were also people like Charlotte Aria who chose to avoid reality.", "After all, even royals were fundamentally human beings.", "It wasn’t just Charlotte Aria.", "‘Kim Hannah’s right.’", "After reading about Jung Sua, Seol Jihu couldn’t help but chuckle. She was neither skilled in battle nor administratively capable like Kim Hannah.", "Persona.", "Just by sticking to certain personas, she had climbed up to her current position. Of course, Charlotte Aria being so vulnerable played a big role, but being able to grab that opportunity was a skill in itself.", "It was then. As Seol Jihu was lost in thought, his communication crystal shone.", "The caller was Teresa Hussey.", "“Princess?”", "—Fufu, have you been well?", "‘What is she calling me about?’", "Seol Jihu suppressed the faint worry in his heart and asked. Then, as soon as he heard Teresa’s explanation, his eyes widened.", "“Excuse me?”", "—I’d give it about a 70 to 80 percent chance. Today at the earliest, tomorrow at the latest.", "Teresa shrugged.", "—That’s just how she is. She has a bit of an inferiority complex. Well, I brought up her family and said some harsh things, but even then, she only has a chance of acting.", "“….”", "—Be honest. It’s been upsetting, right?", "Teresa covered her mouth and laughed.", "—I understand. She really doesn’t know how to differentiate between feces and urine.", "Seol Jihu smiled bitterly. He would be lying if he said he never once felt upset.", "From the Eva Royal Family’s perspective, Seol Jihu was an Earthling who had made great contributions. Although he didn’t do this with the intention of receiving rewards, he felt a bit dejected when he heard that the queen was siding with Jung Sua.", "—But she’s not a bad child by nature. Just a little lacking is all. But once she trusts someone, she becomes the Giving Tree. Depending on how you treat her, she can become the most unconditional ally.", "Not excellent, not devoted, but an unconditional ally.", "Seol Jihu decided to take this meaningful advice to heart.", "—Anyway, try to grab hold of this chance. With your charms, I’m sure you’ll be able to capture her.", "Seol Jihu stared at Teresa with a renewed look. At first, he thought she called him to nag about not calling enough.", "—Ah, my apologies if I shouldn’t have meddled. It was just frustrating seeing the progress halted with just a few steps left to go…", "But she wasn’t trying to henpeck him. If anything, she was pecking at his itchy spots when he hadn’t even told her about it.", "“Not at all. I was frustrated with it as well. Excellent assist, Princess.”", "Her wifely support was on par with Seo Yuhui and Flone.", "‘Wait, Yun Seohui too?’", "The report on the desk caught his eyes, but then he shook his head and shook off the silly thought.", "After expressing a deep thanks to Teresa, Seol Jihu got up. As this matter could be a turning point in the status quo, he planned to discuss it with Kim Hannah.", "*", "As always, hundreds of people were gathered in front of Valhalla’s building. It was to pick up the freely distributed food.", "Since the Eva Alliance collapsed, there was no need to continue the plan any longer. But because quitting right away seemed too obvious, Kim Hannah suggested a grace period of two weeks, and Seol Jihu accepted it right away.", "There was a saying that people would confuse goodwill for privilege if it went on for too long, but Eva’s residents were not like that. In fact, their gratitude only strengthened by the day.", "It was because Valhalla seized the debts owed to the Eva Alliance under the guise of damage compensation and re-contracted the people with reasonable conditions.", "Kim Hannah had taken care of this matter so that no problem would arise in the future. As a result, Eva’s residents were starting to think of Valhalla not only as the actual royal partner, but also as the organization representing all of Eva.", "Just like always, Kim Hannah was overseeing the free food distribution site today.", "Seol Jihu discovered her from afar and walked up.", "“Kim Hannah!”", "“Hmm? Why are you here?”", "“I needed to tell you something urgently.”", "Kim Hannah turned around with a confused look. Then, she furrowed her brows.", "“What?”", "“You see…”", "“No, I understand. So is she going to summon us or visit us officially? Or—”", "After turning around reflexively…", "“….”", "Kim Hannah shut her mouth, unable to finish her sentence. As she stared intently in one spot, her eyes opened wide.", "It couldn’t be helped. Although the hundreds of civilians that had gathered around made the view crowded, there was one person from her appearance and clothes who stood out starkly among the ordinary residents.", "She was surely thinking that she was well-hidden and disguised, but such a shabby disguise could not trick Kim Hannah’s well-practiced eyes.", "It would be a different story if Kim Hannah never discovered her, but now that she did, she couldn’t help but pay attention carefully.", "Speaking of the devil, the Queen of Eva had come personally. And judging by how she was alone, she seemed to have left secretly.", "She stared doubtfully for only a moment. Once she remembered what Seol Jihu told her…", "“…Hey.”", "Kim Hannah instantly lowered her gaze. Her brain spun as she continued in a quiet voice.", "“Listen carefully to what I am about to say.”", "Kim Hannah’s eyes flashed cunningly, like the eyes of a fox in front of a herbivore."]}