{"cid": "257", "title": "Chapter 257. Fox, O Fox (3)", "content": ["The silhouettes flying around the room, eating the carefully prepared food, were none other than the resident ghosts.", "They were the mob of wandering ghosts that had submitted to Flone.", "Strictly speaking, it was their home that was forcibly snatched away, but they currently seemed to be somewhat satisfied with their new lives.", "It was largely because Kim Hannah had accepted Flone’s request and set aside a place for them to reside in.", "Not only were memorial stones erected for each of them, but a pretty female Priest was assigned to visit them every so often to burn incense, sincerely pray, and give them offerings of delicious food. How could their hearts not be at ease?", "In fact, their living conditions had vastly improved compared to the deserted house they had lived in before.", "Of course, this did not mean that they were entirely without worries.", "The mob of ghosts that were enjoying themselves suddenly froze— they felt the presence of an enormous evil spirit rapidly approaching.", "Resentment that made even the vengeful spirits tremble in fear swamped the area. It was such a terrible amount of evil that the collective sum of all the resentment residing in the room was like holding a candle to the sun.", "The ghosts came to their senses a beat later and attempted to frantically move. However…", "[Oh?]", "It was only after Flone had already entered the room.", "[Well, will you look at the state of this room.]", "The ghosts hastily positioned themselves as a sharp voice sounded out in the room. Each of them placed themselves in front of their memorial stones and stood at attention, not even moving a muscle.", "[Sigh.]", "Flone was ticked off when she saw the messy room with food strewn all over the place, but she chose to close her eyes and endure it for the time being.", "[Fuu… Let’s do roll call first.]", "[Alright. A total of fourteen and a current total of twelve… What? Two missing? Why don’t I see those two?]", "[What? The toilet?]", "[Are you joking with me? You think you’re still humans?]", "The ghost with the largest frame fidgeted in place, not knowing what to do as Flone yelled.", "[Wow… This is really one hell of a sight!]", "Flone lowered her head and shook it in disapproval.", "The ghosts flinched.", "They knew, ever since they met her for the first time, that she’d never let them off easy when she said the words, “one hell of a sight.”", "And as expected, Flone put her hands on her waist with her head still lowered. She then spoke in a grave manner.", "[I, Flone, have been greatly disappointed by you all today.]", "[I know you don’t like to hear these words. But you lot can’t even keep the basics, huh? Are you all incapable of being better than this?]", "[It’s not like I’m expecting a lot out of you— reporting your whereabouts and staying quiet. I don’t expect you to improve yourselves, but you’ve got to at least meet me in the middle, am I wrong?]", "[No. I’m not saying that you guys shouldn’t play. But if you eat something then at least clean up and open the windows to let some fresh air in. Huh? You’ve got to rest after doing what needs to be done, no?]", "She ranted on and on about how they should switch perspectives and that she couldn’t trust them to be by themselves even if she wanted to. After scolding them for a long time, Flone crossed her arms and looked around at the ghosts standing in line with their heads lowered.", "[Can you do better from now on?]", "[Yes!]", "The ghosts shouted in unison.", "[Can I really trust you? Will you all be able to last at least a few days before making a mess again?]", "[Yes!]", "[…Good.]", "Flone smacked her lips but purposefully spoke with a solemn face.", "[I’ll pretend I didn’t see anything just this once.]", "After warning them to behave, Flone turned around and left the room. The ghosts began to grumble amongst themselves only after they felt her presence move far away.", "[Sheesh, that woman always says she’s disappointed whenever she sees us.]", "[How many times has it been?]", "[Twenty-one times.]", "[Hey hey, it’s fine. She left, right? Just make it look like we cleaned up.]", "The ghosts groaned and gossiped about Flone together.", "*", "Park Dongchun visited the Carpe Diem building as per Omar Garcia’s request. He was told to try his luck under the pretext of a real estate deal, but that was outright impossible.", "With the situation escalated to this extent, it was obvious that the opposing party would be informed of the purpose of his visit. It was a better choice to just bluntly ask them.", "\"Are you really going to be like this?”", "\"I have no idea what you’re talking about~\"", "But of course, it was simply a better course of action and nothing more, so he didn’t even dream of getting what he wanted without paying a price.", "\"Stop being like that and say something. Why are you doing this to me?”", "\"That’s strange. Why? Did we do something we shouldn’t have?”", "Park Dongchun glared at the nonchalantly replying Kim Hannah.", "It was just as he had expected. However, he couldn’t back away.", "\"Think about my position a little, too. Do you even know how much trouble I’ve been in lately?”", "\"Well. If it’s you, Ahjussi, you’ve probably got a backup plan already.”", "\"What backup plan?\"", "\"You only handed over the contract after making all the calculations in the first place.”", "Park Dongchun made a bitter face. Kim Hannah shook her head before taking out a stack of documents from her jacket.", "“You really are amazing.”", "\"What now?\"", "Kim Hannah grabbed a sheet of paper and waved it.", "\"What do you think this document is?\"", "\"…What is it?\"", "\"It’s a report on the organizations in Eva.”", "\"?\"", "\"Our representative told me to submit a ve~ry detailed report on the organizations in Eva.”", "Park Dongchun’s eyebrows narrowed as she emphasized its importance.", "\"So I was in the middle of drafting one up and… The Dongchun Merchants was cleaner than I expected.”", "\"….\"", "\"The timing you chose to wash your hands clean was simply perfect. What suddenly made you do so?”", "\"Well… I just thought I should live a better life.”", "Park Dongchun gave an ambiguous laugh, but his head was already on full drive.", "'Why did she switch the subject?’", "Kim Hannah had told him it was a detailed report, but was it his imagination that he heard it as an assassination list?", "No, he wasn’t wrong. If so, then what Kim Hannah was trying to say could only be one thing.", "Carpe Diem was not going to stop.", "Whether he died or they died, one of them was bound to die and step out of the ring called Eva.", "'No way.'", "Park Dongchun, who had reached that conclusion, finally realized.", "Kim Hannah had given him a chance to choose — whether to stay in the Eva Alliance or switch sides. It was one or the other. The probability was 50 percent. But there was nothing as dangerous as blindly picking.", "\"…Do you have someone backing you up?\"", "He asked in a low voice to try and at least get a hint, but Kim Hannah did not reply. She only gave a subtle smile. It meant he had to pay an equivalent price if he really wanted to know.", "'This is driving me crazy.'", "Park Dongchun’s complexion grew serious as he was faced with a decision that would dictate the fate of his organization.", "Gulp. His Adam’s apple jumped up and down. He rubbed his hands out of habit. He wasn’t aware, but his palms were drenched in sweat.", "\"Uh…\"", "Park Dongchun cautiously took a step after being stuck at the crossroads of two major choices for a long time.", "\"Be careful.\"", "Kim Hannah slightly raised one of her eyebrows.", "\"An emergency meeting was held after you guys made a commotion.”", "\"Tell me only the important facts.\"", "\"They said that the royal family will give a call to the Ochoa Cartel soon. They have probably already done so by now.”", "\"A call?\"", "\"I don’t know the details either.”", "Park Dongchun frantically waved his hands when Kim Hannah snorted.", "\"Listen. Actually, it’s not the first time something like this happened. Of course, those incidents weren’t as major as the ones this time.”", "\"I guess. That Sorg Kühne isn’t an average fellow.”", "\"Sorg Kühne was there too, but they suffered numerous blows from a High Ranker Earthling called Evangeline Rose. In any case, there have been many incidents that have threatened the alliance, but they safely made it through each and every crisis.”", "\"What’s that got to do with this?”", "\"Listen to me. What I’m saying is that the royal family took action whenever the alliance faced something they couldn’t handle. I’m talking about their partner in the royal family.”", "Park Donghun lowered his voice to a whisper even though it was a room with only the two of them.", "Kim Hannah finally showed some interest.", "\"And so?\"", "\"I’d like to tell you more, but that’s all I know. Really. The Ochoa Cartel controls the partnership with the royal family and we only follow what they say.”", "Seeing him desperately defend himself, Kim Hannah lightly shook her head.", "\"So what you’re saying is that every time there’s a crisis, the partner in the royal family manipulates the situation while the Ochoa Cartel finds a way to resolve it.”", "\"Basically, yes. What’s clear is that something will happen to you guys too. Choose your actions carefully when it comes to that.”", "As he said that, Kim Hannah, who was tapping her finger on her crossed arms, smirked.", "\"Iya, this city is an interesting one. It’s more like a jungle than a city.”", "\"That’s how it is.\"", "\"In any case, I’ve heard your story, so while it’s not much to call it a repayment…”", "Park Dongchun’s eyes lit up hearing her say ‘repayment’.", "\"Since you mentioned something about choosing or whatnot, I’ll tell you something similar in return.”", "Kim Hannah flashed a smile revealing her white teeth.", "\"You be careful too, Ahjussi.\"", "\"Huh?\"", "\"You will also be confronted with a choice. When that moment comes—”", "Kim Hannah put away the documents while still smiling.", "\"Just stay put.”", "\"Stay put?\"", "These were unexpected words. He had thought she’d ask for help in whatever way he could provide.", "\"Our representative, Seol. Although he’s trying hard not to show it, his eyes have been completely flipped, you know?”", "\"….\"", "\"What I’m trying to say is this. If you want to live, then stay quiet and don’t do anything. Don’t try to interfere and get hurt. Perhaps he’ll come back to his senses afterwards.”", "Kim Hannah shrugged her shoulders at the end of her sentence. She must have meant that she had no reason to tell him anything more.", "Although he hadn’t heard any vital information, his trip wasn’t futile.", "He had misunderstood from the very start. Kim Hannah did not try to persuade him to help her and instead, had just informed him one-sidedly.", "This meant that they were confident even without the help of a mere Dongchun Merchants.", "He felt a hair-raising chill after arriving at that conclusion. He couldn’t figure out what Kim Hannah was hiding, but Park Dongchun did not continue to ask. It was because staying quiet and not doing anything wasn’t hard to do and was actually what he had wanted in the first place.", "\"…Okay. I got it.\"", "Park Dongchun quietly rose from his seat.", "That afternoon, Carpe Diem received a call from the royal family. Its content was about a job commission. Now that the situation was wrapped up, the only thing left was to send the individuals from the Federation safely back to their homes.", "The problem was that the majority of the foreign races adamantly refused to be escorted by humans and wished to go back by themselves.", "They cooperated with the investigation only because they saw the human that saved them and because they wanted to take revenge on the bastards that toyed with them. Their deep-rooted resentment and hatred for humanity had not disappeared.", "Then again, it was illogical for them to accept an escort by the very Earthlings that captured them and committed all sorts of atrocities on them.", "In any case, the royal family was placed in a predicament because of this.", "It wasn’t that they were looking down on the combat power of the foreign races, but the majority of them were only now recovering from their injuries. Furthermore, the surrounding area was practically the backyard of humanity.", "No one could guarantee what the Eva Alliance that was grinding its teeth in anger and poachers who were blinded by money would do to them.", "Also, there was no assurance of safety even if they forcibly assigned a squadron of soldiers against the Earthlings that would ambush them.", "After thinking for a long time, Sorg Kühne suggested to call the Federation to have them send an escort team, but someone retorted whether they had to go that far and brought up Carpe Diem.", "The reason was that the foreign species would feel less aversion towards the Earthlings who saved them and also because ordinary Earthlings wouldn’t dare approach them. That was why they contacted them after asking the members of the Federation.", "Seol Jihu agreed without thinking much about it. He reasoned that distance to the border wasn’t too far and that it would be a good opportunity to get to know about many of the foreign races.", "Above all, he felt like personally escorting them back would erase the unease he felt in his heart. They had finally taken the first steps to mend their relationship, but if they were hunted again on their way back, everything would go back to square one.", "Seol Jihu immediately instructed his teammates to prepare for the royal family’s commission.", "Surprisingly, Kim Hannah did not say anything. She only said that certain members, including herself, could not follow them.", "\"We have a lot of work that we started. Who’s going to do the work if all of us go?”", "\"Let’s pause those activities for the time being, even if it’s for a few days.”", "\"Well, will you look at yourself? Who’s the one that said giving up in the middle is worse than starting something in the first place?”", "\"I didn’t say we should stop our work.”", "Seol Jihu scratched his head.", "\"I'm just worried about them. Things might become dangerous if we split up and I can’t escort them just by myself.”", "\"Oh my. So you do worry about things.”", "Kim Hannah commented sarcastically and shook her head.", "\"Just go then. You’ve already said you’d take the commission, so it’s not like we can back out now.”", "\"Still—\"", "\"It’s fine. There’s still the Triads, so there shouldn’t be any big problems.”", "Then again, even the Eva Alliance wouldn’t act rashly in front of the organization that once divided Haramark with Sicilia.", "\"Well, if you’re that worried then I want you to listen to a small request of mine.”", "\"A request?\"", "\"Yep. It’s nothing much.”", "Kim Hannah said it nonchalantly, but the way she licked her upper lip made her look strangely crafty."]}