{"cid": "150", "title": "Chapter 150. With Two Golden Eggs", "content": ["Four days after returning to Haramark, Seol Jihu walked out of his room while rubbing his eyes and flinched when he saw an old man’s back.", "Jang Maldong was sitting on the couch reading a paper. Seol Jihu didn’t know what he was reading, but seeing how he looked bitter, Seol Jihu asked carefully.", "“You’re awake?”", "Jang Maldong glanced back before gently putting the paper down.", "“I opened up the envelopes. They kept stacking up while you were gone.”", "“Ah, the information from the assassins’ guild. That’s fine. In fact, I wish the other two would read them on their own.”", "“Stop dreaming. I’d be damned if they don’t froth at their mouths while doing that.”", "Seol Jihu laughed thinking Jang Maldong was joking, but Jang Maldong was being serious.", "After slowly walking forward, Seol Jihu grabbed the paper on the table.", "—The wind has begun to blow the other way.", "The report had a simple and concise subheading. Seol Jihu’s eyes immediately opened wide.", "—With the return of Phi Sora (Korea), the reignited flames of the controversy were met with a fierce wind.", "‘Already?’", "It had only been a few days since Seol Jihu contacted Kim Hannah. Astonished by Kim Hannah’s haste, Seol Jihu continued to read the report.", "—The Scheherazade Royal Family announced that the broker at the center of the crime turned himself in and sought punishment. According to the investigation, this Earthling who sold the information about the ruin to two parties was Charlie Haber (Canada).", "", "He admitted to his crimes of breaking Paradise’s taboo, but he also dropped a bombshell regarding White Rose’s leader, Bok Jungsik (Korea)….", "…The Scheherazade Royal Family has thoroughly reviewed his claims and examined the evidence he submitted, and revealed that they would summon Bok Jungsik.", "", "Currently, Charlie Haber is staying in Scheherazade’s prison by voluntary request, under the strict scrutiny of the Scheherazade Royal Family’s watch.", "“Don’t take everything at face value.”", "Jang Maldong spoke in a heavy tone.", "“This report is at the same level as a newspaper article. Little information has been revealed to the public, so they added some unnecessary self-assessments.”", "His calm tone made it sound like there was no way the broker would turn himself in. As Seol Jihu had a bit more knowledge regarding the event, he was slightly surprised.", "But then again, anyone would get suspicious if someone who was hell-bent on hiding himself suddenly turned himself in.", "At the very least, someone who was knowledgeable about the inner workings of Paradise would easily guess that some kind of outside interference had occurred.", "What would be difficult would be pinpointing Kim Hannah as the perpetrator.", "“He wasn’t like this in the beginning.”", "Jang Maldong heaved out a deep sigh.", "“He sheepishly laughed even when someone criticized him. Although he was lacking in talent, he was passionate and tenacious…. At the very least, he was principled.”", "Seol Jihu instinctively realized that Jang Maldong was talking about Bok Jungsik.", "“…Right, he was principled.”", "He muttered the last line again before fumbling around for his cane and getting up from the couch.", "The old man’s shoulders seemed particularly bitter as he trudged to the door.", "[But you know… not everyone is as noble and amazing as Old Man Maldong.]", "[Just imagine it. You giving your time and effort to raise disciples, all so that they can aid Paradise in some way, but instead, they fight and kill each other all in the name of profit….]", "Seol Jihu went ‘Ah’…", "[How would you feel if that happened to you? Think about it.]", "And he subconsciously opened his mouth.", "“Miss Phi Sora…”", "He immediately regretted speaking out, but it was too late.", "“Miss Phi Sora proved her innocence.”", "Jang Maldong stopped. The corner of his mouth curled up ever so slightly.", "“Yes… you’re right.”", "Then, he pushed his fedora down until it covered his eyes.", "“You did well. Rest up.”", "Seol Jihu blankly stared at Jang Maldong as he quietly walked out of the door.", "‘I did… well?’", "*", "The incident that heated up Scheherazade quickly cooled down.", "Seol Jihu was standing alert, wondering what Bok Jungsik would do, but he could only chuckle when the result came out.", "When the suspect, Bok Jungsik, refused to answer the summons, the Scheherazade Royal Family forcefully searched White Rose’s building. However, Bok Jungsik was nowhere to be found. He had gone into hiding.", "With Charlie Haber confessing and providing evidence, claiming to be innocent would only be disgraceful. In a way, his quick decision to run showed how experienced he was in Paradise.", "Regardless, running away was akin to admitting guilt, and Bok Jungsik’s claim had lost all credibility.", "Naturally, Phi Sora’s statement came into the spotlight once again.", "Although it was true that she forced the expedition, anyone who knew the inner workings of White Rose saw that this was Bok Jungsik’s plot.", "The focal point fell on Bok Jungsik who ran away, and now that Phi Sora had some room to breathe, it was unlikely that all the blame would fall on her shoulders.", "At the very least, she was absolved of the charge of willful negligence.", "The matter came to a close for now with the Scheherazade Royal Family issuing the Red Notice for Bok Jungsik.", "If there was something that went outside of Seol Jihu’s expectations…", "That would be that Phi Sora didn’t avoid responsibility by saying ‘I was only being used’, and that she ‘temporarily’ rose to the position of the leader of White Rose.", "While she was only acting a leader temporarily, taking this position was equivalent to announcing that she would settle this incident.", "Another thing that surprised Seol Jihu was that White Rose’s ‘temporary leader’ contacted him personally.", "*", "Seol Jihu set off for Scheherazade as soon as he received the call.", "Jang Maldong periodically told him about the situation White Rose was in, and Phi Sora’s actions could only be described as a series of surprises.", "Seol Jihu was expecting her to rebuild White Rose from bottom-up, but she officially announced its dissolution. As if to show the world her fiery temper, she did not stop at just saying this but was supposedly doing everything in her power to put it into action.", "For Seol Jihu, who was eagerly waiting for her to go broke, this wasn’t such happy news.", "On the other hand, he got curious. What Phi Sora was doing was equivalent to narrowly stopping a piggy bank from falling on the ground and shattering, and then raising it up high and slamming it down on the ground.", "‘Couldn’t she have just stayed silent?’", "Why was she trying to destroy White Rose with her own hands? It didn’t seem like it was simply out of anger.", "Seol Jihu kept tilting his head as he entered Scheherazade.", "White Rose Guild lacked any semblance of liveliness. Not only did no one enter and leave the building, only one or two people could be seen walking around inside. But from the way they were packing their belongings, even they seemed to be getting ready to leave.", "With no one to guide him, Seol Jihu searched his memories and walked around the building.", "Phi Sora was waiting inside the conference room.", "After briefly exchanging greetings, Seol Jihu spoke as he sat down on the chair opposite to Phi Sora.", "“This place is pretty empty.”", "“I let everyone go.”", "Phi Sora spoke fleetingly.", "“People who wanted to leave left, people with time left in their contracts were transferred elsewhere, and the hired-for-help had their contracts canceled….”", "She slowly blurred the end of her speech before looking side to side.", "“We have to leave this place by the end of the day as well.”", "Seol Jihu doubted his ears.", "“We finished negotiating with PAX. The land belongs to the Scheherazade Royal Family, so there’s nothing we could do about that; but the money from the transfers, our shared assets, and this building itself will all be handed over to them.”", "“Did you really have to go that far?”", "“Technically, the incident hasn’t ended yet. In Paradise, coming to an agreement is incredibly important. More so than you might think.”", "Phi Sora hesitated for a moment before continuing.", "“And it’s true that I pushed for the expedition on my own.”", "“But….”", "“No buts. I didn’t know this would happen, but what I did should get me charged with manslaughter. Well, I can technically be shameless all I want, like a certain someone, but I don’t want to.”", "Phi Sora crossed her arms.", "“It would have been a different story if PAX persisted on having things their way, but thanks to that Bok bastard quickly running away, they reluctantly accepted this offer. They must know it too. That resolving this matter cleanly is much better than rolling in the mud to possess me…. Why are you staring at me like that?”", "“It was just a bit unexpected.”", "“What is?”", "Phi Sora’s eyebrows perked up.", "“I didn’t think you would dismantle White Rose. Personally, no less.”", "Trying to sound like he was chatting casually, he stealthily raised a question.", "“Is it… revenge?”", "Phi Sora immediately let out a snort.", "“Revenge? I doubt that bastard will return to Paradise ever again. I’m sure he’ll be too busy keeping himself safe on Earth.”", "This was somewhat frightening considering that PAX was an international organization.", "“It’s not like I have regrets. It’s just that….”", "Phi Sora tapped on the desk a couple of times.", "“I’ve been with White Rose since the day I stepped into Paradise. To be honest, there were many bad memories, but there also were good memories….”", "“….”", "“Love it or hate it, White Rose and I grew together. Since it was able to reach its current height with my help, I think I have the right to put an end to it myself.”", "From her words, Seol Jihu could feel the affection she had for White Rose. He calmly asked back.", "“I’m sure you could have chosen to start over. With you as White Rose’s leader.”", "“No.”", "However, Phi Sora rejected firmly.", "“That will never happen. Ever.”", "She emphasized this line.", "“This is the end.”", "‘The end?’", "It sounded like she was compressing a whole lot of meaning into this one word, but Seol Jihu nodded his head without digging any further.", "“Then you’re leaving today?”", "“Yes, today will be my last day here too. I’ll leave as soon as I finish the negotiations.”", "Seol Jihu’s jaw dropped slightly.", "‘This person.’", "How could she be so impatient? Was she a bulldozer?", "Taking Seol Jihu’s intent stare the wrong way, Phi Sora shrugged.", "“Don’t worry. Given my level and experience, do you think it will be difficult for me to find a new home? I already know where I’m going…. No, wait, why am I telling you all this?”", "She grumbled in a low voice before taking two pieces of paper out of her pocket. She flicked her hand, and the paper pieces flew like paper airplanes and landed in front of Seol Jihu.", "Next, a pen rolled toward him.", "Seol Jihu grabbed the pen and carefully studied the paper before asking.", "“What do you mean by joint ownership?”", "“It’s exactly what it sounds like. That Bok bastard is the one who scouted Yi Seol-Ah and Yi Sungjin, but I’m the one who procured their stamps with my contribution points.”", "Since Bok Jungsik abandoned his rights and escaped, the authority over the siblings naturally fell on Phi Sora. Hearing this explanation, Seol Jihu was rather relieved.", "Even if riches were scattered on the side of a road, it was a crime to pick them up when they had a rightful owner. Likewise, even if Seol Jihu brought the siblings with him, if their contractual owner showed up in the future and claimed his right over them, Seol Jihu wouldn’t be able to say a thing.", "So, it was much better to take care of the matter now when he had the opportunity.", "After all, the negotiation was an important process, just like Phi Sora said.", "“Then about the transfer fee….”", "“I don’t need much.”", "Phi Sora answered quickly.", "“You can probably tell by how empty this place is. As long as you don’t lowball me too much, I’ll accept whatever offer you have.”", "She smacked her lips before continuing.", "“…If I had more time and room for leisure, I could have sent them to you free of charge, but as you know, I’m dirt poor now. Anyways, Carpe Diem must have thought of a price, right? I’ll accept it as long as it’s not too out of line.”", "“Mm… do you need money to find a new place?”", "“No, it’s not that.”", "Phi Sora shut her eyes before roughly sweeping her hair up.", "“It’s a private matter. Do you really need to hear it?”", "“That will make it easier for me to decide on the price.”", "Hearing this, Phi Sora sighed.", "“It’s nothing. Just that….”", "In the end, she spoke as if she had no other choice.", "“We made a promise before. All 18 of us were from the same country, so if anyone died, we promised to take care of them on Earth.”", "This caught Seol Jihu by a surprise.", "“They will have lost their memories about Paradise… but it’s not like they need to remember me for me to support them.”", "“That’s true, but… with how long they’ve been active in Paradise, wouldn’t they have money saved up?”", "“That depends. It’s different on a case-by-case basis. What’s the point in participating in expeditions left and right since you need contribution points to bring anything to Earth?”", "With this, Phi Sora closed her mouth.", "The more Seol Jihu looked at Phi Sora, the more his interest was piqued. He carefully studied Phi Sora who had turned her head as though she was sulking,", "‘This person.’", "“I can’t figure you out.”", "“What did you say?”", "A sharp retort immediately came back. Rather than replying, Seol Jihu activated his Nine Eyes.", "[Phi Sora’s Status Window]", "Summoned Date: 2015. 03. 20Marking Grade: RedSex/Age: Female/26Height/Weight: 168.6cm/56.8kgCurrent Condition: HealthyClass: Lv 5. Royal GuardNationality: Korea (Area 1)Affiliation: White RoseAlias: Scumbag, Big Unni, Action-taker", "[2. Traits]", "1. Temperament—Whimsical (Temperament and attitude changes often)—Sharp (Keen and acute)—Responsible (Regards assignments and duties with importance)", "2. Aptitude—Brilliant (Gifted and talented in a way that stands out from the rest)—Passionate (Shows intense feelings about things)", "[3. Physical Level]Strength: Intermediate (High)Endurance: Intermediate (Intermediate)Agility: Intermediate (Low)Stamina: Intermediate (High)Mana: Intermediate (Low)Luck: Intermediate (Low)", "Remaining Ability Points: 0", "[4. Abilities]", "1. Innate Abilities (0)", "2. Class Abilities (8)—Shield Application Technique (High)—Hand-To-Hand Combat (Pinnacle)—One With the Sword (High)—Occaceo Sword Technique (High)", "3. Other Abilities (0)", "[5. Level of Cognition]Scumbag (Words and actions are not particularly good) / Ashamed / Black and White (Divides all problems into two extremes)", "‘Black and white….’", "Seol Jihu put his hand in his pocket and fiddled with what he grabbed.", "Phi Sora seemed to interpret his fixed stare the wrong way as she nibbled on her lower lip.", "“I’m grateful that you saved me. If I could, I would take care of the Yi siblings’ matter for you. Unfortunately, I’m all out of money. I even sold all my equipment to shut PAX’s mouth, so I’m penniless.”", "Now that she mentioned it, Phi Sora wasn’t wearing her fancy armor, but casual clothes. Seol Jihu couldn’t see her sword and shield either.", "“I didn’t want to say this, but I received dozens of recruiters who came to ask for Yi Seol-Ah as soon as I announced White Rose disbanding. Sinyoung even offered four gold coins, though they also asked for Yi Sungjin on top.”", "In other words, she had refused these offers and called him instead.", "“Four gold coins would be… about 200 million won.”", "“That’s usually the price for confirmed rising stars. In Paradise, talented Earthlings are considered as greatest assets.”", "“Hm….”", "“I’m not lying. For the record, I’m worth ten times more than that.”", "“I understand.”", "Having made up his mind, Seol Jihu nodded his head.", "“As I said before, I’m not asking for much.”", "He took out his hand from his pocket and placed it on the table.", "“I’m hoping you could give me at least 100 to 200 silver coins…?”", "When a bead rolled across the table, Phi Sora snatched it subconsciously. She slowly opened her palm, and her expression quickly transformed with shock.", "“Eh?”", "The stunned yelp was an added bonus.", "What she saw was a grape-sized golden bead.", "“Gooold?”", "“It’s not a currency. That’s an egg.”", "Seol Jihu emphasized the word ‘egg’. Then, he hesitated for a moment before taking out another one.", "When the second orb cheerfully rolled across the table, Phi Sora’s eyes opened wide and she jumped in fright.", "“Another one? A-Are you crazy? You can’t be serious!”", "“If you don’t want it, you can give it back.”", "“No—! It’s just that I only expected 200 silver coins at most….”", "“Didn’t you say you were going to use them for someone else?”", "“…I did.”", "“What are 200 silver coins going to do? You have 17 people to take care of.”", "Seol Jihu spoke curtly.", "“Each egg should easily surpass a billion won, so that’s two billion for two. Each member should be able to receive at least 100 million.”", "Hearing this, Phi Sora’s calm expression contorted delicately.", "“No complaints, right?”", "She blinked her eyes repeatedly before speaking in a slightly hoarse voice.", "“What… what’s the reason?”", "“?”", "“I know what situation you’re in too. Won’t Grandpa say something if you spend your money so willy-nilly?”", "Seol Jihu snorted.", "“I gave the appropriate price, so it’s hardly willy-nilly. Plus, I’m spending my own money, so who’s going to complain?”", "“But what’s the reason? That you’re doing all this.”", "“Well….”", "Seol Jihu hesitated for a moment before continuing.", "“That’s because I’m also indebted to them. Let’s say I’m just paying back what I owe.”", "“Debt?”", "Phi Sora furrowed her brows.", "“Ah, that again? Listen, Sohyun is my neighbor. I was worried after hearing what you said, so I went and checked up on her. I confirmed that she returned to Earth. She was rolling on the floor clutching her head. I personally brought her to the hospital.”", "“Miss Phi Sora.”", "Seol Jihu sighed inwardly, grumbling about her talking too much.", "“How many times do you want me to tell you? I’m not lying to make you feel better, nor am I being overly generous. I saw it with my own eyes. An indescribable thing was chasing after me when more than a dozen corpses desperately stopped it. It was thanks to them that I was able to leave the villa safely.”", "“That’s….”", "“If they returned to Earth, then they clearly weren’t bound to the villa. So they must have chosen to stay there for a moment. Because they must have been worried about you. Besides, how am I supposed to know about the small details?”", "Seol Jihu spat back, clearly describing only the things he had seen. When he glanced at Phi Sora while raising his pen, Phi Sora nodded her head without realizing it herself.", "“…I can really take these?”", "“Geez.”", "When Seol Jihu tilted his head, Phi Sora flinched and shrunk back.", "After clicking his tongue, Seol Jihu turned his gaze down again.", "“Well, I did that Priest a favor as well, but… since I ended up getting saved in return, I thought I’d need to do a little more. Anyways, with this, I’ll have returned the favor.”", "“Returned the favor…?”", "“Do to others as you would have them do to you. Matthew 7:12.”", "Seol Jihu scanned the contract before signing his name on it. Then, he looked at Phi Sora.", "“That’s the way I decided to live in Paradise.”", "Phi Sora blankly stared at the young man collecting the contract and getting up.", "“Where are the siblings?”", "“In, in their rooms on the second floor of the building….”", "“Got it. I’ll take my leave then.”", "Seol Jihu left the room without saying anything else. Perhaps because he stayed in the conference room longer than he expected, he felt extremely lighthearted as he left.", "‘I finally finished a task.’", "Of course, that wasn’t the only reason.", "What Seol Jihu was worried about was Phi Sora talking about him going to the ruin. Although she had not said a word about it until now, he couldn’t be sure if that would still be the case in the future.", "Wondering how he should get her to stay silent, the method he devised was to make her indebted to him.", "From the looks of it, Phi Sora was quite guilty about the death of her comrades who followed her to the ruin. By taking care of them, Seol Jihu had indirectly made Phi Sora owe him a debt.", "He decided to employ this method when he realized that such an opportunity wasn’t easy to come by.", "As long as the Nine Eyes wasn’t lying, what he did would place him on the side of a ‘friend’.", "In other words, given Phi Sora’s ‘black-and-white’ personality, Seol Jihu calculated that she would remember this matter and help keep his secret.", "“Lulu~ Lululu~”", "Seol Jihu hummed in satisfaction and walked through the hallway with light strides. He was completely oblivious to the fact that Phi Sora was staring at him with a stunned face.", "Naturally…", "“…Returning the favor….”", "He was also oblivious to the fact that his calculations were off, and how today’s choice would return to him."]}