{"cid": "221", "title": "Chapter 221. The Spear and the Treasure Chest (1)", "content": ["Yuirel was waiting on the outskirts of the area with a group of Cave Fairies. As soon as the expedition team came out, they requested the Sky Fairy for purification.", "But the effect of the purification did not happen. According to the Sky Fairy, it wasn’t because the Branch of the World Tree was ineffective, but because they weren’t under the curse in the first place.", "The Sky Fairy was confused, but Seol Jihu had a good guess why. He wasn’t completely sure, but Roselle probably had a hand in it.", "\"How is this possible?\"", "Yuirel was extremely curious. Not only had they escaped unscathed, but they also weren’t afflicted by the curse.", "Seol Jihu prepared four plates of banquet noodles for the Sky Fairy, who was staring at him with sparkling eyes before briefly explaining what had happened inside.", "\"Roselle La Grazia…….\"", "Yuirel carefully listened to Seol Jihu’s story, but she had just one thing as her main concern.", "\"Do you think she’ll treat us like guests if we enter?”", "Seol Jihu said he wasn’t sure about that.", "In the first place, it was thanks to Flone that the expedition team could meet Roselle. If they didn’t have the pendant or Flone with them, then the Stage 2 alert status of the Stele of Evaluation would have activated and caused the expedition team to fall into a far more serious crisis.", "It would be another story if they could wake up on their own like Teresa did, though.", "\"Then we’ll have to continue restricting our people from entering the area.”", "After letting out a bitter laugh, Yuirel asked.", "\"I've listened to your interesting story well. Will you head back right away?”", "\"Yes, that’s what we’re planning to do.\"", "\"I feel a bit sad now that we’re saying goodbye.”", "Yuirel added while squinting her eyes.", "“The banquet noodles, that is.”", "\"It was a fun encounter. I’d love to see you again next time.”", "After frankly revealing her inner thoughts, Yuirel extended her hand. Seol Jihu didn’t hesitate to take it.", "It was only after he shook hands with Yuirel that the expedition team could finally prepare themselves for their trip back home.", "'Now that I think about it.'", "He had made a connection with the Federation.", "Seol Jihu gave a satisfied smile, thinking to himself that while it wasn’t a smooth-sailing expedition, it was definitely one that he had earned a lot from.", "Just before setting off, he turned to glance in the direction of the Pagoda of Dreams.", "The forest was…", "\"….”", "…still shining in a mixture of gold and blue.", "Like all things, the expedition wasn’t over until it was truly over.", "Dylan had always emphasized that an expedition’s end was not when they successfully cleared their objective, but when they safely returned back to their base.", "Likewise, Seol Jihu urged them not to relax their caution until they arrived at Haramark before commencing their march.", "The speed of the march back could only be much slower as they had packed all of the inheritance into their bags. Nevertheless, each magic bag reduced the volume of the inheritance from at least one-tenth to one-twentieth of the original volume, so there was no issue carrying them back.", "The expedition team happily marched while humming with bright and hopeful faces. They only stopped their march when they left the border region.", "The sun had yet to set. It was still pretty early to set up camp, but they had a clear reason for stopping.", "Whatever the job, the calculations needed to be exact. There needed to be no mistake, especially when it came to distributing the goods.", "Seol Jihu finally said the words that everyone had been waiting for.", "\"We’ll be setting camp here for today.\"", "\"Damn it. This has to be the first time I’ve had to consume mana while marching.”", "Phi Sora grumbled while letting her bags drop.", "Seol Jihu chuckled.", "\"It would have been easier if we had brought porters.”", "\"Well… I think I know why we didn’t.”", "Looking at the bags, Phi Sora grinned before starting to stretch her body. She had a serious face like that of an athlete about to begin an important competition.", "…In reality, she really wanted to hurry up and total the expedition rewards to confirm her portion of the share.", "And so, the expedition team quickly set up camp and began settling accounts.", "They were prepared to take a long time given the sheer volume of the wealth. But thanks to Roselle neatly sorting the treasures and everyone working together with one heart, the calculations progressed at a fast pace.", "First, the gold coins— no, the gold eggs. Kazuki weighed them on a scale and found that each bead weighed about 70 grams.", "Considering that the average weight of gold coins in Paradise was close to 1 ounce, each egg was worth 2.5 gold coins.", "There were 800 of such gold eggs in total. Or 2,000 gold in terms of coins.Since the expedition team had a total of eight members, each individual could receive 250 coins worth of gold. If converted into cash, each of them would receive 126 billion 250 million won.", "Of course, it was necessary to keep in mind that the market prices were completely different between Paradise and Earth, but the fact that it was still a staggering amount beyond imagination did not change.", "The important part was that this was the calculation of only one out of a total of seven parts of the wealth.", "The expedition team skipped dinner and continued to calculate their spoils, but no one complained.", "Classifying the gems proved to be a bit more difficult. Nevertheless, with Kazuki and Marcel Ghionea displaying their sharp eyesight and dexterity as Archers, the end finally began to appear.", "Meanwhile, Seol Jihu opened the smaller boxes to check their contents. The boxes were lighter than expected and the inside of them were items that were wrapped in soft cotton.", "For example, the last box he opened contained a crystal sculpture shaped in the figure of a bird. It was definitely beautiful to behold, but the faint light emitting from its surface made it seem extraordinary.", "As Seol Jihu was turning it over, trying to figure out what it was, Flone spoke up.", "[It’s an offering.]", "\"An offering?\"", "[Yep. It contains holy power. Not a lot, but it’s probably around a superior-grade offering.]", "\"Wow. Isn’t a superior-grade offering extremely rare?”", "[What are you talking about!? Offerings to Gods should only be supreme-grade, or at least top-grade goods.]", "Either way, Seol Jihu was extremely excited. While it was far from enough to wish for Seo Yuhui’s complete recovery, it would be of some help.", "\"Hey! Seol! Don’t dawdle around and help me over here!”", "Chohong, who was counting silver coins, shouted and beckoned him over with her hand. Seol Jihu quickly walked over.", "Time swiftly passed while they were busy sorting the goods. The sun set and the moon rose, and the night shifted into a bright dawn with dew glistening on the grass.", "The expedition team finally finished the calculations.", "\"…I had never expected during all my time in Paradise that a day would come where I’d be calculating in units of gold coins.”", "Kazuki rose up from his seat, wiping sweat off his forehead. Then, he passed a piece of paper to Seol Jihu.", "\"It’s the final account record. Take a look.”", "Seol Jihu hurriedly received the paper. On it were several categories and numbers written in a neat handwriting.", "1. 18 gold bars (600g per piece, total of 10.8kg = about 386 gold coins)2. 800 gold eggs (70g per piece, total of 56kg = about 2,000 gold coins)3. 1,200 chunks of silver (800g per piece, total of 960kg = about 31 gold coins)4. 56,000 silver coins (31g per piece, total of 1,736kg = about 56 gold coins)5. 5,400 gems (ruby, sapphire, emerald, opal, amethyst, pearl, topaz, peridot; 675 pieces each)6. 20 offerings7. Other", "#Weight of an average gold coin: 28g# Weight of an average silver coin: 31g", "\"Whoa….\"", "The tips of Seol Jihu’s mouth curled up higher the further he read. A laugh naturally burst out.", "\"So, how much is it in total? In gold coins.”", "Teresa squeezed herself in between the two handsome men and asked.", "\"I don’t know.\"", "Kazuki flatly replied.", "\"My brain was about to explode trying to calculate the worth from the fifth item onwards on the list. This is my limit.”", "\"I guess so.\"", "Teresa agreed and looked at Seol Jihu, who was laughing in glee.", "\"When should we distribute these?”", "Seol Jihu gave a wide smile and looked around at the members.", "\"How about right now?”", "A loud cheer broke out. The calculations were done. And when the time for the awaited distribution came, everyone released the excitement they had bottled up throughout the march.", "\"Yoohoo~!”", "Chohong did a mask dance and high-fived Hugo with her feet when he stuck his feet out.", "\"Aaah~ssa! Busan seagulls~ Busan seagull~!”[1]", "Phi Sora also went crazy, clapping her hands together while doing a leg dance. Teresa copied her, saying it was an intriguing dance.", "Seol Jihu burst into laughter, looking at the two women.", "It really was a fun time.", "Meanwhile, Kazuki silently watched the celebrating expedition team from a step away.", "\"…Are you sure you’re okay with this?”", "He spoke up after a moment of conflict. Seol Jihu, who had been crying in laughter, blinked his eyes.", "\"About what?\"", "\"The distribution.\"", "Kazuki bit his lips.", "\"This expedition… Even if you claimed a bigger portion, there wouldn’t be anyone who would say anything. Rather, they won’t have anything to say at all.”", "The clamor abruptly stopped. The gazes of everyone focused on Seol Jihu and Kazuki. A few of them even shot resentful gazes.", "There was no helping it. There was nothing more sensitive than the issue of reallocating the distributions. It was especially so, since it was at the end of the expedition and because it was the header, who brought up the topic.", "Even so, no one thoughtlessly opened their mouths. It was because no one could deny that Kazuki’s words were reasonable.", "Kazuki firmly continued.", "“Of course, you made some additional conditions like keeping all of the offerings. But I still think the current distribution is too unfair.”", "\"B-But even porters receive the same portion as everyone else excluding the artifacts…!”", "Maria hurriedly shouted.", "\"I wouldn’t have said anything if we were porters.”", "Kazuki cut her off.", "\"A certain amount of expectation is placed on each member of an expedition team. Excluding Seol and Princess Teresa… taking away the spoils of this expedition according to the original agreement is practically eating free lunch.”", "He wasn’t wrong. Bluntly put, Teresa had at least escaped from the nightmare through her own will. It wasn’t wrong to say that the other members did nothing during the expedition.", "\"There’s no need to be sorry. It’s not uncommon to increase the distribution of members with higher contributions.”", "Seol Jihu fell into thought. This was a good thing for him.", "The important thing was whether to accept it or not. Seol Jihu compared the benefits of receiving a higher distribution and keeping it the same.", "And the answer immediately came to him. Seol Jihu grinned.", "\"Is what you said, your opinion as a header?”", "\"So you’re saying…?\"", "\"Thank you for the opinion, but I’ll have to refuse.”", "The restless Maria shot her head up, and Kazuki looked like he had received a blow.", "\"The agreement on the distribution was already finalized before the start of the expedition. Changing it after everything is over feels like twisting it too much for my own convenience.”", "While that was what he said, he also had down-to-earth reasons behind it.", "He didn’t want to sow discord and seem greedy when it was only a ‘part’ of the entire inheritance. Because they were people that he wanted to be with in the future, he wanted to share as much as he could with them.", "Kazuki asked.", "\"Aren’t you frustrated? Your contribution in this expedition was over 80% at the very least.”", "\"Not at all.\"", "Seol Jihu shook his head. According to Kazuki’s reasoning, it was only right for all of the inheritance to be given to Flone instead.", "\"If there are these kinds of expeditions, there are also others. It would have been another story if anyone of you purposely shirked your duties, but wasn’t it just the situation of the expedition that made you unable to contribute?”", "After clearly stating his stance, Seol Jihu flicked the paper with his finger.", "\"The reward distribution will be the same as before. I won’t receive any further comments.”", "“Oooooh—”", "A small cheer rose from his firm statement.", "\"…Alright.\"", "Kazuki stared at Seol Jihu before shrugging.", "\"If that’s what you think, then okay.”", "As soon as Kazuki retracted his suggestion, Maria came bolting at him.", "\"Opppaaa!\"", "She tightly hugged him and cried out.", "\"Oppa is the coolest! I believed in you, Oppa!”", "\"Ah… Sure.\"", "Seol Jihu gave a bitter smile. It was at that moment—", "\"Wait a minute.\"", "Teresa raised her hand and stepped up as if the conversation wasn’t over.", "\"Actually, I think that what Kazuki said is right.”", "Seol Jihu didn’t show it on his face, but he became uncomfortable. He had just said he wouldn’t receive any further comments, but why did she have to keep at it?", "\"How about we do it like this?”", "This was Teresa’s opinion. She brought up the existence of Flone and claimed that she, too, had to be a part of the distribution.", "He had not imagined that she’d bring up Flone, so Seol Jihu became dumbfounded.", "[!]", "Flone had not spoken up, but she seemed surprised.", "Seol Jihu was actually pretty quick-witted, so he understood what Teresa was suggesting.", "It wasn’t only because of his abnormal behavior. Not only had he said so himself and Roselle had too, on many occasions, mentioned that there was a legitimate successor to the inheritance.", "Mumble mumble.", "The camp became noisy. Seol Jihu could not turn the suggestion down on his own this time.", "Teresa’s suggestion was completely sound. In fact, the expedition was formed thanks to Flone, and she had contributed the most out of all of them.", "And the timing of the suggestion was optimal. It was right after Kazuki had suggested redistributing the allocations, so most of them agreed, thinking, ‘Sure. She’s the real owner of the inheritance anyways.’", "Of course, they were fully aware that including Flone in the distributions was equivalent to increasing Seol Jihu’s share.", "After a while, the votes were cast.", "The result was all in favor, except for one person.", "1. Pretty sure this is a cheer song of sorts. "]}