{"cid": "320", "title": "Chapter 320. Simultaneous Outbreak of War (1)", "content": ["The Astral World could hardly be described as bearable, even as lip service.", "However, the saving grace was that the expedition team was very high leveled. The thick-boned veterans of Paradise knew well how to deal with this unfamiliar phenomenon.", "Following Oana’s warning, they did not act out and focused entirely on chasing after the girl’s footsteps.", "With the exception of one person.", "“Mm~ The scent of death~”", "Hoshino Urara, who was walking totally fine until now, suddenly spread her arms out and took in a deep breath.", "“This is it. This is what I’ve been waiting for. The sensation of being alive. I love it…!”", "Not a single ray of light shone down on this place, but the way she was facing the sky and standing enraptured, she seemed to be having an orgasm of some sort.", "Of course, this was something Seol Jihu couldn’t understand in the slightest. The scent of death was making her feel alive? It didn’t make any sense.", "But Hoshino Urara really looked like she was greatly satisfied. She was someone who chattered on and on like a child with a mental disorder, but the moment she entered the Astral World, she became quieter in comparison.", "“My father left me a last word of advice before passing away.”", "Audrey Basler whispered after seeing Hoshino Urara laughing maniacally like a junkie who was high.", "“The world is vast and there is no shortage of Crazies. Now I finally understand what he means.”", "Seol Jihu nodded his head. Audrey Basler must have been a Crazy in her own right before coming to Eva. But it wasn’t surprising for her to be doubting herself after coming to Valhalla and seeing women who lacked a few more screws.", "“I also didn’t think the day I would consider Miss Basler normal would come.”", "Seol Jihu replied calmly before taking out a beef jerky from his pocket and biting down on it.", "“Achoo!”", "He sneezed, feeling a creeping chill suddenly caressing his soul, but he did not stop or turn around. Perhaps, feeling proud of Seol Jihu for heeding her warning, Oana gave a furtive smile.", "“It wants one too.”", "Seol Jihu’s face stiffened.", "“You mean the thing Chohong encountered before…?”", "“Yes. It’s following us.”", "“Is it behind me?”", "“No, to the side. It’s waving its hand at the beef jerky. It must be sensitive to the smell of blood.”", "Was this why his insides were rumbling so much?", "“….”", "He lost his appetite. After quietly spitting out the beef jerky in his mouth, Seol Jihu thought hard before taking out a new one.", "He wasn’t hungry and couldn’t taste the meat, but he still forced it down his throat. Since his five senses became faint, he couldn’t trust anything he felt.", "And because even thirst and hunger became faint, he ingested water and food periodically regardless of the signals he thought his body was sending. Otherwise, he might collapse during the march without even realizing it.", "“I feel a lot better now that I’ve gotten used to this place. Humans really are quick to adapt.”", "Oana cheered herself up while clenching her fists triumphantly. Seol Jihu couldn’t help but feel sorry, seeing the girl speak with vomit smearing her mouth.", "“Let’s go. It looks like we’re not far off.”", "Seol Jihu lost count of how many times Oana said this already, but he didn’t complain and returned a smile.", "How much time went by? By the time Oana changed her direction six times and continued to lead the group in a roundabout way, Seol Jihu felt that his body had become heavy as though he had a severe case of the flu.", "But it was at this moment that Seol Jihu strongly felt something was off. He thought it was the mysterious, attention-seeking monster messing with him, but the sensation that he thought would go away soon had been lingering for a while, almost as if it entered his body.", "‘Could it be?’", "The moment he thought so, the fog suddenly lifted. His hazy vision became unhindered, and the surroundings cleared up. Though it was still a little opaque, things were still much better than before.", "Once he could finally see, the first thing that entered his sight was an open area with sparsely scattered rocks.", "It was a strange sight. The fog filling the heaven and earth was encircling the area as if it was the only place it could not invade.", "And in the center of the open area was a small spring.", "“This is it.”", "Oana stopped.", "“This place should be safe. I don’t see any rifts in space here.”", "She seemed very happy, walking about left and right and stopping with a light hop. Then, she pointed in the center and spoke.", "“Oh, except for that place.”", "Seol Jihu immediately walked into the open area.", "‘Hoh.’", "He could immediately feel the difference as he felt the solid sensation of the ground under his feet.", "This open area seemed to be the eye of the storm just like Kazuki said.", "Shortly afterward, members of the expedition team ran to the center of the open area. It looked like a spring when they saw from a distance, but upon closer inspection, they realized it was a pit — a 2-meter-wide, huge bottomless pit.", "There was no water inside the pit, only a faintly shining, spirit-like smoke.", "“Oooooong~!”", "Hoshino Urara scurried up excitedly and squatted down in front of the pit. Everyone else stood at a good distance from it and craned their necks to peer down.", "Seol Jihu swallowed hard as he saw Hoshino Urara grabbing a handful of dirt to throw into the pit.", "‘So this is…’", "The spring mentioned by the future Seol Jihu and Eun Yuri.", "Now that he was looking at it with his own eyes, it didn’t look all that special. However, Seol Jihu didn’t trust his eyes in this place. Though it may look like a pit to him, there was a chance it was something else in reality.", "“Hey.”", "Philip Muller must have thought the same thing as he turned and asked Oana, who was sitting comfortably and massaging her calves.", "“What does that pit look like to you?”", "“Uun—”", "Oana tilted her head.", "“Space?”", "“What?”", "“To be more precise, there’s a glass window that’s cracked like someone kicked a soccer ball at it, and beyond it is the space. I can even see stars, planets, and whatnot.”", "“…Space…”", "Philip Muller rubbed his chin and fell into thought.", "“What are you doing?”", "At that moment, Agnes muttered in a displeased tone.", "Hoshino Urara lugged over a boulder the size of her body and threw it down the pit. Next…", "“Eh?”", "“Ah?”", "Philip Muller and Oana yelped simultaneously, then…", "“The smoke subsided?”", "“The window reformed a bit!”", "They spoke at the same time.", "As everyone’s gaze fell on Hoshino Urara, she blinked rapidly and scratched her head.", "“Um, I was just curious how deep it went…”", "Agnes furrowed her brows.", "“Shut up and go back.”", "“Arigato~”", "Hoshino Urara quickly scurried back.", "“The rift seems to have gotten smaller…”", "Oana was taken aback, but Philip Muller, the second to none Magician, reacted a little differently.", "“Could this be…”", "He muttered in a serious voice as if he had something in mind.", "“I see. My conjecture might be true. An internal collapse must have happened already. It just wasn’t expanding. Then this restoration phenomenon just now…”", "“Oi, Mister Magician, can you stop talking to yourself and give us an explanation?”", "Hearing Chohong’s discontented voice, Philip Muller nodded his head in agreement.", "“Hmm, you must have heard of the laws of thermodynamics.”", "“?”", "“The first law states that energy cannot be created nor destroyed in a universe or, to be more precise, an isolated system. And the second law states that the entropy of the universe is always increasing. So if you assume that an arbitrary isolated system has 2n atoms, the entropy would be increasing in the direction of…”", "Philip Muller stopped his explanation midway and made a flustered expression. Most members of Valhalla, including the female Warrior who spoke up, were looking at him with dazed faces.", "“…Alright, suppose I got a scratch on my arm.”", "In the end, Philip Muller tapped on his arm and changed his tune.", "“What would happen if you leave the injury be? What would the body do?”", "“You’d get a scab.”", "Phi Sora answered.", "“Right. And the reason we get scabs is to defend against infection, dust, and other debris. So the reason the fog subsided— or rather, the reason the rift shrunk is because of a similar case.”", "Philip Muller cleared his throat.", "“To the Middle World, that pit is like an injury. What we’re trying to do is push our way through, so the world is recognizing us as debris and trying to block the pit temporarily. You can think of it as a self-healing process.”", "“…The hell is he saying?”", "Hugo asked in a shrill voice.", "“I didn’t understand a thing he said.”", "Chohong also shrugged and shook her head.", "Philip Muller scowled.", "“God damn it. If you can’t understand even that dumbed-down explanation, then blame your own brains. I condensed what could very well be a 20-page research paper to a few sentences, and you still say that…”", "“You’re saying there’s a limited number of people that can enter that pit.”", "When Seol Jihu, who had seen and heard things about the pit, asked, Philip Muller breathed a sigh of relief.", "“Yes, you can say it is limited for now.”", "“By ‘for now’, you mean…”", "“Well, you can’t exactly equate the Astral Phenomenon with the body’s self-healing process. No one knows whether that pit will stay closed, recover its original size, or get bigger. I have a lot of questions left unanswered too.”", "Philip Muller said quickly, then took off his glasses to clean them.", "“Anyway, what I can say for sure right now is that there is a good chance that we can enter the Spirit Realm using that pit and that probably not all of us can go in.”", "“And if we’re going, we should go as soon as possible.”", "Agnes added.", "“Yes.”", "Seol Jihu agreed strongly.", "Although everyone was tired from the journey and deserved a good rest, the problem was that resting was not allowed in this place. Never mind recovering, their stamina was being drained at a steady rate just by staying still.", "Although things got a little better once they entered the open area, their senses had not entirely gone back to normal.", "“Then—”", "Before speaking, Seol Jihu glanced at Baek Haeju, wondering if she would bring up retreating. However, she was silently looking down the pit.", "‘Even a heavy rock only reduced the rift by a little… It would be nice if everyone could enter.’", "With that, Seol Jihu was about to decide the order when he suddenly changed his mind. Thinking about it again, there was no need to enter one by one.", "“Let’s join hands and jump in at the same time.”", "This was just in case entering one by one would teleport them to different locations of the Spirit Realm.", "“I understand what you’re saying, but wouldn’t it be safer to go in two teams? There’s a chance that pit can’t accept everyone, and we don’t know what will happen to the few who are left out.”", "Philip Muller offered his opinion. Agreeing with him, Seol Jihu immediately picked out eight people.", "Excluding himself, he picked out high-level Warriors and Archers and then included both Priests.", "The first team tied a rope to their wrists to connect everyone together and then circled the pit.", "At this point, two people were obviously excluded from the expedition.", "“Thank you.”", "Before setting off, Seol Jihu glanced back and thanked the Halep siblings. He had only asked them to guide the way. It would be too much if he asked them to join their mission to rescue the Spirit Realm.", "“Have a safe trip back. I let Kim Hannah know before coming here, so you can go straight to Eva.”", "Oana didn’t say anything. She only stared at him with a peculiar smile.", "Seol Jihu looked back at the pit.", "Finally, he was here.", "‘No.’", "Should he say he was only now at the starting line?", "“Euu, I wanna pee.”", "Standing in front of the giant pit must have made her nervous as Maria crossed her legs and whimpered. It wasn’t only her. The members of the first team all had clear looks of nervousness.", "“Get ready, everyone.”", "Seol Jihu tightly clenched the hand to his left and right — belonging to Seo Yuhui and Baek Haeju — and spoke.", "“Five, four, three, two, one….”", "He started counting, staring fixedly at the pit. Eventually, when he reached zero, the members of the team leaped inside.", "“Uryaryarya!”", "One person frogged-jumped.", "“Valhalla!”", "Another hopped in with a valiant shout.", "“Seol Jihu, you son of a bitch!”", "One Priest, who insisted on entering second, threw herself in like a wronged maiden entrusting herself to the river.", "“Eeeh? Wait, waaaait!”", "And another person fell into the pit as if to be pulled in.", "Splash!", "In the next moment, Seol Jihu felt himself falling into the water. There was only smoke inside the pit last time he checked, but something indescribably heavy was pressing down on him.", "But that only lasted a moment. Soon, a bizarre sensation of his head being stretched out dominated his body. Seol Jihu shut his eyes, withstanding this head-splitting pain.", "And in his heart, he sincerely prayed.", "That when he opened his eyes next, he would be in the Spirit Realm.", "*", "An army arrived at Eva.", "It was a grand army, including forces from four cities, led by Teresa.", "When Teresa visited the Eva Royal Palace to officially take command over Eva’s army, she was met with surprising news from the royal administrator.", "“Charlotte left?”", "“Yes, Her Majesty left for the border region with a Magician who arrived from Haramark yesterday and a hundred soldiers.”", "“What? Why would she…”", "“Her Majesty said there is something she must do. She asked me to tell you that she is sorry for being unable to meet you and that she would see you at Tigol Fortress.”", "The look Teresa gave Sorg Kühne was asking whether Charlotte Aria lost her mind. However, when she saw Sorg Kühne’s face, she nodded her head in acknowledgment.", "She knew Sorg Kühne was just as strict and careful as she was. Unless he had also lost his mind, he wouldn’t have let a clueless child run out by herself.", "‘So that explains it…’", "Teresa had been surprised on multiple occasions on her way here. Although two cities other than Haramark and Odor sent reinforcements, to speak a little harshly, they were just barely bigger than tiny.", "It was just enough that the cities take part of the credit if things went well and save face if things didn’t. In any case, Teresa didn’t have a problem with it since their cities’ Executors also came.", "However, Eva was different. Whether it be the size of the army or the quality of Earthlings, she managed to assemble a force that was on par with Haramark’s.", "Teresa expected this to be the royal administrator’s handiwork, but that apparently wasn’t the case. Sorg Kühne fully revealed that it was Charlotte Aria, who brought about this situation, even going as far as to seize control over the temples’ portals.", "“Even I got burned trying to control the Earthlings… I’m surprised. What happened?”", "“When lightning strikes, thunder drums as well.”", "Sorg Kühne replied vaguely with a faint smile.", "Teresa couldn’t hide her surprise.", "“I see. The late king would be proud if he was alive.”", "“This servant also thinks that it’s a shame.”", "“Anyway, thank you. Is the captain of the Equities battalion waiting outside?”", "“He is, but do you plan to leave right away?”", "“It would be great if we can take a break, but unfortunately, the situation calls for haste.”", "As Teresa was turning around, she stopped and put her hand in her pocket. When she pulled her hand back out, a communication crystal was in her hand.", "“Administrator Kühne, when was the last time you contacted the Federation?”", "“We haven’t tried for the past few days…”", "“I lost contact with them four hours ago. I’ve been calling them periodically since then, but they’re not picking up at all.”", "Sorg Kühne’s expression froze.", "The communication with the Federation cut off completely? That could only mean one thing.", "“Signal Jamming!”", "The Parasites had arrived at their destination.", "“That’s why we need to hurry.”", "Teresa sighed.", "Sorg Kühne was at a loss for what to say.", "“…I will pray for you to come back in one piece.”", "All he could do was pray for her safe return.", "“I don’t mind losing a piece or two of my body as long as I can come back alive.”", "Teresa chuckled before saying her farewell and quickly leaving the palace.", "Thirty, forty minutes later, the allied forces of five kingdoms, led by a ten-thousand-men cavalry, marched out of Eva’s southern gate.", "To Tigol Fortress — where a fierce battle may already be taking place."]}