{"cid": "159", "title": "Chapter 159. Attribute Change, and...", "content": ["Undying Diligence led the Nosferatu, and Vulgar Chastity and Unsightly Humility were also Army Commanders who led their own Parasite armies.", "Other than the Queen whom they served, the seven Army Commanders were the Parasites’ highest-ranked beings.", "But the Parasite Queen was dispatching three of them just to assault a single valley? Even going so far as deploying ten precious Nests?", "Considering the fact that two of the Seven Armies had left the Material Realm for unavoidable reasons, the Parasite Queen was deploying more than half of the Parasites’ available forces.", "Being wasteful was generally not a problem. As it was the Queen’s strict command, if they had excess troops or leisure, Undying Diligence would have followed the order without a word of complaint.", "The problem was that they had just conquered Tigol Fortress.", "[If we advance towards Haramark, they will surely come out to Arden Valley.]", "Hearing the Parasite Queen’s command, Undying Diligence became conflicted.", "The battle at Tigol Fortress was a large-scale siege battle fully utilizing the five remaining Parasite armies, and the Parasites had just barely conquered the fortress after a fierce battle. Naturally, this spoke volumes of how important Tigol Fortress was as a strategic point.", "It would be a different story if the Parasites had completely taken over the fortress, but with the Federation gritting their teeth to try to reclaim the fortress, if the Parasites reassigned over half of their forces, there was a high chance that the Federation would succeed in their recapture efforts.", "“….”", "As such, Undying Diligence strongly wanted to protest. If it weren’t for the terrifying pressure he just felt, he really might have opened his mouth.", "[There is no need to worry.]", "However, the Parasite Queen’s will was clear.", "[You only have to eliminate a single star.]", "Her decisions that came from watching the movements of the constellations had never been wrong.", "[Then everything will return to normal.]", "Everything will return to normal.", "Undying Diligence gently closed his eyes.", "…Right, there had to be a reason.", "A reason that the Parasite Queen was valuing a single star higher than Tigol Fortress.", "Eliminating his doubt, Undying Diligence bowed.", "“This humble servant accepts the Chief Deity’s command.”", "*", "Marcel Ghionea officially became a member of Carpe Diem.", "After finishing up his training that day, Seol Jihu called the Yi siblings and introduced them to Marcel Ghionea. Of course, he didn’t forget to let Chohong and Hugo know through the communication crystal.", "Marcel Ghionea was someone who was far from being sociable.", "Although he treated Seol Jihu and Jang Maldong with respect, he consistently treated the Yi siblings coldly, even though they were making efforts to warm up to him.", "Rather than doing so on purpose, it was more correct that this was how he normally was. After all, he was cold even to Chohong, whom he was acquainted with.", "But seeing as how Chohong didn’t get angry, he didn’t seem to be missing a screw like a certain someone. So, Seol Jihu welcomed him with open arms.", "He could see a somewhat bitter Phi Sora watching them from the corner of the cave, but she vacated the area.", "Just to be sure, Seol Jihu asked Marcel Ghionea whether he would like to return to Carpe Diem’s office and rest, but he made a surprising request instead.", "“I would like to join the training.”", "“Training?”", "“Yes. I have heard about Master Jang’s reputation to the point of having my ears bleed. Now that I have the chance… if it is not too much of a hassle, I would love to receive his guidance.”", "Seeing Marcel Ghionea’s passionate eyes, Jang Maldong rubbed his chin.", "“I don’t know how I feel about working an injured person so hard….”", "With Marcel Ghionea joining the team, Jang Maldong talked more casually as the team’s advisor. Marcel Ghionea was the one who asked him to do so.", "“If it is about my body, I have already fully recovered. But because I’ve been held captive for too long, I seem to have lost my touch….”", "“Having one more person won’t pose much of a problem…. Fine. We will work on slowly re-sharpening your senses while making sure your injuries are not worsened.”", "“No.”", "Jang Maldong was being rather considerate, but Marcel Ghionea flat out refused him.", "“I have heard about your training methods, Sir. Please work me to your heart’s content. That will be much more beneficial.”", "Hearing this unbelievable request, the Yi siblings became dazed. They looked like they had just seen a madman while walking down the streets.", "“Hoh….”", "Jang Maldong couldn’t hide his astonishment.", "“To think I would hear this from someone other than that boy….”", "Jang Maldong struck his palm with his cane and let out a sinister ‘Keuhuhu.’", "“Fine. If that’s what you want, I don’t see why not. Don’t regret it later.”", "“Thank you!”", "Marcel Ghionea replied cheerfully.", "And the next day.", "When Marcel Ghionea didn’t come back at night, Seol Jihu went out to look for him.", "Since he was an Archer, Seol Jihu wasn’t worried about him being lost. But judging by Jang Maldong’s chuckles, Seol Jihu thought he might have run away.", "Thankfully, Seol Jihu was able to find Marcel Ghionea near a lake.", "He was squatting by the water…", "“Keuk… heuk….”", "And crying quietly.", "Jang Maldong’s hellish training made even the determined Archer of Steel raise the white flag.", "“A truly crazy training….”", "When Seol Jihu heard Marcel Ghionea muttering to himself, he laughed on the inside.", "That Marcel Ghionea was a human, after all.", "*", "Although a new member joined the team, not much changed from the daily routine.", "Every day was a repetition of intense training, and the days and nights flew by in the blink of an eye.", "But it was only the daily routine that remained steady. Seol Jihu’s Status Window was changing by the day.", "‘Something’s weird.’", "His physical stats had increased evenly, including his Luck stat, and only his Mana stat remained the same.", "Of course, this was something Seol Jihu should welcome with open arms… but there were more than a few suspicious points.", "Should he say that things were progressing too smoothly?", "After carefully contemplating for a few days, his suspicions turned into convictions. The more he trained, the more the energy inside of him would digest and increase his physical level.", "Moreover, even though it felt like he’d already drained a lot of this mysterious energy, he still felt an inestimable amount left in his body.", "At this point, Seol Jihu could no longer believe that the recent changes were only the fruits of his labor.", "‘The late-night meals.’", "Thinking about it now, the sudden changes began after he started having late-night meals with Seo Yuhui. No matter how many times he thought about the matter, that was the only suspicious point.", "Then, a new question arose in his mind.", "If Seo Yuhui really was the source of all this change, why was she treating him so well?", "He had heard about the Daughter of Luxuria caring for talented Earthlings and helping them grow, but this was simply too much.", "She was no longer just helping, but almost being a charity like the Giving Tree.", "‘Why?’", "Clutching his hand and pondering, Seol Jihu slowly looked around. He couldn’t see Seo Yuhui anywhere.", "Now that he thought about it, Seo Yuhui had been acting a bit differently recently.", "Not only did her late-night meals become less frequent, but she also wasn’t wandering around Huge Stone Rocky Mountain and was often staring at the sky with eyes full of worry.", "And whenever Seol Jihu asked if she was worried about something, she would only shake her head with a pensive smile.", "‘My curiosity would be satiated if only I could see her Status Window with General Observation.’", "Why did the Nine Eyes not work on Seo Yuhui and Cinzia? The dejected Seol Jihu suddenly heard approaching footsteps and turned around.", "It was Shuttle, no, Phi Sora.", "She stopped and went straight to the point.", "“Grandpa is calling you. Your lover is with him too.”", "“She’s not my lover.”", "“Yeah, yeah. Anyways, judging by their faces, it looks like it’s something important. You should hurry over.”", "“Thank you for…. Miss Phi Sora, hold on.”", "Seol Jihu stopped Phi Sora, who, like always, had turned back after saying what she needed to.", "“Can we talk for a bit?”", "“Talk?”", "“Yes.”", "“S-Sure.”", "Turning back around, Phi Sora stuttered with her eyes shining from anticipation.", "“There is something I want to know about Lady Seo Yuhui.”", "Then, her face seemed to lose all of its energy in the next moment.", "“…What is it?”", "“Do you know what level she is?”", "“No, why would I? She should be the only one who knows that. Well, we know that she is a Unique Ranker, so she must be a Level 7 at the very least.”", "“Then do you know Miss Cinzia’s level?”", "“Cinzia? Ah, Taciana Cinzia? The leader of that group of war hawks?”", "“Y-Yes.”", "“I don’t know. I know she is a Magician, but that’s about it. But why are you asking me this?”", "Hearing Phi Sora’s question, Seol Jihu scratched the back of his neck.", "“Ah… I was just curious about the difference between High Rankers and Unique Rankers. And about Executors too.”", "“Well, they’re different alright….”", "“Can you tell me what you know about them?”", "Phi Sora put on a prim expression but explained obediently.", "“You know that Earthlings have to choose a god to serve when they become a High Ranker, right? Just like how you will have to choose between Gula and Ira unless you plan on becoming a dual-class Earthling.”", "“What does it mean to choose a god to serve?”", "“You can think of it as receiving their influence.”", "“Influence?”", "“That god’s disposition. For example, Gula would be gluttony. You will suddenly have the urge to eat whenever you see food or things like that. The urge is faint when you’re a High Ranker, so it’s not too bad. For the record, I serve Ira, the Goddess of Rage.”", "Seol Jihu barely held himself back from blurting out, ‘Is that why your personality is so fiery?’", "“But from what I hear, this urge becomes far more intense when you become a Unique Ranker and go through the specialization process under your god’s power. It hear it becomes an unbearable desire.”", "Seol Jihu tilted his head. He understood what Phi Sora was saying, but he had immediately thought of a counterexample.", "“But Lady Seo Yuhui is—”", "“A Unique Ranker who serves the Goddess of Lust. That’s what makes her so amazing.”", "Phi Sora replied immediately and shrugged her shoulders.", "“Who knows whether she’s holding it in with superhuman patience? You never know what someone is feeling on the inside.”", "“Mm… then what about Executors?”", "Hearing this, Phi Sora raised her hand to her stomach in the shape of a blade, then quickly raised it.", "“You can think of Executors as being a stage higher than Unique Rankers.”", "“So their desires will be even stronger?”", "“That’s not all.”", "Phi Sora raised her index finger.", "“Becoming an Executor means becoming an apostle chosen by a god. You break away from your human shell and become your god’s avatar.”", "“Avatar?”", "“Not only are you bestowed power, but you also come to share values, personality, thoughts, and life with your god. It’s obvious why you will be influenced so much.”", "“At that point… aren’t you just the god’s puppet?”", "“No, not at all. The god cannot force you in any way, and your will is prioritized above all. There is a reason why Executors are called that — because they carry out the will of their gods. Well, some call them Avatars or Clones, which makes sense as well…. Ah, my throat hurts.”", "Seol Jihu had asked, wondering whether the reason he could not see Seo Yuhui’s Status Window was because she was an Executor, but he ended up getting more information than he had expected.", "“By the way, don’t you have to go?”", "Phi Sora asked while rubbing her neck.", "“I don’t mind, but they’re waiting for you.”", "“Ah.”", "Only then did Seol Jihu start racing to the cave.", "Just as Phi Sora said, Jang Maldong and Seo Yuhui were waiting inside the cave. They were in the middle of a serious discussion but stopped when Seol Jihu finally arrived.", "“I heard you called me.”", "“Seol, how much money do you have?”", "Hearing a rather unexpected question right out of the gate, Seol Jihu made a puzzled expression.", "“S-Sir?.”", "When even Seo Yuhui was flustered, Jang Maldong let out a dry cough.", "“Kuhum. You should remember me telling you about the attribute change.”", "“Yes.”", "Seol Jihu nodded his head.", "“But you said it’s not something that can be learned quickly….”", "“Right. You have to learn Mana Cultivation and then slowly take in lightning energy to transform your mana. But, a good opportunity just came up.”", "When Jang Maldong looked to his side, Seo Yuhui slowly reached her hand out.", "Next, when she reached into the empty air and pulled something out, Seol Jihu’s eyes widened.", "“Don’t be so shocked. It’s Dimensional Pocket, one of the innate Authorities of a Unique Ranker.”", "Seol Jihu was surprised to see something he had only read about in novels, but that surprise only lasted a moment as his attention was taken by the object Seo Yuhui took out.", "It was a beautiful red flower shaped like a marigold.", "Its round, fanned-out petals were encapsulating a small, circular crystal that shone like a firefly.", "“It’s called the Essence of Soma. Pretty, isn’t it?”", "Seol Jihu nodded his head in a daze. He was just thinking how pretty it would look as an earring or a ring.", "Then, he suddenly closed his mouth and blinked.", "Why was she showing him this thing called the Essence of Soma?", "Jang Maldong opened his mouth.", "“The Essence of Soma is… simply put, something like an inner core.”", "“An inner core?”", "“Yep. As long as you can absorb it, your mana will come to carry powerful lightning energy. In other words, you’ll be able to skip the process of gathering lightning energy with Mana Cultivation.”", "Seol Jihu’s jaw dropped. He was saying that it was basically a cheat key that could skip the long and boring grinding?", "“And another thing.”", "Jang Maldong continued.", "“If you acquire this essence, you will gain another powerful weapon.”", "“Power weapon…?”", "“The anti-evil attribute.”", "With a short reply, Jang Maldong raised his tone by a notch.", "“So (燒) meaning to incinerate and Ma (魔) meaning evil. Soma. It’s an attribute that incinerates evil. Considering the fact that most of the Parasites’ forces are undead creatures… you can see how useful this attribute will be.”", "Seol Jihu swallowed hard.", "He wanted it. And judging from how things were going, it looked like Seo Yuhui was planning of gifting it to him. But…", "“Isn’t it incredibly precious?”", "“Is that even a question?”", "Jang Maldong snorted.", "“Its value doesn’t just come from its rarity. Attribute change stops at just resisting evil, but Soma is a power that was created to combat evil. Normally, this power is something only a select few, special Level 6s can receive.”", "‘Now that I think about it, Miss Agnes’s class name….’", "Was it Evil-hunting or Evil-chasing Spider?", "Although he couldn’t remember clearly, it was still something that he couldn’t ignore.", "“So if this item can instantly resolve such a complicated process, by putting it up for sale at an auction….”", "Seol Jihu finally realized why Jang Maldong asked how much money he had.", "“Elder, I’ll take over from here.”", "When Seo Yuhui politely spoke up, Jang Maldong, who was flicking the beads of his internal abacus, paused.", "“I talked too much. Seeing this legendary sacred flower has shocked me too much…. Please, it’s all yours.”", "Jang Maldong left the cave. With only Seo Yuhui and Seol Jihu in the cave, a somewhat awkward air flowed between them.", "Seol Jihu, whose eyes were fixated on the Flower of Soma, faced Seo Yuhui and asked seriously.", "“How much does it cost?”", "“Mm… I’m not sure. It’s a bit difficult to put a price tag on it.”", "The slightly troubled Seo Yuhui suddenly put on a courteous smile.", "“If it is okay, may I ask for something other than money?”", "“Of course. I have more items than money.”", "Seol Jihu replied quickly, having no intention of losing out on this opportunity, and Seo Yuhui shook her head gently.", "“No, I’m not talking about items…. I’d like you to grant me a request.”", "“Request?”", "“Yes.”", "Seo Yuhui gently grasped the flower and smiled.", "“Can we be a bit more close with each other?”", "For a moment, the nervous Seol Jihu doubted his ears.", "He was thinking about agreeing to any request as long as he didn’t need to step into the Parasites’ territory, but he became dumbfounded by the unexpected nature of her request.", "“That’s… your request?”", "He asked again just to be sure…", "“Yes.”", "But the answer was the same.", "In that instant, the questions he had forgotten about popped up in his head once again, and he snapped out of his daze as though he had been doused in cold water.", "Seol Jihu stared at Seo Yuhui fixedly. Her smile was just as kind and comforting as before.", "If he threw a tantrum and pestered her to give him the Essence of Soma, he felt she really would give it to him.", "‘…Why?’", "His flames of suspicion had been lit and refused to flicker off. As a result, her bright smile looked different than usual.", "It was as if he was leery of her, but he felt slightly uncomfortable.", "“That’s…”", "Seol Jihu’s mouth moved…", "“…Strange.”", "And he finally spat out these two words.", "Seo Yuhui’s smiling eyes quickly widened to a circle. Seeing the young man’s stiff face, she controlled her facial expression.", "“No, I—”", "“Why is it?”", "And when she said something, Seol Jihu’s voice cut her off.", "He felt like he would inadvertently be persuaded if he let her talk.", "So, he asked directly.", "“Seo Yuhui-nim, why do you treat me so well?”", "A conspicuous sign of fluster flickered on Seo Yuhui’s face."]}