{"cid": "43", "title": "Chapter 43. Spilled Milk (2)", "content": ["Seol Jihu continued to wander aimlessly on a certain street.", "It wasn’t that he didn’t know what to do. He was just… hesitant. Hesitation gripped him tightly and prevented him from taking that last step.", "For a while, he walked the same street over and over again. Eventually, his steps cautiously slowed to a stop as if he was standing on slippery ice. While standing still, he took a look inside a certain coffee shop through its front window.", "His gaze was directed beyond the tables and chairs, to a young woman preparing coffee beyond the counter.", "It was Yoo Seonhwa.", "….She was truly beautiful.", "Her clear eyes seemed to imply how honest she was; the light shining within those eyes was calm yet passionate; her slender hands cautiously handled the hot water; the soft and warm radiance whenever she smiled….", "Was that guy confessing to her? A man receiving a mug of coffee from her hesitantly pushed his phone forward. Yoo Seonhwa's eyes opened up a little wider, but she still managed to shake her head softly enough for her neatly-tucked-in hair to gently brush her neck.", "The man still tried to present her with his phone, but only after she bowed her waist did he withdraw his disappointed hand. Even though she seemed a bit troubled, never once did Yoo Seonhwa lose her charming smile.", "The shop's door issued a ring, and the rejected man walked out.", "Seeing that man's back trudge away, Seol Jihu felt a certain amount of unexplainable deja vu.", "He took in several breaths and reached out towards the door handle, only to freeze on the spot again.", "He would've reached the door if he let his hand inch forward just a little bit more. However, the distance between himself and the door to the shop suddenly felt so wide and impossible to close, and it grabbed hold of him tightly.", "“….”", "In the end, he withdrew his hand and placed it on his chest. That was when he felt it.", "His pounding heart. ", "And his fear.", "*", "The tables would be filled with patrons right past the lunch hour. But, after four in the afternoon, the shop would usually become less crowded.", "After the man who had been occupying a certain table for a long time finally left, a waitress finished tidying up his table, returned to the \ncounter, and began speaking to her co-workers.", "“Body, six points.”", "Then, another waitress who was busy with wiping clean one of the display shelves began laughing her head off.", "“Wow, how generous of you. Face, three points.”", "“Fashion sense, five points.”", "Finally, a different waitress stopped organizing the vibration bells and chimed in as if she was waiting for this chance. She then clicked her tongue.", "“A total of 14 points. How unfortunate, but rejected!”", "“Girls?!”", "Yoo Seonhwa stopped operating the POS terminal and turned around to face the waitresses. They stopped their chat and then began giggling non-stop.", "Seeing this Yoo Seonhwa slowly shook her head.", "“Is it really that fun?” ", "“Eii, stop being so coy, Unni. We all know that you're secretly enjoying this.”", "“What do you mean? Enjoying what? I just find it a little troubling, that's all. If you continue to….” ", "“That's only because you’re such a stonewall. By the way, Manager Yoo, wasn't that the second person to confess today?”", "“It was ten people last week…. At this rate, we might have a new record!”", "Seeing three waitresses chat among themselves in clear excitement, Yoo Seonhwa could only sigh softly to herself.", "The truth was, she was blessed with outstanding beauty, so there were quite a few men who would approach her and ask her out during the day.", "Also, there would be no man alive who would simply walk by disinterested after hearing her comforting voice and seeing the way she gracefully carried herself.", "Such events kept occurring every single day, so the three girls working as part-time waitresses here began assigning points to all the potential suitors asking her out.", "One of them was tasked with the body, another one with the face, and the last one with fashion sense. They began critiquing without anyone's permission; they even arbitrarily decided that the top combined points should be 30.", "Of course, Yoo Seonhwa told them to stop and behave themselves, but in a strange twist of logic, the girls began arguing in their defense that any guy who wished to date their respected manager should score at least 24 points.", "For the record, out of hundreds of men who tried their luck, 25 had been the highest score so far. For something these girls started as a bit of joke, the three of them were rather strict in their judging criteria.", "In any case, Yoo Seonhwa herself wanted this critique panel to disband with immediate effect. After all, no matter how careful these girls were, there was bound to be a slip-up sooner or later, and the customer might overhear them, which would naturally lead to a huge headache.", "“Ohh! We might have our third candidate for the day!”", "“Where, where?”", "“Right outside. Look, there he is. He's been standing there for the past hour or so, hesitating like that.”", "“You're right. Should we take a closer look?”", "They only pretended to listen to her and never really tried to heed her warnings.", "Seeing the three girls huddle around and began whispering amongst each other, Yoo Seonhwa decided to ignore them completely. The owner of the shop often called the girls 'the three no-answer stooges' and at this very moment, she sort of understood where that sentiment was coming from.", "In the meantime, one of the girls with an arrogant expression studied the youth outside, before suddenly gasping and blinking her eyes several times.", "The guy outside was tall. His chest and biceps were sturdy. He possessed the type of a body that this girl preferred, the one where the muscles were tough yet agile and smooth without looking like a bodybuilder's. The girl's lips loosened in a foolish grin.", "“Hi~ya. His butt and his waist are so dreamy! Body, ten points!”", "She then turned her head towards another girl rubbing her chin like an arrogant old man. This girl had a really high standard and so far, never had issued a single nine pointer, never mind the perfect ten. It was not for nothing she was tasked with judging the face.", "“….Hmm, he's okay. Eight points.”", "“I knew you'd do that!”", "“Knew what?”", "“I knew that you like guys with softer, more delicate looks.”", "“What do you mean? Look, that guy's face is manly enough, don't you think so?”", "She nodded her head and smiled in satisfaction.", "“Well, we might have the highest point scorer of all time if this keeps up. So, how about his fashion sense?”", "“….Ten points…. No, nine. His shoes are a bit of mismatch.”", "“Ohh? I get her, but what's up with you?”", "“You know, that top he's wearing? That one alone should cost a few hundred thousand.” ", "“Hiik.”", "The girls gasped in surprise before one of them tilted her head.", "“Wait a minute, didn't you say before that you hate name brands?”", "“No, it all depends on how you wear them, okay? It's not the same with you buying the most expensive stuff out there so you can show off, and someone carefully choosing and picking the right combination like him.”", "“R, really? I can't tell.”", "“With him, well, I think either a pro coordinator got him to wear those, or he could be someone really interested in fashion. Even though he looks simple and plain on the outside, he can't fool my eyes. He's got a killer fashion sense.”", "An evaluation that bordered on gushing praises was made.", "“Let's see. 10 points, 8, and 9….”", "“27 points! The history has been rewritten!”", "The girls clapped their hands, and one of them spun around to look at Yoo Seonhwa, in the middle of concentrating on her job and not minding whether they were throwing a party or not.", "“Unni! Manager! It's a 27! Finally, we have a guy who can bring down your unwavering wall!”", "“….Girls.” ", "Yoo Seonhwa's voice became heavy. There was a limit to her keeping quiet and ignoring them. She finally decided to teach these girls an unforgettable lesson today.", "“I told you girls to stop this, didn't I? How would he feel if he hears you and your…” ", "Her words blurred and the tone went up the moment her eyes drifted to the outside of the shop. Yoo Seonhwa froze up in the middle of her speech.", "But, that was to be expected. The girls spoke of a guy who could bring down her wall, but that person turned out to be someone who had already done that once.", "“….I…. Wait. I'll be back soon.” ", "Yoo Seonhwa took off her hat, grabbed her handbag, and hurriedly walked out from behind the counter.", "*", "Ring. The doorbell issued a ring once more.", "Seol Jihu stopped wasting time and momentarily held his breath.", "Yoo Seonhwa, still wearing the shop's uniform, was now standing in front of him.", "He felt his entire body, starting from the fingertips, freezing up after being subjected to her cold eyes.", "“…You even decided to show up at my place of work.” ", "“Seonhwa.” ", "“Follow me. I don't want to raise a fuss here.”", "Yoo Seonhwa declared as so and began walking towards the backstreet without waiting for his consent. He had no choice but to follow after her.", "A short while later, Yoo Seonhwa stopped walking in front and turned around to face him. Seol Jihu too reflexively stopped.", "“….”", "She stared at him for a long time without saying a word.", "Seol Jihu's head slowly lowered as if he was a criminal who knew his crimes. For some reason… he found it hard to look at her in the eye.", "There were only six, maybe seven steps between him and her. However, he sensed this wordless pressure that forbade him getting closer.", "The first person to break the silence was Yoo Seonhwa.", "“First of all, take these.” ", "Seol Jihu received his old bank card and the mobile phone and his expression became slightly dazed.", "“T, thanks. I had forgotten about them….” ", "“You forgot? No, you were just trying to create an excuse for yourself. You were being clever because I said I'll call the police.” ", "“No, really. I did forget them.”", "“Stop. Fine. So, why are you here today?” ", "Her voice remained cold.", "“You left behind ₩2 million that night.” ", "“….Yeah.”", "“Now that you thought about it, you want that money after all, is that it? What? Should I give it to you, then?”", "“N, no. That's not it. The thing is….” ", "“Fine. I'll give you. I'll give it to you, so….” ", "Yoo Seonhwa pulled ₩2 million, cash, from her handbag and thrust them out as if she was about to throw them away. It seemed that she had the cash ready just in case Seol Jihu came to visit her one day.", "“Take it and please leave, right now. I need to go back to work.” ", "Her voice, filled with resentment and anger, tore into his body and began stabbing his innards like a dagger.", "“Take this, and never appear before me ever again.”", "She used to be a kind, loving girlfriend once upon a time.", "“This is the last time I'll turn a blind eye. Don't ever think another cheap ploy like this will work in the future.”", "It felt like she went past the point of despising him and into the realm of hating him now.", "'Get a grip, get a grip….' ", "He stood there, his lips flapping helplessly for a while before he was able to squeeze out some words with considerable difficulty.", "“I'm sorry…. for coming to see you during your work.” ", "“?”", "“There was something I have to say to you…. But, I thought that, if it's not today, then I won't be able to… S, so, like, I….”", "Seol Jihu began biting his lips. This was not it. This was wrong. Even he could tell this was gibberish. There were so many things he wanted to say to her, but his head became an untidy mess that was impossible to unravel.", "Slowly.", "He had to do it, slowly.", "Today was the last day.", "Unlike with his family, he had to end it with Yoo Seonhwa today.", "Seol Jihu made up his mind once more; only then did some calmness return to his heart.", "“I know you're really busy, but is it possible for us to talk? Ten minutes, five, no, even three minutes will be fine.”", "“….”\nA short bout of silence later, Yoo Seonhwa retracted the hand carrying the money. He raised his gaze, a little more hopeful, but her eyes remained cold and critical.", "“You want to talk?” ", "“Yeah….”", "“Just how many more times do I have to tell you? If you want to talk to me, then go to the casino and apply for a ban there! I told you that I'd consider talking to you afterwards.” ", "“I, I already have.” ", "Seol Jihu quickly replied. Yoo Seonhwa's brows pricked up.", "“What did you say?", "“I've already applied for the lifetime ban. I did that in the morning before coming here.”", "“…..Hah.”", "She let out a long sigh and stared at the sky.", "She closed her eyes and even clicked her tongue. It was as if she was dealing with someone beyond saving. Although she didn't say outright “You are lying, aren't you?” Seol Jihu thought that he could still hear those words.", "“I'm telling you the truth. Please believe me.”", "Yoo Seonhwa bit her lower lip after hearing him plead. She then pulled her phone out and switched it on.", "“Hello? Is this Seorak Land counseling office? Ah, hello there. I'm calling you today to ask you for a favor, to ask whether someone is banned from entering your premises. His name is Seol Jihu….”", "Seeing her confirm the truth by phoning the casino, he felt something bitter rising up in the back of his throat. Just how much pain and misery did he cause in the past for Yoo Seonhwa and his family to have memorized the casino’s number?", "“He's already on the list? Today, he himself…?” ", "Yoo Seonhwa's hardened expression crumbled a little.", "“T, Thank you.”", "She ended the call and stared at him with eyes full of distrust.", "“You….”", "She blinked her eyes quickly and wetted her dry lips.", "“….What did you want to talk about?” ", "Although it was only by a little, her voice sounded less chilly than before.", "This was the final chance, one he'd never have again. Seol Jihu worked up his courage.", "“I'm sorry!”", "He bowed his waist as much as he could. His gaze was immediately filled with the view of the concrete.", "“What did you say?” ", "“I'm really, really sorry.”", "His left hand held the envelope with money much, much tighter.", "“I… know that… I behaved like a son of a bitch…. But, but still, I… I wanted to ask for your forgiveness….” ", "“….”", "“All those times I lied to you… disappointed you… made you go through hell… hurt you with shit I said… I wanted to… apologize to you…”", "As his words stuttered out, the corners of his eyes began to sting. Seol Jihu gritted his teeth and endured.", "“I'm sorry….” ", "He continued to beg for her forgiveness.", "He couldn't do one of those moving and simple but concise apologies. No, that'd be more like him insulting her dignity.", "The longer she remained quiet and the more he spoke, he felt his throat clam up.", "“I used to….”", "It was then.", "“I used to hope that a day like today would happen.”", "Her quiet but heavy voice entered his brain. He focused all of his being and listened.", "“Of course, I reflected a lot too. I’m partially to blame for things turning out this way. I shouldn't have given you any money when you asked me for the first time. I should have listened to your mom and your dad back then.” ", "Seol Jihu forgot what he wanted to say.", "“I… I believed that you'd revert back to how you were someday. So I waited for you with that single ray of hope until now. No, wait. Maybe this is me making more excuses.” ", "He felt like biting his own tongue as her calm, composed voice continued on. He wanted to shout out and say that it was all his fault.", "If she was scolding him and pouring out insults like his sister, then perhaps he could've endured and accepted her words. But having heard such a calm, composed voice, he simply didn't know what to do anymore.", "Yoo Seonhwa cautiously asked him.", "“Those things you said…. Are they all true?”", "“….Yes….” ", "“You really came here to apologize to me?”", "Nod, nod.", "“Well, then.”", "Yoo Seonhwa relaxedly walked to where he was and extended her hand out.", "“Then… take this.” ", "The moment he saw her pushing the wads of note to him, Seol Jihu got to find out what the taste of despair was like.", "“S, Seonhwa…”", "“Please take it, if you are truly being honest.” ", "The emotions reflected in her eyes seemed a little complicated, but that was it.", "The reason for her to offer this money to him was quite clear: the severing of the final thread of connection they shared.", "“If you truly thought like that, then… Rather than words, please show me with your actions.” ", "Now, the meaning behind her action changed. It was no longer “Take this and disappear from my sight” but now, “Please, don't make my life any harder.”", "He realized then; there was a deep emotional chasm existing between them that could never be healed again.", "Seol Jihu's neck began trembling as the moment had finally arrived.", "He couldn't accept this money.", "The moment he did, then it'd be over for good.", "No, it was already over.", "He knew this, yet he still couldn't easily accept the money.", "Yoo Seonhwa let off a soft sigh and in the end, she carefully tucked the money in his pocket.", "“Thank you for applying to be banned. I'm sure your parents will be happy to hear that. And Wooseok Oppa and Jinhee too…..” ", "Yoo Seonhwa quietly lowered her own eyes after watching him stare at the ground all this time.", "“I'm… too tired. I'm a little upset, yes, and to be honest, I don't think I can sincerely forgive you in the state that I am in.” ", "“….”", "“However, if you have truly changed back, then…. I want you to press forward, work hard, and live well as if you were trying to show me all the progress you've made. If so, don't you think that one day, we would be able to talk to each other with smiles on our faces?”", "….One day.", "Yoo Seonhwa had formed a thick bond with the Seol family when she was still a young child. So, it was rather obvious that he would run into her during family reunions and national holidays in the future.", "However, he knew, and she knew too – what she said wasn't meant to imply that they could try one more time.", "An unknown amount of time went by.", "“….You're right.”", "Seol Jihu finally forced his head to rise up. His eyes remained fixed to the ground, however.", "“Thank you for believing me.” ", "As ever, Yoo Seonhwa was a kind person. She treated him in a way that was incomparably kinder than when he went to see his family.", "It would have been hard for her to believe him after he had lied to her so many times already.", "Yet, she believed him once more.", "Not only that, by not using any harsh language and telling him stuff in a roundabout way, she was being considerate towards him, too.", "Indeed, he was well aware of this, but…", "“This 2 million…. I understand. I'll take it. I understand what you're trying to say.” ", "….But, his heart ached even more than before.", "Seol Jihu sniffed in deeply and began fidgeting with his right hand the money she gave him. He still had to give her back what was hers.", "“But… at least take this.”", "He raised his left arm carrying the envelope with money and opened his left palm.", "Then…", "“Huh?”", "She formed an expression of confusion and looked down at his hand. ", "“….What?”", "Then, her eyes that remained composed until now widened in surprise.", "Her mouth opened in a daze. He could immediately tell that she couldn't believe what was happening. She even took a step back in shock.", "At this rate, she looked like she'd refuse the money, just like how his siblings did. So, he reached out and grabbed her hand to place the envelope there. Her skin felt so soft. So much so that he never wanted to let go.", "“I, I should go.” ", "However, he could only be satisfied with holding her hand for this short moment. He did his best to force out a smile. Meanwhile, Yoo Seonhwa still looked stunned.", "“You, but… how?” ", "“I won't appear before you again. So, uh….. Take care of yourself.” ", "Seol Jihu turned around and ran out of the street.", "He began running hard as this unbearable emotion filled him up.", "“…Ah.”", "Everything seemed to happen so fast. Yoo Seonhwa belatedly recovered her wits and instinctively confirmed the contents of the envelope. It was packed full of bills with the images of Shin Saimdang. She gasped out in shock one more time. ", "“He, he… N, no wait. What….?” ", "Yoo Seonhwa was deeply mired in confusion for a while before she hurriedly switched her phone on.", "“Wooseok Oppa? Yes, yes… By any chance…. He did come? When?”", "Her voice continued to grow louder.", "“55 million Won?!”", "—Yeah. Not only that, he brought back Jinhee’s car and bought her a new laptop.", "“But, that doesn't make sense. Where did he get that money from?” ", "—I don't know. He assured me that he didn't earn it through gambling…", "“But….”", "—Right. I know. Remember that day when he came to borrow money from you? I called the Seorak Land to confirm and they said the last time he was there, it was Thursday, March 16th. That means he really didn’t get that money through gambling…", "“W, what was the date again?” ", "—March 16th. In any case, he said the money was from an honest source. But, he said he was busy and had to go. I guess he went to see you….", "March 16th.", "'No, it can't be.'", "Yoo Seonhwa was no longer listening to Seol Wooseok's voice.", "“N, no, wait. This, it can't be…” ", "The envelope fell on the ground, and the money spilled out.", "However, Yoo Seonhwa didn't even take a second look at that and ran out of the street herself.", "“Jihu!” ", "She looked around her and called out desperately.", "“Seol Jihu!”", "Unfortunately, Seol Jihu's back could not be seen anymore."]}