{"cid": "47", "title": "Chapter 47. First Experience (2)", "content": ["He wasn't imagining things.", "Whish. The gust of wind blowing past Seol Jihu's ear stung as if a piece of sandpaper was dragged across his face. Two horse-like creatures were already running at full-tilt, yet Maktan was still whipping them hard, his urgent voice roaring out.", "“This doesn't feel good, does it?”", "The big man clicked his tongue and put on a battle helm with a flat top that kind of resembled a bucket. He then shouted out.", "“Did you have to use this road through the forest?!”", "“This road is my lifeline! There was no problem nine days ago!” ", "Maktan replied without looking back.", "“How long have you been using this road then?”", "“Three months!” ", "“Goddamn it! You'd have spread lots of your trace around here in those three months!”", "The Warrior complained under his breath and lowered his body.", "“Seol, you should get down too.” ", "Alex bent down and pulled Seol down to the floor as well.", "“Listen to me. From now on, do not leave my side. Understand?” ", "Not a hint of mischievousness could be seen in Alex's expression now as he spoke in a grave voice. His serious, focused eyes only served to further tighten Seol Jihu's chest.", "Seol Jihu knelt down on the floor and lowered his body, his grip on the two spears tightening. At the same time, he activated Nine Eyes.", "'Son of a….'", "He somehow held back the cuss from escaping from his mouth. The entire forest was in the shade of orange. ", "Do Not Approach.", "However, he was already inside the danger zone. This would be his first time encountering such a situation.", "He should have prevented the wagon from entering this forest in the first place, but he had fallen asleep and didn't even know that he was being delivered into the open mouth of a tiger.", "Seol Jihu was about to suggest that they get out of here fast but shut his mouth after seeing Maktan whipping his rides hard while sweat continuously poured down the guy's frowning face. The wagon was already running at full speed way before he even woke up.", "'What should I do now?' ", "It should be considered something of a happy occurrence that the forest wasn't in black, ‘Escape Immediately’, or red, ‘Immediate Retreat Recommended’. But this orange color presented enough danger already. After all, he nearly got burned from underestimating the threat posed by the ‘yellow’ color in the past.", "As his complexion hardened, Alex to his side was in the middle of taking out a palm-sized crucifix.", "The surroundings were rather eerily quiet… other than the sounds of hooves pounding on the ground and Alex's quiet murmuring as he chanted his spell.", "As this unbearable silence continued on, the big man began gritting his teeth. Meanwhile, the Archer still had her ear glued to the floor of the wagon, not showing any signs of moving.", "“Say something.”", "“….”", "“Oi! The distance, the direction, the number of them! Anything is fine, so say something!”", "“….I don't know.”", "“What?”", "“I don't know. I can't tell.”", "She lifted her head back up and formed a confused expression.", "“I can definitely hear a strange noise mixed in among the rest, but…. it's too faint and I can't grasp it.”", "“Hah?! Are you sure you're a Tracer?”", "The Warrior spat out some words of exasperation, causing the Archer woman to narrow her eyes in anger.", "“What are you trying to imply?”", "“Fuck, man. You say you're a Level 3, but how can you not know anything?”", "“Shut your mouth! Do I look like a High Ranker to you? What do you expect me to do here when I need to be on the actual ground to hear anything?”", "Her pride must've been wounded because she shot right back at him. The Warrior looked as if he had nothing else to say and only spat out lengthy groans.", "“Decide fast! Do we keep running or do we stop? Hurry!” ", "Maktan asked with an anxious voice.", "“D*mn it. What choice do we have? Stop the wagon!”", "“No! Keep running!”", "As soon as the big man voiced his opinion, the woman sharply opposed him. Maktan was about to yank on the reins to stop the wagon, so quite understandably, he ended up spitting out a cuss word.", "The big black man looked at the woman with a dumbfounded expression before growling at her like a wild beast.", "“This crazy bitch. You want to fight me when we're in this situation?”", "“It's you who don't know shit. What will you do when we stop and get surrounded?”", "“How do you know that there isn’t an ambush waiting for us up ahead? So, we stop and get down from the wagon!”", "“Stop, both of you!”", "Unable to take it anymore, Alex finally intervened. The crucifix in hand was emitting a calm, gentle light now.", "“It doesn't matter whether it's a team or an expedition, Archers always take the lead. Let's just listen to her for the time being, okay? What do you say, Hugo?” ", "Seeing that Alex addressed the big man by name, they must have known each other.", "After pacifying Hugo, Alex turned to study the Archer.", "“I should place priority on your opinions as you’re an Archer, but even I think it'll be better for us to stop at an adequate place and find out what we're dealing with first. We can only come up with a strategy if we know what we're up against.” ", "“I know that. But look around, there isn’t any adequate place to stop.”", "The Archer woman replied unhappily before biting her lower lip.", "“It's like we're being led around. I can feel that something isn't right.”", "Alex's brows quivered.", "“Fuck me! Did you hear her just now? You're supposed to be an Archer, yet you're busy mouthing off about your gut feelings?!”", "Hugo cried out in anger. If it weren't for that fact that he was crouched real low to the floor, he might have jumped up and down with that big physique of his.", "Alex maintained his patience as he opened his mouth.", "“If you're relying on gut instinct, I can't place my trust in you. The odds are half-half. It's better for us to stop the wagon immediately and figure out what's going on right away.” ", "The Archer snorted and turned around to face the other direction.", "“Fine. However, you need to give me 30, no, 15 seconds. I can't be certain, but we might be facing a group of Riders.”", "Alex didn't disagree with that. What she said made perfect sense, but also, in case the Archer's words were proven to be correct, then stopping the wagon would be tantamount to committing suicide.", "“Maktan! Don't stop the wagon abruptly, but slow down gradually! So you can set off at a short notice, got it?” ", "“Got it!”", "“Alright! But…. what…?”", "Alex turned around to face the Archer once more before falling into a state of daze from what he saw. The eyes of the woman were gleaming in soft light before that light disappeared. She then cautiously raised her torso up and peeked her head past the railings.", "“Ah, hey! What are you doing? Sit down!”", "Hugo freaked out. She utterly disregarded him while surveying her surroundings. Then, she nodded her head. ", "“I think we aren't being herded around. It should be fine to slow down.”", "“Herded or not, I said, lower your goddamn head!” ", "“Seriously, stop shouting, will you?!”", "The Archer covered her ears and showed how annoyed she was.", "“Are you an idiot? If I were to get sneak attacked, then that driver would've been hit first!”", "Hugo became even more dumbfounded than before. His mouth opened and closed a couple of times, before an expression of suspicion formed on his face.", "“You… Are you really Level 3?”", "“Ha.”", "The woman spat out a groan. It was as if she didn't know what to do with him. She then placed a hand on her waist and opened her mouth.", "It happened then.", "Psh! Psh!", "Along with the faint whispers of air being split apart…", "“In any case….”", "….Her words came to a sudden stop.", "Her eyes that had been mocking Hugo suddenly spun around. She then began faltering theatrically. Her head and her shoulders slowly trembled before she fell face-first to the floor.", "Her body trembled only for a second before it went limp. She was dead.", "Alex's face crumpled unsightly as soon as spotting a lengthy needle sticking out of the back of the woman's head.", "“You idiot!” ", "Hugo angrily cried out as well.", "Seol Jihu couldn't wrap his head around on what just happened. The woman who was so full of confidence only until a second ago died in the blink of an eye. It was as if he was having a bad nightmare.", "Alex extracted the needle out and frowned deeply.", "“Wait a minute. This, can it be….?” ", "Next, they heard the pained cries of animals coming from the front.", "Just as Seol went, ‘Crap,’ the wagon tilted and then overturned on the side.", "“Uaaahhh?!” ", "Alex was flung away, both of his arms helplessly flailing in the air.", "Seol Jihu, too, was thrown in the air. Before he knew it, he was sent flying. He was still gripping his spear tightly; as the sensation of his tummy being sucked in hit him, he clearly saw 'it' – Maktan's neck thrown backwards and his arms powerlessly dancing in the air, with a needle stuck in his forehead.", "The wagon overturned and the surviving trio was thrown out from the back. Seol Jihu managed to land safely in the bushes and rolled on the ground to dissipate the momentum.", "“Fuck! Riders my ass! It's the goddamn Moles!!”", "Seol heard Hugo roar out at the top of his lungs, but the youth had no time to mind that. Before he had the chance to take a breather, four pale-white hands shot out from the earth below, each of them carrying sharp daggers.", "“!”", "He didn't even have the time to see them take a swing at him; he let go of the spear and rolled further away. He bounced right back up at the end of the tumbling action and took a look at the spot he was in and saw the four daggers stabbing there. He felt a chill run down his back.", "However, picking up his spear took priority over him freaking out and asking what the hell those were.", "He snatched up his spear and rapidly stabbed the ground where those four hands jutted out from.", "STAB!!", "He felt the spear pierce past the soft earth and then dig into something more substantial. It was almost as if he had stabbed into a large radish.", "He then stabbed forward even harder and rotated the spear shaft. Right away, two of the four hands coming out from the ground went crazy as if they were having a seizure.", "When that happened, the other two hands began pushing up on the ground as if they wanted to come out from there.", "“Not so fast.”", "Seol pulled the spear out and rapidly stabbed the ground again, causing the other hands to do that dying dance as well.", "“Seeeoooll!! Huuugo!!”", "Seol quickly turned around as soon as he heard the urgent cry.", "Alex hadn't been able to get up yet; he was bitterly resisting two hands sprouting from the ground as they restrained him. His arms and shoulders were quaking hard from the struggle, but the daggers were closing in gradually.", "Due to the overturning of the wagon, their distance was greater than Seol expected it to be. He pulled the spear out, and thick coating of blood at the tip of his weapon drew an arc in the air.", "He quickly circulated his mana through his Reinforced Circuit. He focused his power in his right arm and threw the spear as hard as he could.", "Swish!", "The spear carrying his overwhelming mana flew past Alex and dug deep into the ground.", "“Uwahck?!”", "Alex reflexively turned his head away, only to blink his eyes in shock. He then realized that his hands no longer felt the pulling from under the ground. He hurriedly yanked his arms loose and got up from the spot.", "“Huh?”", "Hugo belatedly arrived there before staring at Seol with an equally surprised face. Then, he shouted out.", "“Over there! Your left leg!!” ", "Seol was bending down to pick up the other spear, but as soon as he heard the warning, he jumped right up. Another dagger swept past where his foot was. He landed back on his feet and stabbed the ground, but when he felt movement below again, he lifted his left leg up.", "He dodged the hand with the dagger with his swift footwork and stabbed the ground with his spear. Soon, the soil was dyed in the color of blood.", "“Ohh?” ", "When Seol took care of four, maybe five unknown assailants in one go, Hugo began grinning with an expression that said, “Would you look at this kid go?”", "He then burst out in a raucous laughter, raised his giant axe up high, before slamming that heavy weapon down to the ground.", "KWANG!!", "What came out next was the impact noise that couldn't possibly have been made by an axe. Seol's eardrums shook hard. The earth exploded up and blasted away, leaving behind the air rippling clearly visible to the naked eye. He couldn't tell whether that was Hugo's mana or one of his abilities, but if that was from purely his physical strength, then that was one of the most electrifying displays of power he had ever seen.", "“This is the best method in dealing with the goddamn Moles.” ", "Hugo beamed brightly while resting the axe against his shoulder. Seol couldn't understand that guy's relaxed behavior since they were still in the middle of a battle, but it seemed Alex did understand.", "“Nice! Well done, Hugo! Now, it's our turn!”", "Alex quickly picked up the crucifix off the ground as his eyes burned in anger.", "“You sons of bitches. The moment you all show your faces above ground, it'll be your funeral.” ", "The meaning behind those words revealed itself soon afterwards. With the spot where Hugo slammed his axe down as the central point, over ten pairs of arms broke out from the ground in a disorderly fashion.", "“Alex!” ", "Hugo gripped his axe tightly and shouted out.", "“I know!”", "Alex spat out a short breathless gasp, placed a hand on his side to press down a wound there as he pushed forward his crucifix.", "“Luxu Lu Luxuria!!” ", "Suddenly, a blinding light exploded forth from the crucifix. And at the same time, the creatures emerging out from the ground all froze up mid-action.", "“Oh, yeah. Time to pull out some vegetables, then.”", "Hugo ran forward as if he had gained wings and yanked at one of the arms from the ground. Then, a strange monster with two arms and two legs that resembled a trunk of a tree but with animal hide covering its body was pulled out from its hiding spot.", "Hugo easily bisected the stiffly-frozen monster, then without taking a break, went around repeating the action of pulling and killing the monsters.", "Soon, the duration of the spell came to an end, allowing these strange monsters to fully emerge above ground. By this time, though, their numbers had been whittled down to only seven. Also, they were all staggering around as if they were suffering from concussion.", "Seol continued to be vigilant against the ground near his feet, but Alex spoke to him in a relaxed tone.", "“It's fine. It's already over.”", "“Over? What do you mean?” ", "“Right. See, these Moles instinctively hate mana. These bastards will emerge above ground as soon as you pour in enough mana where they are hiding.”", "“Moles?” ", "Alex formed a wry smile at Seol's follow up question. However, the youth saved his life just now, so answering this much was nothing.", "“Think of them as land-bound fish. They move around by swimming underground.”", "Seol Jihu tilted his head to the side. He couldn't even imagine how anything could swim underground.", "“In any case. They failed to kill us through their sneak attack, so it's the end for them. Hugo is a Level 4 Barbarian Warrior. Moles attacking from below the ground might have proven to be an irritating nuisance, but fighting them above ground is as easy as taking candies from a baby.” ", "Alex pointed to his front. Hugo was treating these crazed monsters called Moles like a bunch of unruly children. Seeing the big man swing around his axe and cut them down one by one, even Seol felt his mind getting freed from anxiety.", "Alex continued on.", "“Actually, Moles are really crafty and sneaky bastards. And these particular things must have fought against the Earthlings a couple of times already.” ", "“How can you tell?” ", "“Simple. Where do you think these monsters got their hands on the daggers?”", "“…Ah.”", "“They must have also figured out that we had an Archer among us because they hid deep underground and tried to confuse us. Otherwise, we would have discovered them the moment they got near the surface. They spread around and waited for an opening before firing those needles. As soon as they killed one of us, they attacked us properly.” ", "“How scary….”", "“I know, right? But that stupid Archer woman!”", "Alex spat out angrily before coughing out to clear his throat. It was a waste of time to bad-mouth a dead person, after all.", "“In any case, that's not all. Since they usually form a herd, they move around in large packs, and then…. Ehehehe.” ", "Alex began laughing strangely and moved his pointing finger away from Hugo towards Seol. The youth glanced down at himself, and his jaw dropped from the surprise. He spotted four needles stuck in the middle of his chest armor. It seemed he had been sniped during the battle.", "“And then, they possess enough intelligence to assign different roles, too. Ah, don't worry about it. Those who'd been sniping us should have ran away by now.” ", "Alex saw Seol scanning the area and stopped the youth from making a move, before tilting his head in puzzlement.", "“Hmm. But, this is really strange. I haven't heard of news that Moles have popped up near Haramark until now.”", "“I'm finished!” ", "Hugo squeezed and popped the head of the last Mole with his bare hands, before shouting out with his arms raised up high.", "“Nicely done, Hugo.”", "“That was way too easy. Rather than that, you okay?” ", "Hugo took large strides and came in closer before asking Alex. The young Priest smiled weakly.", "“Actually, I got hit once.”", "“In that case, hurry up and heal yourself first. I won’t be able to thank you if you’re dead.”", "“Puhat! Yeah, you're right.”", "Alex plopped down on the ground before producing a small vial. While the Priest was grunting on the ground, Hugo strutted a little while studying Seol Jihu.", "“Hey, man. I saw your fancy footwork just now. You sure you're only Level 1?” ", "“Yeah, I was wondering about that myself. It would be easier to believe that Seol is Level 3 with that Archer being Level 1.”", "Alex spoke with an anguished face as he tipped the healing liquid from the vial on his wounds. Hugo nodded his head as if he agreed with that assessment.", "“That damned bitch. I've never seen a Tracer like her before. I thought I might die from frustration, you know?” ", "“That woman, she wasn't a Tracer.” ", "Alex chuckled softly.", "“And she obviously wasn't a Level 3, either. She was Level 2 at best, and she probably leveled up recently too.”", "“What?” ", "Hugo asked back with a disbelieving face. Alex breathed out softly as if the pain had lessened a great deal and answered the big man.", "“I definitely saw it. It was only for a moment, but her eyes were shining. If I'm correct, then that's not the ability 'Thousand-Mile Eyes' but the 'Eagle Eye'. You know that Thousand-Mile Eyes is a must-learn ability for Archers when they reach Level 3, right?” ", "“Wait a damn minute here. Now that I think about it, 'Eagle Eye' is something you learn when you hit Level 2…..” ", "Hugo dazedly muttered to himself before his expression crumpled.", "“Goddamn it!! She's been lying to us since the beginning!” ", "“Well, come on now. You know that there are plenty of people lying about their levels in Haramark. I mean, you see a ton of idiots coming up with all sorts of excuses when you ask them to show you their Status Windows.”", "“Damn it. How did she even get that longbow, then? Her equipment also looked pretty good too.”", "“She probably got a good sponsor or something.”", "Alex sounded confident of his findings as he stood back up. And then, he turned towards Seol.", "“Seol? An advice, if you will. We might have won today, but this wasn't what you'd call a good victory. Of course, you fought well above anyone's expectations, but for me and Hugo, this was a bad fight.” ", "Seol Jihu nodded his head. He roughly understood what Alex was trying to say here.", "If everyone acted according to both Hugo's and Alex's opinions, then these enemies would've been dealt with quite painlessly. Even if an Archer was tasked to head up a team, this would be the result when the right to make the final decision was given to someone not qualified for such a task.", "Through this experience, Seol got to engrave this lesson right down to his bones.", "“Che. If I knew we were facing Moles, I wouldn't have even broken a sweat.”", "Hugo continued to complain bitterly.", "“Who knew we'd be up against Moles? But…. in any case.”", "Alex looked around his vicinity, and his shoulders drooped helplessly. Maktan and the Archer woman was dead, and the wagon was smashed to bits.", "“And we're right in the middle too… ehew.”", "However, Alex didn't lose hope and asked the question anyway.", "“Anyone with a bright idea?”", "Of course, no one raised their hands.", "“….”\n“….”\n“….”", "The big guy, the youth, and the Priest spat out a long groan almost at the same time."]}