{"cid": "471", "title": "Chapter 471. The Crumbling Line of Defense (1)", "content": ["“Cough! Cough!”", "Seol Jihu got up with a hoarse cough. His face was wet. He unwittingly wiped his mouth, and his eyes widened. Fresh blood drenched his hand. His face had been covered in blood without him knowing.", "“Ugh….”", "Intense dizziness struck his head. To be frank… he wasn’t in a good state. His chest felt stuffy, and his mana was boiling. He also felt like parts of his body became loose, almost like how a new car was quickly becoming used.", "It must be the price for activating Spear God. Seol Jihu murmured inwardly before slowly collecting his breath.", "The golden light surrounding his body flickered off, and his body quickly returned to its original color.", "Spear God wasn’t a convenient ability that could be used and maintained as long as one wanted. Seol Jihu had activated it only to escape from the barrier of chaos that the Parasite Queen created.", "Although he achieved his goal, he couldn’t help but feel like he suffered a significant loss. He originally planned to save it to finish off the Parasite Queen. But now that he revealed this trump card, the Parasite Queen was sure to be on guard against it.", "In all likelihood, she would not fall for it so easily next time. This naturally meant his chance of defeating the Parasite Queen was now lowered.", "However, there was one encouraging gain. It was that the Parasite Queen failed her all-out attack.", "She must have taken on a heavy burden to perform such attacks with her unstable body. Seol Jihu had also been a little greedy in activating Spear God to deliver an effective blow. No matter how powerful the Parasite Queen may be, there was no way she was fine after all that.", "Seol Jihu wasn’t wrong. The Parasite Queen staggered up in the distance. White smoke rose from her body, and there was a 30-centimeter-long hole in her stomach.", "That was, until the Parasite Queen stretched out her hand.", "Papapak!", "Suddenly, the sound of something exploding rang out consecutively. Immediately afterward, the seething smoke subsided, flesh filled in on the hole, and a hard carapace was created over it.", "The Parasite Queen regained her presence in an instant.", "‘Ah, shoot.’", "Seol Jihu gritted his teeth, remembering that the Parasite Queen did the same thing when she descended in Tigol Fortress. If his memory served right, she had absorbed half of the Nests to use a wide-area attack.", "He should be happy that the number of Nests would go down, but that was the least of his concern. From the looks of it, the Parasite Queen had only absorbed about a dozen Nests just now. He knew there were approximately 200 Nests in total.", "Based on a simple calculation, the Parasite Queen would be able to use the attack at least fifteen times. Once or twice might be okay, but Seol Jihu had no confidence in being able to withstand the attack more than ten times.", "‘Fuck, didn’t you say you’d fight with me?’", "He cursed Black Seol Jihu, who was nowhere to be seen after proudly boasting about helping out.", "‘I’ll have to take care of the Nests first….’", "However, the Nests were like the lifeblood of the Parasites and the Parasite Queen. There was simply no way the Parasite Queen would let him destroy them so easily.", "‘What to do, what to do….’", "Seol Jihu bit his lip as he watched the Parasite Queen crack her neck left and right while walking forward.", "It was then.", "[Hmm?]", "The Parasite Queen suddenly paused.", "“Ah.”", "Seol Jihu, who was raising the Spear of Purity, also paused.", "Their gazes then simultaneously turned in the same direction, where the right-wing of the Parasites and the left-wing of the allied force were.", "*", "Vulgar Chastity panicked when she saw the Parasite Queen being sent flying. Checking on the right-wing’s current situation, her panic only grew deeper.", "Just why did things turn out this way?", "Her own army had been turned to a rag by the Fallen Angels and the Star of Avarice’s joint attack, and the right-wing forces were being burned up by the Star of Lust’s light.", "A total pandemonium had broken loose while she was distracted by a witch.", "Most importantly, she had committed the grave sin of letting the enemy reach the Queen.", "“No….”", "I have to turn the situation around.", "I have to go help the Queen.", "But how?", "It’s too late to organize the army….", "Vulgar Chastity could only think of one method.", "“No…!”", "Vulgar Chastity’s eyes shot open as she glared fiercely at the allied force. She looked utterly demented.", "And next…", "Flash!", "A blinding light burst out of Vulgar Chastity’s body.", "She had released her divinity.", "*", "‘So it happened….’", "Twisted Kindness, who forced Valhalla members back for a moment, sighed as she watched the light spreading out.", "She didn’t think it was a foolish decision. Roselle’s appearance was something Twisted Kindness did not expect. She knew that the right-wing would have trouble the moment she felt Roselle’s powerful energy, which rivaled that of the Army Commanders.", "Unlike Twisted Kindness, who was holding her ground against her enemies, Vulgar Chastity had screwed up grandly from the start.", "It was probably better that she unleash her divinity now when she still had soldiers left.", "In Twisted Kindness’ eyes, this war was likely to be a short one. Unless the allied force were complete fools, it was unlikely that they would drag out the battle in the Parasites’ corrupted land.", "The tactics they had shown so far were more than enough proof.", "Seol Jihu and the Parasite Queen, the vanguard and the center army, the left and right-wing, and the rear army. The tide of battle would tilt to one side if even one of these fronts came to an end.", "And just now, with Vulgar Chastity releasing her divinity, the Parasites’ collapsing right-wing regained stability. If she could use this momentum to defeat the allied force and then support the other places, that would be more than enough to make up for her earlier mistake.", "Of course, Twisted Kindness was not at ease. Releasing one’s divinity was a double-edged blade. What if the allied force held out until the duration ended? Then the situation would tilt the other way.", "‘That’s not all.’", "There were other things that worried her.", "‘Those Dwarves.’", "Twisted Kindness’ eyes narrowed as she gazed at the allied force’s main camp. Thunders were powerful weapons of destruction that even Army Commanders had to be wary of.", "However, the Dwarves had not used any Thunder since the vanguard forces started fighting. Twisted Kindness could feel that they were eyeing the battlefield carefully, almost as if they were waiting for a singular golden opportunity.", "‘How suspicious….’", "She wanted to charge into the enemy camp and stop whatever it was that they were planning to do… but that wasn’t an option at the moment.", "She couldn’t even use Teleport as all kinds of attacks came flying her way if she let her guard down for even a second.", "It didn’t seem like she would have the opportunity until she took care of Baek Haeju, who continually bothered her with frightening reinforced sword qi, and the phoenix, which came back to life no matter how many times she struck it down.", "‘I’d rather take matters into my own hand than leave it to that stupid succubus.’", "Twisted Kindness steeled her resolve and spread her wings open.", "*", "Same time.", "The light that dyed heaven and earth subsided. From the faintly scattering light, a beautiful woman wearing a light, fluttering robe appeared.", "Her hair, which went all the way down to her feet, was a beautiful snow-white color, and white feathers adorned her pair of bat wings. The way a silvery halo radiated behind her, she almost looked like a noble goddess.", "At that moment, Vulgar Chastity slowly opened her closed eyes. The goddess-like atmosphere vanished completely. A pair of alluring, bloodshot eyes gazed at the battlefield, or to be more precise, at Roselle, who had flown up to avoid the divinity release.", "[Die.]", "Vulgar Chastity raised her left arm.", "Whish!", "A cloth accompanied by enormous energy spiraled out and shot toward Roselle. At the same time, a foggy mist flowed out of her mouth.", "When the Fallen Angels touched the scintillating mist, their bodies turned black, and they fell one after the other.", "[Die, die!!]", "Vulgar Chastity did not stop.", "She stretched out her hand toward the allied force’s main camp. A formless energy cut through the battlefield instantly and pounced on a Priest that was chanting a spell.", "Startled, Seo Yuhui quickly put the Proof of Castitas forward.", "Pop!", "“Kahuk!”", "As her barrier exploded violently, Seo Yuhui was pushed back, her feet leaving behind a long trail in the ground.", "“Unni!”", "Eun Yuri rushed in and caught Seo Yuhui’s swaying back.", "“Are you alright?”", "“Yeah… I’m fine….”", "Seo Yuhui picked herself back up and glared forward.", "There…", "[Burn world!]", "Kwakwakwang!", "Massive, blazing pillars of fire were erupting from multiple spots on the ground.", "[Ahahahahahahaha!]", "Vulgar Chastity cackled loudly while watching the hundreds of pillars of fire holding up the sky.", "It’s so easy. I should have done it sooner.", "“Hnng…”", "Roselle let out a nasal sound as she watched Vulgar Chastity, who regained her confidence completely.", "“I got her to release her divinity….”", "Ssp. She muttered before licking away the blood coming out of her finger. With this, the die that would tilt the balance of the battle was cast.", "There would only be one of two outcomes: Either Vulgar Chastity would hold out, or the allied force would.", "…Or so the enemy might think.", "In reality, there was a third outcome. However unlikely, it was, ‘ Vulgar Chastity’s defeat while her divinity was released.’", "As long as this could be done, the Parasites would suffer a massive loss, and the allied force would make an enormous gain.", "As an ancient witch, Roselle was the only one beside Seol Jihu who could possibly achieve such an impossible feat.", "Of course, that didn’t mean she did not see the reality. Bluntly speaking, there was no way she could defeat the current Vulgar Chastity alone.", "She exchanged glances with Gabriel and devised all kinds of plans, but it was still difficult.", "‘We’re still missing something.’", "What they were doing was like hitting a rock with an egg. But, just like how Eun Yuri gave birth to an alien monster with her terrible cooking skills, if there were only one more ingredient to fill in this inadequacy….", "It was then.", "Something caught Roselle’s attention as she looked around the battlefield. Though she was looking a little far out, a rather strange scene was happening there.", "Inside a bloody battlefield, a male archer was lying face down on the ground, aiming his crossbow in their direction. He did not pay attention to anything happening around him and was only focusing on his aim, almost as if he was at the perfect shooting spot.", "Moreover, Roselle could feel an incredible level of resolve laden with resentment. It was like he was saying he would hit his target no matter the cost.", "And when Roselle felt the man’s unwavering determination…", "—You, there.", "She found herself talking to the man.", "—What are you doing?", "Anyone would get flustered if a voice suddenly resounded in their head, but the man did not even flinch. He remained in the same position, erasing his killing intent and presence, not losing his focus.", "Oho. Roselle exclaimed quietly. She did not know the man’s circumstance but instinctively knew that she had just found the perfect ingredient.", "—You don’t need to talk or look for me. All you have to do is think.", "A soft voice rang out in the man’s head again.", "Marcel Ghionea, who had been eyeing Vulgar Chastity, moved his eyebrows slightly.", "‘…Once.’", "—Once?", "Roselle asked back after reading Marcel Ghionea’s thoughts.", "‘Just once is enough.’", "Marcel Ghionea nodded.", "‘Just give me one chance.’", "—Do you understand the significance of what you just said?", "Creating an opening against a divinity-released Army Commander was no easy feat. It was possible since they were facing Vulgar Chastity, but it would virtually be impossible against someone like Twisted Kindness.", "—Are you confident in dealing a finishing blow if given a chance?", "Marcel Ghionea shook his head slightly. It wasn’t as if he was an Apostle. He knew his limits better than anyone else.", "‘No, it will be difficult. But….’", "—But?", "‘I will use the opening you created for me and return an even bigger opening.’", "A broad smile appeared on Roselle’s face. She received the realistic answer she had been hoping for.", "She would not have continued talking to him if he insisted doggedly in a fit of rage, but she could tell that this archer’s current state of mind was as cold as the look in his eyes.", "—Excellent.", "Roselle decided to trust the man.", "—I’m ready when you are. Don’t worry about hitting her. Just shoot when you think you have the best chance.", "With that, Roselle’s voice disappeared.", "Marcel Ghionea took out an arrow from his quiver that gave off a chilling light. He nocked it on the bowstring. It was a Special Thunder arrow that he asked Vidalif to make using Seol Jihu’s name.", "The best chance. Marcel Ghionea grinned as he fixed the crossbow in his grip. From the teeth that were revealed between his lips, his sharp fangs flashed blue from the light of the arrow."]}