{"cid": "59", "title": "Chapter 59. Goodwill with Goodwill, Malice with Malice (2)", "content": ["An expedition was an entity sharing one fate – this assertion from Samuel was something pretty much all Earthlings would readily agree with.", "It didn't matter whether one's relationship was bad or not, or if there was some bad blood; as long as they belonged to the same expedition, every member had to cooperate with one another. Otherwise, there was a high chance the expedition would spiral into an uncontrollable mess during a march or a battle. This would obviously put everyone’s lives at risk.", "In that regard, both Seol Jihu and Clara lacked the 'educational' aspect of what made Earthlings the Earthlings.", "Blinded by greed, Clara provided pretext with her foolish actions, and when she was criticized for it, she got angry. Seol Jihu was triggered by her and relentlessly pushed her to a corner afterwards.", "The result was the atmosphere of the expedition becoming icy. Everyone felt like they were walking on thin ice.", "Clara continued to wipe at the edges of her eyes, her breathing heavy and rough as if she couldn't get over her anger. Seol Jihu deliberately ignored her altogether.", "Eventually, Samuel stopped leading the team only ten minutes after leaving the tomb.", "“Master Ian, I apologize for this, but can we return to the vicinity of the tomb?” ", "“Mm? Why?”", "“It seems that we have left too quickly.” ", "“What do you mean by that?” ", "“I think we should take a short break first. I thought that, from what you told us before, the vicinity of the tomb should be the safest….” ", "Samuel glanced at the still-sobbing Clara, the ends of his sentence drifting away.", "“….Apologies. She hasn't been in the team for long. She's only a Level 2, and thus is a bit lacking in some areas.” ", "He revealed the reason for the break with an embarrassed tone of voice. Ian scanned his surroundings, not really minding it.", "“Now that I think about it, we haven't taken a single break since we entered the forest in the morning. Even the mealtime has flown by us. Right, shall we take a break here?” ", "“You mean, right here? But….” ", "“It'll be fine. If you're worried about the effects of the Forest of Denial, then I believe we'll be fine.” ", "“Is that true?” ", "Ian nodded his head.", "“A Magician is more sensitive to the flow of magical energy. If my hypothesis is correct, then the boundary for the activation of that defense spell will be just beyond where we are right now.” ", "“Is… that so?” ", "For a brief moment there, a strange light flickered within Samuel's eyes. It was truly for an infinitesimally short time, though.", "“It is hard to believe, isn't it? A magic spell that encompasses this massive forest.” ", "“Well, he was called a sage even by the people of the ancient Empire. You shouldn't even compare him to a fake like me. Oh, it's just my supposition, so don't get too hung up on it.” ", "Ian waved his hand around and settled down with a bit of groan.", "“Everyone, we take a short break! Eat something, if you're hungry!” ", "Samuel shouted out loudly and then silently stared at Clara for a while. He stood there staring at her as if he was caught in a dilemma. Next, he called out to Alex, who was still unable to calm her down even now.", "“Alex, let's talk for a bit.”", "Samuel dragged Alex away to a distance and they spoke softly to each other for a while. Alex formed a troubled expression and shifted his gaze towards Clara, now in the middle of being pacified by Grace.", "Next up, Samuel walked over to Clara. His expression seemed determined as if he had made his mind up over something.", "“Clara. We need to talk.”", "“Hic! That bastard…!”", "“Stop! You are not a little kid anymore! Don't you understand that your actions are negatively impacting the atmosphere of this expedition?”", "Clara continued to sniff away in bitterness.", "“I only, I…!”", "“I hear you. I hear you, so lower your voice. I'll listen to whatever you want to say, so come with me.”", "Samuel spat out in irritation, grabbed her arm, and dragged her deeper into the forest. Grace wordlessly followed after the two and disappeared from the view as well.", "“What a dumb bitch. Seriously now.”", "Chohong spat out some mocking words while chewing on a dried jerky.", "“Chohong.”", "Dylan quickly warned her since Alex had joined them again. But the latter simply waved his hand about with a weak smile on his face.", "“No, no. It's fine. Honestly, even I don't have anything to say in her defense…. Tsk.”", "While looking at Alex clicking his tongue, Hugo opened his mouth.", "“Will it be fine for you to not chase after them?”", "“Mm?”", "Hugo raised his pinky.", "“I mean, she's your gal, right? Didn't Samuel ask you just now to pacify her somehow?”", "“Well, that….”", "Alex's shoulders drooped real low before he messily tousled his hair.", "“Argh, damn it! I don't know anymore.”", "“I won't help you if you get into trouble later~.”", "Hugo giggled loudly. Alex spat out a long sigh and pulled the altar out from his bag. He carelessly placed a couple of plates on it, before throwing on some food there. Seeing this, Chohong couldn't help but ask.", "“What are you doing? What are you doing with the food?”", "“I want to at least get her to eat something. Also, I should let the others grab a bite too.”", "Alex spoke while not even turning to face her.", "“Why doesn't she just come over here and eat?”", "“With her personality, she's not going to calm down anytime soon. All I can do is feed her and hope for the best.”", "“Well, sure thing. Come back after doing what you think is best. However, if she comes back here and continues on with that bitchy attitude of hers, I ain't gonna take it lying down. Okay?”", "“Che. I hear you. But still, aren't you too openly favoring someone here?”", "Alex carefully picked the altar up and began walking towards where the rest of his teammates had gone off to. Meanwhile, Chohong glanced to her side after her 'sore spot' was accurately pointed out. Seol Jihu was sitting a bit further away, busy sucking on a cigarette.", "Hugo stopped gulping down on food and sneakily approached the youth, before reaching out with his cupped hands. Seol chuckled and pulled out a new cigarette for him.", "“Keuh! As expected, Seol, you really are quick on the uptake, you know.”", "Hugo grinned brightly and lightly tapped the youth's shoulder.", "“You aren't feeling down from that fight, right?”", "“No way.”", "“That's right. You haven't done anything wrong. Even I didn't want to touch that coffin, you know.”", "“Really?”", "“Yup. It's like, I was kinda tempted back there, but like, my instincts stopped me from doing anything. I kept getting this feeling that I should not touch that coffin.”", "Seol Jihu looked at Hugo with renewed interest. The big man was supposed to be a 'Barbarian Warrior', so the youth couldn't help but wonder if he possessed some sort of animalistic wild instinct or something of the sort.", "“Anyways, you were pretty damn cool back then.”", "“?”", "With a cigarette still stuck between his lips, Hugo stood back up. He then assumed the position of aiming something to his front and formed a grave, intense expression.", "“….If you really want it, then try to take it over my dead body.”", "Chohong burst out in a boisterous laughter. Even Dylan began chuckling quietly as well. Seol Jihu's cheeks reddened instantly.", "“Did I really say that?”", "“That's right, you did! Wow, I thought I’d wet my pants!”", "“Well, I…. I just couldn't understand it. I still can't tell if that thing was worth all that greed.”", "“It was definitely enough to rouse that sort of greed.”", "Seol Jihu said what came to his mind so he could change the topic, but a reply did come anyway.", "“I don't know much about the necklace itself, but I know well enough what that keepsake, the token, was.”", "Ian lightly massaged the back of his neck and carried on.", "“If my memory serves me correctly, then that thing was most likely the 'Proof of Castitas'.”", "“Proof of…. What?”", "When Hugo asked back, Ian clarified.", "“It's the proof of one's chastity. It's one of the artifacts given to a saintess.”", "“But wasn't her becoming a saintess only a symbolic gesture?”", "“Well, it's not only chaste women who get canonized as saints. Also, since you're a symbolic existence, you'd be asked to appear publicly every now and then, don't you think so?”", "Ian lightly winked back and looked at Seol Jihu next.", "“Have you heard of a magic system called 'Memorize'?”", "“Yes, I've heard of it.”", "“Well, that should make explaining it a bit easier. Now originally, 'Memorize' was supposed to be unique only to the Magician class. As one's level increases, the number of spells that one can 'store' goes up by one. For instance, I can store up to four magic spells.”", "“Is it impossible for a Priest to store spells?”", "“Normally, yes. That’s because Priests are most closely associated with the gods. Many of the important spells that require borrowing of gods' powers can only be activated via the principle of equivalent exchange. It's not for nothing that Priests lug around altars and offerings all the time.”", "Seol Jihu nodded his head. For some reason, he recalled Maria's face all of a sudden.", "“The honest truth is, many Priests find this point rather annoying. However, there is an item that can make up for that shortcoming.”", "“By any chance, was the crucifix Alex carried around one of those?”", "“Correct. There are artifacts that let you store spells as well as allow you to perform holy magic without the need for offerings. Sure, there is a limit to the number of times it can be used, but then again, just those two points alone make such artifacts very valuable to Priests. During emergency situations or when the spells you've prepared run out, such items would become indispensable.”", "Only now could Seol Jihu understand why Alex desired that item so much. Now that he had lost his artifact, Alex was no different than an average Priest.", "“I guess that proof of chastity is a far better item than the one Alex lost.”", "“No need to even mention that! I'm actually feeling rather embarrassed for even thinking of comparing the two. You can store six holy spells for as long as you want at no cost, which is the same thing as possessing the power of a level 6 Magician. On top of that, there is no limit to the number of times you can use the artifact, so can you imagine how amazing that thing is?”", "Ian spoke passionately, but it still didn't fully register with Seol Jihu. He could only guess that the item they were talking about was an incredible thing, judging from how wide-open Chohong's mouth was.", "“Had we walked out of there with that artifact, I’m sure every single Priest in Paradise would have come looking for us.”", "“To that extent….?”", "“I'm not exaggerating. And then, the other accessories, the longsword and that shield too. Every single one of them should match the proof of chastity in value.”", "With his explanation now over, Ian gazed at the youth with warm eyes.", "“Well, that's that. I have answered a question of yours, so I'd like you to answer one of mine.”", "Seol Jihu tilted his head.", "“As long as it's something I can answer.”", "“Well then, let me ask you this. What would you have done if I voted yes back there?”", "This was yet another question with no easy answers. Wasn't he deliberating on his choices right until the end?", "What should he say here? Seol Jihu pondered for a little while, before deciding to come clean.", "“I'm not sure. Should I convince others, should I fight, or should I just give up and leave? Before Hugo voted against, I was in a dilemma. I can't be sure of what my choice would have been.”", "He tried to read Ian's possible reason for asking this question, but the old Magician remained expressionless. And here he was, thinking that the older man was a bit of a character the first time they met. Seeing those deep, thoughtful eyes, Ian now came off as a different person altogether.", "“Regardless of what the result was, you had no thoughts of ever touching the items found on the sarcophagus, is that it?”", "“That's correct.”", "Ian silently stared at Seol Jihu as if he was trying to judge the youth.", "“You are a righteous man.”", "“A righteous man? No way that's true. Hahaha.”", "Seol Jihu broke out in a loud laughter.", "'I'm righteous?'", "Even a passing mutt would laugh non-stop at the notion. However, Ian's brows rose up and down quickly for a moment there after seeing the youth deny that suggestion without a shred of hesitation.", "“Being modest is a good thing, indeed. Still, you do look like a righteous man from where I'm sitting. Otherwise, you wouldn't have gone that far to defend a woman who was already dead. Am I wrong?”", "“I won't deny that I sympathized with her. But if you believe that I acted only because of her, then well….”", "“Are you saying you didn't? If that's the case, then why did you desperately stop Clara back then?”", "“Mm…. If I were to put it into words, I'd say it was for me, as well.”", "“For… yourself?”", "“Yes.”", "That wasn't a lie, though. He didn't want to die, after all. Also, he didn't want any sour feelings to linger in his heart, too.", "Ian quietly closed his eyes. As if he was mulling over what Seol Jihu had told him, he stood still and didn't move from the spot.", "Seol Jihu tilted his head in confusion and shifted his glance over to Chohong, but she raised her hands in the air with a shrug, her face saying 'I dunno either'.", "After some time had passed, Ian's beard began to quiver.", "“Fufu. Fufufufu….”", "He grinned softly, rubbed his forehead and opened his eyes.", "“So, that's how it was. I wondered why there was this certain incongruency whenever I looked at you, but now…. I think I can understand you just a little bit better. You are an interesting fellow, that's for sure. Your words and actions are unusual, but your thought processes are quite unusual, as well.”", "“Hey, isn't that the same thing?”", "Hugo asked, but since Ian was talking to himself anyway, there was no reply to that question. Soon, the Magician smiled warmly and stroked his beard.", "“Seol, let me introduce myself properly. I am Ian Denzel, a Level 4 Alchemist, currently employed by the Royal Magic Corps. I'm from Area 4.”", "Suddenly, he introduced himself.", "“From what I hear, it had not been long since you came to Haramark. Have you found a suitable team to join, yet?”", "Shake, shake.", "“Very good. Actually, I was planning to resign from the Royal Magic Corps.”", "“Seriously?”", "Surprisingly, Dylan asked a question, which was rare.", "“I've already informed them of my decision. I told them the scouting of the Forest of Denial will be my last assignment for them. Well, it's true that I was comfortable there, but things could get rather stuffy and boring too. And I believe that I've repaid their kindness by now.”", "Ian grinned brightly.", "“In any case. I'll soon be unemployed, and no team is asking me to join them, so…. How about it? Would you like us two with similar circumstances to partner up?”", "After hearing the older man's suggestion, Seol Jihu became utterly dazed.", "“Pardon me?”", "“What I'm saying here is, don't you want to go on the next expedition alongside this old man? After two of us form a team, that is.”", "“Uwahk?! Hey, Dylan!”", "Hugo yelped out and hurriedly got down to the ground in a kowtowing position.", "“Dang it, what are you doing? Hurry up and get down! Seol-nim! We're sorry for turning you away the last time!”", "Hearing that, Ian's eyes opened wider.", "“What are you talking about?”", "“My god.”", "Dylan began to chuckle wryly, and Ian pieced together what had happened quickly enough.", "“Huh-uh. But, why? I've always thought that you possessed pretty discerning eyes.”", "“In all honesty, I was tempted, yes. However, I was not confident at all. If the old man was here with us, then, well….”", "“Ahh, that fellow? Wait, now that I think about it, I haven't heard anything from him recently.”", "“He's preparing to retire soon.”", "The forest became noisier as several people began raising their voices. Hugo continued to plead with Dylan, but the latter didn't say anything. Meanwhile, Ian told Seol Jihu that the youth didn't have to answer right away, that he should carefully think it over, and ended the conversation there.", "Seol Jihu remained flustered even then, but still, happiness welled up rapidly in his heart. The expedition was coming to a successful conclusion, and it seemed like he'd be able to earn additional rewards, as well. On top of that, a Magician even tried to scout him with the words of 'let us form a team'.", "He was thinking that everything would work out well as long as they managed to return to Haramark safely. It happened then.", "—Aaaaaaack!!", "From afar, a desperate scream resounded out.", "The flowing conversation came to an abrupt end.", "Two people reacted first before anyone else could.", "“Dylan!”", "Chohong grabbed her mace and shouted out, prompting Dylan to grit his teeth.", "“That was Alex. It came from the direction of the tomb!”", "'What was that??'", "Seol Jihu's expression hardened. What was going on here? Didn't Samuel and his team change their location to quietly pacify Clara?", "“Those dumb fuckers!!”", "Chohong angrily spat out and rushed forward first.", "The cordial atmosphere was broken up in an instant. Even as he reflexively joined others and rushed forward, Seol Jihu continued to pray in his heart.", "….That his thoughts were wrong.", "*", "The remaining expedition members hurriedly ran to the tomb, but their steps came to an abrupt halt as soon as they saw Samuel in front of it.", "There was around 50 meters or so to the tomb from where they were. However, they realized something was off about Samuel's movements. His face was dyed in the colors of pure terror, and tears were streaming down non-stop from his eyes. And most importantly, his long hair was in a yanked-back position in the air behind him.", "It was as if someone, or something, was pulling at them.", "“S-save m….!!”", "Samuel tearfully tried to say something, before he suddenly crashed to the ground on his back. As he flailed about, something fell out of his hand.", "“Uwaaaahhh!!”", "Just as everyone had finally regained their senses, Samuel was sucked into the tomb and disappeared from their view.", "Slam!!", "The iron door slammed shut violently after that.", "—Kuaaaaaaaaah!", "And then, an ear-piercing scream followed. The remaining five people belatedly ran forward, now utterly speechless.", "The front of the tomb was in a chaotic mess. The altar Alex took away while saying it was for eating lay upside down, the food scattered about everywhere.", "“This…. Those dumb idiots!!”", "For the first time ever since the expedition began, Ian flew into rage. Dylan looked at Ian angrily stomping on the ground for a second before raising his crossbow.", "“Chohong, Hugo! I'll cover you.”", "Chohong and Hugo stuck to either side of the tomb's entrance. They stared at each other and mouthed the words one, two, three before Chohong kicked the door, hard. And, just as she was about to enter….", "[GET OOOOOOOOUUUUUUTTTTT!!!]", "Incomprehensibly thick murderous intent, sharp enough to render flesh apart, slammed and dug into everyone's brains.", "“U-uwaaah?!”", "Chohong, who always behaved like a female version of man's man, began to falter, her face full of fear.", "The roar of the Lioner leader was a joke compared to the enormous evil aura pouring out from the interior of the tomb. Never mind Chohong and Hugo, even Dylan and Ian had collapsed to the ground, gasping urgently for air. The only one standing unaffected was Seol Jihu.", "Before anyone present had the chance to recover their wits, Seol Jihu instinctively activated 'Nine Eyes' and couldn't help but question his own eyes.", "'It's yellow?'", "Meaning, he had to pay attention?", "But, why? Even Dylan, a High Ranker, couldn't fight against whatever force was affecting him.", "Seol was unable to figure it out, but the situation was rapidly getting worse.", "The corrupted, indistinct, and blurry miasma leaked out from the tomb and began to envelop his teammates one by one. Seol Jihu looked around in helplessness, only for an object glittering on the ground to catch his attention. It was a small tiara boasting a brilliant silver hue.", "Seol Jihu hurriedly picked the tiara up, and his trembling eyes shifted back to the tomb itself. The 'Attention Required' could not be seen as absolutely safe, but…. But, when he saw Chohong grasping at her neck with her eyes wide open, Seol Jihu stopped hesitating and ran inside the tomb.", "Kwang!", "As soon as he entered, the door slammed shut by itself. Seol Jihu flinched, but he never stopped moving.", "And so, he entered through the doorway and managed to make his way past the lone corridor. What awaited him by the entrance of the burial chamber was a man sprawled on the floor.", "Samuel was staring at the ground with dull eyes…. with his head and body separated. No, would the description of his head being yanked out from the body be more fitting here?", "“Samuel….”", "He wasn't the only one.", "“….Alex!!”", "Alex, who had been holding that keepsake he desired so much, lay there with his neck twisted around like a twisted doughnut.", "“G-Grace….”", "Meanwhile, Grace's head was cracked open like a watermelon.", "And, finally….", "“….” \nSeol Jihu's jaw opened vacantly after spotting Clara, now literally ripped in half from the top of her head right down to her groin.", "Her remains showed the most amount of damage compared to others. As if something had dug her eyes out while she was still alive, her eye sockets were empty now. Her limbs were twisted into bizarre angles.", "That wasn't all. Her neck flesh was crumpled inward as if something had squeezed it too tightly. And, she must've been flung against the walls dozens of times, because her body now resembled finely ground meat paste.", "His comrades who were alive and well only a few minutes ago had now all met horrifying deaths. Realizing this chilling truth, Seol Jihu froze up like a statue on the spot.", "“Why…. why….”", "Everything would've been fine if they just chose to quietly return home.", "Run away! – suddenly, this thought popped up in his head. However, he couldn't do that. Seol Jihu looked behind him and gritted his teeth.", "This wasn't 'Do Not Approach'; since it was 'Attention Required', there had to be some kind of a solution to what was happening outside. At the bare minimum, a broader range of options should be available to him, compared to something like 'Escape Immediately'.", "But he could think of only one way out of this predicament.", "Seol Jihu reached out to the bodies with his trembling hands. He retrieved the token from Alex; took the earrings from Grace; and finally, found the necklace emitting a blue luster near Clara and picked it up.", "“!!”", "He then looked at the sarcophagus, only for his breathing to come to a choking halt.", "The left sarcophagus was completely disarranged. Not only that, the lid was half-open, and chilly, pale blue aura was slowly permeating out from the opening to fill up the burial chamber.", "Could Samuel and his team have tried to open the sarcophagus, too?!", "As Seol Jihu stood there frozen in shock, he realized that the burial chamber had suddenly become a level darker.", "His surroundings became eerily silent. For some reason, his instincts loudly screamed at him not to move from the spot.", "All of a sudden….", "“….Ah.”", "Seol Jihu could feel 'it'.", "A glare, staring at his back. Someone, or something, standing behind him. And then, a disgusting, acrid odor of blood stinging his nose.", "The fog that darkened the burial chamber slowly enveloped him, too. The evil aura he sensed on the outside of the tomb brushed past his skin, and he thought that every cell in his body had woken up and was screaming.", "The only other time he trembled this hard, must've been back in the days of going through cold-weather winter training when he was still in the military.", "Even though he tried to control the tremor, his body still trembled like crazy. Not just because of the chilly aura leaking out of the sarcophagus, but also from something else grasping at him.", "His brain continued to ring alarm bells. It told him to never look back. That he must not look back.", "Subconsciously, Seol Jihu's neck creaked like a piece of rusted machinery and slowly turned towards his back, but he managed to squeeze his eyes shut in time. He also somehow managed to extend his shaking arms out as well. This was all he could do under the circumstances.", "After five minutes that felt like an eternity had passed, he sensed the necklace slowly leaving his hands.", "[A keepsake from my mom.]", "He nearly opened his eyes after a certain 'will' entered his mind.", "[This, a gift from someone dear.]", "Next up, the slick and cool-to-the-touch tiara was gone.", "And then…", "[I warned them.]", "Suddenly, the words got colder, sharper.", "[I hate those people.]", "[I told them not to enter.]", "[But they entered anyway.]", "[I was going to endure, but then, these two…!]", "'I'm sorry.'", "Seol Jihu dropped his head.", "'I thought we'd be going home, but I didn't know they would….'", "[I know.]", "When he desperately spoke in his mind, her will that sounded like a reply entered his mind.", "[These people, they secretly schemed.]", "[They lied.]", "[That man said it.]", "[That I won't be able to chase them once they passed the boundary.]", "What Seol Jihu feared the most turned out to be true. Samuel and his team couldn't throw their greed away in the end.", "'Really…?'", "[Really.]", "[I was seeing you off but felt something was wrong, so followed them.]", "'Seeing me off?'", "[Un.]", "[You promised to come and see me again.]", "Before he had noticed it, he was no longer shaking.", "The evil aura was still just thick and heavy as before. However, Seol Jihu had finally realized that it was not directed at him. He even began to think that she sounded like a sulking, pouting child, busy whining about this whole thing being not her fault.", "Just how much time went by like this?", "The token and the earrings remained in his hands, yet he could hear the footsteps shuffling away. Regaining some calmness, Seol Jihu breathed in deeply and opened his eyes.", "The first thing he saw was a pair of feet. He expected to see rotting, withered feet of a mummy, but hell, they were small and beautiful instead.", "'….Eh?'", "She should have been dead for a long time, right? Seol Jihu summoned up some courage and raised his head a bit higher.", "And he saw her back. What he saw was the rear of a woman, her long, gently-waving silver hair reaching down to her ankles. Wearing a white gown with icicles adorning it, she readily entered the sarcophagus and laid down.", "Ssssss…", "When the sound of the lid closing resounded out, Seol Jihu finally regained his wits.", "His mind was now silent, her will no longer sounding within.", "“Uhm….”", "'Did she just spare me?'", "He half-expected to be killed off. Currently, he felt like ten years were shaved off his lifespan.", "Seol Jihu turned around hurriedly to leave, but then he noticed the chaotic state of the burial chamber.", "“….” \nAnd then… for some reason, he began to tidy up the burial goods. He closed the lid properly and unfurled the red cloth before laying it back on the sarcophagus. He also correctly placed the longsword and the shield back to where they used to be.", "The problem only occurred when he was just about done with tidying up.", "Plop.", "“Mm?”", "Something weird happened. When he tried to place the earrings and the Proof of Castitas to their original positions, they kept falling down. No matter what he tried, they resolutely refused to stay in their original positions.", "'What's going on here?'", "He only wanted to finish tidying up quickly and leave, so this was one hell of an exasperating event.", "“Argh…”", "[Argh…]", "“?”", "[?] \nSeol Jihu tilted his head this way and that before cautiously thinking to himself.", "'By any chance, are you doing this deliberately?'", "[You can take them.]", "'….Pardon?'", "[Thanks.]", "[It was the first time.]", "[A person protecting me.]", "[Come again.]", "'No, hang on. I was….'", "Seol Jihu was about to say something inwardly, but then he saw the sarcophagus suddenly grow distant from him.", "His body was actually being pushed out. No, it was more like someone or something was dragging him away, and before he could do anything about it, he slid past the corridor. Soon, he heard the sound of the door opening up, and the darkened world brightened up once more.", "As the door closed shut with a resounding 'slam', Seol Jihu looked behind him.", "Dylan, Chohong, Hugo, and Ian were patiently waiting for him.", "Just before Seol Jihu opened his mouth….", "“As soon as you entered inside, the miasma dissipated.”", "Ian spoke up in a soft voice.", "“We heard what happened. Listening to the will of the vengeful spirit…. That was truly an unexpected phenomenon.”", "Ian sounded lonely and wistful as he closed his eyes. It seemed that the vengeful spirit relayed her will to the four people outside the tomb, as well.", "“It's my fault that Samuel's team decided to act separately like this. If only I didn't speak of my hypothesis so carelessly, then….”", "“No, that is not true.”", "Dylan spoke in a formal tone of voice.", "“We all were given the same opportunity. And it was them who ignored it. They could not control their greed and paid the price for it.”", "“Is that so….”", "Ian sounded resigned. He shifted his gaze over to the accessories in Seol Jihu's hands – the Proof of Castitas and a pair of nameless earrings. From a certain point in time, the fate of Seol and Samuel's team had become clearly divided.", "The old man chuckled wryly and gazed up at the sky, looking somewhat helpless.", "“Goodwill with goodwill, and malice with malice… I've learned a lot during this expedition.”", "“I agree. After all, humans aren’t the only race who possess intelligence.”", "Dylan smiled ruefully before turning around. Their Pathfinder might have died, but he was also an Archer.", "“Let's go back.”", "Soon, the remaining members of the expedition assumed a new formation according to Dylan's orders and silently left the tomb's vicinity.", "11 had entered, but only 7 were leaving the forest.", "*", "The return trip proved to be uneventful. With the sole exception of Ian performing another one of his mind-calming magic spell, nothing of note happened.", "The mood of the expedition remained…. quiet. Sure, they had experienced the annihilation of a friend's team, but also, each of them had a lot to think about.", "It was a rather common event for a person to die in battles against monsters or other enemies. However, today's circumstance was slightly different. It was Samuel's fault for making the vengeful spirit their enemy in the first place.", "Endless questions still swimming inside his head, Seol Jihu remained confused. He didn't know whether to feel happy or sad about this expedition.", "But, if he were to be honest, he was more regretful than anything else.", "[More importantly, if we don't acknowledge the Warrior who managed to defend against a female Lioner as one of the members of the expedition, then how can we even think about acknowledging anyone else?]", "Samuel….", "[Name's Alex. I'm a Level 3 Investigative Priest. From Area 4.]", "Alex….", "Seol Jihu never once thought of them as bad people. Samuel could be a bit hard-headed at times, but still, he was a good leader who paid attention to the opinions of his teammates. And Alex was a good-natured young man with a bright smile on his face most of the time.", "And that was precisely the reason Seol Jihu found it so much harder to understand. Why did they try to take on the risk, when the situation was anything but certain?", "As he walked while submerged deeply in his thoughts, the sky that had been hidden away by the trees began to show up. He could even see the distant Napal Hill too, as well as the previous night's campsite.", "“How much do you know about 'death'?”", "Soon after they finally managed to escape from the Forest of Denial, Ian initiated a conversation with Seol Jihu.", "“All I know is that you lose all memories of Paradise and it becomes impossible to re-enter.”", "“Looks like you have some understanding of it. If I were to correct one thing, then there actually is a way to re-enter Paradise.”", "Now that was the first time Seol Jihu heard about that.", "“It's not easy, of course. First of all, you need to revive the dead being. And secondly, you must find a way to bring the person back here, the person who had utterly forgotten about Paradise. If you meet these two conditions, then you're given one last opportunity to re-enter.”", "“Revival?”", "“Well, rather than calling it 'revival', it'd be more like you praying to the gods for your wish to be granted. Will you please revive that person, or something like that.”", "The moment he heard that, Seol Jihu felt like a hammer had struck him in the head.", "A wish….", "That was a rather familiar word to him.", "[You have honored your side of the deal, so I shall honor mine. What is it that you wish?]", "[So, do you wish to be revived?]", "Indeed, back in his dream….", "“Of course, the act of praying for that wish itself is the difficult one. You need to either achieve great military merit in the battlefield, get a promise from a god, or get yourself truly ridiculous, unbelievable offerings…. It's not an exaggeration to say that the whole thing is practically impossible.”", "“….Master Ian, do you think Samuel was trying to revive Vanessa?”", "“I do.”", "'….Vanessa?'", "Seol Jihu shifted his gaze over to Chohong after hearing an unfamiliar name. She quickly whispered to him.", "“A Level 5 Blade Runner. She’s the OG leader of Samuel's team.”", "“….I was worried about that, so I tried to warn him, but in the end, he couldn't let go, could he?”", "“I can understand, just a little, where he was coming from. They had been teammates for a very long time, and while she was still alive, they were one of the best teams in Haramark.”", "“I'm sure that the weight on Samuel's shoulders was heavy. In any case, I'm deeply worried. Samuel was a capable enough Archer to enter the ranks of Level 5. And now, both Vanessa and Kahn…. What a shame, when every single High Ranker is important.”", "Ian abruptly stopped talking and began rummaging through his robe. He then pulled out a round crystal. Seol Jihu remembered seeing something similar in Carpe Diem's office, but this crystal was several times clearer.", "“Is it from the royal family?”", "“Looks like it. Sorry about this, but can you give me some privacy?”", "“Of course.”", "Seol Jihu followed Dylan and the rest to distance himself away from Ian.", "“Is it possible to communicate with Haramark from here?”", "“Well, he works for the royals, right? I mean, they are still a royalty, so they should at least possess good quality crystals, no?”", "Chohong replied and lightly clicked her tongue.", "“I hope that's just a friendly call.”", "“Unfortunately, doesn't look like it.”", "Dylan seemed to get a little tense after seeing Ian's surprised reaction.", "“Wait, it's not a war breaking out, is it?”", "“I wonder. Surely, the Parasites wouldn't have the necessary manpower to focus on us right now.”", "“In that case, is it the Federation?”", "“That makes even less sense.”", "While they chatted among themselves, Ian's communication came to an end. As the older Magician slowly walked over, his complexion was definitely not so good.", "“What happened?”", "“….They say that all communications with the Arden Fortress have been cut off.”", "Hearing that, Chohong's expression crumpled immediately.", "“Damn it! I knew that would happen!”", "“Let me continue. The last communication was two days ago. The royal family of Haramark has issued an emergency bounty and has recruited Level 3 and 4 Earthlings. They have issued draft notices for High Rankers as well.”", "“Draft notice?! Gimme a fucking break!”", "Chohong angrily shouted out. Dylan calmed her down and asked.", "“How many answered the notice?”", "“Not even one.”", "“I thought as much.”", "“It can't be helped. The Arden Fortress was a strategy the royal family forced. In any case, they are in the midst of marching towards the fortress as we speak, along with a small contingent of Earthlings accompanying their own armed forces.”", "Things just got complicated as they were about to return. Ian helplessly stroked his beard. After a short bout of silence later, Dylan asked.", "“Will you be heading there, as well?”", "“You know it. I'm still employed by the royal family, after all. I've received quite a few benefits from them, so I must comply.”", "“Argh, don't go! You're supposed to quit after scouting the Forest of Denial is done, right?”", "Seeing Chohong so vehemently react like this, Seol Jihu became quite curious. He could tell that a war had broken out, yet he failed to understand why everyone was so openly vocal about it.", "Dylan finished organizing his thoughts and asked once more.", "“What did they want from us?”", "“The mission to scout the Forest Denial is to be put on hold immediately. Escort me to the previously-agreed rendezvous point. As for the rest, they will discuss it with you. They also added that you'll be paid suitable compensation so you should rest easy.”", "“Sounds like the royal family is in a serious bind.”", "Dylan slowly shook his head.", "“I will have to discuss this with my team first. Can you give us a bit of time?”", "“Well, I don't have a say in that to begin with. And also, I'm sorry about this.”", "“This isn't something you should apologize for, Master Ian. Well, then. ….Ah.”", "Dylan was about to gather his teammates around, but he thought of something before that and asked quickly.", "“By the way, who is the commander of the forces?”", "“Teresa.”", "“…Pardon?”", "Dylan frowned deeply.", "“Teresa Hussey is personally participating?”", "“Fufufu. I see that you're reacting exactly the same as I did.”", "Ian chuckled loudly and nodded his head.", "“That's right. The princess of the Haramark Royal Family is personally going to war.”"]}