{"cid": "212", "title": "Chapter 212. An Unexpected Gain (3)", "content": ["After accepting Yuirel’s offer, Seol Jihu ordered the expedition team to set up camp around the area. Now that he had permission from the Federation, he no longer had any qualms about loitering around the border region.", "He was rather lucky that the Cave Fairies had come to greet him as well.", "As the last race admitted by the Federation, the Cave Fairies prioritized feelings over reason. How Yuirel was acting was the perfect example of this. It was clear that she came out of personal curiosity and amusement rather than to keep an eye on them.", "Seol Jihu decided to use this to his advantage. Yuirel wasn’t a normal Fairy, but the Fairy General who supposedly supervised her entire race. Forming a good relationship with her seemed to be in his interest.", "‘How should I treat her?’", "After much consideration, Seol Jihu decided to go with dinner that would show off his skills, but also not make the other side feel uncomfortable.", "He happened to have the perfect ingredients, as he had brought all sorts of food ingredients during his last trip to Earth.", "‘Just making ramen isn’t enough.’", "He grinned as he took out plain noodles from his bag.", "After slicing up beef seasoned with salt, frying eggs and then chopping them up, and dicing up mushrooms and zucchini, Seol Jihu took out the boiled noodles, moved them to empty bowls, then garnished them with the vegetables.", "Then, he poured in the broth cooked with soy sauce, kelp, green onions, and refined rice wine. Once he added ground sesame seeds mixed with salt and prepared kimchi, extravagant banquet noodles were ready.[1]", "He put quite a bit of effort into making this meal, and it rightly looked delicious even in his eyes.", "The meal was a total success, as an uproar broke out in the camp.", "“Amazing! This is amazing! Ah! I’d kill for another bowl!”", "Hugo slurped up the noodles in a hurry. He was basically a living vacuum cleaner.", "“Kyaa! The broth has such a deep taste!”", "Chohong hollered with a big grin.", "Seol Jihu smiled.", "“It’s good, right?”", "“Yeah! It has a really refreshing taste! Kyaha!”", "Chohong chuckled like a fool and gulped the broth down from the bowl.", "“…I don’t get it!”", "Phi Sora was also busily moving her chopsticks, tilting her head with every taste.", "“Argh, did he really not put any drugs in this? I normally hate noodles!”", "“Fuck, fuck!”", "Maria was the same.", "Seol Jihu rubbed his chin in satisfaction as he watched his comrades enjoy the meal more than he originally imagined. Then, he seriously considered opening up a noodle shop in Paradise once everything ended.", "[He-eh. It looks good!]", "“Flone?”", "Seol Jihu looked down in an instant. A small puff of smoke was peeking out of the pendant. She had been sleeping the entire afternoon, but it seemed the smell of food woke her up.", "“Do you want to try it?”", "[Un. I wasn’t going to try it at first… but everyone’s eating it so deliciously.]", "Judging by her pleading tone, it seemed she really wanted to try it now.", "“Sure, you can have a bowl too.”", "[Heehee.]", "After serving a bowl to Flone, Seol Jihu turned to where the members of the Federation were sitting. His noodles might taste good to humans, but he wasn’t sure if members of another race would like it as well.", "However, he soon realized that his worry was for nothing.", "Haeryeo and Haeya practically had their heads in their bowls, and their spinning tails showed how much they liked it.", "As for Yuirel…", "Slurrrpprprp!", "“….”", "She was making a truly incredible sound, shoving the noodles into her mouth whole. Her mouth seemed too small to fit all of it in, but she managed and even swallowed successfully.", "Seeing her wrap the last little bit with kimchi, Seol Jihu started.", "‘S-She really knows how to eat.’", "“Delicious!”", "After finishing a bowl in the blink of an eye, Yuirel turned to Seol Jihu and pushed her bowl forward.", "“I’ll take another bowl!”", "It felt like she was saying ‘hurry up with my refill!’ rather than ‘give me more’.", "‘Good thing I made plenty of broth.’", "Seol Jihu nodded his head as he put more noodles into the pot. In any case, Yuirel really ate well.", "‘If she stars in a mukbang[2], she’ll make a fortune through donations…’", "Using a communication crystal to show a recording of Yuirel eating to all regions of Paradise. Now wouldn’t that be an amazing advertisement?", "While Seol Jihu was busy thinking about his business idea, Yuirel ate sumptuously.", "Gulp, gulp!", "“Puha!”", "Yuirel exclaimed in delight after gulping down the broth. Only after finishing four bowls did she pat her bulging belly. She sat around feeling full and satisfied, then nodded her head with the words, “As I thought.”", "She continued.", "“Humans are such fine creatures…”", "Seol Jihu smiled wryly. It was an excessive compliment for simple banquet noodles.", "“We can’t go without this on such a fine day!”", "Yuirel rummaged around her waist, then took out a leather canister.", "“Oh? Me too, me too!”", "Hugo shot up when he saw liquor, then glanced to check Seol Jihu’s reaction. Since this was a place to better their relationship, Seol Jihu figured it would be fine to be a little loose and nodded his head.", "“Don’t drink too much though.”", "“Won’t you have a glass as well?”", "Yuirel asked after pouring the liquor for Hugo. Seol Jihu didn’t say no.", "“This is my favorite liquor— clear-honey spider wine.”", "“Clear-honey spider wine?”", "“It’s made from fermenting the spider’s threads. It should be good.”", "Yuirel replied as she poured a viscous, white liquid in a glass.", "“Here. Try it.”", "“Thank you!”", "The wine really had a unique flavor. Because it was so viscous, he wanted to keep it in his mouth. When he pulled it down his throat, the savory smell of milk spread out.", "“Seol. No, Seol Jihu, what is the meaning of that act?”", "“?”", "“Why did you place your hands under the glass and tilt your head back to drink? Is that the Earthlings’ drinking etiquette?”", "“Ah, yes.”", "Seol Jihu replied.", "“It doesn’t mean anything special, but I learned from a young age that I should do this when I’m drinking with a senior.”", "“Hoh! And who did you learn that from?”", "“My father.”", "“Aha… I see. Excellent, truly excellent! Senior, you say! Haha!”", "Yuirel burst into laughter again. She looked extremely happy for some reason.", "Seol Jihu tilted his head, but it seemed calling her his senior worked wonders.", "The Cave Fairies were a race that prioritized hierarchy as much as the army. They naturally cared a lot about the virtue of command and discipline and were strict enough to execute anyone who committed mutiny or insubordination.", "So how could Yuirel not be happy being treated to dinner and even being addressed as a senior in front of her subordinates?", "Not to mention it was from humanity’s hero, who killed the First Army Commander!", "“A silent moonlit night, superb food, and a new friend! What a wonderful day this has been!”", "Yuirel took a shot and tilted her head in a burst of laughter.", "‘She’s pretty cool.’", "Seol Jihu had a feeling she would get along with Hao Win.", "With a burp, Yuirel put the glass down.", "“Oh right, you said you had something you wanted to ask, no?”", "Now they were getting down to business.", "“Go ahead. I’ll answer most questions.”", "It really looked like she would answer almost anything. As Seol Jihu had more than a couple questions he wanted to ask, he took a moment to organize his thoughts.", "‘First.’", "“Why did you say we shouldn’t sleep until we met up with you?”", "“Because you will dream if you sleep.”", "Yuirel answered with clarity before pointing to the side.", "“Those two.”", "Haeryeo and Haeya were hugging each other in sleep.", "“Those cheeky brats broke the taboo and entered the forbidden ground. The moment they stepped foot into the forbidden ground, they had been cursed with magic and witchcraft. The important thing is that this curse is contagious. It can spread to anyone who is nearby.”", "Seol Jihu’s jaw dropped.", "“Ah, so that’s why you told us to stand still… Then that ritual must have been to lift the curse.”", "“Exactly.”", "“I heard Haeryeo and Haeya followed the Sky Fairies to see their ritual… Does this mean they went to lift the curse in the pagoda?”", "In truth, this was the most important question. If the Federation was in the middle of conquering the pagoda, it would be hard for the expedition to claim authority over it.", "“No. If it was possible to lift the curse, the Federation would have conquered the pagoda a long time ago. We gave up because it was deemed impossible. There’s a reason it is a designated forbidden ground.”", "Seol Jihu was relieved, but a corner of his mind filled up with worry. He could imagine how difficult the expedition would be if even the powerful Federation had no choice but to give up.", "“This is the reason the Sky Fairies held a ritual—”", "“Wait a moment.”", "At that moment, a woman who was sitting by herself slurping noodles, cut in.", "It was the woman wearing a ceremonial robe — a Sky Fairy.", "“That ritual is the Sky Fairies’ internal affair. There’s no reason for us to go out of our way to reveal everything.”", "“Tsk, so stingy.”", "Yuirel clicked her tongue.", "“All I’m saying is that you don’t need to go so deep into the detail.”", "“He’s treated us to a fantastic dinner, and you personally ate two bowls of it. You’re saying you can’t even do this?”", "If this matter involved the Sky Fairies’ internal affair, Seol Jihu didn’t need to push to hear the answer. And so, just as he was about to move on to the next question…", "“Keuk!”", "The Sky Fairy groaned. She was clearly upset and a little ashamed.", "Seol Jihu was confused.", "‘Why does she look irritated and accepting at the same time?’", "“You know, this is the problem with your sparrows. You and your stupid face. If there’s a problem, just say it and accept help! What’s the point in holding onto useless pride? Tsk…”", "Yuirel took the opportunity and really went off.", "“W-What did you say!?”", "Of course, the Sky Fairy didn’t sit still.", "“S-Sparrow? Did you say what I think you just said?”", "“What if I did?”", "“Then that is not a comment I can gloss over. I will report it during the next council meeting!”", "“Go ahead.”", "“Let’s see if you can be so nonchalant about it when we’re bwack!”", "“Leth'sh shee if you can be sho nonchawanth abouth ith when we're bwacw!”", "Yuirel mockingly repeated the Sky Fairy’s words.", "Seol Jihu barely held his laughter back. It was because the Sky Fairy’s reddened neck was trembling frighteningly.", "“Isn’t it funny? This idiotic race always slurs their speech when they’re worked up!”", "Seol Jihu laughed vaguely.", "“Anyways, it’s best you don’t interact with their race if possible. Just look at how they act! Going off about internal affairs or whatnot over such a trivial matter. Isn’t it tiring?”", "“Oh, yweah?”", "The Sky Fairy slammed her bowl down. After shooting up from her seat, she pointed at Seol Jihu and spoke.", "“Human, aren’t you curious why Cave Fairies are covering their eyesh?”", "‘Oh!’", "To be honest, he was curious. In fact, this was one of the questions he planned to ask given the chance.", "“I’ll tell you. You see—”", "“Eit! Don’t be such a kill-joy! Drag her away!”", "As soon as Yuirel gave the command, the ten Cave Fairies all shot up and dragged the Sky Fairy away.", "“W-Wait! Let go of me! Let go of me this instant!”", "The Sky Fairy struggled desperately.", "“Okay, I get it! Let me get my noodles at least… Ah, hey! Get your hand off that bowl now!!”", "During all this chaos, one of the Cave Fairies sneaked off and was stealing the Sky Fairy’s noodles.", "“That’s mine! I was savoring each bite! Uup! Uuuuup!”", "The Sky Fairy’s scream subsided soon. After the short uproar…", "“Alright! Let’s get back to the topic!”", "Yuirel spoke as if nothing had ever happened.", "Seol Jihu put his hand over his forehead. It felt like a storm had just passed by.", "“There is a simple reason they hold a ritual. For communication.”", "“Communication?”", "“According to the Sky Fairies, there is a powerful Spirit slumbering inside the Pagoda of Dreams.”", "Yuirel suddenly asked.", "“Did you know that the Sky Fairies lost their spirit power?”", "‘Spirit power?’", "“Now that you mention it, I heard the communication between the Sky Fairies and the Spirit Realm cut off recently.”", "Teresa, who was standing nearby, slid into the conversation.", "Seol Jihu asked.", "“Something like that happened?”", "“Yes, but I don’t know much about what happened.”", "“Since when…?”", "“I think it was right after we came back from the Delphinion Duchy.”", "Right, the Sky Fairies were definitely using their spirit power while they were fleeing from the Parasites in the Forest of Denial.", "Yuirel confirmed right away.", "“It was a huge incident at the time. The Sky Fairies’ battle power has more than halved because of it.”", "This was indeed the case. The significance of the Sky Fairies’ existence came from their ability to summon Elemental Spirits. Without this ability, the Sky Fairies were nothing more than dextrous archers.", "“To be honest, there have been cases in the past where the communication became unstable. That’s why the Federation transferred us in a hurry.”", "[Isn’t it surprising? They might share a common ancestry, but for the two hostile races of Sky Fairies and Cave Fairies to become partners?][3]", "[That just goes to show how desperate they’ve become.]", "‘I see. So this was the backstory.’", "Seol Jihu finally understood the background story of the conversation Ian and Dylan had in the past.", "Teresa spoke up.", "“Can you provide more details on what happened? From what I know, something happened when the Parasites’ Seventh Army Commander invaded the Spirit Realm under the Queen’s orders.”", "“Mm.”", "“But that only made the summoning unstable. It never cut off the communication entirely. At least, not until very recently.”", "“You’re right.”", "“When I heard the rumors, I thought the Seventh Army Commander won the war in the Spirit Realm. But in that case, Twisted Kindness should have returned to the Middle World already[4]. But no one has seen him yet.”", "“That is most likely the case.”", "Yuirel replied calmly.", "“The reason is simple. The Spirit Realm hasn’t lost yet. Perhaps they are in the middle of a fierce battle even as we speak.”", "Teresa’s face seemed to be asking ‘What the hell does that mean?’ What Yuirel was saying just didn’t make sense.", "It was then that Yuirel suddenly turned serious.", "“Hm…”", "After pondering for a long time, she started with the words, “It shouldn’t matter since it is an open secret in the Federation.”", "“The Pagoda of Dreams is a ruin from hundreds of years ago.”", "She suddenly changed the topic. However, Seol Jihu quietly listened in. He had a feeling that everything Yuirel was about to say would connect together.", "“I don’t know the details either. But at the time, the Empire was facing an unprecedented threat.”", "She pointed backward with her thumb.", "“Due to the pagoda you’re trying to reach.”", "A pagoda that almost drove the powerful Empire to ruin? Seol Jihu swallowed hard.", "“As I said before, going near the pagoda afflicts you with a powerful, contagious curse.”", "“….”", "“And that curse makes you dream.”", "Yuirel lowered her arm.", "“To be more precise, the curse delves into the minds of living beings, regardless of their race, and makes them dream what they fear most.”", "“Dream… you mean, nightmare?”", "Seol Jihu asked, clearly wondering what was wrong with having a simple nightmare.", "“How could it be a simple nightmare?”", "Yuirel grinned, then turned to face Teresa.", "“You asked why the communication cut off, right?”", "“Yes.”", "“This happened very recently. The Sky Fairies learned that a powerful Spirit was sleeping inside the Pagoda of Dreams and immediately left to explore the place.” Yuirel continued. “Because the Spirit Realm requested assistance.”", "Teresa’s eyes widened.", "“Assistance? The Spirit Realm did?”", "“Mn. They said Twisted Kindness’ assault was getting harder to withstand and requested for help in whatever way possible.”", "Teresa’s jaw dropped at Yuirel’s explanation.", "“Dear god… I know that the Seventh Army Commander is the last Dragon, but how could he single-handedly… Twisted Kindness doesn’t even have his own army!”", "“Who knows?”", "Yuirel shrugged.", "“I’ve never fought him. Anyways, with the summoning getting more and more unstable by the passing day, the Sky Fairies rightfully grew anxious. That’s when they discovered the Pagoda of Dreams and figured they should awaken the powerful Spirit and send it over to the Spirit Realm to help.”", "With that, Yuirel crossed her arms.", "“And immediately after they started exploring the pagoda, their communication with the Spirit Realm cut off completely. All in a single morning.”", "“….”", "Seol Jihu blinked dazedly. He felt like there was a huge jump in the story.", "‘No.’", "That wasn’t the case. There had to be a reason Yuirel talked about the pagoda. Seol Jihu calmly organized the story.", "‘Nightmare, curse, Spirit Realm, Sky Fairy….’", "Soon, Seol Jihu connected the dots and widened his eyes.", "‘Don’t tell me!’", "He quickly asked.", "“That morning, when the Sky Fairies attempted to explore the Pagoda of Dreams, was failing to summon the Spirits what the Sky Fairies feared the most?”", "“…You have fantastic intuition.”", "One corner of Yuirel’s mouth curled up.", "“You’re right. The reason the Pagoda of Dreams is so frightening is that it goes beyond making you dream what you most fear to making that dream a ‘reality’. That is what the Federation has discovered, and that is why they have forbidden its members from entering it.”", "Yuirel acknowledged what happened and stared at Seol Jihu straightforwardly.", "“That is why I advised you to go back.”", "1. Google Korean banquet noodles (janchi-guksu) ", "2. Mukbang, muk-bang or meokbang is an online live audiovisual broadcast, where a host eats food while interacting with the audience. It is usually done through a webcast, and it became popular in South Korea in 2010 - (Info from Wikipedia). ", "3. From chapter 53. ", "4. This term is never really explained, but it is the same as Material Realm (Paradise). "]}