{"cid": "128", "title": "Chapter 128. Seol Jihu (5)", "content": ["Even without looking, he could tell where the sound came from. The Orc Champion had swung its axe the moment Seol Jihu lost balance.", "A disk just barely managed to block the blade, but the shockwave sent Seol Jihu’s hair flying back. The sharp winds pierced through the disks, and facing the merciless wind pressure ravaging his face, Seol Jihu shut his eyes.", "When he opened them back up, he realized his body was in the air. He flew like a car frantically driving in reverse, until he eventually struck the wall.", "Thud!", "“Puhup!”", "Blood spurted out of Seol Jihu’s mouth as he suffered internal damage. With his blurred vision, he could see the Orc Champion striking down with his battle-axe.", "It was then… Click, click! Sharp sounds of a chain shot toward the monster’s neck. Just as a chained scythe was about to hit its neck, the Orc Champion struck it down with his arm without even looking back.", "“…Chet.” A giant clicked his tongue and pulled his chain back. Ten or so arrows immediately followed.", "The Orc Champion, which was about to end the puny insect’s life, couldn’t help but grit its teeth and fall back. But where had all these reinforcements come from?", "Krrrr?", "Its nose twitched, and then it quickly scanned its rear. After seeing that the old Orc had been decapitated, it finally realized the cause for the unusual change. The Orc Shaman had been killed while it was focused on the weakling who he mistakenly thought was strong.", "When the Orc Champion saw Kazuki darting away from where the Orc Shaman used to stand, it let out an angry snort.", "“Hurry up and take him!” The giant man swinging his chain in a circle shouted.", "Lara Wolff ran in while being covered by others. She grabbed the legs of the sporadically convulsing young man and pulled on him frantically.", "Of course, Seol Jihu couldn’t recognize anything happening around him. He was in a state of complete bewilderment, like a TV screen full of miscellaneous signals.", "“Concussion and seizure…. He needs immediate treatment…!”", "He could faintly make out a few words.", "“The Orc Champion’s power surpasses my expectations. Can you do anything about it?”", "“I’m sorry. I cannot use power beyond that of a High Ranker as long as I’m inside the Banquet.”", "“Even though you used a Divine Wish…!”", "“People who cleared the Banquet cannot enter it again. I could bend the rules using a Divine Wish, but a restriction has been placed on my abilities….”", "A conversation he couldn’t understand flowed out.", "“First.”", "He felt a soft touch enveloping his face. A warm sensation flowed into his body, and his vision focused. Seol Jihu opened his eyes and saw Kazuki’s face.", "“Are you okay?”", "Seol Jihu picked himself back up. His body was drenched. At first, he thought it was blood, but he then realized it was sweat.", "When he lowered his head, cold sweat dripped down. He also felt a bit exhausted. Although the battle was short, this was proof that he had been pushed to a corner and expended much mental energy.", "His hand fumbled on the ground, searching for his spear. Seeing this, Kazuki opened his mouth.", "“Don’t worry. The man you saved is surprisingly skilled. He’s holding up with a hit-and-switch tactic.”", "Seol Jihu quickly grasped how the battle was playing out. The Orcs fighting spirit had died down greatly. Their crimson eyes had also returned to their original color.", "The most important thing was that the old Orc in the back was killed. He was wondering why Kazuki wasn’t supporting him. It seemed that he had gone to assassinate the Orc Shaman.", "Kazuki placed his hand on the young man’s shoulder.", "“Good job. You did well— truly. Thanks to you, we are now in an advantageous position.”", "These weren’t empty words. Although the robed Priest played a huge role, Seol Jihu was the one who caught the Orc Champion’s attention and fought it directly. Thanks to him, Kazuki was able to assassinate the Orc Shaman without the Orc Champion finding out.", "But it was too early to celebrate. Most of the Orc Warriors were alive, and the Orc Champion was still kicking. The giant and the six others were barely keeping the Orc Champion in check under the Priests’ support.", "The Orc Champion’s power was truly incredible. And in reality, its physical power surpassed that of most High Rankers. A ‘true’ High Ranker like Oh Rahee might be needed to fight it on an even ground.", "Even then, there was a chance that she would lose. Victory wasn’t guaranteed.", "Right. Kazuki couldn’t deny that Seol Jihu did a good job. However, the result people were expecting from him was no longer that of a Level 3 Warrior.", "“Do you think you can go on?”", "Kazuki chose his words carefully as he knew how overwhelming it was to take on the Orc Champion’s attacks.", "Seol Jihu trembled. All humans possessed a primitive fear. Seol Jihu was no different.", "The Orc Champion’s consecutive axe-attacks, its wind-using ability, and its charging power…. As someone who had experienced them all, fear crept up inside Seol Jihu.", "A part of him wanted to dump everything onto Kazuki. Since he toiled away until now, he wanted to leave things to others and run away.", "But he knew he couldn’t. If he did, he would be no different than Audrey Basler.", "He was the one who convinced people to enter this place. He was also the one who agreed to send Chohong, their strongest fighter, to another team.", "Regardless of the process, he was the one who led 110 people into this place as a result. Thus….", "“Mister Kazuki.”", "He had to ‘repay’ what he received.", "“I can’t fight him for long. We need to settle it in one go.”", "Seol Jihu admitted inwardly — that he alone was incapable of handling this monster. He had to borrow others’ strength.", "“You want to go for the kill in one exchange?”", "“Yes. Can you create an opening?”", "Kazuki nodded before turning back to the Orc Champion. Seol Jihu seemed to have regained his composure as he calmly gazed at the Orc Champion, readying his posture.", "“…I can do it once.”", "Kazuki threw away his crossbow and took out a deep-purple longbow.", "“I used two shots to kill the Orc Shaman… so I only have one left.” He muttered as he nocked an arrow onto the long, pole-sized bow.", "Even while they were chatting, several people were risking their lives to buy Seol Jihu enough time to recover. There was no time to hesitate or waste.", "“Let’s go.”", "Kazuki aimed his bow.", "Seol Jihu bit his lower lip. Looking back, he had been too helpless. It was true that the Orc Champion was powerful, but he failed to bring out his full potential due to fear. From the moment they first crossed weapons, he got too intimidated and was busy running away.", "[Don’t forget. Training is a battle.]", "‘Sir.’", "Seol Jihu recalled Jang Maldong’s words and tightened his grip on his spear. He suppressed the mana wildly flickering around it.", "“Go!”", "Ping! The moment Kazuki let go of the bowstring, Seol Jihu shot forward like a ray of light. The arrow drew an arc in the air before gliding down like a bird.", "The Orc Champion was already enraged to the limit. No matter how many mayflies gathered together, in the end, they were just mayflies. But every time the Orc Champion tried to do something, the disk-shaped barriers blocked his attacks, frustrating him endlessly.", "Swish! With a short slashing sound, a chilling energy reached it. The Orc Champion glanced up before instantly jumping back. At a glance, it looked like the Orc Champion was trying to get out of the range of the arrow.", "From a common sense standpoint, it was impossible for a fired arrow to change its course. However, High Rankers had the power to alter common sense.", "The arrow hurling downward wiggled like a living creature just before it touched the ground. Next, like a swallow sailing up, the arrow drew a clear arc and chased after the fleeing enemy.", "After finally catching up, the pole-like arrow grazed the Orc Champion’s Achilles tendon, and Kazuki immediately shot past the Orc Champion while slicing its right shin. He had snuck forward while the enemy’s attention was drawn to the arrow and landed a perfectly timed attack.", "Clearly, he had planned out the entire move to restrict the Orc Champion’s movement.", "Thinking that he succeeded, Kazuki turned back to check. However, the Orc Champion wasn’t paying any attention to Kazuki or the arrow. It was only staring out front in a daze.", "Kazuki examined the monster once more. Now that he thought about it, he felt like the arrow missed its mark by a slight margin, and even his dagger had only cut him lightly.", "Next, when he saw the Orc Champion’s beast-like glare, Kazuki went “Ah!”", "The Orc Champion had not run back to dodge the arrow. It was the opposite. Knowing that Seol Jihu was aiming for it, it had cleverly fallen back to gain momentum and reduce the damage it received.", "The Orc Champion stomped down with its right foot, almost as if to sneeringly say, ‘Did you just find out?’ Then, it strongly kicked off the ground.", "‘Shoot!’ Seeing the Orc Champion leap forward like performing a long jump, Kazuki realized he made the wrong judgment.", "He shouldn’t have killed the Orc Shaman. Even though the Orc Champion would have been stronger, it was much better to have it in a state of madness. Now, while its physical prowess had been reduced, it had regained its intelligence.", "That wasn’t the worst part. If a monstrosity like the Orc Champion noticed Kazuki’s plan, it most certainly would have calculated its following moves. As if to prove this, it had already gone past the range of a Priest’s normal barrier. Now, only the disks could protect Seol Jihu.", "But the Orc Champion had been bothered by the disks the entire time. How could it not have put them into its calculations?", "Kazuki was filled with despair. The moment Seol Jihu entered the attacking range of the Orc Champion; he would die without a doubt.", "“FALL BACK!!”", "Kazuki shouted at the top of his lungs, but Seol Jihu was charging forward from the moment Kazuki fired his arrow. He had even used the final charge of the Festina Earring.", "And when the Orc Champion stopped retreating and suddenly shot forward, Seol Jihu was taken aback. He planned to chase after it and drill a hole in its chest with an Aura-infused thrust. However, the Orc Champion had closed the distance between them with a sinister smile.", "As if it knew what Seol Jihu planned to do, it was clearly saying it would finish him off.", "By the time Seol Jihu realized this, the Orc Champion was already making its move. It carefully watched where the white disks were being created and left leeway in its movements to change course.", "Seol Jihu still couldn’t read its attacks. However, he could guess what would happen next from the devastating wind pressure striking against him.", "His head turned blank, and his eyes also became vacant.", "“Ah….”", "Just when he thought, ‘This is it’….", "[Don’t forget. Training is a battle.]", "A calm voice brushed past his head.", "[Brat, stop trying to do things without a plan and use your head.]", "[I told you not to move from that spot. But I never told you not to move at all.]", "Seeing the Orc Champion’s right arm swinging down, Seol Jihu ducked to the left.", "[That’s it.]", "A sharp, prickling sensation grazed past him. The Orc Champion still had the same bored look it did before. After all, it had more than one weapon. And as if to say, ‘What’s the point of dodging?’ it swung down its other axe at the insect ducking down.", "In reality, Seol Jihu didn’t even know he barely dodged the first attack. And this time, he didn’t even have the chance to see the Orc Champion’s arm.", "But he intuitively knew that the Orc Champion’s attack wasn’t over. After all, he could see Kazuki running toward him with a frightening face, and more importantly, he was feeling a clear, prickling sensation on his neck.", "Seol Jihu’s head was empty. But just as he had learned and as his instincts led him… Seol Jihu instantly straightened his back halfway and ducked to the right reflexively.", "Swish!", "Could this be what it felt like to have a fiercely spinning chain-saw graze past oneself?", "[Good job.]", "As chills ran down the backs of everyone watching, Kazuki stopped running. A look of shock spread across his face, enough to make him forget everything.", "“What….”", "The first attack was one thing, but the second follow-up attack should have been checkmate. No matter how he saw it, it should have been impossible to avoid.", "Not only did the Orc Champion time it perfectly, but unless one had eyes behind their head, there was no way to tell which direction it was coming from.", "However, the young man had dodged it. He had crossed over with an acrobatic movement and avoided the attack by a paper-thin margin.", "Kazuki witnessed the entire scene, yet he was still full of doubts.", "It was as if the young man had moved ‘intuitively’….", "“Could it be?”", "Kazuki’s jaw dropped.", "‘He learned Intuition?’", "Even dodging Jang Maldong’s wooden logs ten thousand times might not allow one to obtain this ability. Even among the gifted, it was said that only a small minority could obtain this marvelous ability.", "If the onlookers were this surprised, how shocked would the involved parties be?", "The Orc Champion, who now had both its arms crossed downward, looked confused. Its first attack had been a feint to draw out the white disk. It hadn’t even considered the insect in front of it to dodge.", "While both friend and foe were in states of disbelief, Seol Jihu was also wrapped up in a strange sensation. To be precise, he was feeling the wind that touched him while he dodged the Orc Champion’s axes.", "Just like when he was floating in the lake and feeling the flow of the water, he mindlessly focused on the current of wind sweeping past him.", "[Flash Step is a technique in which you move instantly by using the elasticity that comes from bending your body like a bow…. Since it uses your entire body, you can say it’s closer to a body technique than a foot technique.]", "Coincidentally, his body had been bent.", "[The key is to consume minimal energy.]", "As if he was worried that this sensation would disappear, Seol Jihu roused his mana and controlled it subconsciously.", "Dividing one large stream into dozens of smaller streams, he evenly spread them through his veins and meridians. Soon, when the streams connected together like a well-woven spider web, Seol Jihu’s head shot up.", "Past his droplets of sweat, he could see the Orc Champion looking down at him. A refined light flickered from Seol Jihu’s eyes as he straightened his bent back.", "Boom!", "With an explosive sound, the spear Seol Jihu extended… no, his entire body shot forward.", "Kkudeeeeeuk!", "The Ice Spear penetrated the Orc Champion’s armor and dug into its side. The monster’s jaw dropped open.", "Festina Earring and the explosiveness of Flash Step. Since the attack even came from such a short distance, not even the Orc Champion could react immediately.", "When a sharp pain spread through its body, the monster grit its teeth rather than scream.", "Not yet. Although an unexpected incident occurred, it hadn’t lost. It could just endure an injury of this level. It still held onto its weapons, and the enemy was within its range. A weakling like a human should turn to meat paste if it just swung its axe.", "The Orc Champion tried to raise its battle-axe, but its arm lagged. Before it noticed, the giant man had wrapped his chain around it and was pulling on it.", "Keeeeeeeeu!", "Refusing to give up, the Orc Champion threw away the axe in its right hand and grabbed the spear stuck in its body.", "It was then… Suddenly, a blue spear filled its vision.", "BOOM!", "Blood spurted out from its nose. Seol Jihu’s Mana Spear had tilted its chin up, so much so that its helmet flew off.", "The Orc Champion even let go of the spear it held in its hand. With a near-dead huff, the monster dropped its head.", "In the next moment, the Orc Champion saw the Ice Spear flickering with blue flames.", "The Thrust.", "A truly clean and beautiful thrust unraveled.", "Psssh!", "The tip of the spear pierced through the Orc Champion’s solar plexus and exited through its back. The monster’s neck wriggled, and blood spurted out from its mouth.", "Strength escaped its lower body. Although its legs bent down, its fierce eyes were still alive. It no longer stared at the young man like some weakling. Almost as if to engrave the visage of the existence marking its end, the Orc Champion gazed at Seol Jihu swinging his spear.", "Soon….", "Its head separated from its body, shooting up into the air and then rolling on the ground.", "Seol Jihu drew heavy breaths while staring at the slowly collapsing corpse with widened eyes.", "Thud!", "The muscular body fell to the ground and created a small rumbling. The Orc Champion had finally fallen.", "And….", "Confirming the death of one of their commanders, the Orc Warriors became disarrayed. This couldn’t be helped. There was a clear difference between the Orc Warriors and the Orc Champions. Comparing them to a nation’s army, they were foot soldiers and generals, respectively.", "But the general receiving their absolute trust had just been executed by a mere thousand-man… no, a hundred-man commander. How could they not be shocked?", "Not only did they falter back hesitantly, but some even dropped their weapons.", "Kazuki clenched his fists. The moment Seol Jihu had dodged the Orc Champion’s second attack, goosebumps shot up all over his body and he could no longer hold himself back.", "“Seol…!!”", "He shot his hand up.", "“Carpe Diem’s Seol Jihu has defeated the Orc Champion!!!”", "And he shouted out loud."]}