{"cid": "255", "title": "Chapter 255. Fox, O Fox (1)", "content": ["The meeting concluded.", "Seol Jihu headed to the temple as soon as the discussions ended. It was to withdraw money from the storage.", "At first, he told Kim Hannah to take as much as she wanted from the storage, but she replied with a snort.", "The core of the second attack was money. The more money they had, the higher the chance of success would be.", "But Kim Hannah said they should still spend in moderation, criticizing Seol Jihu for thoughtlessly trying to spend all of the organization’s precious money.", "She didn’t forget to remind him to bring back only a modest amount. It was only after hearing an earful that Seol Jihu came to a realization — Kim Hannah wasn’t trying to help the Paradisians out of goodwill.", "She said her plan was to shake up the organizations’ main source of revenue — the nightlife business — but by the looks of it, that didn’t seem to be her ultimate goal.", "When she was talking to Seo Yuhui, each of her words really made it feel like she was aiming at the organizations.", "Although Seol Jihu couldn’t grasp what big picture Kim Hannah was ultimately drawing, he decided to sit back and watch the so-called Miss Foxy work her magic.", "After all, you couldn’t go wrong with listening to your mom.", "After arriving at the temple, Seol Jihu took out the 20 gold coins that Kim Hannah requested and an additional gold bar without hesitation.", "A gold bar was equivalent to 21 gold coins or 21,000 silver coins. On Earth, that would be worth hundreds of millions of won!", "Since each household had an average of 87 silver coins in debt, just this gold bar would be able to pay off 241 people’s debts, with a margin of error, of course.", "Kim Hannah was busy drawing up documents in her room. Dexterously moving her hand with a serious face, she put her pen down when she heard the door open.", "“You’re back?”", "Seol Jihu obediently put down the money pouch. After checking the contents, Kim Hannah smiled in satisfaction.", "“This should be more than enough as a deposit. It really is nice to be rich.”", "“Of course, it is. Who doesn’t like money? Just look at Miss Maria.”", "“No, stupid, I meant money gives us more options.”", "Simply put, they could only carry out this plan because they had ample wealth and could easily spare some. Otherwise, they wouldn’t even have dreamt of it.", "Seol Jihu smiled flatly.", "“Right, I didn’t think you’d fight with them using money.”", "“There’s no rule saying that battles have to be conducted with weapons. You can use words, money, or even law, religion, pen, and other things as well.”", "Kim Hannah recited a long list before suddenly looking at Seol Jihu.", "“But to tell you the truth, this can hardly be called a war. Because we’ll be pummeling them one-sidedly.”", "“One-sidedly?”", "“Think about it. Does our plan violate the law in any way?”", "Seol Jihu shook his head.", "“No, right? We’re giving out money to Paradisians who are drowning in debt. Who’s going to say anything about it? Sure, they might think we’re acting out of place, but that’s it.”", "“I mean, yeah, what we’re planning to do isn’t illegal, but if you only look at the outcome, our money will end up in the enemy’s hands.”", "What Seol Jihu said wasn’t wrong, but the corner of Kim Hannah’s lip curled up.", "“You haven’t seen the nightlife here, huh.”", "“What do you mean? We went together.”", "“I mean adult entertainment. Or you know, prostitution.”", "Kim Hannah continued with a smirk.", "“All products have a sale price, and that means there is a difference between the seller’s cost of acquiring products and the selling price, or basically what’s called a margin. And in Paradise, the adult entertainment industry has a high-profit margin. There’s a reason that organizations which favor profit above all, chose this industry as their main business.”", "This made sense. If the industry didn’t make much money, there would be no reason for organizations to operate and maintain them for years.", "“It’s not just about the profit margin. The reason the adult entertainment industry is so popular in Paradise is that it keeps a small-profit high-volume structure.”", "“They’re purposely making less profit?”", "“Yep. For adult entertainment businesses, you’ll get many customers even if you raise the price a little bit. These people generally won’t hesitate just because the price is slightly higher.”", "Seol Jihu nodded.", "“But doing that comes with a risk. The more money you make, the more you will have to pay the girls. Just think. What if their workers made dozens of silver coins every day? They’ll pay off their debts in no time and leave.”", "“So that’s why…”", "“They bring the girls in by inflating their debt, so they make them work cheap, controlling the price so that they can barely make enough to make ends meet. That way, the girls will work for them longer. After all, that’s better for them in the long run.”", "By the time the long explanation ended, Seol Jihu realized his mouth had gone dry and bitter.", "“Sometimes, I get Paradise confused with Earth.”", "“Obviously. These businesses are operated by people from Earth.”", "Kim Hannah snorted. At that moment, the door opened with a click, and a grey-haired man walked in. Kim Hannah put on her business smile that immediately brightened up her face.", "“Come in~”", "“…Excuse me.”", "Marcel Ghionea looked a little puzzled as he walked in with a big bag in his right hand.", "“You came back from the temple?”", "“Yes, just now.”", "“How was it? Did you confirm it?”", "Marcel Ghionea sighed before nodding his head.", "“What did Superbia say?”", "“‘Soon.’”", "“Iya~”", "Kim Hannah applauded.", "“Congratulations! And to you too, Jihu. You’ll have another High Ranker in your midst soon.”", "“I always dreamed about reaching Level 5… Now that I’m finally at the doorstep…”", "Marcel Ghionea looked confused, but not displeased.", "“I really didn’t expect it. To think you could get contribution points with this…”", "That was right. The second benefit Kim Hannah mentioned was contribution points.", "The team members were in disbelief when they first heard it, but Seo Yuhui personally attested to it, citing her personal experience.", "“Contribution points are the quantified representation of an individual’s influence on society. As the main objective of Earthlings is the extermination of the Parasites, war is the primary method of amassing contribution points. But if you look carefully enough, you’ll see that there are plenty of other ways.”", "“Earning contribution points with volunteer work… I thought it would apply only to Priests.”", "“That just goes to show you how desperate a situation Eva is in. The current relationship between humanity and the Federation is like that of teeth and gum. The VIP auction house and Royal Pattaya were harmful to this precious relationship.”", "Kim Hannah spoke clearly.", "“Not only did we eliminate this harmful cause, but we also prepared the foundation to restore the two parties’ relationship. On the grand scale of things, there is no reason for the Seven Gods to not approve of this as a contribution.”", "Kim Hannah gave a clear-cut explanation before throwing her gaze down. Marcel Ghionea handed her the sack of money without hesitation. Kim Hannah took it and checked the contents, her eyes widening instantly.", "“This much?”", "“I got a little greedy.”", "Marcel Ghionea spoke in a flushed voice.", "“Becoming a Level 5 is the dream of all Earthlings. It’s the same for me. If I can earn contribution points by attacking Eva’s organizations, I don’t feel that the money I’m spending is a waste.”", "“Looks like you know how to see far. Don’t worry, I’ll make sure you get the most out of it.”", "“Thank you.”", "Marcel Ghionea bowed before turning around and leaving. Seol Jihu watched him with a warm smile.", "‘Mister Ghionea is certainly worthy of becoming a Level 5.’", "The Archer of Steel already had a reputation for having high combat prowess. Other organizations and teams must have known he was close to becoming a Level 5, for them to have gone recruiting him as soon as he made his return.", "Seol Jihu felt elated knowing that Carpe Diem would soon have another High Ranker. And before his happiness could subside, the door opened once again.", "It was Chohong.", "She held up a money bag.", "“I’m here to buy contribution points.”", "She wasn’t the only one.", "“You’re here too, Hugo?”", "“Yeah…”", "“What did she say?”", "“She told me I’m doing well and that I should work hard just a little more…”", "Hugo spoke quietly with reddened cheeks.", "“Ira always said, ‘You think you’re good enough to be a High Ranker?’ To think a day would come when she would encourage me…”", "Hugo came in after Chohong left and placed down a money bag. It had a sizable amount as well.", "Phi Sora was next, followed by Jang Maldong and Seo Yuhui, who also chipped in.", "The opportunity to earn contribution points so safely didn’t come by often, so everyone was very generous. Even the money-grubbing demon was persuaded by Kim Hannah.", "“Y-You too, Miss Maria?”", "“What’s up with that unbelieving face? Are you that shocked?”", "Grumbling, Maria scurried inside.", "“A Priest’s job is to heal injured people. Pain doesn’t necessarily translate to injuries. If donating money can relieve Paradisians of their pain, I don’t regret it one bit.”", "It was a lie, and such an obvious one, at that.", "Although she was mumbling like she was some virtuous, altruistic person, her hand was shaking violently as she handed over the money bag.", "It was clear she made proper calculations before painfully giving away money. After all, her value would skyrocket once she became a High Ranker Priest.", "“Unni, let’s not skimp out.”", "“Yeah, yeah, just let go of your hand.”", "“I really brought it to be used for a good cause. If you pocket even a single copper coin, then you’re really the bitchiest bitch of all bitches.”", "“I got it, so let go! Why are you holding on so tightly?”", "“You see my name here? Take a good look.”", "Just like she said, the money bag had the name ‘Maria Yeriel’ clearly written on it. With how tightly Maria was holding onto the bag, Kim Hannah quickly got annoyed.", "“You know what, keep it. If you can’t trust me, you can do it on your own. Do you think I’m some beggar?”", "“No, no, I’m just making sure.”", "Maria finally loosened her hand. Kim Hannah clicked her tongue.", "“How much did you even bring?”", "“Alright, see ya!”", "As Kim Hannah was about to look inside, Maria quickly flew off, running away so quickly that Seol Jihu doubted if she had her own Festina Earring which she used three times.", "After checking the contents of the bag, Kim Hannah burst out laughing.", "“Fucking lunatic.”", "Then, she suddenly turned serious.", "“I was wondering why it was so heavy. What a joke!”", "“?”", "“That bitch, she’d come to a 100,000 won per person wedding, eat to her heart’s content, and run away after giving an envelope of 5,000 won filled with nothing but 10 won coins.”", "Kim Hannah cursed Maria out before shaking her head.", "“I’m not inviting her to my wedding, that’s for sure.”", "Well, just like that, Carpe Diem gathered quite a sum. After counting the amount, Kim Hannah was astonished.", "“Wow… we’ll easily pass a thousand people with this…”", "She then calculated the funding for livelihood support, buying food, and paying off debts.", "Seol Jihu snooped around, wondering if he could help, but hearing a, ‘Don’t bother me and go play outside,’ he rolled around on Kim Hannah’s bed.", "“Perfect. This is enough.”", "Soon, Kim Hannah put her pen down and stood up. Looking at Seol Jihu, who had his face buried in her bed, she frowned.", "“What are you doing?”", "“It smells nice.”", "“Are you a pervert?”", "“No, seriously, it has a nice fragrance. My bed doesn’t smell like this.”", "“Listen, you creep, stop smelling my scent and help me carry these bags. We have to go to the palace.”", "Seol Jihu raised his head slightly.", "“The palace? Why?”", "“To say, ‘We’re here to give you good news~’”", "Right, that wasn’t something Kim Hannah could do alone. And Sorg Kühne would surely welcome them with open arms, even helping them out greatly.", "Seol Jihu hopped off the bed, picked up the money bags Kim Hannah separated, then said.", "“Oh yeah, there’s something I’m curious about. Ah, don’t misunderstand, I’m really curious.”", "“So you’re finally asking.”", "Kim Hannah picked up her jacket, talking like she knew what the question would be.", "“With this money, we’ll first—”", "“You said a wedding, right?”", "The hand straightening the jacket paused.", "“Do you have a boyfriend to get married to?”", "Kim Hannah spun back and kicked Seol Jihu’s shin.", "*", "Eva’s nightlife scene was booming as always. There were many reasons why Earthlings frequented Eva’s nightlife scene, but the biggest reason was that this was Paradise.", "There was no Internet and no computers. There were no electronic devices, which were omnipresent on Earth. As an entirely new world, Paradise’s culture and products often captivated the attention of Earthlings who just entered.", "But just like on Earth, new things would quickly lose their novelty as people got more familiar with them. Not only did leveling up become more difficult with each level, but the price of good equipment also skyrocketed.", "There was naturally a limit to how Paradise could remain attractive to Earthlings.", "They were also stressed out by the repeated battles with no way to relieve this stress. The only way really was to gather together at a pub and drink.", "What appeared at that time was adult entertainment. With this development, not only did Earthlings drink alcohol, but they also enjoyed many other things, such as showing off and fulfilling desires.", "Businesses that Earthlings were already familiar with, paired with exotic women of another race and cheap price — it was truly the recipe of a gold mine, drawing Earthlings’ attention endlessly.", "King Corona.", "It was the name of a famous adult entertainment business in Eva. As a business with over fifty Paradisian women, it was considered a midsized adult entertainment business.", "However, the head manager, who was in charge of operating King Corona was pacing out anxiously today. As if they had made a promise beforehand, 52 women working at the place had not shown up.", "Although he was happy at first, thinking he could force the latecomers to cough up fees, his face turned red after a couple of hours.", "Customers endlessly walked in, but he had to send them out due to the lack of ladies.", "‘Did these bitches all get high together?’", "In the end, he sent out his men.", "To drag them over, even if they had to beat them up.", "One manager chased out to the streets quickly went to one of the girl’s house, grumbling.", "‘Fuck, did they commit group suicide or something? Otherwise, how could they all be missing?’", "These things happened from time to time in this line of work. Paradisian women who couldn’t endure the humiliation and intense labor committing suicide often happened.", "But the manager’s worry disappeared when he arrived in front of a dilapidated house. Looking through the cracked window, he saw a woman eating dinner with two children, full of laughter.", "The manager immediately jumped in rage.", "“This bitch!”", "Pang! As he kicked the door open, the three people inside turned their heads in shock.", "“What are you doing? Breaking open someone else’s door.”", "“Someone else?”", "The manager scoffed.", "“Bitch, did you finally go crazy? Why aren’t you at work?”", "“I was going to go after I gave the kids their dinner.”", "The two children looked up in worry. The manager shook his head and beckoned her to come.", "“Whatever. Hurry up and put on your clothes. The head manager is furious.”", "“No.”", "“What?”", "“I refuse to continue doing that revolting work.”", "“…Ehew.”", "The manager sighed. This happened from time to time. Women who didn’t know their place and spoke up with a why-don’t-you-kill-me attitude. Having experienced it multiple times, the manager wasn’t fazed in the least.", "“I’ll say it just once. Put on your clothes and come.”", "“I said, no.”", "“Oh yeah?”", "The manager snorted, stomped forward, then grabbed the woman by her hair. It was then.", "“Uk!”", "He faltered backward. The woman had pushed him away when he grabbed her hair.", "“You…!”", "The manager’s eyes widened. She was supposed to crawl once he threatened her a little. What was going on?", "“Did you actually go crazy?”", "“Get out.”", "The woman glared at the man with hatred in her eyes.", "“I said I was going to go in a bit. If you don’t leave, I’ll call the guards.”", "“The guards?”", "The manager laughed dumbfoundedly.", "“Aigoo~ I was wondering what gave you the guts. Guards? Alright, call them. Call them now!”", "“….”", "“Looks like you don’t understand your position. Listen, you’re in debt. Don’t you know that?”", "“…I do.”", "“We waited for years for you to pay up, but you didn’t. Then, shouldn’t you work to pay it off?”", "“.…”", "The sound of her gritting teeth frighteningly rang out.", "“You’re only going to make things more difficult for yourself by calling the guards. Let’s see, you’re debt is…”", "Snickering insidiously, the man reached into this pocket to take out a contract. It was then.", "Pak. A small shock struck his chest.", "The manager reflexively grabbed what fell down from his chest, blinking his eyes in confusion. Judging by the clanging sound, it seemed to be a money pouch.", "“…Money?”", "Checking the inside of the pouch, the manager’s jaw dropped. Seven white-silver coins and a handful of copper coins. It was the exact amount that the woman owed.", "“You…”", "“There. The debt’s paid off.”", "“H-How…?”", "“Give that here.”", "She snatched the contract out of the manager’s hand and tore it into pieces. She must have been harboring a lot of resentment as she ripped the paper over and over again until it turned to dust.", "Then, she threw it at the dazedly standing manager’s face.", "“Happy? Get out with your money. Now.”", "“Y-You bitch…”", "“Don’t call me a bitch! I don’t owe you guys any money now. I no longer have anything to do with you!”", "She screamed with pent-up resentment. The fuming woman took in a deep breath and muttered.", "“You want me to call the guards?”", "“You, no, hey, what are you gonna do from now on—”", "“That’s none of your business! Now get out! I don’t want to see you ever again!”", "The manager was chased out of the house, unable to say a thing.", "Boom! The door slammed shut behind him.", "“What the hell happened…?”", "In the end, he could only leave absent-mindedly. That wasn’t the end.", "When he returned to the shop, he saw his colleague coming from the other side of the street. He was also trudging back with a pouch, his expression still in shock.", "At that moment, a loud ruckus erupted from the distance before a group of guards cut through the streets. The two managers both stared at the guards at a loss for words.", "But today’s matter was only the beginning. The day after the 52 women paid off their debts and quit, an additional 106 women did the same. 214 women the next day and 436 the day after that. Then to all of the adult entertainment managers’ surprise, 873 women paid off their debt the fifth day.", "In just five days, 1,681 women had paid back what they owed and became free of debt.", "But as if that wasn’t enough, more and more women quit working in the adult entertainment industry every day and left. It was almost as if a grand scheme was unfolding before their eyes.", "All the managers and owners of these adult entertainment businesses couldn’t tell whether they were lost in their dreams, but they soon realized this was happening for real.", "In the past, they had to turn away customers who came late, but the number of customers plummeted. Without any prostitutes, it became impossible for them to do business.", "What was once a bustling nightlife scene, turned desolate with only flies flying around.", "A few head managers decided to be patient. Although they didn’t know where the women got their money from, they were relaxed, confident that they would come back once they got hungry.", "They were certain that the women would return to borrow more money.", "That was when a strange rumor began to circulate."]}