{"cid": "165", "title": "Chapter 165. Struggle (4)", "content": ["Thwack! A heavy sound strong enough for Seol Jihu to flinch burst out.", "Oh Rahee’s head dropped down and almost touched the ground.", "“…You motherfucking whore.”", "Oh Rahee managed to raise her head, even in that state.", "Phi Sora’s foot, as if it had been waiting for this, kicked Oh Rahee’s cheek powerfully, and Oh Rahee was sent flying with a 90-degree spin.", "Crash! Oh Rahee rolled on the floor.", "Having witnessed a legendary foot face slap, Seol Jihu’s jaw dropped.", "“…You.”", "Phi Sora spun her ankle with a face that couldn’t be more apathetic even if it tried.", "“Lose my house and equipment? Is that something you should say to me, your Unni, in my current situation? Shouldn’t you say some consoling words instead?”", "Oh Rahee grit her teeth with glaring eyes.", "“Unni, my ass.”", "“Why? Why do you always act smart when you know you’ll just get beaten up? Mm? Answer me, Rahee.”", "Oh Rahee spat out blood.", "Seol Jihu snapped out of his daze as a roar of laughter burst out. Even though their leader was being beaten, the members of Blood Line were laughing their asses off.", "“Those two fight whenever they see each other.”", "“Do you think we’ll finally get to see some blood? What was the win-loss again?”", "“5 wins 11 losses. Rahee Unni’s losing.”", "“Huh? The difference got that big?”", "“It was about even at first at 5 wins and 5 losses, but Sora Unni suddenly just sort of awakened and won six times in a row.”", "While a rather unbelievable conversation was unfolding, Jang Maldong walked in.", "“What’s all this ruckus about?”", "The appearance of Paradise’s legend and elder made the room fall completely silent.", "Oh Rahee quietly got up from the floor. Phi Sora also retracted her foot. Then….", "“She provoked me first!”", "Like a snitching child, she pointed at Oh Rahee who was dusting herself off.", "Jang Maldong glared at Phi Sora silently before turning to the woman who had regained her straight face and perking up his eyebrows.", "“…It’s been a while.”", "“….”", "“I heard a partner group would come…. Did you come to Haramark?”", "“…Yes.”", "Oh Rahee pushed back her disheveled hair and answered softly.", "“I see. Well, take care of yourself.”", "Hearing this, Oh Rahee closed her eyes gently before nodding her head slightly.", "“You guys can talk. And you follow me. Stop bothering them.”", "“Ah! Grandpa!”", "“No complaining! Get over here!”", "Jang Maldong shouted angrily before walking to the door and opening it.", "“Damn it!”", "Phi Sora grumbled and loudly stomped off with Jang Maldong.", "Once the storm passed by, Oh Rahee let out a deep sigh.", "“Is that person also a part of your team?”", "“Temporarily, yes. There’s a war coming up, after all. Anyways, are you alright?”", "“I’m fine. And judging from what I just saw, it doesn’t look like I have anything to worry about.”", "Seol Jihu blinked his eyes. She didn’t have anything to worry about what?", "“Geez, her temper really doesn’t go anywhere.”", "Oh Rahee rubbed her cheek and grumbled.", "‘Could it be?’", "Was that their form of greeting? Verbal abuse and a foot face slap?", "[Is the Old Man doing well?]", "Now that he thought about it, Oh Rahee seemed to know Jang Maldong. And just now, she had clearly shown signs of being uncomfortable around him. Naturally, Seol Jihu became curious about Phi Sora and Oh Rahee’s past with Jang Maldong.", "“Have you found a place to stay? If not….”", "So, he brought up the problem of lodging to offer them a room and hear her out later on. However….", "“Yeah.”", "“Ah, then what about registering at the palace?”", "“We already did that too.”", "As expected of a professional mercenary, Oh Rahee had already taken care of the necessary process.", "“We’re not novices in this field…. Ah.”", "She spoke in a businesslike tone before putting on a smile as though she just remembered something.", "“Princess was really happy.”", "“Princess Teresa?”", "“We went to register. When we said we came under Carpe Diem’s introduction, she was rea~lly happy. I thought I was looking at a maiden in love.”", "This made sense. Given how happy Teresa was when just Phi Sora registered to join the war, how could she not be elated with a skilled mercenary team coming to participate?", "“A princess and a prince. It’s almost like a scene from a fairytale. You two are a good match.”", "Oh Rahee snickered before turning back.", "“You’re leaving already?”", "“We came today for a formal greeting. We’ll be back on the day the army sets off, so don’t worry.”", "Leaving behind these words, Oh Rahee left with her teammates. Seol Jihu saw them off until the stairs out of courtesy before returning back to his room.", "“Huaa….”", "The moment he threw himself on his bed, the sigh he had been suppressing until now escaped.", "Everything that happened in the past few days brushed past his head.", "Because of the do-or-die training at Huge Stone Rocky Mountain, he had made great strides in his strength.", "To increase his comrades’ combat potential, he had even given out most of the equipment he had.", "…Right, it could be said that Seol Jihu did everything in his power.", "Almost to the point that there wasn’t much more he could do.", "But as he glared at the poor ceiling above his head, his eyes kept narrowing progressively.", "‘Why…?’", "Why did he feel like it wasn’t enough, the more he prepared for the war?", "He was trying to look bright and hopeful on the outside, but unknown uneasiness and anxiety kept creeping up his body.", "It wasn’t just his feeling.", "[Something’s strange.]", "[I don’t like the way this is going.]", "[I agree.]", "[I don’t have a good feeling about this.]", "Everyone who had been active in Paradise for a long time was worried.", "There wasn’t a clear reason. But Seol Jihu was tormented by the thought that everything he’d prepared so far was just a futile struggle.", "‘The Seven Armies.’", "Seol Jihu smacked his lips for a long time before raising his upper body.", "Sitting cross-legged, he began to circulate his mana.", "‘There’s only one thing I can trust….’", "Even if he couldn’t be of help to his comrades, he couldn’t hold them back.", "Thinking so, Seol Jihu concentrated on melting down the stored energy in his body.", "Otherwise, he felt like he couldn’t forget this constant sense of anxiety.", "**", "Scheherazade.", "At Sinyoung Headquarters, a man was having a one-on-one meeting with a woman.", "“Now this is interesting.”", "The woman waved the paper containing a report and laughed nonchalantly. Although she left a cold first impression, she seemed to know how to laugh brightly as well.", "She was wearing a simple black tunic top and a soft silk gown. Although her legs were covered by her airy skirt, a pair of slender legs were revealed beneath it.", "This was Yun Seohui, Sinyoung’s Executive Director and Yun Seora’s older sister.", "With an elegant flick of her hand, she took a spoonful of sherbet from a transparent crystal cup.", "Nibbling with her mouth, she glanced at the report once again and nodded her head with a hum.", "The man cupping his hands and standing politely in front of her looked as if he was indescribably uncomfortable.", "Observing the actions of the woman in front of him, he noticed how controlled and graceful they were. These had to be habits ingrained into her from the education she received at a young age and her experience in commanding people.", "Although her words sometimes didn’t match her actions like just now, the man didn’t think it was anything strange.", "Her face was the same. Despite having ice-cold facial features, she had rich expressions.", "She had practiced them without a doubt, but never mind looking artificial, they looked more genuine than the authentic ones.", "But something felt off. It was almost like she was wearing clothes that didn’t fit her.", "This invisible sense of incongruity was the reason the man felt nauseous whenever he stood in front of Yun Seohui.", "Of course, he didn’t show any of this on the outside and did his best to smile.", "“Thank you. I’m happy that you liked it.”", "“I loved it. This is exactly what I wanted. It’s not formal and static, but full of vitality and vividness… Am I right in thinking that you heard and wrote this yourself?”", "“That’s exactly right. It came from an Archer named Lara Wolff.”", "“Lara Wolff?”", "Yun Seohui’s eyes widened before blinking repeatedly. If someone unfamiliar with her saw this, they would smile inadvertently.", "However, the man swallowed hard.", "“She completed Stage 1 and 2 of the Banquet. She said she owed a great debt to Seol Jihu.”", "“Oh~? Yet she sang like a bird?”", "“She showed signs of being wary at first. But when I told her Seol Jihu was Sinyoung’s employee and that this report would be used as a reference for the September evaluation, she did her best to place him on a pedestal.”", "“Wow! And it would have been perfect if you said she needed to speak truthfully and in detail to assess him fairly.”", "“And that’s exactly what I did.”", "Yun Seohui grinned. Seeing that she seemed happy, the man carefully spoke up.", "“Um… Executive Director Yun.”", "“?”", "“There is a meeting with the royal family soon. President wanted you to think about the matter carefully….”", "Resolving the reinforcement requests from six other cities was Scheherazade and Sinyoung’s top priority. The man was taking a roundabout way to say that they had no time to worry about Seol Jihu’s past deeds.", "“I know. That’s why I’m reading this.”", "Her frail finger flicked the paper in her hand. The man fixed his posture and stood tall.", "Yun Seohui had a habit of acting playfully whenever she was relaxed. Although she sometimes said things that only she seemed to understand, nothing she said was nonsensical.", "“Manager.”", "Hearing Yun Seohui call him, the man became nervous to his bones. He would need to concentrate strongly if he wanted to understand even a tiny bit of what she was about to say.", "“Would you like to make a bet with me?”", "“A bet?”", "“Yes. Betting on whether the Parasites’ Seven Armies will show up in Haramark or not. How about it?”", "“T-The Seven Armies?”", "The man stuttered.", "“I’ll bet on them coming. At least one, perhaps even two.”", "“But the Federation is preparing for a frontal assault…. If they did that, wouldn’t they lose control over Tigol Fortress, which they spent so much effort to conquer?”", "“Generally speaking, yes. But~ this Parasite Unni acts a little random sometimes.”", "A look of confusion brushed past the man’s face. Yun Seohui had to be the only person in Paradise who referred to the Parasite Queen in such a friendly manner.", "“Sometimes, I imagine. What if I were the Parasite Queen? What would I do to conquer this world? …Then, I often find myself thinking the same thing Unni does.”", "The man looked like he didn’t know what to say or do.", "“Did you know? That there has been a strange common point every time the Parasite Queen led the Seven Armies to attack the human forces.”", "“A common point?”", "“Yes. A secretive common point between Parasite Unni and me.”", "The man nibbled on his poor lips. Perhaps liking this reaction, Yun Seohui interlocked her fingers and made a pleased smile.", "“I might chuck it up to coincidence if it happened once or twice… but she’d always kill the children I have my eyes on. She would either Parasitize them and take them, or cleanly murder them.”", "“Is, is that true?”", "The man’s tone went up.", "“Yes, of course, it is.”", "Answering with a clear voice, Yun Seohui crossed her arms. Her gaze went up to the ceiling.", "“Who was it again? Ah, right. Marika Larisa. You’ve heard of her, right?”", "“The Magician from Romania? She was famous in the past when she was together with the Archer of Steel.”", "“Right. I was eyeing her because she was the only Magician who wielded photons rather than the elements, but Parasite Unni took her from me. By commanding Vulgar Chastity, that is.”", "Yun Seohui crossed her legs and shrugged.", "“It wasn’t just once or twice that this happened.”", "“Then… this is war is….”", "“Seol Jihu. His reputation has spread across Paradise lately, hasn’t it? This is what I think.”", "The man looked as if he found this hard to believe. If Yun Seohui wasn’t the one telling him all this, he would have snorted and turned his back on such nonsense a long time ago.", "“But, even so… Tigol Fotress is on the line….”", "“Well, we’ll find out. The question is what we should do.”", "The man organized his thoughts before speaking.", "“Executive Director Yun, if things are as you say, then can’t we call Seol Jihu to Scheherazade? We can come up with a good reason.”", "“Then Parasite Unni’s blade will be directed here. Although we might be in a safe position now, it won’t be a final solution.”", "“Then why don’t we just leave things be?”", "“?”", "“You see… just as you say, Seol Jihu’s position is going up by the day. Although this is my personal opinion, it might be difficult for us to do anything about that at this point….”", "At that moment, his eyes met Yun Seohui’s. Seeing her cold gaze, goosebumps shot up on his back.", "Her sharp eyes curled to the shape of a crescent moon.", "“You bring up an interesting point.”", "“….”", "“You’re right. I didn’t expect his rate of growth to exceed even Sung Shihyun. Well, it’s partly thanks to Director Kim Hannah doing a good job masking him… but anyway, it’s true that he has gotten more difficult to control. You are certainly correct about that.”", "Hearing this, the man finally let out the breath he had been holding in.", "“But is there a need to control him?”", "The sharpness in Yun Seohui’s expression slowly loosened.", "“If we can’t force him to come to us, we just have to make it so that he comes to us himself.”", "As Yun Seohui relaxedly fiddled with the report, her head slowly tilted back, and her black hair reaching her butt drooped down further.", "“I told you. That it’s interesting.”", "Putting the report paper against the light in the ceiling, she made a reserved smile and laughed inaudibly.", "“His actions all have a clear cause and effect. And because of that, it’s clear who his enemies are. Without his brain being made up of the law of causality….”", "She snickered and looked back at the man standing awkwardly.", "“Aren’t you curious?”", "“Pardon me?”", "The man muttered like a fool.", "“What would Seol Jihu do if we erase an undeniable debt he owes us?”", "“Undeniable debt…?”", "“Isn't that obvious given the situation? I’ve decided.”", "With a bright smile, Yun Seohui stood up.", "“Let’s go.”", "“You’re going to the conference room?”", "“I have to convince Father before I go. And the Executor as well. Ah, right—”", "Yun Seohui skipped to the door before suddenly stopping. Then, she looked back at the slightly exhausted man and asked.", "“How is the Daughter of Luxuria doing lately?”", "*", "Same time.", "In Scheherazade’s Temple of Luxuria, many people were gathered and causing a commotion.", "To be more precise, Earthlings were gathered in groups on the way to the portal, whispering to each other.", "“What? That person is also going back? I thought she returned.”", "“It doesn’t matter, right? It’s not like an emergency draft call has been issued for us.”", "“But she’d usually….”", "Seo Yuhui cut through the gate pathway while enduring the gazes of dozens of people. Then, she disappeared into the portal.", "Flash! With a burst of light, the scenery changed.", "Having returned to Earth, Seo Yuhui let out a soft sigh. Looking around at the familiar room, she grabbed her phone from the top of the drawer and quickly punched in the numbers.", "Trrr, trrr… It seemed like the dial would last for a while, but it suddenly cut off.", "—Yes?", "A voice mixed with an electronic sound came out. Seo Yuhui closed her eyes.", "After a moment of hesitation, she took a deep breath and opened her mouth.", "“Please help us.”", "After a long silence…", "—…Tell me the details.", "A tranquil voice flowed out.", "*", "Seol Jihu’s complexion looked better than one might imagine. It wasn’t that he was no longer feeling worried or anxious. It was because he heard good news.", "Two, in fact.", "First was that Seo Yuhui became the second Level 8 in the history of Paradise. Because he knew about this and expected the advancement to go smoothly, he could accept it without being too shocked.", "But what surprised him the most was Scheherazade announcing that they would mostly reinforce Haramark and even declaring an emergency draft call.", "Seol Jihu wondered if Yun Seora had a hand in this matter, but from the newspaper that the assassin group got him, all evidence was pointing towards Sinyoung’s Yun Seohui.", "Evidently, she had strongly suggested that Haramark was likely to become the main battlefield and had served a pivotal role in making the Scheherazade Royal Family form their decision.", "But not stopping at that, she apparently had pleaded for all Executors other than those of the three missing positions to gather.", "‘Yun Seohui….’", "That was Yun Seora’s older sister. Seol Jihu didn’t know why she chose to help Haramark specifically, but he couldn’t help but feel grateful given the situation.", "While he couldn’t be sure, with four Executors coming to Haramark, he felt the war wouldn’t be so bad.", "And thus…", "The morning to march on to Arden Valley finally dawned."]}