{"cid": "420", "title": "Chapter 420. If a Different Choice Was Made (1)", "content": ["Strange mana suddenly crept up on his body. It was as if an invisible wave penetrated through him.", "Just as Seol Jihu and Yun Seohui shut their mouths from the odd sensation…", "Woong!", "A short but imposing noise resounded over the area.", "Next, white light began to glimmer in their line of sight. The streetlights illuminating the city flickered crazily as if they had gone mad.", "Moreover, terrifying energy could be felt rising up, one that seemed to be on the verge of bursting out of Scheherazade’s deepest area.", "Feeling a frightening pressure, Seol Jihu and Yun Seohui subconsciously moved backward.", "In the next moment…", "Flash!", "The world in their eyes was dyed white.", "At the same time, Seol Jihu faintly saw a pillar of light soaring up to the sky from the center of Scheherazade, spinning in a spiral and rippling out far and wide.", "By this time, the area had turned into a strange space where no sound could be heard.", "Meanwhile, the light expanded its domain fast and wide, breaking through the city wall and rushing outside.", "In fact, it only took a second for it to cover the area where Seol Jihu was standing.", "“Keuk!”", "The light touched his body. He didn’t feel any killing intent or harmful energy. He was only pushed back.", "The light pushed Yun Seohui and Seol Jihu out as if it would not let anyone into its sacred land. A few corpses that made their way out of the city were pushed further out.", "The light didn’t stop spreading until Seol Jihu was pushed 50 meters out.", "When Seol Jihu narrowly grabbed hold of himself, he instinctively raised his eyes. His breath paused.", "A massive, seemingly endless barrier exuding a powerful holy power that made one’s skin tremble surrounded Scheherazade in a grand manner.", "“….”", "Seol Jihu’s expression contorted as he looked at the city.", "[There are two powers lying dormant inside Scheherazade…. No, it would be more correct to say there is one power split into two stages.]", "[The first stage activates a mechanism that turns the entire city into a special territory, and the second stage releases the power of god stored in Gorad Boga to form a powerful barrier that envelopes the city.]", "…Right, the second level of Gorad Boga had activated.", "‘How?’", "The first stage might be activatable, but it shouldn’t be so easy to release the power of a god.", "Did Roe Scheherazade use the Royal Oath? Otherwise, how could she have activated the second stage?", "‘…Damn it.’", "Seol Jihu furrowed his brows. Looking back, there were quite a few existences inside Scheherazade that were bestowed with divinity. If the first stage served as a preparatory step, activating the second stage might not have been so difficult.", "Despite having doubts, Seol Jihu dropped that line of thought and raised his spear.", "He cut and slashed madly, but the barrier did not budge. Never mind a crack, not even a tiny ripple billowed out.", "It bounced off all of Seol Jihu’s attacks as though they were comical.", "Seol Jihu gritted his teeth and retracted his spear. He could tell the situation was getting out of hand, but there was nothing he could do.", "‘Should I have stood my ground…?’", "He regretted belatedly but shook his head shortly afterward.", "Even if he stayed inside, he would have been pushed out by the barrier anyhow. He might have been slammed into the city wall or pushed out through the city gate if he was lucky.", "How much time went by?", "Baek Haeju, Kazuki, Phi Sora, and Hoshino Urara rushed to Scheherazade at a frightening speed.", "They had jumped out of the carriage and raced to the city with the aid of mana because they were worried about Seol Jihu.", "They were confused when they saw Seol Jihu standing in a daze but stopped after seeing the giant barrier.", "Phi Sora, who was running in the sky with Pneuma’s Sky Boots, almost fell down in shock when she saw Scheherazade.", "Once some time went by, the remaining Valhalla members arrived.", "Their reaction was no different. Once they arrived at the city, they stared at the vast barrier with dumbfounded faces.", "“W-What the hell happened?”", "“Seol! What’s up with the city? What happened here?”", "Chohong and Hugo asked in a fluster.", "“Gorad Boga….”", "Seo Yuhui looked back and forth between the huge barrier and the dazedly standing Seol Jihu before closing her eyes and biting her lower lip.", "It was then.", "A group appeared above the city wall.", "Including the brutally beaten Vulgar Chastity, Twisted Kindness, Exploding Patience, and Abhorrent Charity were there too. To top it off…", "“Yooooo~! Beautiful morning! If you’re asking how my day’s going, that is~”", "Sung Shihyun was there too, acting just as cocky as always.", "Seol Jihu gulped unnoticeably as he looked up at the city wall.", "There were five Army Commanders.", "Since only six Army Commanders remained in Paradise, it sufficed to say that almost all of the Parasites’ elite forces were invading the human territory.", "But it was still too early to be surprised.", "Soon, Seol Jihu saw a woman skipping up to the city wall, butt-naked. She looked down and smiled brightly.", "It was Roe Scheherazade.", "What Seol Jihu had been worried about the most came true.", "“Hello. It’s nice to see you again.”", "Roe Scheherazade spread her arms out and gently waved her hand.", "When Seol Jihu glared at her with his mouth tightly shut, she tilted her head and raised the corner of her mouth.", "“I thought you’d be surprised…. As I thought, you found out.”", "“….”", "“I guess I might have been in trouble if I was a little late. How lucky~”", "Roe Scheherazade covered her mouth and laughed gracefully.", "“…Roe Scheherazade.”", "Kazuki, who was watching with hawk-eyes, calmly asked.", "“Is this your doing?”", "A loaded question came out.", "However, Roe Scheherazade…", "“Yes.”", "…answered without the slightest hesitation.", "Almost as if she was proud.", "By now, most of Valhalla’s members realized what was going on. That Roe Scheherazade had helped the Parasites invade and conquer the city.", "In other words, she was a traitor.", "“Why?”", "“Why? Well…”", "Roe Scheherazade pushed her lower lip up with her finger and rolled her eyes.", "“I guess you can say it’s to avenge my husband.”", "“Avenge your husband?”", "“Yes, my husband was killed by the Earthlings, you see.”", "Roe Scheherazade spoke with clarity before looking down at Yun Seohui, who was sitting on the ground.", "Yun Seohui shook her head with a sour look.", "“There’s no need to pretend to be oblivious. Well, you weren’t the executive director back then, so I’m sure you weren’t the one responsible for giving the order. Still… you knew about it, didn’t you?”", "Everyone’s gaze fell on Yun Seohui.", "“I, I didn’t know.”", "Yun Seohui stuttered.", "“I was only told one day that Gairos Scheherazade was poisoned to death…. In the first place, there’s no proof Sinyoung was behind it!”", "“Fufu, still acting so shameless. Do you want to know how I found out?”", "Roe Scheherazade smiled gently. She took off the necklace hanging on her neck and raised it up for everyone to see.", "“I’m sure you all know what this is. It’s the Royal Oath you coveted so much.”", "“….”", "“The day we decided to serve the Seven Sins, they bestowed two Royal Oaths to the Scheherazade Royal Family. One to my husband and one to me.”", "Roe Scheherazade continued.", "“The day my husband was poisoned to death… a powerful divine protection was cast on me.”", "A divine protection? Seol Jihu doubted his ears.", "“It came as a total surprise. Shocked after hearing of my husband’s death, I went to the temple, thinking that the divine protection was somehow related. And this is what the Seven Sins told me.”", "Roe Scheherazade cleared her throat.", "“My husband, Gairos, used the Royal Oath to protect my life, to not let my Royal Oath get stolen, and to not have me suffer the same fate he did….”", "Seol Jihu finally understood why his Innate Ability didn’t work on Roe Scheherazade. It was because she was bestowed with the power of god, just like an Executor.", "“Back then, I never thought you guys were the perpetrators. I’m sure Gairos thought the same with how you handle such matters.”", "Roe Scheherazade took a light breath…", "“But… did you know?”", "…and then said suggestively.", "“One day, while you guys were running around ransacking every corner of Scheherazade to find the perpetrator… one of your executives came to my room, his cheeks red from intoxication.”", "Strength entered Roe Scheherazade’s voice.", "“And while he was raping me, a widow, who was crying from the sorrow of having lost her husband… he had a slip of the tongue.”", "Her voice trembled as she became more incensed.", "“I still remember it vividly. He was pulling my hair and whispering into my ear, *Damn Gairos, you should have just handed it over! Now that it’s come to this, I’ll make your wife hand it over herself!”", "Realizing how heated she had gotten, Roe Scheherazade collected her breath and then continued calmly.", "“As proof, you all have stopped demanding the Royal Oath after Gairos died. Though you were acting like you were sorry, it was because a restriction was placed on you, no?”", "Yun Seohui’s face paled.", "A heavy silence descended.", "The entire city was dead silent, enough to let one hear others’ breaths.", "“That’s when I swore to get revenge. But because I didn’t have any power, I could only bide my time. Then one day, I heard a voice inside Gorad Boga calling me….”", "Roe Scheherazade shrugged.", "“You crazy bitch!”", "Chohong, who was listening silently, spat out a curse.", "“How can you…!?”", "Roe Scheherazade tilted her head. She looked like she couldn’t understand why she was being criticized.", "“Aren’t you the queen!? You’re supposed to be a ruler who takes responsibility for your kingdom! How can you cast aside your people and hand the city over to the enemy!? How can you call yourself a queen!?”", "Roe Scheherazade’s eyebrow went up slowly.", "“What is a queen?”", "“…W-What?”", "“Kingdom? People? Responsibility? What’s that?”", "Roe Scheherazade raised her hands in a shrug.", "“I don’t know any of that.”", "“You….”", "“I didn’t have a single authority as a queen, so I can only say that it’s laughable that you ask me to take responsibility…. I’m just a person, a woman who wants to avenge her beloved husband.”", "Chohong became speechless at Roe Scheherazade’s shamelessness.", "“Just because of that…!”", "Just as she was about to lash out in anger—", "“Just?”", "Roe Scheherazade’s brows twitched violently.", "“Just?”", "Her gentle expression changed in an instant.", "“Did you say… just?”", "Roe Scheherazade turned serious, her eyes widening to the point of physically tearing. It was so bad that her pupils looked like tiny beans inside the sclera.", "The way her pupils glared down from her abnormally widened eyes, she looked like a vengeful ghost filled with hatred.", "“What do you know?”", "A rough, scratchy voice shot out.", "“Being dragged to drinking parties, having to act cute and pour alcohol with both hands while my clothes were torn apart, shaking my butt like some cheap prostitute from the streets and panting like a whore in front of my husband’s portrait while high on drugs… Can you say you know what that feels like?”", "Roe Scheherazade’s throat and body both trembled visibly.", "“Yet you dare to say just? I had to suffer unmentionable humiliation from the bastards who murdered my husband, yet you say just?”", "Roe Scheherazade burst into laughter, the cackling sound ringing out in the otherwise silent area.", "“Then you should have destroyed Sinyoung! Why…!”", "“Roe Scheherazade.”", "Seol Jihu stretched his arm in front of Chohong who was trying to shout back.", "Roe Scheherazade was not in the right mind. That much was easy to tell just by looking at her face. Her once virtuous and tender appearance was nowhere to be seen, and she had clearly lost her sanity.", "But now that her possession of the Royal Oath was confirmed, he had to get her to change her mind no matter what.", "“Please.”", "The laughter stopped at Seol Jihu’s words.", "Roe Scheherazade’s gaze moved slightly.", "Their eyes met.", "Looking up at her pupils, which seemed to be possessed by an evil spirit, Seol Jihu quietly said.", "“I’d like you to reconsider.”", "“?”", "“The disadvantageous position you were in as an individual against an organization, the unfair treatment you had to suffer due to people in positions of power, the inexplicable death of your husband, and the anger you felt after finding out the truth…”", "“….”", "“Anyone would sympathize with you and understand you.”", "“…Hmm…”", "Roe Scheherazade raised her chin and hmmed. Her chillingly frightening expression began to slowly fade away.", "“But…”", "Seol Jihu shook his head while still meeting her eyes.", "“This method, this choice, is definitely wrong.”", "Before anyone noticed, Roe Scheherazade’s face had returned to normal.", "“…I know.”", "Her voice became soft again.", "“I obviously know that I am wrong.”", "“….”", "“But does that matter at this point? What matters is whether I stop or not.”", "Roe Scheherazade staggered up to the wall and leaned against it.", "“Representative Seol.”", "She rested her chin on her hands and grinned at Seol Jihu.", "“You see, I actually thought about stopping. Just once.”", "“When? It was when Representative Seol came to Scheherazade.”", "Roe Scheherazade’s expression turned hazy as she spoke like a dreaming girl.", "“I’ve been hearing a lot about you since long ago.”", "“Fighting for the Haramark Royal Family that was being threatened like me…”", "“Taking care of the trash that were using the Eva Royal Family and even looking after their stupid queen and helping her grow…”", "“I saw it. How beautiful and dignifying Charlotte Aria looked as she made her proclamation on stage!”", "She then cupped her hands together.", "“When I heard Representative Seol was coming, I wasn’t able to sleep for days. I shook with joy!”", "“I know it might sound immature, but I couldn’t help it. I was looking forward to it too much.”", "“He’s finally coming. Ah, ah, he’s finally reaching out to help me!”", "“I heard a few organizations already disappeared without a trace! But what if Sinyoung accepts the provisions? Ei, they’re the main culprit. How can he forgive them so easily? Ah! Sinyoung is finally going to be destroyed!”", "“How can I express this gratitude? He’s putting in so much effort to make this world a better place. Maybe when this all ends, I will also… Maybe this is what Gairos wanted too….”", "She trailed off after chattering like a maiden in love. She knew how meaningless it was at this point.", "“But…”", "Roe Scheherazade heaved out a deep sigh and dropped her hands to the side.", "“…You told me this.”", "Her chin hit the wall.", "“Things will change so wait just a little longer…”", "Without a hint of being in pain, she shook her head, lying face down on the wall.", "“No…. Gaining a small authority will change nothing for me….”", "“Nothing at all, as long as Sinyoung stands tall!”", "Her voice suddenly turned sharp.", "“Why didn’t you do it?”", "At the same time, Roe Scheherazade straightened her upper body.", "“All you had to do was destroy Sinyoung!”", "She asked as if she truly couldn’t understand.", "“I was on my knees too! I was hoping someone would come rescue me too!”", "She cried like a heroine from a drama.", "“You personally helped Teresa Hussey and Charlotte Aria up, so why not me!?”", "She wept quietly.", "“You could have guided me too! I wanted to be like them too!”", "Her throat trembled.", "“So why did you leave after only holding my hand briefly!?”", "And she shouted with a shaking voice.", "“Just why!?”", "Her desperate scream echoed sonorously."]}