{"cid": "44", "title": "Chapter 44. The Places He Needs To Be", "content": ["Seol Jihu couldn't remember how he got back to his room. He staggered up the stairs and opened the front door with an emotionless face.", "Underneath the window dyed in an orangey hue, the light of dusk drew a lengthy shadow and cast a shadow over his aged laptop.", "Seol Jihu leaned against the wall and closed his laptop shut. He suddenly felt like a fool, thinking back to when he was busy calculating all those sums.", "‘…Just a little bit.’", "It'd be a lie if he wasn't just a tiny little bit expectant. However, the gap between reality and his imaginations proved to be too wide for him to bridge. The reality was cold and harsh as if it occupied the opposite end of the scale from his imagination.", "His old habit reared its head; he pulled out a cigarette and began puffing out blue smoke.", "Cough, cough.", "His throat felt scratchy. His eyes stung. Maybe because of that, the tears he'd been holding back began streaming down.", "[You think I'll fall for your lies again?]", "How could he resent anyone….", "[….Horse racing? Or sports betting?]", "Or, how could he blame anyone?", "[Please take it, if you are truly being honest.]", "The view of the entire world seemed to have turned 90 degrees. His temple hit the floor, and Seol Jihu stared at the tilted room in a silent daze.", "His head was too chaotic to feel the pain. His breathing too was unsteady.", "Everything felt wrong. It was as if everything was telling him that he shouldn't be here.", "'I have no place left here.'", "The moment this thought entered his head, his fuzzy, unfocused eyes regained some of the lost clarity.", "He did find a place he could go not too long ago, didn't he?", "'Paradise.'", "Indeed, if it was that place….", "His hand rummaged through his pockets until he found a small slip of paper.", "For a while, he fidgeted around with it. He wanted to rip it up right away, but… he was still waiting for a certain woman to give him a call first.", "Now that he took a look at himself, his condition wasn't so good as well. Seol Jihu's body shuddered from the sudden coldness rushing into his bones. He figured that he'd feel better after getting some sleep.", "Sniff. He sniffed slightly as he crawled on the floor and dug underneath the worn blankets.", "Within this cold room, only the deathly stillness kept him company.", "'….I'm…. lonely.'", "He pulled the blanket over his head and quietly closed his eyes.", "On the other hand….", "—The number you have dialed is not available at present. Please leave your message after the beep….", "“And why is this guy not picking up his phone?!”", "Kim Hannah angrily switched her phone off and frowned in unhappiness.", "“Could he have dined and dashed? No, he didn't look that stupid to begin with….”", "She licked her lips and contemplated for a little while longer, before picking up her handbag to leave her residence.", "“You think I won't be able to find you because you hid yourself?”", "*", "Kim Hannah arrived outside his house. She pressed the doorbell and knocked on the door, but the whole place was eerily quiet.", "'He's not home?'", "Kim Hannah closed her eyes and concentrated. She then clearly sensed his aura coming from the inside. Her expressions crumpled in an instant.", "Knock, knock!!", "“Hey! Open the door! I know you're in there! Seol Jihu!”", "Kim Hannah's voice rose up as she knocked on the door. She even began chewing on her lower lip.", "Oh, so he was playing hard to get, was that it?", "Seething with anger, she grabbed the doorknob and turned it, hard.", "“Maybe I shouldn't have given him the money?”", "…But then, the door opened up without offering any resistance.", "'…It was open all this time?'", "Rather than surprised, she suddenly felt foolish for wasting the last five minutes standing outside the door while doing stupid little things. Kim Hannah entered while looking around, only to cover her nose in a hurry as nausea viciously assaulted her.", "A truly disgusting odor, formed from the combination of stale cigarettes, rotting food, clothes that hadn't been washed in ages, as well as other unidentifiable smell, attacked her senses.", "When she took a look around the state of the room, she found it to be a truly disgusting sight to behold. The cigarette butts piling up high atop a plate reminded her of a hedgehog, for instance.", "Kim Hannah felt an urge to vomit rush in, so she quickly made her way to the kitchen sink, only for her eyes to open even wider in shock.", "“Blergh….”", "In the end, she began retching. For someone like her who obsessed over her hygiene like a maniac, this room was a trash pit that made her feel disgusted and uncomfortable.", "“Blergh, bleeeergh….”", "She continued to retch several times more, before shifting her tearful eyes to look behind her. Only then did she spot Seol Jihu sleeping on the floor with a blanket covering his entire body.", "“Y, you crazy bastard!”", "Kim Hannah strode angrily to where he was.", "“Hey, wake up!”", "She used the tip of her feet to push the blanket off but froze still afterwards.", "“Uuu… uuuuu….”", "She heard him moaning out in pain. He was breathing with much difficulty as well. His hair was soaked with sweat and clung to his scalp, and she spotted large sweat drops on his neck, too.", "“What on earth….”", "Kim Hannah's anger cooled down in an instant. She squatted down and placed her palm on his forehead, and felt his temperature. He was boiling hot.", "“….”", "She had no idea that he was sick, so she felt foolish and apologetic for suspecting him.", "“….Idiot. How can you not get sick when sleeping in a room like this?”", "She muttered out in defeat and quietly sighed out. She took another sweeping look at the place and then, shook her head.", "“Ehew…. You were fine back in Paradise, but why are you like this on Earth?”", "She spoke to herself as if she couldn't help it, and stood back up.", "“Even if it's cold, endure it for a while. Let me start by getting some fresh air in here. I might also get sick from this room if I don't do something right now.”", "She proceeded to fling open the window as wide as it could be opened and rolled up both her sleeves. As if she was getting ready to exert some effort after a long while of not doing so, she stretched her back and loosened her neck muscles.", "“Okay, let's see…. Where should I get started first?”", "*", "Seol Jihu had a dream. It was a kind of a dream that he hadn't had in a long time. But it was a good one.", "Yoo Seonhwa came to see him and began nursing him. She even scolded him for the messy state of his room. She dragged him to the corner and then began cleaning the mess.", "While the washing machine did its thing, she went out and bought stuff like dishwashing soap, air freshener, and some other cleaning products. She washed his clothes, then tidied up the kitchen, washed all the dirty dishes, threw away the rotting rubbish, cleaned out the fridge, mopped the floor, wiped the windows clean, and even got around to cleaning the bathroom.", "She spent the next several hours on completely transforming his entire residence. Then, saying she was hungry, she cooked ramen. Seeing her stand in the kitchen with her ponytail gently swaying about, Seol Jihu felt warm and fuzzy inside. It was as if he had gone back in time, back to when everything was okay.", "If there was one thing he couldn't quite understand, then that would be her wearing a business suit. Why wasn't she in her uniform? Yoo Seonhwa had never once wore a business suit until now….", "Suddenly, his nose picked up on the spicy but delicious smell. Saliva began pooling on the tip of his tongue.", "Seol Jihu swallowed his saliva as the sleepiness left him, and he blinked his eyes several times.", "'It wasn't a dream?'", "He quickly raised his upper body.", "“Oh, will you look at this guy?”", "A rather particular prim tone of voice entered his ears. Kim Hannah narrowed her eyes and stared at him while carrying the tray with ramen on it.", "“You sure can smell food like a sniffer dog, can't you?”", "“Kim Hannah?!”", "“If you're up, then come and have some.”", "“What are you doing here…?”", "“I told you, didn't I? If you don't answer my call, then I'd come barging into your place.”", "Kim Hannah replied matter of factly.", "Seol Jihu dazedly surveyed his surroundings. And his jaw nearly hit the floor after realizing that his trash pit room had been transformed into spotless living quarters.", "'Was my place this spacious?'", "He spotted plates neatly arranged on the shelves, and the floor seemed to glisten like marble. There was an unfamiliar but nice scent permeating in the air too. This place was well past the level of being a nice place to be in, and straight into the territory of 'My Sweet Home'.", "“….You thinking of starting a new career?”", "“What are you even talking about?”", "Kim Hannah sourly retorted to his question.", "Seol Jihu massaged his forehead.", "“So, it was you….”", "He thought it was Yoo Seonhwa, though…", "“That's right, you idiot. Do you know how many trash bags I…. Wait a minute? Why do you sound disappointed?”", "“N, no way. You're mistaken. I'm grateful. Really.”", "He flinched and quickly denied it while waving his hands around. Kim Hannah snorted once.", "“That's right. You better be grateful. How can you even think about sleeping in a place like this? It was probably full of germs and stuff. Euh!”", "She shuddered as if just imagining it gave her the chills and put the tray down on the small table. She then sneaked a glance at him.", "“You don't want? I cooked two packets, you know?”", "Warm steam invitingly rose up from the pot. And after a pair of wooden chopsticks were placed before him, there was no way he could refuse now. And when he thought about it, he hadn't eaten anything since the morning.", "Indeed, he was feeling hungry. So, he decided to fix that first before thinking about anything else.", "Sluuurp.", "'It's good.'", "The noodles were perfectly chewy, and the soup itself was on the right side of being spicy, with the chopped spring onion bits adding a layer of refreshing aftertaste as well.", "Kim Hannah began giggling after seeing the youth focus on wordlessly hoovering up the ramen.", "“You like it?”", "“Yeah.”", "“Well, I've got some skills when it comes to making ramen. Anyways, enjoy yourself.”", "“Okay, thanks.”", "The two of them concentrated on the meal at hand for a while. And sure enough, the noodles were finished pretty quickly.", "“It's not really enough for both of us, right?”", "Kim Hannah licked her lips and with an unsatisfied face, she looked at Seol Jihu enjoying the spoonful of the ramen soup.", "“How about some rice to go with the soup?”", "“Yeah, that sounds…. Ah, but there's no….”", "“I've already bought some instant rice. I got them when I went out to buy extra trash bags, you see.”", "Kim Hannah went to the kitchen and brought out packets of instant rice. She must've had them warmed in the convenience store, because they were rather cold to his touch.", "They dumped the rice into the ramen soup and shared the rest of the meal among themselves.", "Once his stomach was full, he felt sated and a bit sleepy as well. Even though he just woke up, his eyelids felt like they weighed thousands of tons. Seeing him like this, Kim Hannah smirked.", "“You aren't a kid anymore, but you're getting sleepy because you're full?”", "She then took the tray with the empty dishes away, before bringing a bag of medicine.", "“Hey, let me do that.”", "“Don't bother. You're still sick, you know. I bought some medication, so take those and rest up. We'll talk tomorrow.”", "Seol Jihu closed his mouth. The thing he hated the most was needles, and the thing he hated the second most was taking medication. It might have something to do with childhood trauma.", "Kim Hannah hummed as she washed the dishes, only to get royally ticked off when she found out that he didn't even bother to take a single medication. She forced him to take some pills, and after that, she said she'd talk to him tomorrow, then turned around to leave. It was getting late and she also needed to get some rest, too.", "“I'll be going now. Get some rest, okay? And don't you dare not answer my call again.”", "Just as she was about to leave, she felt him suddenly grab her hand.", "“Kim Hannah.”", "“What?”", "“Don't go. Please.”", "“….What did you say?”", "Kim Hannah couldn't help but flinch after hearing his pleading tone of voice.", "Well, it was already in the middle of the night, so….", "A thought that said perhaps coming here was a mistake entered her head.", "“I….”", "“Hey.”", "Kim Hannah turned around to face him and firmly stated her position.\n“You're an Invited, and I'm your Inviter.”", "“I know.”", "“If you know, then you shouldn't behave like this. Don't you think you're being a bit inconsiderate here? Do I look that easy to you?”", "She began sounding quite a bit pissed off. Seol Jihu stared at with his eyes blinking non-stop as if to show he had no idea what she was on about before his tired voice left his mouth.", "“I want to go back.”", "“…Hm?”", "“Right now, I want to go back.”", "It was Kim Hannah's turn to blink her eyes. Her neck skin reddened up from embarrassment only for a brief moment. The moment she confirmed the strange fervor in the youth's eyes….", "“Let's go. Right now. I mean, we have the means, right?”", "….Her own eyes narrowed to a slit.", "'No way. Can it be…?'", "As a matter of fact, she had been feeling that something odd was up. She also found it strange that the youth was unusually quiet during the mealtime.", "What she initially worried about was Seol Jihu not wanting to go back to Paradise after coming back to Earth. However, the truth turned out to be the exact opposite of that.", "Not even one full day had passed, yet Seol Jihu wanted to go back to Paradise already.", "The most convincing evidence was his complexion, which was now full of vigor as soon as he mentioned going back. She felt that the way he held her hand was like someone dearly holding onto the sole remaining lifeline. Kim Hannah began thinking that….", "….That this wasn't right.", "….That this was dangerous.", "Every now and then, one would find people like this; people who were seduced by the charms of the Lost Paradise and discarded their lives here on Earth. It was kinda like putting the horse before the cart.", "Such Earthlings would lose their lives pretty early on, ten times out of ten. They would get drunk on the adrenaline provided by the battles of Paradise and end up seeking out progressively more dangerous assignments.", "Other Earthlings called these kinds of people the Paradise junkies.", "Normally, Kim Hannah would have welcomed his desire to return to Paradise, but Seol Jihu wasn’t a simple Contracted nor was he a disposable pawn that could be thrown away after being used once or twice.", "No, he was an Earthling that could become her trustworthy support and an important partner in the future. Indeed, he was more like a rough gemstone she needed to nurture very carefully.", "She wanted Seol Jihu to balance both of his lives here as well as over there; she definitely didn't want to see him get addicted to Paradise.", "Besides, he only went there once, and he spent most of his time inside the Neutral Zone; it was rare to see someone who wanted to return to Paradise only after experiencing so little.", "'Something must have happened here.'", "Remembering Seol Jihu's past, she could think of a couple of things that might have happened.", "“You can't.”", "Kim Hannah firmly refused him.", "“But, why not?”", "“At the bare minimum, you have to finalize the contract first.”", "“Give it to me. Let me sign it right now.”", "“You think that's the end just because you signed it? I've got lots of things to say to you, and besides, aren't you curious about some things, too? What about your future plans?”", "“….I'll figure it out once I get there.”", "Seol Jihu's fervor cooled down a lot after hearing her angry voice.", "“In any case, you can't. I want to get some sleep, too! Do you have any idea how tired I am trying to tidy this place up?”", "Seol Jihu forgot what he wanted to say now, his expression one of apology.", "“Just get some sleep. You look like you’re about to fall asleep at any second anyways…. Plus, when it’s time for us to go back, I’ll make you go even if you don’t want to.”", "“…Okay.”", "In the end, Seol Jihu waved a white flag.", "A short while later…", "The light of the room turned off.", "A complicated expression formed on Kim Hannah's face as she watched the sleeping Seol Jihu and his steady breathing.", "She stood at the front entrance and deliberated for a while before she settled down on a spot a bit of distance away from him. She draped the jacket around her like a duvet.", "She was worried about him running off to Paradise without her knowing. Her sharp senses would snap her out of sleep even if there was a minute disturbance, so she trusted that and decided to stay.", "As his protector, she had to prevent him from 'escaping' into Paradise at all costs.", "'Really now, what a troublesome guy to look after.'", "Kim Hannah stared at him for a long while before closing her eyes as a yawn left her mouth.", "*", "Kim Hannah woke up first in the early dawn, confirmed that Seol Jihu was still asleep, and quietly took a shower. She originally planned to lightly wash up but had shed way too much sweat the day before cleaning this pigsty of a room, so it couldn't be helped.", "She didn't want to wake him, so she took her clothes inside the bathroom with her, but then, the noises of the water must've woken him anyways; by the time she got out, Seol Jihu was sitting up while rubbing his eyes.", "The morning sun had already risen past the horizon when he finished washing up as well.", "She then dragged the youth out of his house and took him to a small diner located in some forgotten backstreet, so they could have some breakfast.", "While waiting for the food to arrive, she demanded that he tell her everything that had happened yesterday. Seol Jihu wasn't really keen on revealing them but still told her everything. After hearing his story, her reactions were quite dramatic, to say the least.", "“W, what?! You spent over ₩100 million yesterday?!”", "“….”", "“How can you be that stupid? Are you even the same person?! Are you even that first-ranked survivor?!”", "“….”", "“Hey, you!! I told you to think about the difference in the time, didn't I?! What would they think when a gambling addict like yourself showed up after a month of silence with ₩5-60 million in tow, claiming to have given up on gambling completely out of the blue?! Ah?”", "Kim Hannah was this close to losing her sh*t, and she nearly jumped up from her seat. She thought that he'd use the cash wisely; that was why she deposited some in his account to begin with. A guy who was so thoughtful and capable of solving all those difficult tasks quite easily back in Paradise, did a 180 as soon as he returned to Earth. She could hardly believe how dumb he was.", "“You dumb idiot… you really went and did it….”", "Kim Hannah massaged her neck as she wallowed in the pits of despair.", "“….It's not like I don't understand where you're coming from, okay? But, in that case, you should have just shown up with 2-30 million first or something. You need to gradually mend your old ties by apologizing first, saying you've quit gambling for good, that you'd work hard to repay them, but that you're too busy so you'll call them later on, etc, etc… What, you thought you could get back on their good graces in one shot? Your relationships broke down years ago, remember?”", "Her continuous stream of correct opinions caused Seol Jihu to wordlessly scratch the back of his head. Even if he had ten mouths, he'd still have no excuses to offer right now.", "“Haaaaaah….”", "Kim Hannah spat out lengthy groans over and over again, before glaring at him.", "“This can't go on.”", "“?”", "“Although you haven't signed the contract yet, as soon as you do, I'm going to invoke the protector’s privilege.”", "“The protector’s privilege?”", "“You want to make it right with your family. Correct?”", "Seol Jihu nodded his head as if that was obvious.", "“I'm not planning to interfere with how you live your private life, but I'll be intervening in this matter, okay?”", "The food arrived then, so Kim Hannah's dissatisfaction had to pause for a while.", "“Let's eat. We'll talk while we eat.”", "Kim Hannah scooped some soup up with her spoon and continued on.", "“Now, listen. Among my subordinates, there is this guy who went there when he was just a university student. He did okay, carved himself a nice little career, became famous and then got scouted by Sinyoung in the end. He even got married not too long ago, too.”", "“You even get married in that side?”", "“Sure, there are some people who do, but that's not what I'm saying.”", "Kim Hannah waved her hand around to emphasize the fact that it wasn't what she wanted to talk about.", "“Anyways. He married a girl who's not involved with that world, know what I mean? So, what do you think happened?”", "“I wonder. Isn't it a bit, you know, dangerous? He could get discovered, right?”", "“You think so? You see, his actual life is going pretty nicely. He comes to work in the mornings and transfer to that side, spends a couple of days there and comes back, but it's only the late afternoon over here. If he were to get delayed that side, then he would simply tell her that he'd been putting in some overtime. If he needs some extra time that side, then he just tells her that he's going on a business trip.”", "“But, his wife could show up at the company, right?”", "Kim Hannah shrugged her shoulders.", "“So? What's the problem? We just have to show her her husband working at the office.”", "“What if she shows up unannounced or there's an emergency?”", "“Even those are not a problem. If something happens to his household or his family, the company will be notified immediately. We'll tell her that he's working outside the offices, and at the same time, one of our guys will transfer to the other side and bring him back.”", "“You really are thorough in managing your people, aren't you?”", "“That's the power of my company. And well, that's one of the reasons why I will be looking after you, too.”", "Seol Jihu nodded his head and agreed with her. The tone of Kim Hannah's voice was a bit combative, but he didn't mind hearing her out. Rather than her interfering, it sounded more like she was going to help him out, instead.", "“In any case, what you're saying is that, you'll invoke this privilege of the protector, right?”", "“That's right. Actually, I don't even really need to invoke the privilege in the first place. This is one of the responsibilities people like me, who were granted the rights to scout, must carry out.”", "“Rights to scout?”", "“That's right. You think the rights are granted for free to us? Naturally, we have the responsibilities and duties to perform.”", "Kim Hannah began munching on the rolls of kimbap before going oops after seeing the youth's vacant expression. Since he was so outstandingly capable back in Paradise, she would sometimes think that he had figured most things out by himself already and gloss over some stuff.", "“Even if it's called rights, it's not that impressive. It's like, we can use the stamps, and get to figure out whether you're involved with that world or not – that much, I guess?”", "“You can do that?”", "“Of course. Without such a thing, why would I have believed you back then? Just because you swore in your mother's name or something?”", "“Ok, so how do you tell, then?”", "“Give me your hand.”", "Seol Jihu opened his right palm and presented it to her. But she shook her head.", "“Not your right hand. The hand where I planted that stamp.”", "Seol Jihu opened his left palm and tilted his head. From his perspective, it was just a hand with nothing on it and he couldn't see anything special there.", "However, it must have been different to Kim Hannah because she was nodding her head rather sagely.", "“Yeah, I can see it pretty clearly now. It must be that vivid because you're a Gold Mark.”", "“You can see something on my hand?”", "“Yup. There are three ways to distinguish those who are involved with that world and those who are not.”", "She licked the chopstick and unfurled her index, middle, and ring fingers.", "“Firstly, you recognize a person's face. Even you can do this. Secondly, you can take a look at the other's Marking. But the drawback to this method is, you don't know exactly where the Marking might be. Sometimes, you might find it in some weird place, you know?”", "Seol Jihu became slightly curious what those weird places could be.", "“The last one is to sense the 'aura'.”", "“The aura?”", "“There's this distinctive aura emitted from the Marks. You have to be close to the Mark and concentrate hard to feel it though.”", "Seol Jihu became deeply intrigued as they began discussing a topic related to Paradise.", "“Ah, I got sidetracked. Anyways…”", "Kim Hannah clicked her tongue and pulled out the contract as well as a pen from her inner pocket.", "“My point is this. I want you to balance your life over here as well as the one over there, just like that subordinate I told you about.”", "“That’s….”", "“Listen. I've been living on that side for far longer than you have. I also got to meet a lot more people than you. Hell, I'm someone who seduces others into entering that place.”", "Suddenly, the tone of her voice became lower in the middle of her speech.", "“I'll be honest with you here. Ever since I began as a broker, I've never imagined that I'd say these words out aloud.", "Kim Hannah took a big gulp of water, adjusted her glasses and continued.", "“I'm convinced after seeing how you acted last night. You may not need it when you're on the other side, but when you're here, you need strict management.”", "“….”", "“More importantly, I won’t sit back and watch the man I invited get addicted to that side and flounder around like a fool. Got that?”", "Kim Hannah spoke up to here and placed the contract in front of Seol Jihu.", "“If you understand me and feel confident that you can do this, then sign the contract.”", "Seol Jihu remained quiet, before picking up the pen. And just as he pulled the contract in closer….", "“Don't forget.”", "Her voice was sharp.", "“The place you need to be is here.”"]}