{"cid": "424", "title": "Chapter 424. Variable, and Variable (2)", "content": ["“Humanity will form a separate expedition team to infiltrate the heart of the Empire and return with the last remaining piece of the stele.”", "The gist of the plan was simple. Seol Jihu was taught to give simple descriptions so that the objective could ideally be described in one sentence.", "People reacted calmly. Thanks to Baek Haeju, they found out that they still had some time to secure the stele.", "But that wasn’t enough. There were still a ton of problems that needed to be resolved.", "It would be foolish to think the Parasites would stay still, so how big should the expedition force be? Would they be able to arrive at the destination before it was too late? Even if they succeeded, would they be able to return safely?", "One question came up after the other, but everyone held their breaths and waited. No one believed that the young man in front of them would have brought up such an idea without a solid plan.", "Before starting his explanation, Seol Jihu looked at the corner seat and activated his Future-Gauging Nine Eyes.", "[Yun Seora’s Status Window]", "Summoned Date: 2017. 03. 16Marking Grade: SilverSex/ Age: Female/ 21Height/ Weight: 166.2cm/ 49.8kgCurrent Condition: HealthyClass: Lv 4. MactatorNationality: Korea (Area 1)Affiliation: SinyoungAlias: Wild Dog, Hothead, Black Sheep, Red-Eyed Warrior, Toy", "[2. Traits]1. Temperament—Cool-headed (actions and thoughts are not swayed by emotions; always calm)—Conviction (a firm, unwavering belief)—Endurance (ability to withstand pain and hardship)—Responsible (treats duties and obligations with importance)", "2. Aptitude—Observant (carefully analyzes and studies items and events all around her)—Brilliant (possesses a smart brain as well as good overall talents)—Driven (ability to carry out one’s thoughts)—Gordian Knot Slasher (takes care of complicated matters skillfully and properly)", "[5. Level of Cognition]Manchild (actions and thoughts are like that of a child) / Ashamed / Cold-blooded (rational and unempathetic)", "Ashamed. It meant she was too embarrassed to raise her head and look straight on.", "Next, a screen popped up with a burst of light.", "Seol Jihu carefully watched the video that played from beginning to end.", "Yun Seora dropped her head even lower, taking his stare as criticism.", "“Miss Yun Seora.”", "Yun Seora, who was sitting with a depressed face, flinched. Seol Jihu’s voice had been softer than she had expected it to be.", "She then took a deep breath and raised her head with a look of intense determination.", "After staring fixedly for a while, Seol Jihu finally said.", "“Can you beg Roe Scheherazade for forgiveness?”", "Yun Seora’s eyes lit up.", "“Yes.”", "“Can you do anything to obtain her forgiveness?”", "“Yes, I can. I’ll do whatever it takes.”", "She replied without a hint of hesitation.", "“Really? Even if you have to tear apart your sister’s limbs with your own hands?”", "“Yes, I can do it. In fact, please let me.”", "“Can you capture every executive who’s involved with Roe Scheherazade and bring them here?”", "“Of course. As long as they’re alive, I’ll make sure to catch them and bring them back. Even if they have already died in Paradise, I’ll make sure they pay the price on Earth.”", "“Including Chairman Yun Seojin?”", "Yun Seora’s prompt replies halted for the first time. Perhaps asking her to bring her father to his death was asking for too much.", "“It will be difficult to do that right away.”", "However, Yun Seora’s reply surpassed anyone’s expectations.", "“Father retired from Paradise. He’s also a very meticulous person by nature, so he will not try to enter Paradise again if he finds out what transpired.”", "She wasn’t saying that she was reluctant to do it but that it would be difficult to do so at present.", "Yun Seora thought for a moment before revealing a determined look.", "“Can you lend me your help?”", "“If it’s for this matter, anything.”", "“Then please limit the use of all warp gates in the remaining cities so that no one related to Sinyoung can go back to Earth.”", "“That should be easy.”", "“As soon as you find anyone, transfer them here under my name.”", "Under Yun Seora’s name. She was saying she would take full responsibility for this matter.", "“I’m also going to have to return to Earth for a few days. I’m sure Sinyoung is in complete chaos right now.”", "Indeed, many of their executives and employees had died from the Parasites’ attack. The mass deaths would inevitably cause a scene on Earth.", "“I’ll try to resolve the situation as soon as possible. I’ll only reveal that the Parasites invaded Scheherazade. I will take control of the company while making sure nothing about the cause leaks out.”", "“Will that be possible?”", "“It was already decided in a shareholders’ meeting that I would be Sinyoung’s next executive director. I will only be hastening the process a bit.”", "Seol Jihu nodded his head.", "The plan she was suggesting was simple. While executing every executive inside Paradise, she would solidify her position as the new executive director and then aim for Yun Seojin after isolating him.", "Even as the former executive director and chairman, he should not be able to exercise his influence by himself.", "By that point, Yun Seora, with Valhalla and its partner organizations’ support, would be more than enough to force him to move.", "“Of course, I don’t think that will be the end.”", "Yun Seora lowered her gaze and continued.", "“As I said before… I’m prepared to do anything.”", "Seol Jihu stared at Yun Seora who was in clear torment.", "He had to admit that she was wise. She knew exactly what to do in the current situation to rebuild Sinyoung that had fallen to rock-bottom and begin anew.", "After silently watching for a while, Seol Jihu quietly spoke.", "“Then, you’ll need to get moving right away.”", "Yun Seora shot up instantly. She looked around the room and then at Seol Jihu before bowing.", "“Miss Yun Seora.”", "When she turned and was about to leave, Seol Jihu stopped her. He wanted to ask if she thought he was asking for too much, but he swallowed the words down before they spilled out of his throat.", "He asked another question instead.", "“Can I trust you?”", "Yun Seora looked more earnest than ever before.", "“…If you can give me a chance…”", "“….”", "“I will do whatever it takes to earn your and everyone else’s trust. Even if it costs my life.”", "It was easy to tell just how determined she was from her voice. Though it was already too late, her desire to right the wrong was self-evident.", "Seol Jihu sighed and nodded his head.", "No matter what the truth may be, Yun Seora was undeniably a core member of Sinyoung. Given what Yun Seohui had done, it made sense for Seol Jihu to have doubts about Yun Seora.", "But, there was a vast difference between them.", "[Yun Seohui, she… How should I say this? It’s like she spoke to you, not to all of Valhalla.]", "Just like Kim Hannah said, Yun Seohui was actually an emotional person, despite not looking like it. Because she couldn’t control her emotions, she was unsuitable as a representative.", "But Yun Seora was different.", "Not only did she speak to everyone and not just Seol Jihu, but she also didn’t try to avoid taking responsibility and instead tried to shoulder everything herself.", "This difference made Seol Jihu trust Yun Seora a little more.", "Yun Seora bowed once again and left the tent.", "Immediately afterward, a heavy silence descended.", "“There were a few witnesses, so we’ll have to make sure they keep their mouths shut. Let’s go call our cities.”", "Wu Lei muttered bitterly.", "Philip Muller took out his communication crystal, but he looked extremely reluctant.", "He was inwardly skeptical of Seol Jihu’s plan as he thought it was impossible to change Roe Scheherazade’s mind at this point.", "Of course, he recognized that this wasn’t the time to be so picky, but the risk associated with the plan was too high to simply base off on Roe Scheherazade’s words that she would wait.", "“Princess.”", "At that moment, Seol Jihu called Teresa.", "“Can you call for Sir Arbor Muto?”", "“Eh? Ah, yes….”", "Teresa, who was fiddling with her communication crystal with the same skeptical look as Philip Muller, went outside.", "Soon, she returned with a white-haired, older man.", "Though a long time had passed since they last met, Arbor Muto looked just as strong and healthy as in their first meeting.", "“Village head.”", "Seol Jihu said after greeting him in the form of a slight bow.", "“Do you remember the talk we had about the Delphinion Duchy Laboratory?”", "“Mn, I do.”", "“Back then, you said the research facility had two secret hideouts, with each hideout having its own transfer magic circle. One was connected to Haramark’s valley, and the other one…”", "“I said you should take it if you want to meet the Parasite Queen.”", "Arbor Muto completed Seol Jihu’s sentence with a bitter smile.", "[That’s right, the second hideout also has a transfer magic circle.]", "[However, it'll be for the best that you don't use that one.]", "[It's connected to somewhere in the center of the Empire. Well, if you want an audience with the Parasite Queen, you can go ahead and use it.]", "Indeed, the plan Seol Jihu thought of wasn’t to charge into the Empire’s territory head-on. He planned to reach the center of the Empire by using the transfer magic circle in the Delphinion Duchy Laboratory and then quickly retreating after obtaining the piece of the stele.", "“Ah!”", "Teresa let out a belated exclamation.", "“What do you mean by that?”", "And Philip Muller’s eyes shone sharply.", "“It’s simple. I used to be the head of a research facility that experimented with the Parasites’ Nests. For complicated reasons that I won’t bother to explain, I prepared a contingency escape plan.”", "Arbor Muto rubbed his beard and continued.", "“I made a dummy hideout to conceal the real hideout. Representative Seol seems to be talking about the transfer magic circle inside it. Using it, you can get to the center of the Empire in an instant.”", "Hearing this explanation, shocked gasps sounded out from all sides. Philip Muller even smacked his knee in astonishment.", "“But it’s hard to say whether the magic circle is still functional…”", "“Princess Teresa and I personally confirmed the existence of the magic circle. Although the one connected to Haramark’s valley was destroyed, the one connected to the Empire was unscathed. And because the Federation sunk the earth where the laboratory was built, it’s unlikely that the Parasites paid attention to it afterward.”", "“I can certainly believe it. Even though it was a dummy hideout, I made sure to conceal it thoroughly and built it so that it could even withstand the Dwarves’ Thunders. Since Representative Seol says he confirmed it personally, I’m sure there’s no need to talk about it any further.”", "Arbor Muto walked forward with heavy steps.", "“The question must then be, where does it lead to?”", "“Yes.”", "“Let’s see….”", "Arbor Muto looked down at the map on the table and pointed to a spot.", "“About here?”", "Seol Jihu’s complexion brightened. It was very close to the spot Baek Haeju had pointed out, a small fortune among misfortunes.", "“From the transfer point to the catacombs… half a day should be enough.”", "Baek Haeju murmured while looking at the map.", "Philip Muller’s head spun. He was fully reevaluating Seol Jihu’s plan.", "The result he eventually arrived at was as expected. Yes, it was doable.", "The Parasite Queen would find out as soon as they entered the Empire’s territory. However, the Parasite Queen was currently positioned in the Hiral Mountain Range along with Unsightly Humility, deploying their troops to the border regions.", "Furthermore, five Army Commanders and their armies were bound to Scheherazade at the moment. It didn’t take a genius to figure out that the Empire’s central area was currently empty.", "Of course, Roe Scheherazade might have used the Royal Oath already to locate the last piece of the stele, in which case the Parasites might be on the move.", "But since the location of the enemy’s main force was known, an expedition team consisting of people present at the camp should be more than capable of breaking through any Parasite army.", "Philip Muller finally understood why Seol Jihu asked Yun Seora to lock the stable door after the horse was stolen.", "If Roe Scheherazade delayed using the Royal Oath to watch Sinyoung’s executives be brought to justice, the operation’s success rate would jump significantly.", "Not only that, since the Parasites had not finished deploying their troops to the border regions and were still in the process of doing so, they might be able to enter the Delphinion Duchy Laboratory without shedding any blood as long as they moved quickly.", "“We shouldn’t be sitting around then.”", "Philip Muller shot up from his seat.", "“It’s a race against time. If we’re going to do this, we need to do it now. The success or failure of this operation hinges on who is faster.”", "Those who were participating in this meeting weren’t stupid. In fact, many of them thought the same thing as Philip Muller as soon as they heard Arbor Muto’s explanation.", "Everyone got up, exchanged a look, and then turned to face one person.", "“We’ll set out in an hour, no, forty minutes.”", "Seol Jihu spoke powerfully.", "“We will meet again in forty minutes after finishing all preparations, including Miss Yun Seora’s request.”", "*", "The camp moved busily once Seol Jihu’s command fell.", "They called their organizations to restrict the use of warp gates and asked the royal families to issue Red Notices for anyone related to Sinyoung.", "They asked to detain any affiliate and direct member, their guilt or innocence being a matter for a later time.", "White Tiger also contacted the Federation and asked them to split their force to march toward Hiral Mountain Range. The purpose of this move was to bind Unsightly Humility and the Parasite Queen’s feet.", "While everyone moved busily, Seol Jihu asked Eun Yuri to find out whether Roselle knew any way to improve the transfer magic circle.", "Then, he began to pick out the members who would be participating in the expedition.", "Though it would be great to take everyone along, the situation made that extremely difficult. They had to leave a few experts and commanding officers in case of an emergency.", "After much deliberation, Seol Jihu picked out the members to join the expedition.", "First, he decided to include all High Rankers and Unique Rankers from Valhalla. Among Level 4s, he included Eun Yuri and Yi Seol-Ah.", "Eun Yuri was an obvious choice, and he thought Yi Seol-Ah’s contracted pinnacle-rank Spirit of Air, Aura, would come in handy in the expedition.", "Other than these, he asked two Level 7s, Philip Muller and Agnes, to join, the latter having been promoted after the Tigol Fortress War. Teresa, who was promoted to Level 6 in the same fashion, also joined the team.", "Baek Haeju agreed right away when Seol Jihu asked her to join, and the Beastman King, White Tiger, and the Executor of Wrath, Wu Lei, both volunteered to come.", "Finally, the expedition team was formed.", "Including Flone and the Arcus Spirit, there were a little under twenty people. Members who were Level 6, 7, or 8 far outnumbered the members who were at Level 4 or 5.", "And so, that morning, four carriages stealthily left the vicinity of Scheherazade.", "A team comprising of Paradise’s strongest elites set out for their last expedition.", "All to rekindle the dying flame of hope."]}