{"cid": "163", "title": "Chapter 163. Struggle (2)", "content": ["Dwarves, Vampires, Orcs, Goblins, Fairies, Dragons, Humans, Elemental Spirits…", "The number of races that had once coexisted under the Empire’s reign in Paradise had suddenly experienced a sharp decline following the appearance of the Parasites.", "Some races were driven extinct, others succumbed, and a few even voluntarily surrendered.", "Eventually, only a few races remained and resisted the Parasite Queen in her conquest of Paradise.", "But the result was a pitiful streak of losses.", "The Parasites had multiplied their colonies to their limits and swept across all of Paradise.", "A tearful and desperate fight continued day after day, but no matter how much they struggled, the future did not change.", "The Parasite Queen devouring the Chief Deity that overlooked the star meant that she had done the same with the Seven Virtues under the Chief Deity’s banner. Naturally, there was no way for mortals who no longer had any god’s support to fight against an immortal.", "But at that time, a great change happened that reversed the hopeless situation.", "The unworshipped Seven Deadly Sins took the initiative to make a contract with humans.", "And by summoning humans from Earth, they were able to quickly recover their forces.", "Additionally, the appearance of the Fallen Angels, which were an alien race like the Parasites, successfully assembled the remaining races.", "They united under a single cause, and through complementing each others’ weaknesses and accepting alien knowledge, they created a formidable firepower.", "These two changes created tectonic waves that even the Parasite Queen could not ignore, and finally, they were able to put a stop to the once unstoppable charge of the Parasites.", "But the Parasite Queen did not remain still either. When the situation was on the brink of getting overturned, the Parasite Queen made a decision.", "The card the Parasite Queen played was spitting the Seven Virtues back out. To be more precise, she chose the seven most unique species amongst her subordinates and granted them divinity.", "“In other words, she gave birth to seven new powers that could resist the attacks from the human race and the Federation.”", "Kazuki, who explained the birth of the Seven Armies, let out a small cough. Seol Jihu could be seen with a stunned expression as he had suddenly received information beyond his wildest imaginations.", "\"Then those seven species became the new gods?”", "“It’s hard to say that they’re complete gods since they’ve only been granted divinity. The amount they’re able to digest depends on the ability of the species.”", "“Still, if it’s a god’s power… I feel like they would be extremely strong.”", "\"Obviously!”", "Kazuki snorted.", "“Among the Seven Armies… maybe just three?”", "He tilted his head.", "“No, if four armies were to attack, then the human race will need to worry about its destruction.”", "Seol Jihu stopped breathing. He finally understood why everyone had shown such a reaction earlier.", "“I have a bad feeling.”", "It was Cinzia’s voice. The two men stopped talking and focused back on the meeting.", "“This is unlike how the Parasites usually act….”", "Cinzia rarely trailed off when talking. Her usual laid-back attitude had disappeared as if it was washed off, and a serious expression had settled on her face.", "As this was Seol Jihu’s first time seeing the head of the South’s war hawk organization make such an expression, he began to feel the gravity of the situation.", "\"You’re right.\"", "Teresa agreed with a grave expression.", "The Parasites were moving a massive amount of troops in such a conspicuous manner that it would have been strange for them not to notice. Thanks to that, they were given some time to prepare, but even then, a feeling of uneasiness did not go away.", "After all, the Parasites had always behaved beyond human logic.", "There was definitely a hidden intention behind this sudden change.", "It wasn’t that the Princess Knight who had fought the Parasites for tens of years did not know this fact.", "\"But…\"", "Teresa continued with a helpless face.", "“In the end, there’s only one thing we have to do.”", "The meeting ended with a heavy atmosphere.", "After the meeting ended, Teresa asked Seol Jihu to stay behind for a bit. As he also had some business with her, he willingly accepted.", "Seol Jihu, who was guided to the reception room, was able to hear a number of matters that he couldn’t hear because of his late arrival.", "These were things from the time of the gathering, to the decision of Sicilia controlling the castle gate, to whether he knew anyone that would lend them a helping hand.", "She pleaded with him to bring anyone, whether it was an individual or a group, and told him that she would not forget to heavily reward them after the war was over.", "Seol Jihu felt a lump in his throat seeing her so desperately plead with her hands clasped together as if she was grasping at straws.", "When he told her that Seo Yuhui would lead a support team from the main Temple of Luxuria, Teresa’s fatigued eyes lit up with a shine.", "\"Really?\"", "\"She’s not someone who would lie.\"", "\"That’s great! We were worried because we didn’t have enough priests…\"", "Having one of her burdens lifted, Teresa brushed her chest and let out a sigh of relief.", "The sight of her drooping shoulders made her look extremely tired.", "In his heart, he wanted to suggest her to get some rest, even if it was just a short while.", "But seeing her approach with shaky footsteps as if she was going to collapse at any moment, Seol Jihu remained silent.", "Teresa, who had stopped in front of his nose, gently grabbed the side of his arms and lowered her head. Bump. As her forehead touched his chest, her cherry-like lips gently parted.", "\"Haaahhhh…\"", "A long sigh escaped her mouth as if she was letting out all of her worries.", "The slight trembling of her small shoulders entered his eyes.", "Teresa was also human. She must have been unable to sleep for several days, coming up with countermeasures.", "It was only natural for her to feel wary.", "\"Cheer…\"", "Seol Jihu hesitated while saying ‘Cheer up’ in an attempt to console her.", "What was it like for Teresa to have to live in such a world ever since she was young…? Having that thought brush past his mind, he didn’t have the courage to speak anymore.", "Because he felt that his words would only sound distant as if he was watching a fire across the river.", "So as he was lowering his raised hand.", "\"My head… pet my head.\"", "As per her silent whisper, he placed his hand on top of Teresa’s head.", "When he slowly brushed his hand through her rose-gold hair, she let out a happy moan.", "\"My back too.\"", "The sight of her rubbing her cheeks against him looked like a child whining for attention, causing Seol Jihu to laugh and pat her back as well.", "But he knew this was only temporary comfort.", "'How can I…?'", "What would make Teresa feel better?", "\"Ah.\"", "Seol Jihu suddenly remembered what he had come to her for.", "\"Princess.\"", "\"Haah…\"", "\"Princess?\"", "\"Feels shoo nice… Yes?\"", "Teresa who had been making a blissful expression was startled and tilted her head up.", "“Didn’t you lose all of your equipment back when you were held captive in the research lab?”", "\"Ah— yes. I did.”", "Ssp.", "Teresa wiped the drool off her mouth with the back of her hands, looking regretful.", "It was because her valuable equipment that could raise her ability stats were buried when the research lab was bombed.", "Of course, considering her identity, she could just take as much as she needed from the armory, but it was hard to find equipment as good as the ones she used before even as a princess of a kingdom.", "\"I thought as much. So…”", "Seol Jihu smiled as he held out a sophisticated silver sword in his left hand and a Heater Shield engraved with geometric patterns in his right hand.", "Both pieces of equipment let out a radiance, making them look extraordinary even at a first glance.", "Teresa made a dazed expression.", "\"It’s a sword and a shield from the Empire. They’re a couple hundred years old though.”", "\"…Huh? The Empire?\"", "\"The tomb in the Forest of Denial. You remember it, right?”", "Teresa gasped after hearing his explanation.", "\"You’re giving me these precious things?”", "\"Yes.\"", "Seol Jihu nodded. He emphasized that he wasn’t letting her borrow them but was entirely giving them to her.", "When he handed them over to her without hesitation, Teresa was bewildered as she accepted them.", "\"I was originally going to use them for diplomacy… but considering the situation…”", "\"Diplomacy?\"", "\"Yes. Ian gave me a task. He told me to engage in diplomacy with you using these two items.”", "\"Ahah.\"", "Teresa’s eyes shined like a carnivore that had found an opportunity to strike.", "“Okay then. There’s no reason not to engage in diplomacy. As a representative of Paradise and a representative of Earth…”", "And she said.", "\"Let’s get married.\"", "\"….\"", "\"Why? Diplomacy is basically creating a relationship through economy, culture, and politics. I don’t know if you’re aware, but political marriage is a diplomatic tactic in Paradise.”", "Seol Jihu bitterly smiled, but he didn’t feel bad.", "Teresa, who had looked like she would break with a single touch, regained her vitality and finally looked lively.", "She was all cheered up.", "Seeing Seol Jihu grin, Teresa became embarrassed and asked him.", "\"Is it really okay for me to have these?”", "“Having you use them is for the best.”", "“I feel sorry to receive these for free. They’re from the Empire, not to mention that they’re items only given to a Saintess… Do you have anything you desire by any chance? Something that you really wanted to have, for instance.”", "Nothing came to his mind even after hearing that. He hadn’t given them to her with the intention of receiving anything in return in the first place.", "'No.'", "After thinking carefully, the dream that he had on Huge Stone Rocky Mountain suddenly flashed past his mind.", "While everything else was blurry, the scene where Teresa’s decapitated body was lying in a pool of blood was still clear.", "His mood suddenly turned sour, and he felt shivers run down his spine.", "He now had something he wanted. Seol Jihu honestly spoke out his thoughts.", "\"Don’t die. Promise me.\"", "\"?\"", "\"I hope I can see you again after the war.”", "\"What…. T-The reason you’re giving me all this is because you don’t want me to die?”", "Teresa was shocked, but Seol Jihu nodded with a serious face.", "\"If this equipment can help you in any way, then there is nothing else I want.”", "\"…Oh my…\"", "Teresa tightly hugged the sword and shield.", "'She likes them that much?'", "Seol Jihu who had been giving a satisfied smile was suddenly startled. He felt a burning hot gaze fix onto his face.", "\"What in the world…?\"", "Dilated eyes and a flushed complexion.", "Her face was looking like she had lost herself in ecstasy.", "The problem here was that Teresa’s two eyes weren’t staring at the equipment but were instead, staring intently at Seol Jihu himself.", "…Looking carefully, were those hearts that he could see in her eyes? No. Her entire body was spouting out pink hearts.", "As the flurry of pink hearts made his sight chaotic, Seol Jihu shook his head.", "And when he looked forward again, he could see Teresa slowly approaching with a dazed look on her face.", "\"Princess?\"", "\"….\"", "\"Why are you coming towards me?\"", "\"….\"", "There was no reply. Only, a flirtatious smile gradually spread across her lips.", "'A temptress?'", "\"I’ll be going then. I have a lot of work…”", "The pheromones that stimulated his flesh were dangerously tempting, so the Snow Rabbit instinctively turned away its body.", "It was a common mistake made by herbivores.", "The carnivore ferociously pounced on its back the moment its prey turned its eyes away.", "Seol Jihu screamed as he fell.", "\"I’ve caught you.\"", "Teresa tightly held Seol Jihu who was flailing his limbs.", "\"P-Princess?\"", "\"Damn it, stay still for a moment, will you?”", "\"What are you doing?\"", "\"You’re the one who went off saying all those romantic words, and you want me to stay still?”", "Feeling her breath tickling his ears, Seol Jihu twisted his neck out of her reach.", "\"Nooooooo!\"", "\"This is one!\"", "A moment later.", "\"Eeuuup!\"", "A choked moan rang out of the reception room and out into the hallway.", "Two times, three times, four times… Screams which no one knew the meaning to endlessly sounded out.", "*", "'Twenty four times…'", "Seol Jihu lifelessly returned to Carpe Diem and called a team meeting.", "There was an incident where Hugo looked at the dark hickeys all over his face, neck, and collar and suspiciously asked if he had gone to a brothel, but Seol Jihu brushed over it and relayed what he had heard from the meeting.", "When he had finished speaking Jang Maldong asked.", "\"How do you plan to prepare?\"", "“We must first decide who’ll participate and submit a list. By today or tomorrow.”", "There honestly wasn’t much to decide. Since an emergency draft was proclaimed, Seol Jihu, Chohong, Hugo, and Marcel Ghionea who were Level 4 or above were required to participate.", "Those under Level 3 were allowed to decide whether or not to participate.", "\"Orabeo-nim. Me too!\"", "\"Absolutely not.\"", "Seol Jihu bluntly refused the moment Yi Seol-Ah raised her hand.", "Her courage was commendable but the Parasites weren’t something a mere Level 1 or 2 could go against.", "\"But!\"", "\"There are no buts. Don’t speak nonsense.”", "\"I'll shoot from behind. And I’ll run if it gets dangerous.”", "\"What are you planning to do if a flying Parasite decides to chase you? And if you decide to go, Sungjin will also want to. Do you both have a death wish?”", "Seeing Seol Jihu’s stern face, Yi Seol-Ah slowly lowered her hand.", "He felt sorry seeing her dejectedly hang her head, but it couldn’t be helped. He felt that she would persistently beg him if he didn’t refuse her strongly.", "\"And…\"", "Seol Jihu paused before rapidly blinking.", "He saw Jang Maldong, Chohong, and Hugo stare at him.", "\"Wow…\"", "Chohong scoffed.", "\"Well fuck… Does he even have a conscience…?”", "Jang Maldong cleared his throat.", "\"And?\"", "\"Since the Princess requested it, I’ll try to look for a partner group.”", "\"Do you have any in mind?\"", "\"I’ll have to look.\"", "Hugo suddenly interrupted.", "“A Priest. We should also look for a Priest.”", "\"Oh! Not bad at all.\"", "Chohong agreed. Seeing Seol Jihu tilt his head in confusion, Hugo explained.", "\"Think about it. It’s a war on the scale of hundreds of thousands. Having a Priest that prioritizes our team isn’t bad at all.”", "'He’s right!'", "A person’s natural thought process was like so.", "When two individuals were in danger at the same time, a person would naturally try to save someone they knew first.", "Seol Jihu also thought that he would probably do the same himself so he understood.", "To be honest, he wasn’t comfortable with the thought of receiving special care through a bribe, but a war wasn’t a joke.", "After hearing that such a thing was common during wars, he agreed to do so.", "“I think I know what you mean. I’ll try to talk to her.”", "“Uhuh. Do your best, Leader.”", "Hugo raised his thumb and grinned.", "Surprisingly, Maria had not run away and was still at the temple.", "'How do I convince this money grubber…?’", "Seol Jihu prepared himself to be yelled at but…", "\"Oppa! You came!\"", "He doubted his eyes and ears seeing the amiable blonde girl sweetly welcome him.", "\"Why are you only coming now~ Do you know how long I’ve been waiting? You almost made me sad thinking that you found another Priest~.”", "No. She wasn’t just being sweet. The Maria who was clinging onto his side like a cicada looked like a complete stranger.", "Seol Jihu was able to remove his doubts only after looking at her room that had evolved from a garbage dump to a sewer.", "Maria sat on the bed, delicately sucking on a cigarette before opening her mouth.", "\"You’re here because of the war, aren’t you?\"", "'She knew?'", "Then again, as a Level 4 Priest specialized in healing, she must have received quite a few offers here and there.", "Seol Jihu decided to get straight to the point.", "\"You’re right. First, take this.”", "Thud!", "A heavy money bag was placed on the table.", "It wasn’t a Ching! but a Thud! that rang out.", "Looking at the bag that looked like it was on the verge of exploding, a glint flashed in Maria’s eyes.", "But Maria immediately stiffened her face.", "\"Oppa! What do you think you’re doing?\"", "As if he had expected her reaction, Seol Jihu placed his hand inside his coat again. Maria chewed her lower lip.", "There was a limit to being patient. It was clear as day that she was going to go broke one day if she fell for the moneybag-attack again.", "Money was Maria’s only weakness.", "But it was money that she couldn’t receive in order to carry out the big plan she had in mind.", "\"Oppa!\"", "So she stood up while shouting.", "\"That’s not what I meant! Just who do you think I am?\"", "\"Huh? It’s money…\"", "\"Money? Fine. I like money. I like it but… Haah. Do you really not know why I’m like this?”", "Maria stared at him with an indignant face. Not knowing what was happening, Seol Jihu was flustered.", "\"Oppa, I may be a money-grubber, but I’m a proper woman who has morals.\"", "\"…Huh?\"", "\"It’s a different story if it’s an expedition or an exploration. But this is a war. It’s an obligation that we all have to keep… Were you planning on making me a shameless bitch?”", "\"Excuse me? Miss Maria?\"", "\"I’m really disappointed. Just what did you view me as…?”", "Tears started to well up in her big eyes. Seol Jihu gaped his mouth open.", "\"I’m so sorry. I didn’t know what Miss Maria was thinking… Then can you accept this as a token of appreciation?”", "He acted like he didn’t know what to do before pushing the money bag towards her. Maria’s neck trembled before flinging her head the other way.", "\"Take it back. Just how much more are you planning to shame me?”", "\"….\"", "\"I’m so disappointed. It’s not like we’ve seen each other once or twice. We’ve been together since the Neutral Zone… But I guess I was the only one who thought that way…”", "Maria spoke with a sorrowful voice as she tightly closed her eyes. A clear stream of tears flowed down.", "An awkward silence filled the room.", "'One, two, three, four…'", "Maria silently counted up to ten before opening her eyes. Confirming that Seol Jihu looked apologetic, she inwardly gave a satisfied smile.", "It was enough pushing. Now it was time to pull.", "\"It’s fine. Just introduce me to the new member sometime.”", "\"Introduce?\"", "\"I heard your team recruited the Archer of Steel. I’ve got to know his face if I’m going to look over your team.”", "Meaning, she had accepted Carpe Diem’s offer.", "\"Miss Maria!\"", "Seol Jihu’s complexion grew brighter. Maria crossed her arms.", "“I was planning to visit your building sometime today or tomorrow anyways.”", "\"Thank you! I, I really…”", "\"Enough. After making me feel depressed… Is it a hobby of yours to hand out medicine after giving poison?”", "\"I really didn't know— that Miss Maria was this sort of person. You’re amazing! Really amazing!”", "\"… Anyways, in return to prioritizing the team, you have to keep me safe, okay?”", "\"Of course!\"", "Maria acted like she was wiping off her tears with her hands. But it was really because she needed to hide her lips that threatened to curl up into a grin.", "There was only one reason that Maria did all this for.", "After the Banquet, her brain’s evaluation of Seol Jihu greatly increased. Maria who was materialistic to her bones, had carefully calculated the young man in front of her eyes before reaching a conclusion.", "'This product… no. This man..’", "He was skilled, rich, and generous.", "Above all, the fact that he would always pay back more than he received pulled Maria’s heart.", "In other words, it was a product with profits 100% guaranteed.", "Yes. This was an investment for the future.", "It was not Maria Yeriel in the room. It was the Queen of Stocks, Maria Buffett.", "In the situation where the foreign stock market shook, causing the domestic market to become unstable…", "Maria resolutely chose to invest in a product called Seol Jihu.", "Despite how she had blathered on and on about how disappointed and sad she was…", "‘He wouldn’t suddenly back out on his words, right?’", "Feeling excited just thinking about how much she would profit when the market stabilized, Maria’s lips curled up.", "Of course, it was yet to be seen whether it would hit an all-time high or go bankrupt due to trade suspension or delisting."]}