{"cid": "247", "title": "Chapter 247. Eva's Night (2)", "content": ["The VIP auction house was a place that could be called a treasure house.", "As many precious products were up for display, there weren’t just a few who were keen to lay their hands on them. And being aware of this fact, the manager of the auction house consequently spent considerable effort in the security of the place.", "This was evident from the Earthlings jumping out from all over the place and the Archers who had positioned themselves on the roofs as soon as there was an uproar at the entrance.", "\"Huh? What are those guys?”", "There were only half a dozen people.", "One of the Archers, who had been keeping watch indifferently took aim with his bow.", "But the moment he notched an arrow and activated his Thousand-Mile Eye, he clearly saw…", "…A grey-haired man taking precise aim at him with a white crossbow.", "The moment he realized his mistake—", "Siik!", "The Archer’s body quivered. The bow and arrow both fell from his hands. His body began to sway back and forth before he eventually couldn’t steady himself, crashing down from the roof and rolling like a limp doll… with a bolt sticking out from exactly in between his eyebrows.", "The Archer, who was about to take out a communication crystal after seeing the commotion made a dumbfounded face.", "And one second later, a bolt struck his forehead as well and toppled his body backward.", "That was the start.", "Siik, siik! Bodies fell without fail every time the sound of something splitting through the air was heard.", "With a terrifying sniping skill and a quick reload time, it didn’t take long before everyone on the roof was dealt with.", "\"All rooftop personnel eliminated.”", "Lowering his Laurel of Triumph, Marcel Ghionea grabbed another handful of bolts from his quiver.", "\"Okay. Then we don’t need to worry about being shot at anymore, right?”", "Phi Sora spoke with confidence and held her shield out in front of her. She then tightly braced her arm and bent her knees to take a stance.", "A strange flow of heat sizzled out from her entire body as she circulated her mana.", "\"No need to help!\"", "After leaving those words, Phi Sora recklessly charged towards the mob that was running towards them.", "She accelerated in an instant and started charging with tremendous force that threatened to split the ground beneath her feet.", "Her appearance was so similar to a full-power charge of an angry bull that the people running towards her were taken aback and slowed down.", "But before the approaching mob split left and right to avoid her, Phi Sora heavily stomped the ground with her body still lowered.", "\"Uriya!\"", "Boom!", "\"Ahhhh!\"", "An Earthling flew through the air with blood spurting out over his entire body while screaming.", "That wasn’t the end.", "The shockwaves that spread out from the point of the impact caused several individuals to lose their balance and collapse.", "And one woman with fluttering red hair leaped into the crowd.", "\"Don’t~!\"", "Her impressive long sword slit through the neck of a person on the ground.", "\"Condemn me~!”", "And crushing his face with her foot…", "\"As a merciless woman~!”[1]", "Bang!", "She slammed the face of another Earthling who was desperately trying to steady his body with her shield.", "Fwooosh!", "Next, vivid flames ignited from her long sword. Phi Sora glanced left and right with a smile plastered on her face before raising her voice.", "\"I only chose parting for a while for you~!\"", "The crowd surrounding her hurriedly parted to the side. Their gazes looked like they were staring at a crazy bitch.", "Phi Sora grinned and adjusted her grip on her sword. Seol Jihu, who had been glancing at the situation on his right turned his eyes back to the front.", "There was no need to talk about Phi Sora’s skills. She was a True High Ranker acknowledged by Jang Maldong. She must have told him to go on ahead because she must be confident.", "Seol Jihu pushed open the doors to the building without any hesitation.", "It was still dark inside. At the end of the corridor was a single staircase that led up to the second floor.", "Marcel Ghionea spoke.", "\"The building looked like it had three floors from the outside. If the manager is inside, it’s most likely that he’ll be on the top floor.”", "Of course, this did not mean that there wasn’t anyone on the first floor.", "Judging by the clamor inside, there was no doubt that they were reacting to the situation, albeit a step late.", "\"I’ll take over here.”", "Marcel Ghionea turned around and knelt on one knee as soon as he arrived in the middle of the stairs.", "His intention was to cut off the enemy's advances from the back since it’ll be troublesome to face them from both sides.", "Seol Jihu did not say useless words and continued walking up the stairs.", "Only Maria stopped her steps and did not follow Seol Jihu after giving him a glance. She held her crucifix artifact in one hand and turned her neck around.", "\"I don’t need help.\"", "Marcel Ghionea spoke frankly without even meeting her eyes.", "Maria giggled.", "\"You must be very confident?\"", "Marcel Ghionea raised his white crossbow and aimed it down the stairway. He revealed his teeth as he smiled and empowered his crossbow with mana.", "\"I didn’t want this thing for no reason!”", "\"I…\"", "He drew a line with the crossbow from left to right.", "Tutatata!", "A series of bolts were launched like bullets at the same time as the enemy revealed themselves from the corridors.", "\"Who are you basta— Ack!”", "As soon as the person shouted, the volley of bolts pierced through their chests and tore their shins. The power behind each of the bolts was so strong that a person who got shot in the arm flew in a full circle in the air before collapsing on the ground.", "Everyone ended up on the ground as soon as they jumped out.", "Maria whistled.", "\"Aiya, as expected of the Archer of Steel. You sent all of them together to the afterlife.”", "\"I don’t need help. Go up.\"", "Marcel Ghionea spoke as he took out a handful of bolts. He reloaded the bolts with great dexterity before sharply staring forward all of a sudden.", "\"I thought so.\"", "Maria smirked. Then raising her crucifix artifact, she chanted a spell.", "\"Luxu Lu Luxura.”", "In the same instant the white barrier was erected, several arrows shot out from the front door and struck the barrier.", "\"Idiot. Did you think the enemy only had Warriors?”", "\"…\"", "\"Well, I guess that crazy woman missed a few of them while singing.”", "Marcel Ghionea lightly laughed.", "\"Right. I also found her a bit scary.”", "He calmly agreed and handled the enemy snipers one by one.", "It wasn’t over yet. The corridors became even more lively as they discovered the dead bodies of their comrades.", "Marcel Ghionea took aim again. Maria maintained the barrier and spoke in a clear voice.", "\"You know, it’s no fun to just kill them, so do you want to make a bet? You also have a lot of money, so let’s make the stakes high.”", "\"A bet?\"", "\"It’s called whack-a-mole. Every time someone arrives at my barrier, you give me money. 200 silver per person.\"", "\"What if I don’t allow a single person to come close?”", "\"Then I’ll neatly hand over a golden egg.”", "\"That’s… \"", "Marcel Ghionea raised the Laurel of Triumph to shoulder-level. Adjusting his eyes to the gunsight that he had personally customized, he revealed his fangs.", "\"…Not a bad deal.\"", "And together with those words, a fearsome succession of bolts and yells rang throughout the first floor.", "At the same time.", "Seol Jihu, Chohong, and Hugo went up another flight of stairs.", "\"It’s an attack!\"", "They were confronted with a group of enemies that rushed out the doors on the left and right corridors as if on cue.", "The stairs to the 3rd floor were at the end of the central corridor. They had to pass through this passage to climb further up.", "\"They’re a bunch of small-fries from the looks of it.”", "Spitting on her hands and rubbing them together, Chohong stepped towards the left corridor.", "\"I’ll take the left.\"", "\"Then I’ll take the right.\"", "Hugo also immediately turned his steps towards the right.", "They each grabbed their weapons and stretched their necks and shoulders.", "\"Seol. We’ll open up the way, so go straight ahead to the third floor.”", "After speaking, Chohong glanced at Hugo.", "\"Wanna bet who sends the least people through to Seol?”", "\"I’m in if you don’t use your High Ranker abilities.”", "\"Wimp.\"", "\"Yep. I’m a wimp.”", "They were cracking jokes with each other, but their motions were extremely menacing. It was their way of relieving tension before the battle.", "\"W-What’s with these punks?”", "The Earthling closest to them instinctively sensed danger and backed away in fear.", "With that as a trigger, the glints in Chohong and Hugo’s eyes changed.", "They both fiercely charged forward at the same time.", "Chohong powerfully swung her Thorn of Steel at the Earthling that was shrinking away.", "Pak!", "It struck the person’s ribs, causing his body to bend like a bow and completely smash into the wall.", "\"Kaaaaak!\"", "He let out a scream a beat later.", "\"Noisy.\"", "As Chohong lifted up her mace again, mangled bits of flesh came up with it causing blood to drip down. The man slammed into the wall and finally slid down.", "\"Why do you think they’re only watching from afar and not coming?”", "Hugo pointed forward and jeered at them. One of the men flew into a rage hearing that and shouted.", "\"Fuck, get them!\"", "At those words, almost twenty men charged at them all at once. A corridor’s narrow space was never a good place to fight in groups. Rather, it was a terrible move that completely discarded their advantage in numbers.", "But of course, Chohong and Hugo, who had both faced ten times more enemies all at once and had dealt with the Parasites’ First Army, did not bat an eye.", "\"Hah.\"", "Instead, Chohong snorted and stepped forward.", "Grabbing her mace with both hands, she slammed it into the face of the man that had thoughtlessly charged in like a baseball player batting an incoming ball.", "As soon as the man was slammed away, she twisted her arm back and powerfully struck the person behind her in the temple.", "Pak!", "She felt a satisfying sensation on her hand as the enemy’s head cracked open like a watermelon.", "The same went for Hugo.", "\"Whoop.\"", "Tilting his head, he avoided a crudely-swung long sword and grabbed the wielder’s forearm.", "\"Huut!\"", "When he twisted it with a bit of strength, the arm bent in a weird angle and let go of the longsword.", "Whether the person screamed or not, Hugo grabbed the crying man by his collars and raised him in front of himself.", "He held a meat shield in his left hand and extended a shining halberd in his right hand. The sharp spearhead pierced through a person in front…", "\"Mmmmm!\"", "And as Hugo opened his eyes wide and flexed his arm, the spearhead completely pierced through the enemy and struck another one behind him.", "The enemy line collapsed in droves as he pushed on without stopping.", "A strange sight unfolded.", "Tens of people were attempting to subdue them, but they were being pushed back by two individuals.", "\"What’s going on? Are they really members of this organization? Are they just simple guards or something?”", "They even had the leisure to talk during battle.", "There was no helping it.", "People only participated in expeditions or explorations at the relatively safe city of Eva. The most dangerous thing they did was hunting down small groups from the Federation.", "It was only natural for such Earthlings who had only lived as if they were playing a game, to be suppressed by the warriors from Haramark who had fought against the Parasites with their lives on the line.", "Thanks to that, Seol Jihu was comfortably walking through the corridor without having to swing his spear once, but all of a sudden, his eyebrows twitched.", "He discovered two Archers preparing to snipe him from the end of the corridor.", "Immediately raising his left arm and circulating mana, four blue spears were shot out in succession from his palm.", "The evolution of his abilities allowed him to now fire them without taking a stance in exchange for a loss in power and accuracy.", "The Archers seemed surprised at the mana spears that were piercing through the air, but they did not move from their positions.", "It was because a white film of light immediately spread out in front of them.", "Tong, tong, tong.", "The barrier somehow withstood three hits, but it couldn’t withstand the fourth shot and disappeared after being ripped through like paper.", "Seol Jihu’s eyes narrowed.", "'A Priest?'", "With his enhanced vision that was greatly improved after eating the Golden Wind Phoenix, he instantly spotted a staggering Earthing dressed in white robes.", "Snorting, Seol Jihu fired another Mana Spear with an expression that said, ‘Try blocking another one’.", "\"Uuk!\"", "The unsteady Priest started throwing up blood…", "'That’s impossible…!'", "…And sharply inhaled seeing another Mana Spear flying towards her.", "'My mana is Intermediate (Low)…!”", "It wasn’t a low figure considering she was only Level 3, but Seol Jihu’s mana was High (High).", "There was a large disparity between the difference of even a single level, so it was needless to say much for a difference of an entire rank.", "She didn’t have a crucifix artifact nor had any time to chant a new spell. There was nothing she could do but stare at the instantly approaching mana spear with a look of disbelief.", "\"This is…!\"", "Puuk.", "The Priest doubled over as the spear struck her abdomen.", "\"A cheat—\"", "The spear’s momentum sent her flying with her arms flailing and her long hair fluttering before being struck against the stairs.", "Seol Jihu was about to lower his left hand before he hesitated.", "By chance, a man somehow got past Chohong and Hugo only to dumbly stare around.", "Seol Jihu looked at the pathetic sight. The man was hesitating, not knowing what to do in the middle of a fight. Then again, he probably hadn’t ever experienced an actual war.", "While he was hesitating, his neck was blown apart by a mana spear fired right in front of him.", "Seol Jihu pushed away the headless corpse spurting up blood and lowered his hand as he walked past it.", "The number of enemies had dropped by half in an instant.", "Seol Jihu smoothly walked past the corridor where a slaughter was taking place, past the corpses of the two Archers and finally arrived at the place where a Priest with a hole in her stomach was lying down.", "She seemed like she avoided being instantly killed, but she looked like she went into shock judging from her convulsions.", "Seol Jihu indifferently lifted his feet.", "Craaaack!", "Crushing the Priest’s chest, he went up the stairs. He turned around the corner and started walking up to a desolate floor with wet feet.", "Soon, Seol Jihu arrived on the 3rd floor.", "1. A line from a Korean pop song. "]}