{"cid": "249", "title": "Chapter 249. Eva’s Night (4)", "content": ["Seol Jihu pulled out his spear, muttering quietly.", "“…So weak.”", "Setting the twins aside, he didn’t understand how the man managed to become a High Ranker. But he put the meaningless question aside for now and went to search the rooms on the floor.", "Although he checked every room thoroughly, he couldn’t see the manager. He only found two Beastmen, lying still as though they were dead.", "Then again, considering the ruckus he caused, the manager not showing up until now could only mean one of the two things — either he was hiding or he had already escaped.", "At that moment, he heard footsteps coming up the stairs.", "Chohong, Hugo, and Maria appeared one after the other.", "None of them looked hurt. But Maria’s cheeks were red as if she was extremely angry.", "Chohong raised her Thorn of Steel and shook it left and right.", "“Oh, did you get the boss?”", "“I can’t find him.”", "“He must be hiding. The clean up is more or less finished. The crazy singer is guarding the entrance.”", "“Where’s Mister Marcel Ghionea?”", "“Searching the building. He said he’s gonna go check if anyone is hiding.”", "Seol Jihu fell into thought before moving his steps. He had to go to that place anyway.", "He went back down to the first floor, found the path to the basement and walked down. Just as he expected…", "“Yes, yes, a group of lunatics… The goods are fine. Of course, the important goods are also…”", "The manager he had seen earlier in the day was holding a communication crystal, talking. An adolescent Foxman was being squeezed in his arm.", "Did he feel Seol Jihu’s gaze? The manager looked back before jumping in shock.", "“N-No way! Where’s Jirayu Matthew…!?”", "When Seol Jihu stomped forward, he dropped the communication crystal in a fluster.", "“You’re…!”", "Finally recognizing Seol Jihu, Hugh Rodrigo staggered backward. His eyes then glinted, and he quickly choked the young Foxman with his arm.", "“S-Stay back!”", "Seeing the young Foxman stifled for breath, Seol Jihu’s eyes flickered with light.", "“You must be here for the goods, right?”", "Pang, pang, pang! Without a moment of hesitation, he activated the Festina Earring three times.", "“You think I’ll hand them over so easily!? I’d rather kill them all and …!”", "Whish! A fierce wind blew past, and Rodrigo squinted his eyes.", "An unknown pressure brushed past his chest for a moment, but he shook his head and continued.", "“Make their values…?”", "With a dazed expression, he stopped in the middle of his sentence.", "“….”", "He lowered his gaze and couldn’t see the Foxman he had in his hand.", "Rodrigo stealthily rolled his eyes up. There, he saw Seol Jihu’s back. Having passed Rodrigo before he even noticed, Seol Jihu was standing tall, gently hugging the young Foxman in his arms.", "Rodrigo was shocked. He hadn’t even seen him move!", "Even the Foxman child was astonished, looking up at him with widened eyes.", "Rodrigo’s mouth opened wide.", "“Chohong, Hugo.”", "Seol Jihu spoke while carefully putting the Foxman down.", "“Make sure he can’t escape. You can break his teeth if he keeps spouting nonsense.”", "“Roger!”", "Hugo shouted as he spun his arm in a circle.", "Seol Jihu looked back at the steel cages and raised the Spear of Purity. The sudden uproar had caught the enslaved foreign race’s attention.", "Seol Jihu swung his spear at the nearest cage. Swish. As expected of a divine spear, it cut through steel like tofu.", "As the steel bars of the cage fell down, a huge hole was created above it. There, he could see a Foxman, her limbs chained to the now-severed bars.", "She must not have expected this sequence of events as she was clearly taken aback. Her faded ears were standing up stiffly, and her tail was wagging gently.", "Seol Jihu promptly cut the chains off, freeing her completely.", "The Foxman twisted her body, swaying greatly as if she couldn’t get used to the long-found freedom.", "She held herself up by holding onto the wall and asked with a doubtful face.", "“…What are your motives, male human?”", "Seol Jihu spoke calmly.", "“We came to save you.”", "“?”", "“We’ll send you back to the Federation. It may be hard, but please cooperate with us.”", "Was a rescue outside of her expectation? A clear hint of suspicion spread on the Foxman’s face.", "There was no time to waste on convincing her. Seol Jihu rummaged through his belt, took out a healing potion, and poured it into the Foxman’s open mouth.", "“Uup!”", "The Foxman’s eyes widened. After barely being able to stand from suffering all kinds of torment, her body regained a little bit of vitality.", "Seol Jihu turned around. There were dozens of cages in the basement. He had to get to work.", "“H-Hey! Just take one, you bastard!”", "Rodrigo shouted in frustration.", "“Shut it!”", "Chwak! But Maria slapped his cheek, yelling.", "“You’re the manager here? You fucking piece of shit, you call this security? What the fuck is wrong with you!?”", "“W-What!?”", "“How can even a single guard fail to get to my barrier? How the hell did you only get these shit-for-brains as guards? I have to give up a gold egg because of you!”", "Maria slapped his cheek again and again, spitting out curses one after the other, while Rodrigo shed tears begrudgingly.", "Seol Jihu paid no attention to them and focused on liberating the foreign races. Finding a Sky Fairy shivering in the corner of her cage, he quickly cut the steel cage and removed the chains binding her.", "“Are you okay?”", "“Ah!”", "The moment he approached her, the Sky Fairy dropped her head and raised her hands. Her mouth opened, but like a goldfish, no sound came out. She seemed to be suffering from mental trauma due to the terrifying experience she had.", "Looking at her carefully, one could see that she was in terrible shape. She must have been beaten severely as she seemed to be in the worst condition among the prisoners held captive in this basement.", "While Seol Jihu was at a loss for words, another Sky Fairy approached her and gently embraced the Sky Fairy who was groaning strangely.", "“It’s fine, it’s fine. Everything’s over, Lacia. We’re saved. We can go back home.”", "With a member of her own race comforting her, the Sky Fairy’s trembling subsided slightly. The Sky Fairy who just walked up asked with a hoarse voice.", "“Can I ask you to heal her?”", "Seol Jihu snapped out of his daze and called for Maria. The Priest who was busy slapping Rodrigo’s face endlessly, drew a deep breath and responded to the summon.", "Once she saw the Sky Fairy’s condition, she clicked her tongue.", "“Holy fuck… I don’t think an ordinary spell is going to cut it. Damn fucking pervert, he surely did a number on her.”", "“Please do what you can.”", "“Sure, sure.”", "She chanted a spell in a murmur.", "Seol Jihu went back to rescuing the prisoners. The liberated foreign races staggered out of their cages, surrounding the manager.", "Feeling an instinctive danger, Rodrigo struggled to escape but became silent after taking a dozen of Hugo’s fists.", "By the time Seol Jihu finished liberating everyone, most of the foreign races were sending heated gazes at Seol Jihu.", "They weren’t fools. Not only did he subdue the bastard who locked them up, but he also healed them as well. They knew that Seol Jihu was here to help.", "But there was one thing they dearly wanted.", "Having received their message full of strong desire, Seol Jihu took a step back. He leaned his head forward and reached out with his hand, gesturing, Do what you want.", "Killing intent soared, as dozens of gazes fell on one spot. The intensity made Hugo, who was holding Rodrigo’s neck, flinch.", "“Ha… Just how badly did you treat them?”", "Hugo shook his head and threw Rodrigo to the ground.", "The fat man rolled on the ground, and a dozen howls immediately burst out. The foreign races pounced on Rodrigo simultaneously.", "One, two, four, eight… Rodrigo was covered by the foreign races, who jumped forward from all directions. The Beastmen tore his hair out, dug out his eyes, and cut open his stomach to vent their anger. It was as if a group of zombies was devouring a live man.", "Seol Jihu, who was watching silently, suddenly felt someone approach him. It was the Sky Fairy who previously showed signs of trauma.", "She didn’t participate in exacting vengeance, instead staggered toward Seol Jihu and softly grabbed the hem of his shirt.", "She knelt down, almost in a crumbling fashion, and looked up. Her eyes were still haunted by horror, but her expression was even more desperate. The Sky Fairy opened her mouth, mustering up great courage.", "“C-Child…”", "‘Child?’", "“Child… my child… please… please…”", "She wept in a pitiful voice.", "‘Don’t tell me.’", "Seol Jihu suddenly remembered the adolescent Sky Fairy who appeared at the auction.", "“Is your child… a young boy?”", "Seol Jihu asked just to be sure, and light returned to the depressed Sky Fairy’s abyss-like eyes. She nodded her head, squeezing the hem of Seol Jihu’s shirt tighter as if he was the Messiah.", "But with everyone participating in the auction wearing masks and robes, Seol Jihu had not seen the buyer and was at a loss for what to do. It was then.", "“Here you were.”", "Marcel Ghionea opened the basement door and walked down the stairs, dragging a willowy man with his hand. It was the host who carried out the auction.", "Seol Jihu’s eyes flickered with light.", "“He was hiding. I interrogated him, and he doesn’t seem to be the manager.”", "“Good job.”", "Seol Jihu replied quickly and held the man up by his collar. He seemed to have been beaten up a few times already as he was bruised all over his face.", "“Answer properly if you want to live.”", "Seol Jihu’s cold tone even frightened himself. The man nodded his head crazily, his eyes wet with tears. Marcel Ghionea must have handled him well as he was quite cooperative.", "“You remember the Sky Fairy at the auction today, right? The young boy.”", "“Y-Yes! I do!”", "“Who’s the buyer? Do you know him?”", "“Yes, I do!”", "“You do?”", "“Yes! I’m sure that it’s Sombat La-ongmanee!”", "Seol Jihu furrowed his brows. The man quickly continued.", "“I’m not lying! I’ve been hosting the auction for a long time and we get many repeat customers! The product was that bastard’s taste as well! I’m positive!”", "It didn’t sound like he was lying. Seol Jihu threw the man backward, and a terrified shriek rang out.", "‘Sombat La-ongmanee? I’ve never heard of him before….’", "It wasn’t as if he could go around looking for a random Earthling. Realizing that he needed to get some information on this guy, he reached into his pocket to take out the communication crystal. It was then—", "“Sombat La-ongmanee, the leader of Royal Pattaya, one of Eva’s eight organizations. Their main business is loan-sharking and gay trade, and he’s known to enjoy homosexual relationships with young boys before killing them through torture.”", "Suddenly, a familiar voice rang out behind him. Turning around, Seol Jihu’s eyes widened. Kim Hannah was walking down the stairs with a coy look.", "“Royal Pattaya has a total of 76 members — 11 Level 2s, 36 Level 3s, 28 Level 4s, and 1 Level 5. The average level is 3.25. Two Priests, no Magicians. Their ace is the High Ranker Warrior, Jirayu Matthew.”", "Reciting information about Royal Pattaya, she walked up to Seol Jihu. After looking around the basement, she let out a small sigh. Then, she asked in a determined manner.", "“You’re going, right?”", "Seol Jihu blinked in surprise before nodding. Kim Hannah bit her lower lip and took out a small notebook from her pocket. She scribbled something on the paper before ripping it out and handing it over. It was a map to Royal Pattaya.", "Seol Jihu took the map with a renewed look. He remembered Kim Hannah being against it previously, but now her attitude had changed.", "Of course, there was a reason Kim Hannah’s attitude took a complete 180-degree turn. She thought wrong from the very beginning. She planned to guide Seol Jihu in a specific direction, but he strayed off completely.", "Mainly, Seol Jihu was someone who could not be controlled.", "As such, she had no choice but to go another way. Kim Hannah had to match herself to Seol Jihu.", "The matter had already been blown out of proportion and was impossible to reverse. The worst move she could make now would be to end things halfway.", "It might have been better to not do anything, but now that they started this mess, they had to see it to the end. Not only was it the correct thing to do, but it was also the only thing they could do.", "“Eva’s organizations have a 1 Strong, 3 Middle, 4 Weak structure. Royal Pattaya is a Middle-level organization.”", "Kim Hannah’s calm voice…", "“Go. You can leave this place to me.”", "…suddenly turned sharp.", "“You need to crush at least one organization until the sun comes up. Make them have no hope of revitalization. Only then can we worry about our next move.”", "“Royal Pattaya, huh.”", "Marcel Ghionea put on a worried look.", "“That doesn’t sound easy. The auction house is one thing, but directly striking the organization’s headquarters should be a lot more difficult.”", "“No, it should be more than doable.”", "Kim Hannah’s ponytail fluttered in the air.", "“Not all organizations started out in Eva from the beginning.”", "That was obvious.", "“They raised their forces and fought each other over benefits before being recognized as organizations. Royal Pattaya was one of them.”", "“That’s possible?”", "“Back then, forming an organization wasn’t as hard. The kingdoms encouraged it, in fact. The standard only went up after that incident happened in Eva.”", "[To be honest, I’m still a little confused. I don’t know why they made the procedure so complicated.]", "[Well, it wasn’t like this in the past….]", "‘Ah.’", "Seol Jihu finally realized why Kim Hannah was so confident and why Hao Win wanted to come to Eva.", "Most likely, a majority of Eva’s eight organizations had not followed the proper procedures like Carpe Diem, pulling underhanded schemes to reach the status of organizations.", "“By my standards, among Eva’s current organizations, only two, or three if I’m being generous, are enough to be recognized as organizations in Scheherazade or Haramark.”", "The eight organizations would be scary if they worked together, but dealing with them wasn’t impossible if one could handle them individually.", "Chohong nodded her head in agreement.", "“Yeah, the guys here are all shrimps. If they’re forced to participate in a war, they would die before they could do anything.”", "“No. I bet not a single one of them will die.”", "“?”", "“Because they’ll run away without fighting.”", "Chohong sniggered at Kim Hannah’s ridicule. Meanwhile, Seol Jihu checked the location marked on the map. Just as he was about to leave…", "“Seol Jihu.”", "Kim Hannah stopped him with a cold voice.", "“If you’re going to do it, do it properly.”", "Though she said this, she was already sure of their victory. The leader, whom she thought would walk the path of royalty, had instead chosen to walk the path of a conqueror.", "That wasn’t bad either.", "After carefully reflecting on the matter, she decided that Seol Jihu could easily walk this path. After all, Carpe Diem still had a secret weapon that had not been revealed to the world.", "Unless the enemy brought in a Unique Ranker Priest, it was far more likely for Carpe Diem to be triumphant.", "“Slaughter them thoroughly. I better not see any half-assed show of mercy.”", "Seol Jihu laughed quietly. Crumpling the paper map in his hand, he began walking…", "“Let’s go.”", "…To his next destination, Royal Pattaya."]}