{"cid": "445", "title": "Chapter 445. While He is Gone (2)", "content": ["Seoul, SY General Hospital.", "The morning sky was quiet and peaceful, but the private ward on the highest floor of the hospital was extremely rowdy.", "“Just what…!”", "Seol Jihu slowly opened his eyes as a clamorous, high-pitched voice struck his ears. His face faintly convulsed as soon as he caught sight of his surroundings through his blurry vision.", "The last thing Seol Jihu remembered was being subdued by a group of men in black suits and losing consciousness. However, he wasn’t in a dark warehouse or anything of the sort. In fact, he didn’t even see a single person wearing a black suit.", "The people making his ears hurt were none other than his family.", "“What the hell do you mean!? An unexpected accident!?”", "His father was yelling furiously. With a flushed face, he was shouting again and again while pointing his finger at a woman’s face. The woman, whom Seol Jihu did not recognize, cupped her hands together and apologized.", "“Just when we’re trying to move on and begin a new life…!”", "As his father’s voice went up, the woman lowered her head even more. Meanwhile, his mother was crying.", "“Jihu…. What happened to you…. Just when Jinhee got better….”", "She was holding onto his hands and crying endlessly.", "Soon, he saw a doctor wearing a white coat and a nurse with a bobbed hair walk in hurriedly.", "The nurse went between the woman and Seol Jihu’s father, and the doctor seemed to explain something to the father.", "However, the situation had not calmed down in the slightest.", "Seol Jihu’s father shoved the doctor in the heat of the moment. The doctor fell backward, and the nurse let out a short yelp.", "Seol Wooseok and Seol Jinhee then had to spend a considerable effort to calm down their father.", "All the while, the woman that Seol Jihu was unfamiliar with kept her head low as if she committed a grave sin. Beads of water were falling from her eyes.", "‘Just who is she…?’", "Seol Jihu’s thoughts didn’t go on for too long. Intense drowsiness flooded him as though he had been injected with anesthesia or some other sleep-inducing drug.", "As Seol Jihu closed his eyes, the last thing he saw was Seol Wooseok guiding their father out.", "How much time went by?", "When Seol Jihu opened his eyes again, everything was silent. The first thing he saw was the ceiling of the hospital room and the IV line.", "Beep…. Beep…. Beep….", "Periodic beeps rang out as well.", "When he turned his head to the side with great difficulty, he saw a patient monitor displaying his heartbeat along with other information.", "Only then did Seol Jihu realize that he was in a hospital room.", "The sunset reflected an orange hue from the steel-barred window. It was morning when he woke up from sleep and was assaulted by a group of mysterious people. It seemed half a day had gone by since then.", "Seol Jihu breathed out a long sigh. Perhaps because he was dizzy, he wasn’t sure if he was awake or still half-asleep. It was hard to tell if he was in a dream or reality.", "Almost like he was suffering from severe amnesia that he had only seen before on TV dramas. He couldn’t tell who the unfamiliar names on his phone were, what happened to those mysterious suited men, why he was suddenly brought to the hospital, or who that sorrowfully crying woman was….", "All sorts of thoughts wandered in his head.", "“Ugh….”", "He groaned with a heavy frown. He got a headache when he tried to think about them.", "But this much was bearable. Perhaps because he was still a little numb, but he couldn’t feel that much pain.", "“Ah….”", "Seol Jihu tried to get up but then realized he couldn’t move his body. It was only then that he saw black straps tying his arms and legs to the bed. Even his thighs, waist, and chest were tied up.", "Seol Jihu looked at the restraints with a dazed face before lying back down. He didn’t have the strength to struggle, and he felt rather sleepy anyway. His mind was hazy, perhaps from the drugs that were still in his system.", "Seol Jihu closed his eyes halfway and looked up at the ceiling. He didn’t want to think about anything.", "He just wanted to lie there and rest.", "For eternity.", "*", "The crazy day went by, and night arrived.", "Seol Jinhee heaved out a deep sigh as she awkwardly stood in front of a hospital room door.", "She came to the hospital after getting a call from her mother, but she still wasn’t sure what happened.", "“Really… why does it have to be like this….”", "Seol Wooseok, who was sitting on a bench in front of the door, dropped his head.", "“I guess this is what people mean when they say misfortune never comes alone…. Right after you got discharged from the hospital, something like this happens to Jihu….”", "Seol Jinhee nodded unknowingly at Seol Wooseok’s mumbling. She felt the same way.", "“God sure is heartless…. Just when I thought things were going back to normal…. Fuck, how is this fair?”", "Seol Wooseok spat out a curse.", "Seol Jinhee stared at her older brother with a complicated expression as he wrapped his hands around his face. She had never seen Seol Wooseok so frustrated.", "It wasn’t just Seol Wooseok either. Her father smoked one cigarette after the other before leaving, murmuring, “not letting those sons of bitches at Sinyoung go.” Her mother cried all day long and ultimately cried herself to sleep.", "‘That troublemaker….’", "Seol Jinhee glared at Seol Jihu and grumbled inwardly. There really wasn’t a peaceful day with him around.", "“…I’ll go get something to drink.”", "After a brief silence, Seol Wooseok got up from the bench. Seol Jinhee watched him trudge off before falling into thought.", "‘That bastard, is he scheming something again?’", "For example, he could be pretending to have a psychological problem so he could use it as a pretense to go gamble.", "Then again, it didn’t make sense for the doctors and nurses of a famous hospital to cooperate with a single person’s scheming.", "Seol Jinhee knew this, but she couldn’t help but have doubts due to the number of times she was tricked. To be more precise, Seol Jinhee’s unusually good intuition felt that something was off.", "Seol Jihu had supposedly collapsed out of the blue, and a representative of Sinyoung personally came and apologized, saying that they would do anything they could to compensate. On top of that, the doctors and nurses also said that he had dissociative amnesia from stress or trauma.", "It was almost like everyone was working together to sell a well-composed lie.", "‘Come to think of it, many of Sinyoung’s executives have been getting amnesia recently…. Were they used as guinea pigs for a new medicine? No, it doesn’t make sense for high-ranking executives to be experimental subjects…’", "As Seol Jinhee was mulling over a news report she heard the other day, faint footsteps rang out in the hallway. Seol Jinhee turned her head subconsciously, and her eyes immediately widened.", "A short-haired girl in a nurse’s uniform was walking toward her with a clipboard in her hand. It was the same nurse Seol Jinhee had when she was in the hospital after being shot.", "“Nurse Unni!”", "“Ah, hello, you haven’t left yet?”", "When Seol Jinhee got up and waved her hand, the youthful nurse bowed back in a greeting.", "“Are you feeling okay?”", "The nurse spoke comfortingly, but Seol Jinhee simply shrugged.", "“Of course, I’m not all that worried. I’m sure he’s just faking it.”", "“Ah…. He’s definitely not faking it…. Hold on.”", "With a bitter smile, the nurse asked to be excused and went into the room. She checked his eyes, asked him a few questions, and examined the patient monitor.", "Seol Jinhee watched the nurse with a look of interest. This cute nurse was rather famous in SY Hospital, being called the white-robed angel by her fans.", "She would sometimes place her hand on an injury and chant, ‘My hands are magic hands~’ And just like magic, the pain would disappear for real.", "Seol Jinhee had experienced this a few times as well.", "Soon, the nurse left the hospital room while jotting down a few things on her clipboard. She then heaved out a deep sigh. She usually had a cheerful smile that would brighten the day of those around her, but for some reason, she looked a little unwell today.", "“What’s wrong?”", "“Ah…. Mm….”", "“Eii, don’t worry about it so much. He’ll jump out of bed in a hurry if you say ‘let’s go gamble.’”", "“Gamble, huh….”", "Seol Jinhee said so jokingly, but the nurse had a serious expression.", "“I don’t know…. Gambling can be a good treatment method. There were cases in the past where drug addicts quit drugs through gambling…. But….”", "The nurse looked back at the room and continued.", "“I doubt mere gambling will be enough….”", "“Mere gambling?”", "“Yes. SY Hospital gets many patients like him. But your brother… his condition is especially serious…. To tell you the truth, most people aren’t that bad on the first day they’re hospitalized.”", "The nurse dropped her head.", "“External injuries can be fixed as long as the person’s alive…. Most internal injuries can be fixed too…. But even I can’t do anything about mental illnesses….”", "“…Excuse me?”", "Seol Jinhee asked in a daze.", "“The gap in his memory is too big…. I just don’t know what can fill such a gap…. Ah.”", "The nurse murmuring to herself, suddenly widened her eyes and raised her head.", "“N-Nothing.”", "She shook her head as if she made a mistake and then smiled.", "“Don’t be too worried. We will do our best. Oh right, keep the door open just to be safe.”", "With that, the nurse left the hallway with quick steps.", "Seol Jinhee stared blankly at a loss for words as the nurse disappeared into the distance. This was the same nurse who smiled and said she would heal a man dying from a car accident, so Seol Jinhee couldn’t help but be surprised by her lack of confidence.", "‘…Is it really true?’", "Seol Jinhee turned to the room where the door was open. Her glaring look subsided, and a look of worry replaced it.", "It was then.", "“…Hmm?”", "While she was silently staring at Seol Jihu, her eyes abruptly twitched.", "“Oppa….”", "Seol Jinhee muttered dazedly. While Seol Jihu emotionlessly stared at the ceiling….", "“He’s crying…?”", "A transparent stream of tears flowed down his eyes.", "*", "Roe Scheherazade was out at the city walls again. With her arms on the brick wall and her chin resting on her palm, she was expressionlessly watching a show — a public execution — happening beyond Gorad Boga.", "A long time had passed since the Parasites left the city. The human forces should have become aware of the situation by now.", "Alone in this vast city, she had no way of receiving any outside news. But, she figured that there was a chance that the situation was already over.", "Despite this, Yun Seora did not stop the punishments. It was locking the stable doors after the horse was stolen, but she carried out an investigation into everyone involved with Sinyoung.", "Without discriminating between executives and ordinary employees, she tenaciously investigated them, revealed any wrongdoings, and brought them to be punished. She even guaranteed that she would be able to get Yun Seojin soon.", "Roe Scheherazade felt an inexplicable trust from Yun Seora’s words. The corpses lying outside the city gave weight to her words.", "She brought one today as well. The captured man confessed his crimes only after a finger or two were crushed. He was stripped naked and was now dancing for everyone else to see.", "The things he demanded from Roe Scheherazade while raping her were now being done to him. However, Roe Scheherazade’s face was exceedingly expressionless even as she watched all this.", "A hint of boredom could be seen in her eyes.", "Of course, seeing a man nearing his 60s dancing naked wasn’t particularly a good spectacle. But shouldn’t it at least make her feel refreshed?", "Well, it did at first. Seeing her sworn enemies suffer the same humiliation filled her with sweet ecstasy on the level of narcotics.", "During this time, Roe Scheherazade enjoyed every moment of pleasure she got from the show and laughed every day while demanding all sorts of things from Yun Seora.", "But no matter how tasty a dish was, eating it every day was bound to make it boring.", "Roe Scheherazade felt her enjoyment decrease with each passing day. Then, after one point, she found herself watching the show from a sense of duty.", "She didn’t understand why. If she had to put a word on her feelings, she would only say that she felt… empty.", "She had started this matter with nothing but a feeling of hatred and vengeance. As a result, she had gotten her revenge to a certain degree.", "With her vengeance satisfied, her heart, which once seethed with anger from just thinking about her sworn enemies, turned cold.", "And now that the majority of her targets were gone… all that was left was emptiness.", "Forgiving? No, she had no intention of doing so.", "It was just that she no longer had a reason to live as the only desire that kept her going was disappearing.", "Now that she thought about it, the barrier enveloping the city was about to run out. Gorad Boga should be lifted soon after her revenge was completed.", "And when that moment comes…", "‘It seems I will have to seek your forgiveness, Gairos.’", "To apologize for destroying the Paradise you wanted to protect so much.", "Roe Scheherazade suddenly laughed.", "She was out at the city walls again. With her arms on the brick wall and her chin resting on her palm, she was expressionlessly watching a show.", "Watching the naked man bawling his eyes out and begging for her forgiveness, Roe Scheherazade suddenly raised an eyebrow.", "It was because she remembered the words of the attendant who should be one of the rotting corpses in the city by now.", "Although she inwardly scoffed back then, she changed her mind after experiencing it.", "“…Yeah.”", "Roe Scheherazade stretched out her arms over the wall.", "“You were right.”", "She leaned her head on her outstretched arms and murmured. A hollow chuckle escaped her twisted lips.", "“It’s fucking boring.”", "*", "The dilapidated bookstore in an alleyway of Honolulu was enjoying a peaceful day as usual.", "A white-bearded old man and a largely built black man were having a friendly conversation.", "“So, when is the next chapter coming out for that novel you’re writing?”", "“Ehei, didn’t I tell you not to badger me about it? Do you think writing is easy?”", "“Many of us at the hospital are avidly waiting for your work. I’m one of them.”", "“Keke, is that so? That’s troubling. It’s looking like it will take a while until I can write the next part of the story.”", "Despite calling it ‘troubling’, Ian guffawed as if he enjoyed the reaction.", "“Anyway, when did you say you were publishing it?”", "“After it’s complete. Why?”", "“I’m hoping you would do it fast. That way, I can cash in on the royalty.”", "“Royalty?”", "“You used my name without asking me, didn’t you? Don’t I deserve a piece then?”", "“Listen here, Mister Edward Dylan, that is not how this works.”", "Ian’s manner of speech suddenly became more formal.", "Just as Dylan laughed at Ian’s straight-faced answer, Ian suddenly turned to the door.", "An older man adorning a fedora and a navy blue suit was staring at him fixedly.", "“That’s….”", "“Do you know him?”", "“Be glad. It looks like I can write the next part of the story.”", "“Excuse me?”", "“Don’t just stand there. Come in!”", "As Ian got up and greeted the old man, Dylan got up along with him.", "“I’ll leave you two to talk then. I have to go back anyway.”", "Dylan excused himself. As he left, the old man stared at him with a longing gaze. When Ian told him to hurry in, he smiled bashfully and turned his head.", "“It’s been a while.”", "“Master Jang! How have you been? No, what’s up? It’s not like you to come without calling.”", "“I came to give you a hand with writing.”", "“Keu! My readers have been pestering me about it too! What great timing.”", "Ian offered the old man a seat. However, Jang Maldong did not sit down. He stammered a bit before taking off his fedora.", "“To tell you the truth… I came to ask you for a favor.”", "“A favor?”", "“Can you lend me the novel you wrote?”", "Ian blinked.", "“Sure, that’s not difficult at all…. By the way, did that young man come with you?”", "Jang Maldong’s complexion darkened. Seeing his concerned face, Ian tilted his head.", "“I doubt you’re asking me this because you suddenly took an interest in reading an amateur’s work…. Can you explain the situation to me?”", "“Of course.”", "Only then did Jang Maldong begin speaking.", "By the time his explanation ended, a grim look had taken over Ian’s face.", "“And so….”", "“Wait just a moment.”", "Ian cut off Jang Maldong. He then ripped out a piece of paper and brandished his fountain pen on it.", "“I understand what you’re saying. I’m sure it will have an effect. I have many friends at the hospital who got better because of it…. Now, I’m sure they’ll be happy to wait if I tell them I’ll have to go on a vacation to plan the next story.”", "Ian stood up and stuck the paper on the door. He then turned back.", "“Let’s get going. First, contact the most skilled Korean translators you know. The more, the better!”", "“No, I can do the translation…”", "“Don’t kid yourself.”", "Drrk! Ian opened the drawer.", "“You’re going to translate all this alone? When there’s no time to waste?”", "Jang Maldong did a double-take after seeing the volume of writing that was in the drawer.", "“That’s not all. Call up everyone who knows about that young man. It will be even better if they know personal information about him. If it’s difficult to have them come, go meet with them and bring back their stories.”", "Ian continued while quickly packing his bag.", "“This diary was written from my point of view. If we’re going to make it so that it’s helpful to that young man, it will be more effective to add stories that only he knows about. Or we can do it in a side-story fashion. Of course, it will be difficult and time-consuming to make major edits at this point, but I will do as much as I can.”", "He didn’t have many things to pack. After throwing his wallet, passport, writing material, and diary into the bag, Ian opened the door and looked back at Jang Maldong.", "“What are you doing? Let’s go! Come on!”", "The dazedly blinking Jang Maldong soon showed a look of determination.", "“Thank you!”", "“You can thank me later. For now, let’s head to Honolulu Airport! We can talk on the way there!”", "Ian already had his arm out as if to call for a taxi.", "His white beard was fluttering in the wind like a cape."]}