{"cid": "24", "title": "Chapter 24. Hidden Potential Bursting Out (1)", "content": ["“Interesting information?”", "“That man…. He might not be affiliated with Sinyoung.”", "Upon hearing Cinzia's straight-forward declaration, Agnes's slim, shapely eyebrows furrowed noticeably.", "“But that can't be. Kim Hannah definitely….”", "“Yes, Miss Foxy is affiliated with Sinyoung. But what’s important is that the gold stamp wasn’t issued by them.”", "“What do you mean?”", "“Our investigation revealed that the Temple of Gula has granted her the stamp.”", "Agnes lowered her head and closed her eyes. She did this out of habit whenever she needed to reorganize her thoughts.", "“To have another Gold Mark appear when Sung Shihyun is still missing…. So? Don't you think it's all a bit fishy?”", "“….”", "“Of course, nothing's certain. Well, it really doesn't matter even if Miss Foxy guides him to Sinyoung. They and we, Sicilia, might not be in a cooperative relationship, but we’re still in an amicable position with them, after all.”", "Agnes raised her head. Unfitting for her usual taciturn expression, there was a glint of a strange light in her eyes.", "“In that case….”", "“I'll deal with Maria for you. That girl won’t be opposed to the idea, anyways.”", "“Will it really be fine for me to get involved? With my personality, I will undoubtedly go all out once I start.”", "“Right back at you, Drill Sergeant Agnes. You'll have to give it your all, or else.”", "Cinzia's expression became somewhat sinister.", "“Sung Shihyun was an Irregular with a Gold Mark, and that man is also a Gold Mark Irregular. Conditions are seemingly the same. But if there is one thing different compared to how things were two years ago, then it'd be the trainers involved, isn'… Ah, right, I guess Sung Shihyun was personally trained by an ‘Executor’, so I guess there would be some differences.”", "Cinzia didn't miss the brief flash of fury rising up on Agnes's face.", "“If you think you can do it, then go for it. Show me what the Sicilia's infamous demonic instructor, the conqueror of the South, has to offer.”", "“In case that man becomes a powerful enemy that stands in our way at a later juncture, please do not blame me.”", "Agnes bowed her head in a respectful manner and quietly made her exit from the room.", "“….Hmph. Did I push her a little too hard?”", "Cinzia exhaled the cigarette smoke and chuckled to herself.", "*", "[Foot Race (Number of available attempts: ꝏ/ꝏ)]", "Run around the track until you collapse from fatigue!Difficulty: BasicWhen successful: +10 SPWhen unsuccessful: N/A*Cooperation not allowed", "Hoo-hoo, haa-haa, hoo-hoo, haa-haa…", "Seol was running on the track with a completely empty mind while utilizing the breathing method Yi Seol-Ah had taught him. By now, he had long gotten rid of the habit of keeping count the number of laps he’d done. He simply did as the mission required from him – run until collapsing from the exhaustion.", "After a certain point, he stopped noticing his body improving. There was only one reason why he continued to train like a madman and that was to win the competition against himself. Like now.", "He maintained the highest speed he could muster and lapped the track dozens of times; yet, as if he was trying to run around the endless ocean, he saw no signs of the finish line.", "It was quite obvious that Seol's stamina wouldn’t be infinite. No matter how hard he struggled, he would eventually reach his limit.", "When that happened, temptations would quickly flood in. They’d whisper, ‘You've done enough. Take a short break. It'll be fine to walk for a bit, why don't you slow down a little…’", "When he was so short of breaths that he felt like he'd die at any second, everything around him seemed to fade away. Even taking one step forward became excruciatingly difficult. It was as if a giant wall was blocking his progress. It was telling him that this was as far as he could go.", "“….”", "Suddenly, a drop of tear leaked out from the corner of his eye. He wanted to cry.", "He wanted to cry because it was so hard. He knew it was pathetic, but he still wanted to collapse on the floor and cry his eyes out. Then, maybe, just maybe, he'd feel a lot better.", "Other survivors were too busy completing various missions, yet why was he here, doing this thankless work all by himself? It wasn't as if anyone would acknowledge the hard work and sacrifice he had put in. No, he began to regret the fact that he entered this place in the first place.", "“Kkheuck!”", "Seol resolutely held back his tears. He gritted his teeth and endured. Whenever he was on the brink of falling to those whispers, he felt an unpleasant sense of deja vu.", "For some reason, he felt like he would fall into his old habit of gambling again if he couldn’t overcome this here. He'd rather die than fall back into that hateful state ever again.", "He thought that wishing for a change when he couldn't even win against himself was an unfunny joke not worth repeating.", "This desire, this drive to 'not admit defeat' became the motivating force that ensured he would never falter.", "Just recalling the days when he was lost to the ecstasy of gambling boiled his blood and enraged him. Remembering back to how badly he ended up disappointing his family and how he made Yoo Seonhwa cry, he gritted his teeth. He hated himself so much that he could even start harming his own body.", "His rage transformed into the whip of stubbornness that mercilessly pounded on his legs.", "“Kuaaaaaak!”", "He reached out with his hands; his feet powerfully kicked the ground as if he was trying to jump over a wall.", "Unbelievably, his outstretched leg didn't falter, and it stepped on the ground with strength and stability.", "Right in that moment, a strange feeling wrapped around Seol's senses. The wall that had been resolutely prohibiting his approach until now, became a trusty and secure foothold as he jumped over it and landed on top.", "Seol moved his leg one last time, before finally faltering to the ground and rolled ungainly along the track's surface. Even then, he tried to run again and his arms and legs flailed about, only to feel vomit rushing up his throat.", "“Ueeeeeck!”", "Seol continued to puke while tears fell down his face nonstop.The retching eventually ended, and he powerlessly rolled onto his back. He closed his eyes, wanting to enjoy the remaining traces of ecstasy that overwhelmed his senses just now for a bit longer.", "['Basic' difficulty mission has been successfully completed.]", "[10 Survival points have been accredited to you.]", "[Current SP: 2840 SP]", "Meanwhile, Seol's energyless hands slowly but tightly clenched into fists.", "[Your personality trait, 'Weak-willed' has been erased.]", "[Your stamina level has risen from 'Low (Low)' to 'Low (Intermediate)’.]", "The track disappeared from his view, and the familiar sight of the Neutral Zone's interior entered his view.", "“?”", "Seol was teleported back to the plaza while still on his back. He raised his head slightly when a shadow loomed over him.", "His slowly rising eyes spotted someone's rather shapely legs first. Then, he even got to see the ends of the garter belt crossing her inner thighs, just hidden beneath her dress. And when his sights dug in just a little bit higher, a piece of frilly fabric with a cute teddy bear sewn in front that seemed to be protecting the most secretive and important area….", "“….Lilac?”", "Kuk. With a grunt, a pair of legs hurriedly backtracked.", "Seol nodded his head, thinking that was one very cute bear. Then, after spotting Agnes's cold glare penetrating through her glasses, he began to panic. But how was that possible? After all, she looked like one of those uber-strict head maids working for some historically-important household….", "“I beg your pardon. I did not expect you to be teleported back while lying on the ground….”", "Agnes coughed to clear her throat and quite abruptly presented Seol a cup with some kind of liquid in it. Seol was feeling thirsty anyway, so he gladly accepted it and smiled.", "Soon, the cool and refreshing liquid slid down his throat. It felt as if a little bit of his energy had returned immediately. He pushed off the ground and stood up.", "“Thank you. I was actually….”", "“It's 10 SP.”", "It wasn't free?!", "Seol was about to argue that he was being forced into buying something he didn't really need but swallowed his words right back down as soon as he felt the changes taking place within his body.", "“Oh.”", "The cold liquid sliding down his throat suddenly felt warm and gentle once it arrived in his stomach. A truly refreshing sensation spread throughout every corner of his body and gently massaged all the accumulated fatigue away. Instead of topping up his spent energy, the liquid seemed to enhance his own surging vitality.", "“This is….?”", "“It's nothing much. If you rest for a little longer, you should be able to move as usual.”", "Agnes stopped there for a second and stared at Seol.", "“And also, although I fully understand your intentions, it'd be for the best that you no longer drink the stamina recovery potion for the time being.”", "“Why?”", "Seol was surprised. Rather than 'How did you know', his surprise was more of 'Why shouldn't I?'", "“But, if I want to increase my training time….”", "“I never thought I, as a trainer, would say this, but….”", "Agnes fixed her glasses on her nose.", "“You need to decrease the length of your training time.”", "“You're telling me to…. train less?”", "“Yes.”", "Agnes readily agreed with his answer as if she was waiting for it.", "“It may sound presumptuous of me, but through my observation of the past two weeks, I have come to the conclusion that your training routine has gone beyond the realm of simple fitness training and is now harming your body instead. Your body needs time to cool down properly through regularly scheduled breaks. However, you're punishing it even before it can get adequately ready. It is almost to the point of cruelty.”", "Her cold analysis left Seol speechless.", "“You have been using recovery potions to forcibly regain your stamina…. Although it’s fine to use it every once in a while, continuous intake over a prolonged period of time will not help you at all. Resting well is also part of a proper training routine. The more your fatigued body repeats recovering stamina through natural means, the faster your natural recovery rate will get. Now is the time you let your body get used to recovering naturally.”", "“I… I see.”", "“From here onwards, rather than relying on recovery potions that instantly replenish your stamina, I strongly advise you to use various items that aid you in natural recovery. For example, there are refreshments, special scented oils for bathing, plants or scented candles to place near your pillow, and others.”", "Agnes also added that such items would also have positive effects on his endurance, strength, and agility.", "Seol could only nod his head in a daze. He was currently lost among the influx of information, not knowing what to make of it. He knew she wanted to give him important advice, but right now, that dang teddy bear from before merrily danced inside his brain and he couldn't concentrate properly.", "“If it's not too inconvenient for you….”", "Completely unaware of what Seol was thinking at the moment, Agnes quietly continued on with her words.", "“Will you grant me the honor of guiding you? Please.”", "She said something very similar on the first day Seol arrived on the Neutral Zone. However, the nuance of her words was a little different this time.", "“It’d be my honor.”", "Seol had no reason to refuse, so he didn't.", "“There is one thing that I'm curious about.”", "As they climbed up the staircase, Agnes asked him.", "“Why do you not eat at the restaurants, and instead, choose the food items you found in the Tutorial's convenience store? You can utilize the services of the restaurants for free.”", "Her voice sounded like she was admonishing him somewhat. Seol sheepishly scratched his cheek.", "“Well, uh…. I thought I didn't have a lot of time to waste, so….”", "“That will not do. Just as proper rest is important, so are your meals. Your body needs more nutrients as you train, yet you've been eating those unhealthy junk food….”", "Agnes shook her head in disappointment. Eventually, their steps came to a halt.", "They arrived on the third floor. Through the glass door, they could see a wide-open space filled with various exercise equipment. Even though there was no treadmill insight, it was still better kitted out than some of the best gyms out there.", "“Running for two weeks…. And you have been taking the special Competence daily, so that equates to almost four months of constant training. I believe that you are at least fit to a certain degree now.”", "It was at this point that Seol became sure; this strict-looking maid, who just so happened to possess a taste in cute underwear, had knowledge of everything that occurred inside the Neutral Zone.", "“Running isn't the only form of training. In order to evenly raise your physical stats, I recommend that you try other types of training as well.”", "Seol agreed with that idea. He was thinking of starting other basic training besides running, anyways. Agnes was introducing him to this facility because of that reason as well. Of course, it wouldn't be free to use this place, though.", "“How much is it to use this place?”", "“Ten points per day, but if you pay for a week in advance, then it's discounted to 50. Also, if you wish to hire a full-time trainer to aid you in your training, it will cost you further one extra meal a day.”", "Seol had been paying close attention and ended up doubting his own hearing. Seeing that dumbfounded expression on his face, Agnes hurriedly added something else.", "“You see, the cuisine offered here in the Neutral Zone is really delicious.”", "Although Seol couldn't really understand what she meant by that exactly, he decided to accept it as her way of saying she'd help him for free. Even he knew that having a trainer beside you while training made a huge difference. Besides, he could tell Agnes was fired up about something.", "Feeling something was slightly odd, Seol activated 'Nine Eyes', but she didn't emit any color. In other words, she wasn't necessarily trying to harm him.", "Seol carefully assessed his situation before opening his mouth.", "“By any chance, are there any other maids beside you who can also train me?”", "Agnes tilted her head slightly.", "“It's not impossible to find one, but…. Are you perhaps not satisfied with me?”", "“No, not at all.”", "Seol denied the notion and quietly took a deep breath.", "“I'd like someone who possesses excellent skillset, but also someone who can train me without holding back.”", "Agnes adjusted her glass; the glare from the light reflected off the lens rather sharply.", "“…In that case, there is no need to introduce anyone else.”", "Her eyes remained fixed on Seol as she quietly gathered her hands in front of her chest. He thought that there was a trace of smirk on her lips.", "“It is quite embarrassing to say this out aloud, but I am also referred to as the Sicilia's demonic instructor.”", "“Demonic instructor…. That's good.”", "“Will you be fine with it? I was planning to be gentle with you at first.”", "Her words seemed to be implying, ‘Do you think you can handle it?’ Seol replied without hesitation after hearing such a naked provocation.", "“Let me pay the Survival points first.”", "Exactly 10 minutes later….", "Seol was regretting everything he had said while figuratively beating the ground up in anguish.", "The nickname of 'demon' wasn't just for show. The moment the training began, Agnes pushed him to the brink without mercy. It was to the point that Seol began missing the pain he felt while he was running laps around the track.", "He even ended up protesting during the training by saying, “Isn't this too harsh? Didn't you say something about taking a break?”", "And the reply he got was, “You can rest after the training is over. No one said you could take a break in the middle of your training!”", "Another thing he couldn't bring himself to understand was her suddenly getting violent in the middle of the training.", "“I told you to keep your eyes forward!”", "Slap!", "Her thin stick sharply landed on Seol's shoulders with a loud slap.", "“Again! One!”", "Seol panted non-stop as he fixed his grip on the barbell resting on his trapezoid muscles. While doing squats, the so-called must for training the muscles on the lower body, Seol was suffering from the kind of pain that felt like his thighs were being cut up with a dull knife.", "“Two!”", "“Kkheueueu…..!”", "When he somehow managed to lower his hips, the stick slapped him hard on the back once more.", "“You are bending your knees, yet why are they sticking out beyond your toes? Straighten yourself!”", "'I've never seen someone as vicious as you!’", "Seol was screaming inside. He didn't say anything since he knew that getting hit would help with increasing his endurance. But still, he had no idea she would be this heartless. Was it because he inadvertently sneaked a peek at that laced lilac teddy bear underwear?", "Meanwhile, Agnes sharply shouted out.", "“Again!”", "Unfortunately, Seol's quaking thighs couldn't hold on any longer and he fell on his butt.“….What do you think you're doing?”", "Agnes's icy cold voice 'politely' entered his eardrums.", "“Hua, Hua!”", "Not caring one bit, Seol began massaging his aching thighs. He was getting seriously worried about blood coalescing there and then bursting out of the skin or something.", "“Hmph.” Agnes let off a snort and crossed her arms against her chest.", "“Only with this much…. If you'd like, I can go a little easier on you. Well, I think I'm being sufficiently gentle even now.”", "“You….!”", "“If this is not to your liking, I can introduce you to someone else at any time.”", "The corners of Agnes's lips curled up. Seol barely managed to swallow the curse words almost jumping out his mouth and lowered his head.", "“….No, it's fine. Let's continue.”", "“Let me say this one more time. I won't go easy on you during the duration of your training.”", "“This is what I wanted. I'll just shout out some gihap and continue on.”", "“Gihap, is it…. What you need right now isn't some random shouts, but the willpower to endure. In any case, let us continue. Please, stand up.”", "Seol spat out a lengthy groan after hearing her.", "“Ah! Is it fine if my gihap is a bit peculiar?”", "When he asked her while still massaging his thighs, Agnes's eyes became narrower than a slit.", "“Are you trying to buy yourself time? You can do whatever you want with your gihap, but you will need to hurry and stand up, please.”", "'Damn it! Damn it!!!'", "Seol stood back up while gritting his teeth. Meanwhile, she simply hoisted the barbell on his shoulders. And then….", "“No matter what type of training you perform, the two most important things are your posture and your breathing pattern. One!”", "He timed his gihap with the count.", "“Li!”", "“Li? That's indeed a peculiar gihap. Two!”", "“Lac!”", "“? One…?”", "“Li!”", "“…..Two.”", "“Lac!”", "Suddenly, the counting came to an abrupt stop. When Seol turned his head around to look, he found Agnes glaring at him with her face completely dyed red. She was furtively grasping the hems of her dress, and the stick in her hand was trembling ever so slightly as well. She seemed to be very flustered at the moment.", "Suddenly, Seol felt quite satisfied for some reason. He slyly threw out a question.", "“Why did you stop counting?”", "“W, w, w, what…. What are you saying….?!”", "“Is there a problem with my posture?”", "“N, no! That's not the issue!”", "“Oh, you mean, with my gihap? You said I can do whatever I want with my gihap, so…. Ah, right. Let me change it to something else.”", "Seol raised the white flag when Agnes threateningly raised the stick up high. Of course, he had no desire to end things here.", "“Please, train properly. One!”", "“Teddy!”", "“Two!”", "“Bear!”", "Again, the counting stopped.", "A short moment later….", "SLAP!", "From the third floor gym, a sticky slapping noise resounded out.", "*", "After Agnes entered his life, Seol's way of living in the Neutral Zone underwent yet another noticeable change. The biggest change, of course, had to do with his haphazard training regime. Now, he was working off on a well-defined and thought-out training routine.", "Now he could say that, although the length of the time spent had decreased, the overall quality of the training had been increased several folds.", "Strength, endurance, agility, and stamina – the severity of the training regime targeting these four key areas remained cruel enough for him to resort to throwing out multiple expletives. However, thanks to his fitness level raised through the constant running, he could cling on more or less.", "Also, Agnes showed much diligence and even mapped out his activities outside training, including his diet and methods of resting, etc.", "Since the instructor displayed the kind of zeal only seen when polishing a valuable but still-rough diamond, Seol too was motivated to reciprocate that dedication and worked hard. Not only that, the special Competence with the eight times the effects were added on top, so naturally, he grew at an explosive pace.", "Indeed, his fitness and stats continued to improve. Not only that, his body would now cool down rapidly from the state of sweaty exhaustion soon after the training ended. The transformation felt so alien to him, Seol sometimes had to wonder whether this was his own body or not.", "While Seol constantly and rapidly grew under the guidance of Agnes, the 30th morning finally arrived on the Neutral Zone.", "For other people, it was 30 days, but for Seol, it was more like 240 – almost eight months of hardcore training.", "On this day, the situations of those who had made preparations and those who hadn't would be changed somewhat."]}