{"cid": "300", "title": "Chapter 300. Sweeping Everything Clean (2)", "content": ["One day before the end of the Neutral Zone, Eun Yuri’s team finally agreed to take on the ‘impossible’ mission.", "Eun Yuri stood in front of the plaza’s noticeboard and reminded herself of Seol Jihu’s warning.", "“Rip it as soon as you go in. There’s no need to look around. If you hesitate even for a second, arrows will fly in and pierce your neck.”", "Seol Jihu then added that he would have died on the spot if the guardian of the sanctuary didn’t stop to make threats.", "Eun Yuri put the talisman in her mouth with a nervous expression, then held the paper slip for the Impossible difficulty mission in her hands. The other five members swallowed hard and stared at Eun Yuri with their hands on each other’s shoulders.", "The moment Eun Yuri tore the paper slip in half, the members disappeared without a trace. Then, the six reappeared in the plaza in less than five minutes, all sitting on their butts. Every single one of them had their mouths agape, clearly horror-stricken.", "Usually, an earthquake above 5.0 on the Richter scale would be called a powerful earthquake. An earthquake that was just one magnitude higher than another would release 32 times as much energy.", "Hence, a 12.0-magnitude earthquake would go beyond the realm of a natural disaster and reach the realm of an apocalyptic catastrophe. As the group had just witnessed an earthquake of such scale, it wouldn’t be strange if they had pissed their pants.", "While everyone else was at a loss for words, Eun Yuri snapped out of her daze hearing an alarm. She had received a message saying that the rights over the reward had been transferred.", "She looked around stealthily. Although Eun Yuri was the one who had the highest amount of Survival Points in the Neutral Zone, the other five members of her team weren’t doing so badly either.", "If they truly wanted, they would have no trouble buying an item from the VIP store. Money aside, the VIP store’s items belonged to whoever bought them first.", "Once Eun Yuri reminded herself of this, she shot up and ran. The other five tilted their heads as they watched her rush up the stairs.", "Maria, who was dozing off at the counter, woke up in a startle at the sound of the door bursting open. Seeing the customer who revisited after three months, or 89 days to be exact, she smiled brightly.", "Managing the VIP store wasn’t a popular role. The reason was obvious just by looking at the available items.", "[VIP Store Inventory]1. Pneuma’s Sky Boots: 50,000 SP (1EA)2. Moirai’s Souvenir: 600,000 SP (1EA)3. Miyal’s Branding Iron: 100,000 SP (1EA)4. Seed of the World Tree: 400,000 SP (1EA)5. Saintes Mesures of Sidus: 80,000 SP (1EA)[1]6. Aphriso’s Sedge: 150,000 SP (5EA)[2]", "The cheapest item cost 50,000 Survival Points, an amount most survivors could not even dream of having.", "Although any item sold by the VIP store would net its manager a hefty chunk of Survival Points, there weren’t many people who could buy its items.", "This was why Maria was so ecstatic to see Eun Yuri, who had bought all of the Special Competences on the first day of the Neutral Zone.", "“W-What would you like?”", "Maria cupped her hands together and asked half-nervously and half-excitedly.", "Eun Yuri checked her Survival Points. She had earned 120,000 points in the Tutorial and another 430,000 in the Neutral Zone. Because she was the top ranker, she rarely had to use her points, making her have more than 500,000 points.", "On top of this, she had six one-time use VIP store coupons.", "Eun Yuri yelled without hesitation.", "“I’ll take Moirai's Souvenir first!”", "“Huk—”", "Maria’s eyes split open. She couldn’t believe it. This customer chose the most expensive item from the get-go!? Who would have thought she would be such a huge spender!?", "However, Eun Yuri wasn’t done yet.", "“I’ll take the Seed of the World Tree too!”", "Maria’s jaw dropped.", "1,000,000 points. She had earned one million points from Eun Yuri’s two sentences.", "“Next—”", "“Ah, ah, ah, aaaaaaaaaaaah—!”", "Maria screamed like someone who was on the verge of climaxing from an orgasm. She twisted her body and moaned like she was about to die of happiness.", "“St— stop! Stop it! Are you trying to kill me? Stop it, I tell you!”", "Maria shouted hysterically and begged for mercy, but Eun Yuri did not let her off.", "“I want Aphriso’s Sedge! I’ll take four of them!”", "“HUAAAAAAAANG!”", "In the end, Maria could not bear the consecutive bombshells and collapsed on the floor. Convulsing sporadically, she looked up at Eun Yuri with hazy eyes.", "It was as if she was seeing her Messiah. That was— until she heard what she said next.", "“I’ll buy these six with the VIP store coupons. I have six coupons so it works out perfectly.”", "“…Pardon?”", "Maria’s face stiffened. It went without saying that instructors could only earn Survival Points spent by survivors. Since these items were purchased for free, she would naturally end up with ‘zero’ points.", "“….”", "Maria madly blinked her eyes while doubting her ears. Soon, she checked Eun Yuri’s Survival Points and rewards.", "“…Fuck.”", "Maria’s face distorted.", "How can it be? How can it be!!!? The ray of hope she tasted after three months of despair had vanished into thin air.", "“FUCK!”", "“Excuse me?”", "Eun Yuri was taken aback. But given Maria’s personality, it wouldn’t be an exaggeration to say she was thinking, ‘This god-damned treacherous bitch made a fool out of me!’", "“FUCK! FUUUUUUUUCK!”", "“Why are you swearing all of a sudden… Anyway, hurry up, please.”", "“Shut it! You treacherous bitch! You dare make a fool out of me!?”", "“What? I’m going to go tell Oppa!”", "“What? Fuck, call him! Call Valhalla’s representative right here, right now! Do you know who I am!?”", "Maria shouted with her chin held high.", "Eun Yuri’s eyes widened. Just who could this short, blonde girl be to not get scared of a publicly acknowledged titan like Seol Jihu?", "“You pea-sized bitch, eh! Oppa and I, eh! We go way back! We met in the Neutral Zone! We went to Ramman Village together! We went to the Banquet together! We went to war! We went on expeditions! We did everything, eh!” [3]", "The way she was talking, she seemed to be a member of Valhalla.", "“I’m still owed a favor! You wanna go for it!? Wanna see whose side he’s going to take? Eh!?”", "Maria had completely gone nuts.", "She was already spending her days depressed after a poor attempt at imitating a large-scale force and losing all the money she made by investing in stocks.", "In other words, she was lashing out at Eun Yuri to vent her pent-up frustration. But Eun Yuri did not know the backstory and only thought she ran into the wrong person.", "“J-Just give me my items.”", "“Call Representativvvve!!”", "“Give me Pneuma’s Sky Boots, Miyal’s Branding Iron, Saintes Mesures of Sidus, and the remaining Aphriso’s Sedge too.”", "“WHAT!?”", "“I’ll pay for those with Survival Points.”", "Maria jolted. Her eyeballs were practically popping out of their sockets. A hint of bewilderment and panic crossed her face, but soon, she scrunched her face.", "“…I just don’t get it!”", "Tang! Putting down the items Eun Yuri requested with force, she shouted.", "“So beautiful!”", "Tang!", "“So glamorous!”", "Tang!", "“And so capable!”", "Tang!", "“We really hit the jackpot this time! Yep! Oppa really reeled in some talent!”", "After putting down all the items in an instant, Maria shouted with a look of anger.", "“That will be 380,000 points in total! Thank you!”", "Eun Yuri looked completely dumbstruck.", "‘Just who is this?’", "Because Eun Yuri was staring at her so intensely, Maria let out a dry cough and raised her eyebrows.", "“I’m so grateful, what should I do? That’s it! I’ll go to Oppa and praise her!”", "With that, she just ran off.", "‘…She’s crazy.’", "Eun Yuri was truly stupefied.", "‘She’s completely insane.’", "This was the first meeting of the money-crazed Crazy and the genius magician.", "*", "D-Day - 1.", "A day remained until the end of the Neutral Zone.", "Seol Jihu looked at the items he got from Eun Yuri with a beaming smile. He originally planned to obtain Moirai’s Souvenir only, so how could he not be happy when he received so many items on top of the regular Competences to be used for training?", "‘She’s something, alright.’", "Seol Jihu had kept his promise, and Eun Yuri had kept hers. More than what she promised, in fact. Since she was so generous, it was only right that Seol Jihu returned the favor.", "‘Come to think of it, she looked a little depressed.’", "It made sense for her to feel bitter given that she had to hand over the items she worked so hard to obtain.", "‘Today’s the last day. Should I go talk to her?’", "Deciding as he pleased, Seol Jihu put an item in his back pocket before leaving his room. He stopped by the cafeteria on his way to grab a couple of beer cans, then walked up the stairs.", "“Miss Eun Yuri?”", "Tok, tok. Knocking lightly, the door shot open.", "Eun Yuri walked out in a tank top and a towel on her head. She must have taken a hot bath as her hair was wet. She gave off a sweet scent, possibly from the vitality-recovering herb put in the bath.", "“Can we talk for a bit? Today’s the last day.”", "Seol Jihu winked as he held up a can of beer.", "Eun Yuri lowered her head slightly. The way she blankly stared at the ground, she seemed to be hesitating. On the other hand, she seemed to be on guard.", "“Okay.”", "However, her hesitation did not last long.", "“Perfect timing. I wanted to ask you something.”", "She must have a lot of frustration pent-up inside as she spoke in an argumentative tone. Seol Jihu tilted his head, but Eun Yuri had already turned away.", "The room had a couch and a table, but Eun Yuri sat down on the floor. Seol Jihu sat across from her. The man and the woman drank beer quietly as they munched on dried jerky.", "As an awkward silence continued, Eun Yuri suddenly let out a sigh. Perhaps because she just got out of the bath or because alcohol entered her system or because she was simply weak at alcohol, her neck was already red.", "She looked like she would drink herself to sleep, so Seol Jihu quickly initiated the conversation.", "“Didn’t you say you had something to talk to me about?”", "“Yes, but… can’t you go first, Oppa?”", "She seemed to be extra careful.", "‘Right, I’d be disappointed too if the fruits of my labor were taken away.’", "Empathizing with Eun Yuri’s predicament, Seol Jihu took out Miyal’s Branding Iron from his pocket.", "“Here’s a present.”", "Eun Yuri stared at the stamp. She seemed to be at a loss for what to do, just like someone who received a surprise gift.", "“This is Miyal’s Branding Iron. Once you brand yourself with it, you’ll be able to double the power of a spell once every 48 hours. I thought it’d be perfect for you.”", "“Y-You don’t have to give it to me.”", "“Don’t be so humble. You’re more than qualified to take it.”", "Seol Jihu shook his hand. He looked like he would force it on her even if she refused. Eun Yuri lowered her head and took the branding iron.", "“Thank you.”", "Seol Jihu observed Eun Yuri intently as she studied Miyal’s Branding Iron. She didn’t look all that happy. No, she looked like she liked it, but her eyes were still without energy.", "‘Why…?’", "Looking at her with his Nine Eyes, he saw that her current emotion was ‘complicated’.", "“Um, do you want anything else?”", "“No, not at all.”", "“It’s fine, so tell me. As long as it isn’t Moirai’s Souvenir, I’ll give it a thought.”", "“I would have already told you if I wanted something.”", "Eun Yuri said in a calm voice.", "“What you’ve given me so far is more than enough. Introducing Teacher’s dream world to me, especially. I won’t forget that for the rest of my life. Really.”", "From the sound of it, the VIP store items didn’t seem to be the cause.", "“Mm, then are you depressed because the Neutral Zone is ending?”", "“?”", "“Because I was like that. I really had a lot of fun, so I was reluctant to leave on the last day.”", "“No, I’m not that attached to this place… We all have to leave anyways.”", "Eun Yuri shook her head. A soft swirling was heard from the beer can.", "Did she think it was strange that Seol Jihu was asking this and that? She took a sip of beer and asked, “Why are you asking this?”", "“No reason. You just looked a little down.”", "Tak. The beer can slammed down a little harder. Eun Yuri puckered her lips and sucked in the liquid on her lips. After sucking a few times, she opened her mouth.", "“Um, there’s something I’m dying to know.”", "“What is it?”", "“Oppa, you have a girlfriend, right?”", "Seol Jihu furrowed his brows. Just what kind of a random question was that? He didn’t understand why she was asking him this, but he answered anyway.", "“No, I don’t.”", "“You don’t? Then—”", "Eun Yuri closed her mouth in the middle.", "“No… they don’t have to be boyfriend and girlfriend… a lot of people hook up in this day and age…”", "“Miss Eun Yuri?”", "“Then what about this?”", "She murmured something to herself before suddenly raising her left hand. The silver ring on her ring finger sparkled under the light.", "“Why did you give this ring to me?”", "“…Should I have not?”", "“You can, but you put it on my ring finger and said it was a present just for me.”", "“Yeah, that ring is the medium that’s needed to enter the dream world. That’s why it’s a present just for Miss Eun Yuri.”", "“…Huh?”", "“And when you’re gifting a ring to a girl, aren’t you supposed to put it on their left ring finger?”", "“!?”", "Eun Yuri was surprised twice. But the second surprise was a magnitude bigger than the first. She stuttered.", "“N-No, who told you that?”", "“My ex-girlfriend. My mom also said the same thing.”", "“Ex-girlfriend and Oppa’s mother?”", "“Yes.”", "Eun Yuri swept her forehead up and lifted her chin up.", "“…I’m sorry. I must be stupid because I can’t understand a thing. Can you explain again? In more detail.”", "Seol Jihu scratched his head. He didn’t know why he had to explain it to the last detail, but seeing Eun Yuri’s confused face, he decided to tell her.", "“Was it when I was in my first year of middle school…? Making a ring out of coins was a popular fad at the time. I wasn’t an exception.”", "“Okay, go on.”", "“But after I made one, I didn’t know what to do with it. The fad was pretty much over by then too. So I asked my ex-girlfriend, no, I guess we weren’t dating back then. We were childhood friends. Anyway, I asked her if she wanted it, and she was really happy. That was when I first heard it.”", "“What…. Wait, didn’t Oppa’s mother say the same thing?”", "“She did. She was there actually when the exchange was happening, and she smiled and said Seonhwa was absolutely right.”", "Eun Yuri was struck speechless. She wasn’t sure what she just heard.", "“So you’re saying this idea was embedded into your mind after hearing that?”", "“If you put it like that, it’s like I was brainwashed or something. It’s not that bad. Just… Seonhwa is always right.”", "“No, Oppa, what someone says can’t always be right.”", "“That’s true, but things Seonhwa says to me are. You know, it’s like the saying, if you listen to your mom, you’ll get a rice cake even while you’re asleep. Seonhwa was like that for me. If only I listened to what she said… then things wouldn’t have turned out like this.”", "Seol Jihu said regrettably. But Eun Yuri, who didn’t know his circumstances very well, still had question marks in her eyes. But as a fellow obsessive love disorder patient, she had an idea.", "“Did that Unni say that often? That Oppa should just listen to her, that she’s always right, and that this is all for Oppa’s benefit.”", "“Oh? How did you know? Seonhwa says that all the time.”", "“…You said you were childhood friends?”", "“Yep, our parents were friends even before we were born. She was also my neighbor.”", "“So you must have known her for a long time.”", "“Since the day we were born. We were always together since we were babies, but we didn’t start dating until we got into college. Ah, I still remember. I mustered up the courage to ask her out, and she suddenly burst into tears, saying that she’s been dying of frustration since elementary school and that she’s finally gotten her wish…”", "Seol Jihu smiled pleasantly as he reminisced about past memories.", "The clever Eun Yuri began to understand the details of Seol Jihu’s background. To be more precise, exactly how Seol Jihu ended up this way.", "‘He’s been… completely brainwashed…’", "Although Seol Jihu denied it, it wouldn’t be brainwashing in the first place if he was aware. From the looks of it, this ex-girlfriend of his had carefully groomed him over a long period of time, and his family seemed to have helped secretly.", "Simply put, the ex-girlfriend had earmarked him at a young age and raised him to her taste. Just how much did she like him to go so far?", "Eun Yuri applauded the care and effort this Seonhwa put into grooming him while feeling a chill at the same time. This woman’s tenacity was definitely not something Eun Yuri could match.", "‘Maybe she instilled this strange common sense into him to ward off other girls who would approach him…’", "It was a plausible theory given the underwear gift incident. Moreover, Eun Yuri also became awkward around Seol Jihu after he gifted her a ring.", "Eun Yuri quietly muttered in astonishment.", "“But… if you groomed him so much, why not hold onto him to the bitter end…? Why set him free…? Ah… he said he was a gambler….”", "She tilted the beer can back as her body slowly leaned forward. She was speaking with her body language, Whatever, it doesn’t matter what happens.", "“Are you alright?”", "“Yeees— I’m fine….”", "Unlike what she was saying, the way the end of her speech trailed off showed that she was drunk. Eun Yuri cooled herself off with the coldness of the floor and muttered weakly.", "“I’m still not sure I understand everything… but I think I may have been misunderstanding things….”", "Seol Jihu stared at her before going “Ah”. He started to understand what misunderstandings Eun Yuri had.", "‘Was that why her current emotion was complicated?’", "He grinned, thinking how absurd it was, before bursting into laughter. It would be a different story if it were Seo Yuhui, but to be completely honest, Eun Yuri was not his type.", "“It must have been a misunderstanding. Don’t worry, I’m not an easy guy.”", "Seol Jihu spoke rubbish while being blissfully ignorant. As he slowly turned his gaze, he saw Eun Yuri grumbling. For some reason, her expression was full of dissatisfaction.", "Because this side of her was rather refreshing, Seol Jihu ended up laughing once more. Looking back, Eun Yuri had rarely revealed her emotions during the Tutorial. He never knew what she was thinking about, and whenever she stared blankly into the air, he wondered if he invited a fool.", "But now, she was revealing a small part of her inner thoughts. Perhaps this was Eun Yuri’s real self. In that case, he must have gotten closer to her compared to the Tutorial.", "Thinking so, Seol Jihu cheered up.", "*", "Same time.", "It was deep into the night, but the Eva Royal Palace was bustling. Charlotte Aria was wandering back and forth in the grand hall. With her hands behind her, she was walking busily and nervously.", "“Your Majesty, please go to sleep. Don’t you need to head to the dream world?”", "Sorg Kühne offered, unable to bear looking at her. However, Charlotte Aria did not even pretend to listen.", "“W-What should we do?”", "“….”", "“Seol Jihu, where’s Seol Jihu? Why isn’t he back yet? How can he be gone at a time like this!?”", "“The Neutral Zone hasn’t ended yet, Your Majesty.”", "“When will it end?”", "“The completion ceremony will be tomorrow morning. They should be back immediately afterward, so please talk to them then.”", "“But….”", "“Even if they arrive before then, your servant will still be here.”", "Sorg Kühne bowed while calmly soothing Charlotte Aria.", "“Please do not worry and head to sleep.”", "1. The name of this item has been fixed to what the author came up with (was previously mistranslated) ", "2. This item was mistranslated by the previous translator as ‘Aphrodite’s Sedge’. The name isn’t Aphrodite, but Aphriso (isn’t from anywhere as far as I can tell). ", "3. A parody of a famous line in the Korean movie Nameless Gangsters. ", "Today's my birthday! :) "]}