{"cid": "8", "title": "Chapter 8. The Awakening (1)", "content": ["The Guide remained shocked for a considerable amount of time, being unable to complete his sentence. Then, his lips began twitching in an ugly manner before he hurriedly covered up his monocle with his hand. However, Seol still got to see the lens emit some sort of light before it was covered.", "“Fuck, the one who invited that man, are you watching right now?”", "The Guide growled quite menacingly.", "“What is the meaning of this? Why is a Guide even necessary if you plan on doing things this way?”", "It seemed that Han was really ticked off.", "“Are you making fun of me? Was your experience during the Tutorial that unpleasant? You’re trying to completely rip it to shreds, is that it? Just how did you even know what that man would need in here…..!?”", "Suddenly, the light from the lens vanished. The Guide issued a short but sharp groan and began chewing his lips.", "Completely and utterly disregarding Han, the blonde maid simply picked up the golden bag and gracefully brought it to Seol. Han didn't try to interfere, but his complexion was visibly complicated.", "Just what was in this bag then? Seol couldn't help but become quite curious now. Even the taciturn Yun Seora craned her neck slightly to sneak a better look.", "Seol confirmed that there were six items listed on the tag attached to the bag.", "—Necessary Box, x3", "—Survival Points - 5,000 points", "—Mark of Survival, x1", "—Diary of an Unknown Student, x1", "The first thing to attract Seol's gaze was the so-called 'Necessary Box'. He heard that both the Bronze and Silver Marks got Random Boxes. His had a different name.", "“Please, open and apply your bonuses here.”", "Unlike before, Han's voice seemed to possess far more urgency than before. Since he was planning to do that anyways, Seol slowly unlocked and opened the bag.", "[5000 Survival Points have been credited to you.]", "[You have acquired (1) Mark of Survival.]", "[The Diary of an Unknown Student is currently being updated.]", "The smartphone buzzed and vibrated in his pocket, but Seol couldn't feel it. Why? Because, his attention had been stolen away by the three boxes with all sorts of intricate symbols and runes covering them, neatly tucked to the bottom of the bag.", "“There should be three boxes inside the bag. You can just open them. Nothing complicated to worry about.”", "Han tried to add some explanations in a friendly manner, but he failed to hide his eagerness to see what was inside those boxes.", "“Shit, all this suspense is killing me here. Hey, is it fine if we open the box together?”", "Kang Seok, who had been staring at Seol's bag with barely-disguised greed, stood halfway up from his chair. It was then.", "“Sit back down.”", "A powerful but still well-mannered voice slammed into Kang Seok's eardrums.", "“No, I was just….”", "“I told you to sit back down.”", "Han's voice sounded incredibly cold. Kang Seok nervously swallowed his saliva and parked his butt back down on the chair.", "The Guide, Han, snorted out once and then began fiddling with his monocle.", "“….His bonuses are reserved only for that person. They are things you, Mister Kang Seok, should neither see nor even desire.”", "Han then shifted his gaze back to Seol.", "The assembly hall fell into the grips of the deathly silence yet again. Not even the sounds of breathing could be heard now.", "As for Seol….", "Each of the boxes was no bigger than an adult's clenched fist. Pressured by the silent stares, Seol reached inside, and carefully opened the first box.", "[The Necessary Box (x1) has been opened!]", "[Scanning for the most 'needed item' during the current situation…. Please wait.]", "[The awakening of the Innate Ability, “??”, has been initiated.]", "When Seol blinked his eyes once, new messages began popping up one after the other.", "[Your Innate Ability, Future Vision, is responding to the awakening of the new ability!]", "[The Innate Ability, “??”, has evolved into “Nine Eyes”.]", "[The central direction (1) of your Innate Ability - Nine Eyes, the Green color: General Observation, has been fully unlocked.]", "[Please confirm your Status Window.]", "'Green color? General Observation?'", "Hearing the announcement that he should check the Status Window, Seol raised his head, which led him to peek at the top of Yun Seora's craning head.", "[Yun Seora's Status Window]", "[1. General Information]", "Summoned date: March 16th, 2017Marking Grade: SilverSex/Age: Female/20Height/Weight: 166.2 cm/53.4 kgCurrent Condition: GoodClass: LV. 0 (Invited)Nationality: Republic of Korea (Area 1)Affiliation: N/AAlias: N/A", "[2. Traits]", "1. Temperament:—Cool-headed. (Her actions and thoughts are not swayed by emotions; always calm.)—Indifferent. (She's not easily interested in anything particular.)", "2. Aptitude:—Brilliant. (Possesses a smart brain as well as good overall talents)—Highly observant. (Will carefully analyze and study items and events all around her.)", "She must have sensed his gaze. Yun Seora raised her head, and Seol almost reflexively cried out. He quickly averted his gaze, but her Status Window didn't disappear from his sight. It wasn't just her general information and her traits, either – her physical level, talents, and even her conscientious awareness were laid bare.", "Not knowing what happened, Yun Seora could only tilt her head.", "From Seol's perspective, this whole thing felt absurd. Didn't Han say that one's Status Window couldn't be observed by others without explicit permission from the person themself?", "[Yi Seol-Ah's Status Window]", "[1. General Information]", "Summoned date: March 16th, 2017Marking grade: BronzeSex/Age: Female/18Height/Weight: 160.6 cm/49.8 kg.Current Condition: GoodClass: LV. 0 (Invited)Nationality: Republic of Korea (Area 1)Affiliation: N/AAlias: N/A", "[2. Traits]", "1. Temperament:—Virtuous (Possesses a fine, gentle, and benevolent personality.)—Deeply-caring. (Possesses deep love and care.)—Dependent. (Unconsciously seeks someone to depend on.)", "2. Aptitude:—A jack-of-all-trades. (Good at various activities.)—High-concentration. (Can use 100% of her concentration while performing an action.)", "When Seol sneaked a glance at Yi Seol-Ah to make sure, he also got to see her Status Window. Now feeling somewhat befuddled, Seol was about to raise his hand when he realized his mistake and quickly lowered it.", "“Yes? Are you curious about something?”", "However, the Guide didn't miss Seol's actions.", "“Have you opened your boxes?”", "“….Yes, I have.”", "Seol's throat suddenly dried up. He couldn't be sure why, but he thought that not saying anything right now was for the best. So, he decided to change the topic slightly.", "“I just received a message to confirm my Status Window, so….”", "“Oh, I see. Your Status Windows, is it…”", "Han's anxious expression seemed to brighten up in an instant.", "“So, what was updated? Your traits? Or perhaps, abilities?”", "When Seol wordlessly stared at Han, the Guide awkwardly laughed. Seeing that reaction, it wasn't all that difficult for Han to figure it out.", "“Oh, my. Please, excuse my thoughtless behaviour. You do not have to worry. As long as you don't permit it, not only me, but no one else alive in this world can take a peek at your Status Window.”", "The Guide was inwardly breathing a sigh of relief while saying this. A Necessary Box usually gave out something outrageous to those who were privileged enough to open them. One’s traits, abilities, and even physical prowess were fair game. If Seol’s Status Window had only been updated, Han could accept it.", "Of course, that was only possible because Han had no idea just what kind of ability Seol had awakened.", "When the probing eyes of the Guide had left him, Seol hurriedly opened the remaining boxes — both at the same time.", "[Your Innate Ability, Nine Eyes, is evolving further.]", "[The left directions (3) of the Innate Ability ‘Nine Eyes’ have been unlocked: Yellow – 'Attention Required', Orange – 'Do Not Approach', and Red – 'Immediate Retreat Recommended'.]", "[You have acquired the 'Paper Talisman'.]", "Seol couldn't see this talisman at the moment. Because, he was far too occupied to notice it. Seol was under the belief that he could only see green until now, so the mental shock he received was similar to someone violently hitting him on the back of his head.", "….You have beautiful eyes….", "….Yes, they are beautiful. In the seven shades of the rainbow…", "Seol inexplicably remembered something from his distant past, something he had almost forgotten. The whispers of a woman he couldn't even remember the face of brushed past his brain cells like a bolt of lightning.", "'H– Hold up. Red, orange, yellow, green…..'", "“Excuse me.”", "While Seol was in the midst of his thoughts, someone from the right side of the assembly hall piped up with a voice smaller than a mosquito buzzing around.", "Han was still rubbing his chest while feeling rather relieved with himself. His eyes immediately shifted towards the group of the Contracted. A young woman sporting a bob-cut hair was dusting her butt while standing up.", "“Uhm, is it, possibly….”", "“What is it? We're just about ready to begin.”", "His attitude was clearly different from when interacting with the Invited. Hearing his voice full of annoyance akin to chasing away a pesky bug, a certain sense of dissatisfaction formed on the woman's face.", "“You are not giving us anything?”", "“?”", "“You know, like those bags that those people just got.”", "The Guide let off a cynical chuckle and then replied immediately.", "“Yes. You don't get anything.”", "“B– But why not?”", "“Those bonus items are reserved for the Invited only.”", "It was a simple and articulate answer, but a deep frown emerged on the woman’s face.", "“Why is there a difference?”", "“It's simple.”", "The Guide smiled softly and his right hand pointed towards his right, that is, the left side of the hall.", "“These guests have been invited here after going through a strict evaluation.”", "Next, Han's left index finger pointed to his left, the right side of the hall, in a somewhat accusatory manner.", "“And you people got dragged here because of the Contracts.”", "“No, that's not what I meant!”", "“Besides, didn't you, Miss Shin Sang-Ah, receive ample compensation back in reality? Hmm?”", "With the timely arrival of that question, the woman with the bob-cut hair, Shin Sang-Ah, became utterly lost for words. She sat back down with a reddened face, but that wasn't the end.", "“Are you done talking?”", "A man from the group of the Contracted stood up in indignation. Seeing how fierce his eyes were, not to mention his rather well-developed physique, he looked like someone who knew how to get down and dirty if need be.", "“And what else do you want?”", "Finally, a look of irritation formed on Han's face.", "“Ah? Can't you provide a proper explanation on what this Contract bullshit is? You told us to come here and this is how you treat us?”", "A few people here and there began to quietly agree with the nameless man.", "Such a complaint was bound to occur sooner or later. After all, ever since the Guide appeared, he paid attention only to the left side of the hall, where the Invited were.", "They were already feeling unsure and anxious, and after being treated like a bunch of invisible fish out of water, it was not very strange to see them spit out their dissatisfaction in the open. Unfortunately for them, this wasn't the place to voice their problems, neither was Han the correct person to complain to.", "“You know what, stop wasting time and get us some chairs, too. My legs are aching from all that standing around.”", "“That's right! Now that I see, you still look like a young man, so, how can you even think that it's good to discriminate between people like this?”", "When more and more voices began chiming in, some amount of confidence and energy began filling up the expression of the nameless man. He glared at the Guide, waiting for a response.", "As for Han, he was simply smirking back at them.", "“….Sometimes, we get people like you. Those who don't know their place, those who only know how to bark and nothing else.”", "“What did you say?”", "“Well, I do understand you. I don't know which deplorable bastard reeled you in, but you must have jumped in first without even waiting to listen to an explanation. That is, after being blinded by money and the promised reward.”", "The nameless man flinched.", "“Whatever the case may be, you have already signed the Contract, haven't you? As long as you are here, you don't have a choice but to follow my guidance. If you want to complain, then you should meet up with the person you signed the Contract with later on and do so.”", "“So, what you're saying is I should sit here quietly?”", "“Exactly.”", "“We don't deserve to know so we better shut up and do as told?”", "“Correct. Excellent analysis.”", "“Ha, what should I do, then? Because I don't feel like doing that.”", "“Well, if you feel that way.”", "Seeing the nameless man's rebellious attitude, Han simply pointed at the lone exit of the assembly hall with his index finger.", "“You can simply leave.”", "“You stinking son of a bitch. You think I won't leave?”", "The nameless man venomously shot back and turned to address the group, shouting out loudly at them.", "“He's telling us to leave, so let's leave then! Tell them to do whatever the hell they want and let's go!”", "Hearing this, three or four stood up hesitatingly. Ultimately, though, the number of those preparing to move was small.", "“What are you all doing? I'm saying, we should leave, now!”", "Even after the nameless man urged the crowd, no one else budged. And when the majority didn't move, even those who did stand up began sitting back down. Sure, there was the awkward atmosphere to consider, but also, it wasn't as if every Contracted here didn't receive an explanation or two before coming here.", "“Hah, screw this. What a bunch of dumb cowards.”", "The nameless man muttered a few choice words, and then angrily stomped his way towards the exit. The blonde maid with her quick wits was already there; she carefully creaked the door open. The man turned around, spat on the floor of the assembly hall, and made his exit.", "“Is there anyone else who wishes to leave?”", "The Guide asked, but no one else made a move. The maid silently closed the door and locked it.", "Han didn't say anything else. He simply stared at the door with an expression of someone finding it all rather amusing. As this strange silence continued, the crowd alternated their gazes between the exit and the Guide for a while.", "And so… a minute went by like that. And just as the second minute was about to tick by….", "They all could hear the hurried and scared running steps approaching the door. Then, the door handle was desperately yanked from the outside.", "—Open the door!! Open the door!!", "Next, there was heavy pounding on the door….", "—You fucking sons of bitches! Open! Please!! Pleeeeaaaase!!! Ah, aaaaaahhhh!!!”", "The noises from the outside suddenly cut off — both the screams of that nameless man and the pounding on the door.", "“Well, I knew that would happen. Alright, in any case, let's all get started. The time's already this late and all.”", "The Guide smiled brightly and tapped an icon on his smartphone.", "[You have received a new message from the Guide.]", "[The Tutorial's first mission, 'Escape from the Assembly Hall', will now commence!]", "[The Diary of an Unknown Student has been updated.]", "“I pray for an enjoyable school life for all of you.”", "Han placed his right hand across his chest and politely bowed. Then….", "“Everyone, I wish you all a good fortune.”", "….He vanished into thin air, just like when he made his first appearance. Not just him, but the blonde maid as well.", "Now left seemingly abandoned, people began standing up in haste, one by one.", "Just as someone was about to shout out…", "KWANG!!", "An impact noise on a different scale from the previous pounding rocked the exit door, instantly silencing the uproar before it could even start.", "One of the door's hinges couldn't endure the impact and broke off from the wall, hitting the ground with a sharp metallic clang. The door had been securely locked up, yet it was forced open just a crack before it was closed shut again.", "The silence that settled within this confusion was deafening.", "None of them knew what to do next. Only the instinctive reaction of the mouths silently bobbing up and down continued.", "“….”", "Of course, Seol didn't remain still as this chaos unfolded. He picked up the empty golden bag, slung it over his shoulder, and got up from his chair. All the meanwhile, he didn't forget to keep his eyes on the door.", "Because the door was no longer shining in green but in the color of orange."]}