{"cid": "275", "title": "Chapter 275. The Savior of Eva (4)", "content": ["He saw a familiar scene— Roselle’s dream world.", "As this was his third time coming to this place, he was no longer surprised. Only, he wondered why she summoned him.", "Roselle was sitting at a table in the garden, drinking tea. On her opposite side was a half-eaten cake and a teacup. It clearly showed that someone else was there just a moment ago, and Seol Jihu had a good idea who that was.", "“I finally got her to go back just now.”", "Roselle took a sip of tea before speaking calmly. For some reason, her voice seemed to be trembling very faintly.", "“How was it?”", "“How was it, you ask?”", "Tang. She placed the teacup down on the plate, hard.", "“I had to listen to her story for twelve hours. We didn’t talk, I just listened.”", "Roselle took a deep breath, making her tiny chest puff out a little. Then, she said in an exhausted tone.", "“How should I say this… I must have underestimated that child a bit.”", "She continued with a haggard look.", "“I guess you could say she has a frustrating personality. Ah, fuck, just thinking about it is pissing me off.”", "“Excuse me?”", "Seol Jihu doubted his ears.", "“Did you just curse?”", "“No, I didn’t.”", "Roselle replied with a straight face.", "“No, you definitely did. Was it that bad?”", "“Ah, a flower petal fluttering by must have said that. How frustrated must it have been to blurt out like that?”", "“How can a petal talk?”", "“Anything can talk in this dream world. Right, petal?”", "[Yes, Lady Roselle.]", "One of the flower petals fluttering in the air really talked. Seol Jihu jumped in surprise.", "[But I had nothing to do with it, lady. I, Little Petal, did not cuurrrrssse!?]", "The petal suddenly screamed in the middle of talking and flew far away.", "[Aaak. Aaaaaak. It’s too strong!]", "Seol Jihu stared at the petal being torn apart by the wind, then snapped out of his daze at the sound of Roselle clearing her throat.", "“Kuhum, anyway, it wasn’t too bad.”", "He felt like Roselle was trying to change the subject and gladly went along with it.", "“If I lived in the same era as that child, I would never have taken the time to acquaint myself with her. That said, her talent was just as I expected. And judging by the way she went off with that big mouth of hers, she seems to be good at focusing as well.”", "‘Now she’s just insulting her outright…’ Seol Jihu smiled faintly.", "“So the talk went well?”", "“Would I be saying this if it didn’t?”", "She sounded strangely hostile. Roselle pressed her forehead, then shook her head.", "“My apologies. I should not be getting angry at Seol Jihu-nim like this. It’s just that thinking about her keeps pissing me off…”", "On the other hand, Seol Jihu was amazed at Charlotte Aria. Since Roselle spent hundreds of years by herself, she should have been hungry for human interaction as well. So to make her lose her self-control and react inthis way, he couldn’t help but praise Charlotte Aria’s ‘strength’.", "‘Well, Lady Roselle can read other people’s thoughts, so that must have multiplied the pain.’", "“Anyway, what I can tell you is that rigorous management is needed for that child to grow.”", "“Management?”", "“I am not saying that she is a bad seed. There are people who cannot become anything even if they receive the utmost care and attention from the world’s best manager. However, this child’s talent is guaranteed.”", "“I agree fully.”", "Seol Jihu easily agreed.", "“Thank you for your understanding.”", "It was then that Roselle showed a feeble smile.", "“And for that reason, I would like to shamelessly ask for your cooperation.”", "“Cooperation?”", "It wasn’t until the next day that Seol Jihu understood what her words meant.", "*", "“Seol Jihuuuuuu!”", "The lobby resounded sonorously first thing in the morning.", "Seol Jihu looked down from the 6th floor with an ominous foreboding, and lo and behold, he saw a girl dashing across the lobby.", "He had gotten a message from Sorg Kühne saying, ‘The queen has left. I am sorry.’ At first, he failed to realize why he was apologizing, but now he knew.", "He didn’t think things would turn out like this.", "“What the? Who’s that brat?”", "Chohong, who had just finished breakfast and was walking down from the cafeteria, asked as she looked down from the guardrail. Seol Jihu answered calmly.", "“Eva’s queen.”", "“Haha, funny. Who is it?”", "Chohong didn’t believe him easily. It took Seol Jihu a while to convince her that he was telling the truth.", "“Wow, she’s really the queen?”", "Chohong couldn’t hide her surprise as she stared at Charlotte Aria, who was asking, “Where is he? Where is Seol Jihu?” while shaking Kim Hannah, who had gone down to meet her.", "“I thought I was back at Haramark for a second. No, even Teresa and that old king weren’t this bad.”", "She sniffled while shaking her head. Then, she patted Seol Jihu’s back before turning around.", "“Well, good luck, Princess Collector. Wait, should I say Queen Collector? No, it’s both.”", "“The heck is that… Where are you going?”", "“Back to my room.”", "“Come with me. The queen is here. You can take this opportunity to introduce yourself.”", "“An ordinary member like me? Naaaah. The higher-ups can take care of it.”", "Chohong hastened back as she replied like she couldn’t bother with it.", "“Plus, my sense of smell is telling me not to get involved.”", "“Your dog nose?”", "“Yeah, something like that.”", "Chohong disappeared quickly. Seol Jihu sighed and then went to the reception room to wait for the queen.", "While he was counting to 100 in his mind, the door shot open and Charlotte Aria ran in.", "“Seol Jihuuu!”", "“Ah, you’re here?”", "Before Seol Jihu could even get up from his seat, Charlotte Aria spread her arms out.", "“You were right! You were really telling the truth!”", "She grabbed his shirt and jumped excitedly.", "“You must have met Lady Roselle.”", "“Un, un! I’ve never had such a mysterious experience! My goodness! A dream world where you can achieve anything you imagine!”", "Seol Jihu tried to get the excited Charlotte Aria to calm down and get her to sit, but she did not budge an inch and focused on spitting out words. In the end, Seol Jihu gave up and asked helplessly.", "“D-Did you become her friend?”", "“Un! You were right. She understood me sooo well.”", "‘Obviously. Lady Roselle can read her thoughts, so she must have said exactly what the queen wanted to hear.’", "“She was a really good person!”", "The depressed look she had just a day earlier as she refused to eat and drink was nowhere to be seen. The way her cheeks were flushed in excitement and her eyes were sparkling like stars, it looked like she was dying to speak.", "“Ah, yes, is that true?”", "“Excuse me?”", "“That the dream world isn’t everlasting.”", "Charlotte Aria told the story: Roselle used the Eternal Light of Wisdom before her death to create a dream world, but mana was not an infinite resource. Once the mana maintaining the dream world ran out, both Roselle and the dream world would perish eternally.", "Although she coincidentally met Seol Jihu and was able to maintain the dream world from disappearing, it was only a temporary solution as the fundamental problem had not been solved. So to resolve this problem, she needed someone to help her research.", "Roselle seemed to have tricked Charlotte Aria as such.", "‘What a brilliant idea!’", "Teresa had described Charlotte Aria as an unconditional ally.", "Although she was reckless and without a guiding principle, what if they could apply this personality of hers directly to the study of sorcery?", "Roselle must have lied with this in mind. After all, Charlotte Aria would do her best to stop her friend from perishing.", "‘As expected of Lady Roselle.’", "Seol Jihu nodded his head in approval. With just one meeting, Roselle had noticed Charlotte Aria’s idiosyncrasy and even came up with a good method to use it. Such brilliance was truly befitting of a witch who existed for hundreds of years.", "“That is correct.”", "Seol Jihu played along.", "“Ah! I knew it.”", "Charlotte Aria looked regretful.", "“The problem is that sorcery, the discipline that created the dream world, is a very unique and special discipline.”", "“Un, un, that is what I heard as well.”", "“In this current time, Magicians have become rare, and not even they can understand Lady Roselle’s profound discipline. You see, to the current school of thought, sorcery is something like heresy.”", "“The Empire was like that. They rejected the use of mana for anything other than magic. They were especially strict about persecuting witchcraft. I find that very regrettable.”", "Although this did not matter now since the Empire had fallen, Charlotte Aria replied positively to just about everything. She was quite easy to deal with for situations like this.", "“So Lady Roselle needs a Magician who can understand her school of discipline. Charlotte Aria-nim is like a blank slate right now, which is precisely why you won’t be influenced by the existing discipline. Since you’re talented on top of that, Lady Roselle said you will be able to absorb her teachings like a sponge.”", "Once Seol Jihu started praising her, Charlotte Aria began to laugh gleefully like a little kid. Seol Jihu then continued in a serious tone.", "“Please, I beg of you. Because I am not a Magician, I am limited in the ways I can help her, but Your Majesty is different. Please help the dream world not disappear.”", "“I shall grant your wish!”", "Charlotte Aria took her hands off Seol Jihu’s shirt.", "“You’ve laid out the mat, how can I just stand still and pretend it doesn’t exist? Do not worry. I will learn this sorcery thing and prevent Roselle’s annihilation!”", "She clenched her hands and swore resolutely. Judging by the way she was so full of fighting spirit, she seemed to really be invested in it.", "Seol Jihu smiled inwardly in satisfaction.", "“Thank you. Both Lady Roselle and I have great expectations of you.”", "“Yes, yes. Oh right, come to think of it…”", "Charlotte Aria looked around the room before finally sitting down.", "Seol Jihu blinked rapidly. What else was there to talk about? Didn’t they discuss pretty much everything?", "“Come sit next to me. Come and hear me out.”", "Charlotte Aria said as she tapped on the chair next to her. She made it sound like she was only getting started.", "And just like that, four hours went by. After barely managing to send Charlotte Aria off, Seol Jihu staggered left and right in the hallway before grabbing onto the wall.", "‘God damn it…’", "He cursed unwittingly.", "The devil kept blabbering on and on without rest. He sneakily asked, “Don’t you have to go back and prepare to study sorcery for Lady Roselle?”", "But the reply he got was, “No, I have to focus on research in the dream world, so I have to talk to my heart’s content in the real world.”", "When she refused to go back saying so, Seol Jihu almost jumped out of his seat in shock.", "‘Damn it, this is what she meant?’", "Seol Jihu finally understood what Roselle meant when she said he would know the following day and asked for his cooperation.", "‘Like I will take this sitting down.’", "Seol Jihu staggered back to his room. After practically collapsing on his bed, he forced himself to sleep. He planned to meet Roselle in his dream and say a thing or two to her.", "Of course, Seol Jihu did not end up going to the dream world. Roselle had not summoned him now that she had achieved her goal.", "‘You think I will let this end here?’", "After waking up from a nice nap, Seol Jihu vowed to get his revenge.", "*", "Once the story that Jung Sua ran away spread, Sorg Kühne took a hard measure.", "He regarded Jung Sua running away without acceding to the investigation as a confession of her taking part in the recent incident.", "And along with her crime of lèse-majesté, he declared Eva would no longer recognize Evangeline as an organization. In other words, he was telling them to get out of the city or disband.", "Naturally, Evangeline was no longer the Eva Royal Family’s partner organization. Although Evangeline’s members protested vehemently, saying that they had nothing to do with their representative’s wrongdoings, Sorg Kühne directed all the blame to Jung Sua.", "The fact that she was the representative played a huge role in this matter. It would be a different story if she was an ordinary member, but because the representative of an organization committed a crime, it was impossible to gloss over it.", "Similar to how Bok Jungsik ran away and White Rose disbanded, it was right for the entire organization to be punished.", "Just like that, the Evangeline organization collapsed. One thing that was surprising was that its members did not maintain the group and disbanded the organization completely.", "But thinking about it deeply, it made sense. They would have to leave Eva to stay as an organization, but moving to another city was not so easy.", "Not only was there no guarantee that another city would take them in, but they also lacked a leader who would shoulder the responsibility during the process.", "In truth, the organization had been on its last leg ever since Evangeline Rose died in the Banquet.", "And thus, the position of Eva Royal Family’s partner organization became empty. However, everyone knew which organization would rise to take that spot.", "The queen’s actions were more than telling.", "“Seol Jihuuu!”", "She came to Valhalla today as well. Recently, Charlotte Aria had been coming to Valhalla once every two days.", "Learning sorcery from Roselle while sleeping, waking up late and reviewing until dinner time, then racing to Valhalla. She looked for Seol Jihu and began to chatter, ‘I did this today, I did that today.’", "She was really like a daughter clinging onto her father who just came back from work and talking excitedly about how her day went.", "If it weren’t for Sorg Kühne restraining her, she most certainly would have visited Valhalla daily. And that was not an exaggeration.", "“Uwaaaaah.”", "Seol Jihu sprawled down on the couch after being swamped by Charlotte Aria as usual. He had just sent the queen back, who was throwing a tantrum about wanting to sleep over.", "Sorg Kühne spoke plainly.", "“Thank you for your hard work. I really don’t know what else to say.”", "“Can’t you moderate her somehow?”", "Sorg Kühne laughed inaudibly at Seol Jihu’s candid question.", "“I was briefed on the matter roughly. It seems that the queen views meeting you as a reward.”", "“A reward?”", "“Representative Seol, you are the only one whom she shares that witch with. Simply put, she is saying, ‘I am working hard. Please praise me.’”", "Seol Jihu dropped his head at a loss for words.", "“…Is she studying hard?”", "“Yes, she is truly giving it her best. Even I get scared when she is concentrating. It looks like she is interested in what she is learning, but being able to help her friend seems to be the real driving factor.”", "Hearing this, Seol Jihu raised his head back up.", "“That’s good to hear, at least.”", "“Well, I don’t know about you, but I sure am happy with it.”", "Sorg Kühne chuckled and looked back at the door.", "“How about it? I know you are tired, but would you like to have dinner with me tonight?”", "Seol Jihu’s eyes widened. He didn’t expect this inflexible old man to ask him out for dinner.", "“Sure.”", "“Let’s go out. I know a good place.”", "Seol Jihu agreed readily and got up. Sorg Kühne then led him to a dilapidated restaurant in a remote alleyway.", "“I apologize. This place is nothing grand, especially given the things you have done for the royal family.”", "“It’s fine. I like restaurants like this anyways. It feels like it’s run by a hidden master chef.”", "“Fufu, he may not be a master chef, but he knows how to brew good wine. I drop by often when things are tough.”", "Sorg Kühne entered the restaurant, saying that the dinner would be on him, and then proceeded to order food and drinks without hesitation.", "The wine really was excellent. Although Seol Jihu was a heavy eater, Sorg Kühne was no pushover either. The old man ate and drank so much that Seol Jihu was beginning to worry whether his willowy body would be able to handle it all.", "“It feels like a dream.”", "Only after emptying six glasses of wine did Sorg Kühne start talking.", "“Can you believe this situation? I can’t. When I wake up in the morning, the first thing I do is pinch my cheeks a couple of times.”", "He must have gotten heavily drunk as he began to chatter more.", "“Do you know what the queen said to me yesterday? She said she’s busy with research so I should take care of the administrative work by myself. She said I am the only one she trusts.”", "“That’s harsh.”", "“It is. It really is harsh!”", "Sorg Kühne nodded his head in a big motion.", "“But this level of harshness is something I can bear. In fact, I welcome it with open arms!”", "He cackled before continuing.", "“Never in my wildest dreams did I imagine that the queen would say she would learn magic. Hoho, isn’t that great? Learning magic in this dangerous world. Whenever I see her concentrating in her seat, I think back to the late king….”", "Seol Jihu listened quietly.", "“What I know for certain is that today’s Eva is much better than yesterday’s, and tomorrow’s Eva will be much better than today’s!”", "Sorg Kühne emptied another glass, then stared at Seol Jihu furtively.", "“It is all thanks to you.”", "Seol Jihu shook his head.", "“Even if it wasn’t me, someone would have done it. Though, she unfortunately died.”", "“I believe I know who you are talking about.”", "Sorg Kühne nodded his head solemnly.", "“Evangeline Rose. She was indeed an outstanding person. But to tell you the truth, I did not like her that much.”", "“Pardon?”", "“Don’t misunderstand. Evangeline Rose was an Earthling who had principles and also the ability to achieve her goals. I know she was over a thousand times more excellent than someone like Jung Sua, so much so that I would not dare compare them.”", "“….”", "“But she… how should I say this…”", "He paused before continuing.", "“She did not have any expectations. Rather than leaving it to you guys, I’d rather take care of it myself. She was always like that.”", "Sorg Kühne smiled bitterly.", "“Well, I really can’t blame her given the state of the government affairs back then, but I think it was wrong of her to part ways with the one and only Magician just because she did not agree with that person.”", "With that, he emptied yet another glass.", "“But you are different.”", "He wiped his mouth and smiled.", "“Evangeline Rose would have been able to become the guardian of Eva. But that would have been it. She would not have been able to breathe life into a dying city and offer a brand new vision to me and the queen.”", "Saying so, Sorg Kühne took a deep breath and said.", "“You are the true savior of Eva.”", "Seol Jihu smiled ambivalently.", "“Thank you for your kind words, but it’s a little embarrassing.”", "“Why? Is it not better than Haramark’s War Hero?”", "Seol Jihu and Sorg Kühne burst into laughter simultaneously.", "“Oh yes, can you drop by the palace tomorrow?”", "“Again?”", "“How can you be in tears already? You will have to come a lot more often from now on.”", "Sorg Kühne chuckled jovially as he took Seol Jihu’s glass and poured more wine into it.", "“Don’t play hard to get and come. I was just given full authority over administrative work. I plan to talk to you about the districts within the city.”", "‘Districts within the city?’ Seol Jihu’s eyebrow went up.", "“Dongchun Merchants and Red Hwaru each have one. We’ll have to give one to the Triads. But then out of the eight districts, five will remain.”", "Sorg Kühne grinned.", "“Don’t you need to bring back the certificates of lease for these districts?”", "Seol Jihu’s jaw dropped. Sorg Kühne was saying he would put Valhalla in charge of five districts.", "“How you use them will be of no concern to me. Valhalla can manage them all directly or hire external help.”", "What this signified was clear.", "“But if you plan on hiring external help, I hope you can pick ones that won’t cause any problems.”", "Sorg Kühne handed Seol Jihu’s glass back to him and winked.", "“I look forward to working with you, Partner Representative.”", "“Likewise.”", "Seol Jihu took the glass without hesitation.", "“I look forward to working with you too.”", "“Fantastic.”", "Sorg Kühne raised his glass, and Seol Jihu smiled brightly and raised his glass together with him.", "One toasted for Eva, and the other toasted for Paradise.", "Or so Seol Jihu thought.", "“May the two of you have a happy future together.”", "“For Paradi… huh?”", "Hearing Sorg Kühne’s words which seemingly came out of nowhere, Seol Jihu jumped in a startle and put his glass down.", "However, Sorg Kühne drank the wine nonchalantly. For some reason, he seemed to be having fun."]}