{"cid": "289", "title": "Chapter 289. After the Setup (10)", "content": ["After returning to the cabin, the duo first checked up on the man. Thankfully, he was still breathing. He seemed to have good endurance, judging by his large, well-trained physique.", "Seol Jihu splashed one healing potion on his wounds and forced him to drink another. Then, they turned to the man they saved at the cave. Only after making him drink the last potion did Seol Jihu and Eun Yuri take a break.", "The two men regained consciousness at daybreak. Seol Jihu could hear one of the men waking up, followed by soft whispers to wake the other sleeping man.", "Seol Jihu and Eun Yuri munched on uncooked ramen as they waited for the men to come out.", "Soon, the door creaked open. Although they were staggering a little, walking out of the room with their own legs showed that they were feeling a lot better.", "The two men paused seeing Seol Jihu and Eun Yuri sitting in the living room.", "“Are you feeling better?”", "Seol Jihu asked out of courtesy, and a man nodded in a daze.", "“That’s good. We found a high-quality healing potion by luck.”", "Seol Jihu smiled and pointed at the supply of food and potions he had prepared beforehand.", "“Go ahead. We can talk after you eat.”", "The two men looked at each other slowly. The burly man spoke.", "“Can… can we really eat this?”", "Seol Jihu chuckled. Things might have been different if they were at the lot, but Seol Jihu felt a lot more generous now that he had the Essence of Soma.", "“We have more than enough to go around, so feel free. Even if we run out of food, we can go find more.”", "Once Seol Jihu made the offer two, three times, the two men pounced on the food in a hurry. They quickly munched down uncooked ramen without even putting the seasoning on and emptied a bottle of water.", "How could they not be hungry when they practically came back from the dead?", "“Thank you, Hyung-nim!”", "They must have come to their senses after eating like they were possessed as the slim young man bowed politely.", "“My name is Park Woori! I won’t forget the kindness you showed me today!”", "“Uh, okay…”", "Seol Jihu scratched his cheek with an awkward look. He wanted to say, ‘Splurge with your Survival Points if you really want to thank us.’ However, he held himself back.", "“I’m 24 years old! You can call me Forward Park!”[1]", "“Forward Park?”", "“Yes, it’s my nickname. The hyung-nims at my workplace call me that.”", "Seol Jihu had a feeling the man worked at a nightclub as a bouncer and that the hyung-nims he was referring to were the well-known customers.", "“Anyway, I’m surprised you haven’t asked what happened. I would be curious if I were you.”", "“Eii, isn’t that obvious? Hyung-nim and Missus must have saved us, right?”", "Eun Yuri’s expression became wry. On the other hand, Seol Jihu replied with a pleased look.", "“Looks like you have a good grasp on the situation.”", "“Well, to tell you the truth, I hadn’t lost my consciousness completely yesterday. Although I was only half-awake, I could faintly hear the things around me.”", "Park Woori chuckled jovially and said subserviently.", "“I’m…”", "Next, the burly man carefully introduced himself.", "“Yoo Yeolmu. I’m 34, and I’m an actor.” He then added, “I’m just a nameless nobody though.”", "Seol Jihu nodded. He knew why the two introduced themselves even though he didn’t say a thing. The way they were walking on eggshells the entire time they were eating, Seol Jihu began to pity them.", "“Alright, Mister Park Woori, Mister Yoo Yeolmu.”", "Seol Jihu nodded his head.", "“Well done surviving until now. Rest up, and you can tag along with us afterward.”", "“C-Can we really?”", "Park Woori rejoiced very noticeably. Yoo Yeolmu seemed surprised by the offer as well.", "“Is that okay?”", "“You don’t have to if you don’t want to.”", "Seol Jihu spoke jokingly, and Yoo Yeolmu shook his head.", "“No, I’m grateful. It’s just that…”", "Judging by the way he was hesitating, it looked like he had at least some conscience.", "‘I still gotta bring them along.’", "Not only would Eun Yuri get points for helping them, but these people would also be using Survival Points in the Neutral Zone. Each of them was a precious customer from Valhalla’s perspective.", "“But, I have a condition.”", "Yoo Yeolmu and Park Woori shouted simultaneously as soon as the words left Seol Jihu’s mouth.", "“Y-Yes! Go ahead.”", "“I’d be fine with anything!”", "They practically had accepted the condition already.", "Eun Yuri observed Seol Jihu as she carefully bit on ramen. He hadn’t even asked them to recognize him as the leader, but the two of them were listening to Seol Jihu before anyone noticed.", "Seol Jihu’s condition was nothing difficult. It was simply to not go to the Neutral Zone right away.", "Only after filling the men’s stomachs and checking their health did Seol Jihu leave the cabin. He planned to rescue survivors and eliminate the killers while he was at it to scrape up points.", "The group of four then ran into the first group of survivors in a dense forest when they found a small area hidden by a huge tree. There were four survivors, all ensnared in traps.", "They were either entrapped in fishing nets and hanging on the tree, or lying unconscious with a bear trap fixing them in place. Some had already died after falling into a pit full of stakes.", "Most people were unconscious from severe blood loss, but there was one person who hadn’t lost consciousness yet.", "Seol Jihu let this woman down from the tree and asked what happened. She replied while sobbing.", "“I don’t know… hic. I fell into a trap and then was moved here…”", "‘A trap killer?’", "From the looks of it, this woman seemed to have fallen into a trap elsewhere, then was moved here for storage.", "‘Right, doing this would be a lot more efficient.’", "The survivors who weren’t captured at the empty lot must have scattered all over the island. Going back to the base every time a survivor was caught would be inefficient.", "The trap killer must have set multiple traps and planned to take the survivors back to the cave after a certain number were captured.", "“So if I wait here, the killer should come back, right?”", "“N-No, I’m not sure.”", "The woman seemed to be in a state of panic, but she still answered Seol Jihu’s questions clearly.", "“It was lurking around here except for the times it went to retrieve people who fell into the traps… but I suddenly couldn’t see it anymore. I think it’s been about two hours.”", "The killer had disappeared. For a long time, to boot.", "Seol Jihu debated waiting or continuing with his search before deciding on the latter. He judged that this was the only thing he could do and that he could run into the remaining killers again in the next stage.", "If he was lucky, he could run into more survivors as well.", "He found another group of survivors more quickly than he anticipated. He was circling around the various cabins while healing the survivors who were injured by the traps when he discovered eight people in the fourth cabin he visited.", "One unfortunate thing was that the majority of them had already died. Their corpses were damaged severely as if they were cut apart by a chainsaw.", "It was to the point that a gasping survivor with a long slit on his back was the healthiest among the injured. Although Seol Jihu managed to rescue him, he couldn’t see any killer around the cabin either.", "Then, just as the sun rose to the middle of the sky, Seol Jihu came across a bizarre scene on a forest pathway. It was a group of six survivors, all naked regardless of being male or female, and their arms and legs bound tightly.", "‘…Did they run into a pervert killer or something?’", "The silver lining was that their injuries weren’t as bad as the other survivors. Once Seol Jihu cut the ropes binding them and loosened the cloths covering their mouths, the survivors all shouted with one voice.", "What they said wasn’t all that different from the trapped survivor’s experience. The pervert killer had apparently undressed its victims forcefully, tied a collar around them, and made them crawl on all fours, but then suddenly abandoned them and disappeared.", "The same thing had happened with this killer as with the trap killer. With this added knowledge, Seol Jihu could no longer disregard the matter.", "‘I ran around for half a day already…’", "He had been feeling somewhat strange for a while. Although the island spanned a huge area, it didn’t make sense that the three strengthened killers would not have found them.", "‘Let me think this through.’", "The Sixth Mother was most definitely dead. The Diary of an Unknown Survivor said the same thing, so it was hard to believe that she escaped.", "Just as Seol Jihu fell into deep thought…", "Bzz, bzz, bzz! Eun Yuri’s cell phone rang, not once but several times. Checking the phone’s screen, Seol Jihu furrowed his brows. The Diary of an Unknown Survivor was updating consecutively.", "[Sender: Unknown]#Mysterious Underground Prison (Diary of an Unknown Survivor — Page 32)", "While searching for our missing comrades, we discovered a staircase leading underground. As we carefully explored the mysterious dungeon, someone screamed.Dear god! A horrifying monster was trapped inside a prison cell!Scared out of our wits, we ran as if our lives depended on it. We managed to climb back out to the surface… But shoot! We left the killer we captured underground!The person who mistakenly left him there said he’d take responsibility and went back down. However, he came back empty-handed.Then, he delivered some hard-to-believe news. The mysterious monster locked up in the prison cell had reached out through the bars, grabbed the neutralized killer, and started eating it.A monster that eats killers!It was hard to believe, but none of us had the courage to go back down and check. Since the killer died, the remaining killers should get stronger. We began to walk away, worrying about the future days to come.", "…Huh? What happened? The other killers don’t seem any stronger.", "[Sender: Unknown]#Mysterious Underground Prison (Diary of an Unknown Survivor — Page 33)", "Let’s think this through. Killers get stronger when a survivor kills them with their own hands. But nothing happens when the monster in the prison cell eats them.To test this hypothesis, we went through all sorts of hardships and troubles to capture another killer. After tying it up, we went back to the underground prison.Success! The killer was eaten, but the remaining killers didn’t get stronger. Did the Sixth Mother not notice?We couldn’t be sure, but what we did know was that the killers did not get stronger.Great, we can use this method from now to get rid of the killers. We’re no longer afraid of them!!", "[Sender: Unknown]#Mysterious Underground Prison (Diary of an Unknown Survivor — Page 34)", "Strange. The imprisoned monster seems to have changed.Even in the past, it gave off an ominous aura that made me reluctant to look at it, but now that aura is several times stronger.Is this because of the killers it ate?…This can’t go on. I have a feeling we shouldn’t feed it anymore. I might be mistaken, but I think that thing just looked at me and swallowed its saliva!I’d rather face the killers or the Sixth Mother. I don’t want to fight that thing! If it breaks out of the prison cell somehow… ugggh! Just thinking about it gives me the creeps!", "Seol Jihu’s expression quickly changed as he read the diary.", "‘Wait…’", "There was one question that rose above the others.", "Why did the Diary of an Unknown Survivor suddenly update? The diary was something that was updated depending on the situation. What did rescuing the survivors have to do with anything?", "Seol Jihu looked back at the phone screen. There was still a page he hadn’t read.", "", "[Sender: Unknown]#Diary of an Unknown Survivor — Extra", "…Fuck. We should have killed that fucking monster first.", "Extra. The entry only contained two sentences but delivered a powerful impact.", "‘That fucking monster?’", "Seol Jihu’s eyes narrowed. It was then.", "[Following the Sixth Mother’s will, the pervert killer has been devoured by the ‘Homunculus’.][Saw killer has been devoured.][Trap killer has been devoured.]", "Messages suddenly popped up. And next…", "[Homunculus’ strength and movement speed increase.][Homunculus’ five senses become sharper.][Homunculus’ intelligence greatly increases.][Homunculus’ regenerative power greatly increases. Be careful. Homunculus can now break out of the prison cell.][Homunculus has consumed all killers. By accepting ‘Absolute Evil’, Homunculus’ overall power doubles!]", "More messages popped up. And thus…", "[Homunculus has not met all the conditions for revival!]", "The change…", "[Homunculus’ twisted internal balance causes it to rampage!]", "…like always…", "[While ‘Absolute Evil’ is rampaging, Homunculus receives a 700 percent increase in overall power!]", "…arrived suddenly.", "—GUOOOOOOOOO!", "A terrifying howl burst out from far away, causing the land to tremor. Even the blowing wind shook violently, causing an instinctive repulsion.", "It wasn’t just Seol Jihu and Eun Yuri. The rescued survivors were all looking in the same direction.", "Although they were far away, they could feel it. An unprecedented, inestimable evil was sweeping across the land.", "An evil aura that the killers and the Sixth Mother could not hold a candle to was encroaching upon them.", "1. The word used here in Korean is unique and means ‘someone who has no reverse gear’ or ‘someone who is rash and careless and keeps going only in the forward direction'. "]}