{"cid": "70", "title": "Chapter 70. A Mystery", "content": ["Bringing Maria into the group was an excellent choice in various ways.", "There were two gods that Priests served. The first was the Order of Luxuria, the goddess of lust, who was in charge of healing, dispelling, and support spells.", "The second was the Order of Invidia, the god of envy, who preferred to repulse the enemy with holy powers and governing over the operations of divination magic.", "Chohong was an Earthling who had straddled two separate paths of Invidia and Ira. Maria, on the other hand, walked the lone path that Luxuria had carved out ever since she was Level 1.", "A Priest was already treated like an aristocrat in Paradise, but a Priest who specialized in healing was valued almost equal to a Magician.", "As Earthlings had a tendency of prioritizing their lives the most, a Level 4 High Priest, who was capable of healing regular injuries with a proverbial flick of her hand, made every Earthling react positively to a team with such a Priest as a core member. They would even try their best to act as friendly as possible.", "Seol Jihu was successful in recruiting a Priest, but he didn't rest after that. His next stop took him to the city's library, rather than back to Carpe Diem's office.", "It didn't matter which city it was, the city library could be called the repository of all the amassed information. The Ramman Village extermination request happened frequently, so he figured that there must be past records of the mission itself, just like how Alex's report on the Mole's appearance showed up on the city's noticeboard soon afterwards.", "Chohong, as usual, was full of swagger, loudly declaring that they only needed to look the part as she alone would be enough to sweep all of their enemies away. However, Seol Jihu couldn't readily accept that.", "He developed a certain habit ever since he nearly got killed from the siege of the skeletons back in the Neutral Zone. And that would be to prepare as much as humanly possible in the matters where his life might be on the line.", "And so, as he immersed himself in searching for the relevant information, he ran into someone quite unexpected in the library.", "“Hoh? I didn't expect to see you here, my man.”", "An older man with a greying beard wearing a conical hat typical of wizards reached out for a handshake.", "“Ah, hello there.”", "Seol Jihu politely shook the offered hand.", "“I'm also surprised to see you here. What brings you to the city library, Master Ian?”", "“Ehehe. I think you might be the only Earthling in history to ask a Magician what his business is in a library.”", "Ian giggled and asked back.", "“So, how have you been?”", "“Well, it was okay, nothing too special. I tried my hands at being a courier, and I am still training every day, too.”", "“It's good to hear that you're enjoying a peaceful life so far. Oh, right. Did you get the spear?”", "“Ah, that. I've completely forgotten to thank you and Princess Teresa for it. How is she doing nowadays?”", "“Don't worry about her. Princess Teresa is always pink-pink, if you know what I mean.”", "Ian threw him a knowing wink. He then grinned at the youth panicking somewhat at the seemingly innuendo-ridden word of ‘pink’ before leaning in closer to whisper something else.", "“Fufufu. This is a secret only I know, but allow me to share it with you.”", "Before he had time to realize it, Seol Jihu was paying attention to the older man's words.", "“The truth is, there are many, many variations of the pink color.”", "“….Eh?”", "“For instance~. Princess Teresa's color is much closer to 'baby pink'. Yes, indeed. Mm, mm.”", "“….Master Ian.”", "“Oopsie. I was just messing with you. Just a joke of poor taste from an old man. I definitely didn't use an X-ray spell to confirm so you shouldn't look at this old man that way. If you form a grimace like that, you come across as a total stranger and that kind of scares me a little.”", "Ian waved his hands about and guffawed out loudly. Seol Jihu could only leak out a sigh. He let his guard down and got fooled again.", "“I'm sure she won't mind normal types of pranks but isn't it a bit much making sexual innuendos to a princess?”", "“You say that because you don't know what she's really like.”", "“?”", "“Earlier today, I cracked a simple joke to her and she responded back with 'yours can't even stand up again, so why are you asking me that?' To be honest, my feeling's been kind of hurt.”", "“….”", "By now, Seol Jihu had forgotten what he wanted to say.", "“Okay, that's enough of small talk. What brings you here?”", "“Well, I was given a mission, so I was hoping to find relevant information here.”", "Seol Jihu took a bit of guard against the older man and made his reply.", "“A mission?”", "“Yes, it's a request issued by Ramman Village.”", "A certain glint flashed by Ian's eyes.", "“Dylan and Hugo shouldn't be able to participate in that. Does that mean it's you and Chohong forming the team?”", "“Basically, yes. Master Ian, you heard about that as well?”", "“I'm also participating in ‘that’ mission, so indeed, I know of it. Dylan has given you the leadership role, then?”", "Hmm, hmm~ Ian carried a somewhat contemplate expression, but then, he suddenly formed a mysterious smile.", "“Fufufu. Oh, Dylan, you one sly….”", "He muttered to himself and shifted his gaze back to the youth.", "“My man. Can you spare me a bit of time? I only need around five minutes.”", "“Of course.”", "“Alright. I'll be right back, so please wait for me.”", "With a serious expression now etched on his face, Ian hurriedly went over here and there in the library. And precisely five minutes later, he showed up back again, now carrying an armful of scrolls and various documents.", "“Take these. These are all the historical records pertaining to the extermination mission you're about to take on. And this is….”", "The older man pulled out a ridiculously thick book just as Seol Jihu barely managed to receive them all.", "“This here is the recorded history of the region. You don't have to read everything, of course. I've made a bookmark somewhere in the middle, so you only have to browse that.”", "“You have?”", "“Mm. It has been a long time ago, but you see, I also participated in the extermination mission before. The thing is, the Ramman Village's matter is one of the most endearing mysteries of Haramark, so once upon a time, I was rather interested in solving it, you see.”", "Ian sounded philosophical.", "“Well, it all ended in failure, though. Back then, I thought I had caught onto a pretty solid lead, and I felt confident of my suspicions. But in the end, I still couldn't uncover the origin.”", "“People are telling me the same thing so far. I'd probably end up the same as you.”", "“I wonder about that. We'll have to wait and see first, no?”", "Seol Jihu smiled embarrassedly, while Ian was stroking his beard in contemplation.", "“Us walking out of the Forest of Denial alive, the famous forbidden zone, and then, us miraculously recovering the fortress that everyone thought was a lost cause – both of them were events easily exceeding one's wildest imaginations.”", "“Thank you for your kind words, but I think I just got lucky.”", "“No, not true at all. Your actions were responsible for both of those events, not lady luck.”", "Ian formed a warm expression.", "“Apologies for burdening you even further like this. But, if you manage to solve this mystery, it'd be the same thing as you aiding with the overall stability of the entire Haramark region, so you should be able to earn a substantial amount of 'achievement points'. And the royal family might reward you something extra on the side, too.”", "“I'd feel so much more confident if you were to accompany us, Master Ian.”", "“I'd love to do that. Unfortunately, I have a prior engagement to fulfill. Even Sicilia is involved now, so it'll be difficult to extricate myself out of this one.”", "“There's no helping it, then. Thank you for these records. I'll study them right away.”", "Seol Jihu smiled refreshingly.", "“I'll pray for your success.”", "Ian raised his tightly-clenched fist up high and cheered on.", "*", "Chohong returned to the office late at night, her current mood absolute worst.", "For the whole day, she went around looking for a Priest, only to meet with rejection at every turn. So, when she spotted Dylan drinking tea in the office, she loudly complained and said, “Are you going to do nothing and spectate from the sidelines?!”", "But then, she was rendered completely speechless after Dylan informed her of Seol finding a Priest already.", "“For real?!”", "“Mm. He himself went to talk to the Priest, apparently.”", "“Who is it?”", "“It's Maria Yeriel.”", "“Whaaaat?! That bitch?!?!”", "Chohong's voice became even louder. Dylan calmly covered his ears and nodded once.", "“I agree that it's somewhat unbelievable, but how about lowering your volume a bit? Seol is in the middle of work, you see.”", "“….Work?”", "“Right. I wondered if there was anything I could help him with, but there was no need, judging from how he was handling it. He doesn't even look like a newbie anymore from the way he's taking care of things.”", "There was a content smile on Dylan's face now.", "“Look. Do you know for how long I wanted a team member like Seol to join us? That's why, if we can't help him, we should at least not bother him, right?”", "Too bad, Chohong wasn't someone who'd heed such advice. Her thudding steps led her directly into the shared bedroom. She found Seol Jihu sitting by the desk, quietly jotting and studying all by himself.", "“Hey.”", "“Oh, you're back?”", "Seol Jihu replied without looking back.", "“I heard you found us a Priest?”", "“Yeah.”", "Seol Jihu nodded.", "“By the way, why is Miss Maria a bitch?”", "“Because, she is a bitch, that's why! How did you even manage to sweet talk that girl? I mean, that crazy bitch's infamous for having a re~ally high standard and all.”", "“Please stop swearing for a second. I know her from the Neutral Zone, actually.”", "“Hey, you! You are supposed to look at the person you're talking to!”", "Only then Seol Jihu turned around halfway. He leaned against the chair's back at an angle and continued.", "“Ah, right. What about Archers and Warriors? Did you ask around?”", "Chohong faltered a bit where she stood.", "“N-no, not really? I was busy searching for a Priest, so, like….”", "“But, I told you I'd find a Priest?”", "“I didn't know you'd find one this fast! I felt bad just dumping you with the responsibility, so I wanted to help out, too! So what!”", "Chohong yelled at him. Seol Jihu formed a wry smile.", "“Fine, fine.”", "He turned back towards the scrolls laid out on the desk.", "“Don't worry about it. Miss Maria's supposed to meet me tomorrow at the 'Eat, Drink, and Enjoy', so let's search together.”", "Chohong didn't say anything else to that. Nevertheless, she wanted to show off for a bit since she was supposed to be more experienced in these sorts of things, but just as Dylan had alluded to earlier, Seol Jihu was doing admirably well all by himself. She did feel a tiny bit apologetic in her mind, too.", "“….What are you doing?”", "When she got closer to the desk, she spotted lots of unfurled scrolls and documents. There was even a thick book there, too.", "“Oh, these? Historical records of Ramman Village's extermination missions.”", "“Annnd, this?”", "“Recorded history of the Empire. Master Ian gave it to me, saying that I should check it out.”", "“Wait, you ran into that geezer?”", "“Yeah. Happened by chance.”", "Chohong took a sneak at the book and immediately grimaced in shock.", "“Euhk~. I;m gonna get sick just from looking at this thing. You actually feel fine reading this?”", "“Really? I thought it was pretty interesting though.”", "“Is there a need to go this far? I mean, all we have to do is go there and kick some ass, right?”", "“Well, those monsters will most likely show up again in the future. If it's possible, I want to prevent that by finding out the root cause and eliminate it. Which means, we need solid leads.”", "“But how will reading those things get us anywhere?”", "Chohong sourly remarked. Seol Jihu yawned and stretched his arms high up above his head.", "“You might be right, but there are a couple of suspicious…. No, hang on. Let's just say that there are a few things here that don't feel right.”", "“Don't feel right? How?”", "“I can't be sure of it, yet. It's just a working theory of mine.”", "Seol Jihu covered his mouth to yawn again. Chohong's sigh was so long that the ground might have caved in from that.", "“Argh, I don't know. Do whatever you want. I'm going to bed. I've been walking around the whole day, and I'm pooped out, you know.”", "“You worked hard. Get some rest.”", "Chohong lay sprawled on the bed. For a while, she stared at the ceiling with a bit of a pout, before sneaking a glance at him.", "“Aren't you going to sleep?”", "“In a little while. I have an illuminating stone with me, so you can turn off the lights if you want.”", "“….No, I'm cool.”", "Chohong didn't fall asleep right away, though. Her coy eyes were fixed on the youth sitting by the desk studying the contents of the thick book. His sleeves were rolled up, his expression one of deep concentration and seriousness; silent and determined glint flickering within his eyes. She thought he looked refreshingly different.", "'This is so weird, isn't it?'", "Chohong whispered to herself “Been only a short while since you joined up, yet….” and lightly hugged her pillow. She then stared into his wide-open back that seemed more dependable today for some reason. Only until she fell asleep, of course.", "*", "Next morning.", "As promised, Seol Jihu met up with Maria. If there was one thing he didn't entirely count on, that would be her attire: she seemingly only wore an oversized white shirt that was probably very, very easy to move around in. And secondly, that she also happened to be an old acquaintance with Chohong. Not in a good way, either.", "“Hiya~, so it was true. Just what's gotten into Miss I Love Money that she decided to join in our little mission?”", "Those words were the opening volley Chohong fired as soon as she saw Maria. The latter slightly cocked an eyebrow as those sarcasm-laden words pricked her ears, before forming a refreshing smile.", "“Oh? I was expecting someone decent since I heard a member of Carpe Diem was joining. Turns out the member was the dumbass braindead bitch famed for her thick-headedness.”", "“Your runny mouth is as same as always. I'm curious, will you still be able to yap like a little birdie if I rip that mouth wide open?”", "“Well, I'm sure it's not as runny as your famous brainless fart of a head. Don't you wanna crack open that empty head of yours and prove it to the world?”", "Thick veins popped up on Chohong's forehead. A threatening grin of a beast, fangs bared and all, formed on her lips.", "“See, I told you. She's a bitch. Her mouth is a trash dump.”", "“Well, sure, my lips are a bit dirty. But it's not as loose as your other lips.”", "“Stop, please stop! Chohong, you too.”", "Seol Jihu hurriedly jumped in between the two 'smiling' females and their verbal assault rifles. Chohong had already pulled her mace out while Maria was 'lovingly' caressing a crucifix in her hands. If he left them alone like this, no doubt a scuffle would have broken out.", "“Heng.”", "“Hmph!”", "As they spun their heads away in opposite directions, his shoulders drooped lower and lower. It felt like things were heading the wrong way from the get-go.", "His sorrowful state only lasted for a short while, though. When he entered the pub along with two ladies by his sides, Seol Jihu realized that the attention of all the patrons was focused on him in an instant. It was similar to back when he went on dates with Yoo Seonhwa.", "Actually, he had to position himself in between two ladies in order to prevent a fight from breaking out. But that also meant that, outwardly at least, he had two beauties in each of his hands. These ladies were blessed with great looks, after all.", "'….Hm, hm.'", "Seol Jihu couldn't help but stand up a little taller, his shoulders opening up a bit more. Even his expression relaxed greatly. He tried his hardest not to look smug. Of course, he had no idea what the others were really thinking about.", "“Look at that guy. Now that is one hell of a weird combination.”", "“You're right. He's mixed up with two of the Six Crazies.”", "“Yo, hold up. That dude, didn't he show up here with Agnes not too long ago?”", "“Yeah, that's right. Three out of Six Crazies? Whoa, man. That friend's sure got a particular taste.”", "He wouldn't even have dared to dream that others were sharing such conversations about him right at that moment.", "Maria and Chohong settled down around an empty table and, as if they had made a prior arrangement, they began shouting at the same time.", "“Li-quor! Li-quor!!”", "“Al-co-hol! Al-co-hol! Al-co-hol!”", "They were like a pair of newborn chicks yapping noisily for food. Seol Jihu slowly facepalmed.", "“…..Order whatever you want.”", "“Kyaha! Hey, over here! Bring me all the rum and vodka you got!”", "Chohong possessed unparalleled skill when it came to mixing various alcohols. She expertly blended rum and vodka like a pro, before pouring several cups to distribute it all around the table. Obviously, Seol Jihu didn't even touch his, but well, Maria one-shot hers and shivered grandly from pleasure.", "“Keo-heuh! Now that will wake you up real good!”", "“It's fine if you want to enjoy your drinks, but please don't forget, we're here to scout the rest of our team.”", "“No sweat. Mister Leader, step aside and enjoy the show. I'll take care of everything.”", "Chohong confidently declared and poured another cup. Seol Jihu could only rest his chin on his hands and watch the two females acting like long-lost bosom buddies.", "Quite some time had passed by like that. More and more empty bottles filled up the table, and as Chohong took another manly gulp of her cup, she suddenly stopped moving.", "“Hey.”", "She sent a signal, and Maria glanced at the entrance. Two men and one woman were entering the pub. Maria leaked out an interested Hnng~ and nodded her head before shrugging her shoulders.", "“They aren't complete trash. Do what you want.”", "“Okay, cool. Hey, Mikhail!”", "Chohong waved her hand, and the man in front of the group waved back, his eyes resembling round dots. He was a lanky fellow with short, neatly trimmed hair.", "“You were still alive??”", "“You trying to jinx me or something?”", "Mikhail smirked and asked the duo behind him to wait for a little while. He walked closer, and Chohong started talking to him.", "“How have you been? I heard that you're about to reach Level 4.”", "“And that's been killing me lately. I only need a bit of experience, but the problem is money. I mean, the cost of equipment is just too damn ridiculous.”", "“Well, yeah, the price jumps up ten times higher and all.”", "Chohong grinned and agreed with him.", "“That's why I wanted to ask you about something here. Wanna go for a mission with us?”", "“A mission?”", "Mikail asked back as his gaze scanned the table, only to form a surprised expression.", "“Maria? What are you doing here?”", "“Obviously, it's for work. It's nothing big, just enough for some pocket money.”", "Mikhail whistled, evidently impressed now.", "“Sounds good. Okay, let me hear it out first.”", "He looked behind him and gestured at his comrades to join them as well. And so, three more people settled around the bottle-filled table.", "“Okay, so. What work are we talking about?”", "“Don't be hasty. Enjoy a drink on us.”", "“I respectfully decline. Hell, I ain't touching anything you mixed even if it's free.”", "“Che. It's nothing major, just the monster extermination request from Ramman Village.”", "“Ramman Village?”", "Mikhail immediately looked disappointed.", "“Hey, it really was nothing….”", "He then looked at the two women as if he failed to understand something.", "“Why are you two stepping up for something this small? Isn't this way too over the top?”", "“Argh, why are you talking so much like this? It's simple. You in or out?”", "Maria voiced out her annoyance. Mikhail seemed to be pondering something before casting his gaze to his side. The woman he came in with had her arms crossed and her brows furrowed in a tight knot, making her look a bit temperamental. When she shook her head, her black waterfall-like hair danced about a little. Mikhail spoke up next.", "“Mm, sorry, but it looks like we'll have to pass.”", "“Give it a second thought, okay. The distance is short, right? Think of it as you earning a bit more experience in return for killing a couple of days.”", "“Eiii. I already participated in it once before, you know? Besides, killing a few mutants won't do much at our levels, no?”", "Chohong licked her lower lip. She sneaked a glance at Seol Jihu, and he opened his mouth after getting her signal.", "“That may not strictly be the case this time.”", "“Mm?”", "Mikhail turned towards him. Chohong made the introduction.", "“Sorry about the late intro. This is Seol, the newest Carpe Diem recruit. He’s also the leader of this mission.”", "“Seol?”", "Mikhail stared absentmindedly for a bit before clapping his hands.", "“Ah!! You, from the Arden Valley!! Yeah, you, from the Arden Valley, right?”", "“Oh, you heard about that?”", "“What do you mean, I heard about it? We were actually there! Hyah, I really didn't expect to run into a celebrity today.”", "Mikhail reached out for a handshake, his face brimming with a smile.", "“Hiya. It's really nice to meet you. Really. I'm Mikhailov, a Level 3 Sword Runner. And this here is….”", "“Veronika. Level 3 Sharp Ranger.”", "Veronika finally spoke up. She also seemed a bit more interested now.", "“And this guy over here is Gierszal. He's a Level 3 Guard.”", "The last guy raised his hand briefly, still refraining from saying anything.", "“I still can't forget the sight of you luring away all those bugs, you know? I thought you were a madman at first, but whew, you really surprised me back then.”", "Mikhail lightly chuckled and pulled the chair closer.", "“Okay, so, what did you mean just now? Something about not being the case?”", "Seol Jihu thought about what to say next. Since both Maria and Chohong agreed, then that could only mean this trio had to be rather decently skilled in their professions. In a way, this talk was only possible with those two ladies and their intervention. Now that they got the party started, it was his turn to perform the leader's role.", "“By any chance, do you know of the special characteristics of Ramman Village's request?”", "“Special characteristics? What are those?”", "“First of all, mutants appear.”", "“Yeah, we know that.”", "“Second, different species appear with each new mission issued.”", "“Really? But, they didn't seem all that strong?”", "Mikhail tilted his head.", "“And third, the scale of the extermination team gets larger and larger with the passing of time.”", "“….What do you mean by that?”", "Sensing that something strange was afoot, Mikhail's voice became hushed.", "“Mister Mikhail, you said you participated in this mission before, yes?”", "“Yeah. It was maybe a year or so ago. I can't be 100% sure, but it was around then.”", "“Did you realize that the scale and the quality of the team taking on the mission keeps getting higher every year?”", "Mikhail kept blinking his eyes.", "“Take a look at this.”", "Seol Jihu produced a sheet of paper.", "“Ignore the kingdom's own subjugation forces and take a closer look at the very first mission issued, all the way to the last mission. As you can see, this mission used to be taken up by Level 1s in the beginning, but then Level 2s started taking it, and before long, it was Level 3s. And this time, the request came to Carpe Diem of all teams.”", "Mikhail's eyes narrowed to a slit.", "“Wait a second. That means?”", "“The mutants that will appear this time will be quite a different breed from what you fought the last time.”", "“Hmm…. So, that's how it was. That's why Maria and Chohong is….”", "Mikhail rubbed his chin.", "“You used the records from the city library, so this can't be all fake. Yeah, I guess I get your point. Oh, I see, that's why the reward on offer kept creeping up by a little every year.”", "The other party agreed to his assessment. It was here that Seol Jihu sensed the right time to pull out the final bait had arrived.", "“That's not all. If it's possible, I'm planning to expose this mystery once and for all.”", "At that precise moment, the light in Mikhail's eyes intensified. He too was an Earthling who had spent a fair amount of time in Haramark. So, he knew what Seol Jihu meant by that.", "Solving this mystery was on another scale altogether from simply carrying out the extermination mission. Many, many countless folks failed to solve this mystery, so his fame would get a healthy boost simply from being a part of the team that exposed the truth. In other words, this could easily turn out to be a huge career move. If he said he wasn't tempted, you'd be looking at a liar.", "“Oiii. I don't think you're cracking a joke with these two ladies by your side, but I still gotta ask you. Are you sure about this?”", "“Actually, no. If I'm honest with you, I can't be 100% certain. However, someone very reputable gave me an important piece of the puzzle, you see.”", "“Someone reputable? Who?”", "“Ian Denzel.”", "That landed the final nail.", "“Master Ian did? Really??”", "“You'd find out the truth if you ask him directly, so why would I lie to you?”", "Mikhail let out a heavy gasp and began chewing on his lips. One could see how much of a dilemma he was in. Veronika lightly ribbed on the side, and Gierszal coughed while fidgeting with the cup.", "“There's no need to worry about this. The village is only a half a day's travel away, anyway. At a minimum, you get a little bit of experience points, but if we get really lucky…..”", "Seol Jihu deliberately let his words drift away. He was implying that, if they wanted to hear the rest, they should be more straightforward with their opinions next.", "“So, how about it?”", "He locked his fingers and smiled refreshingly.", "“….Well, I'll be. You sure know how to tantalise your audience, don't you.”", "Mikhail grumbled.", "“If we were only talking about your way with words, then I'd definitely believe that you're a high ranker, dude.”", "In the end, he raised his hands up in surrender.", "“Okay. Let's go somewhere more private and discuss the more… delicate details, shall we?”", "*Early next morning.", "The expedition – no, the extermination team, met at Haramark's southern exit. Seol Jihu and Chohong holding hands arrived first and found the two carriage drivers and two porters on standby there.", "They waited for a little while longer, and soon enough, Maria showed up wearing the same white Priest garb as she wore back in the Neutral Zone. Veronika and Gierszal, led by Mikhail, arrived soon after.", "Four warriors, one Archer, and finally, one Priest. Their average Level was 3.2. Considering that the mission itself was nominally not a tough one, this was a rather good team composition.", "A short while later….", "Two carriages with three members each energetically left the city's southern exit."]}