{"cid": "218", "title": "Chapter 218. Unfulfillable Wish (2)", "content": ["The interior of the golden palace truly boasted the pinnacle of flamboyance. Golden symbols were engraved on a lustrous marble background, and even the windowsills had a gold outline.", "And with all sorts of decorative items placed everywhere, the palace reminded everyone of France’s Palace of Versailles, which was known for its marvelous beauty.", "“I am very pleased that you think so highly of this poor palace.”", "A soprano-tone voice, like that of a skylark, rang out in everyone’s ears, and their eyes naturally headed forward.", "A throne made of gold was standing at the end of the vast hallway, which extended like a corridor. And there was a woman slowly standing up from this throne, looking down amiably at the expedition team.", "The figure looked young and frail, and didn’t seem to even reach 150 centimeters. Her blue hair was slicked back and tied into a bun, emphasizing her small, white face even more.", "Indeed, rather than a woman, it seemed more proper to call her a young lady.", "Clack… clack…", "Seol Jihu snapped out of his daze hearing the clacking of heels. The young lady was walking down the stairs with modest steps, her hands clasped over her bellybutton.", "As she came closer, her attire became easier to see. The top of her clothing was a black, gothic lolita-style dress, which stuck to her body and outlined her alluring curves, and the bottom was a wide, bell-shaped skirt that reached her ankles.", "“Thank you accepting my invitation.”", "After reaching the bottom of the stairs, she lightly held the hem of her skirt up and bowed politely.", "“Welcome to the Pagoda of Dreams, Legitimate Visitors.”", "She scanned the expedition team briefly. Then…", "“And Awaited Experts.”", "She smiled at Seol Jihu and Teresa. Her smile was so captivating that she grabbed everyone’s attention instantly.", "However, Seol Jihu didn’t let his guard down. The young lady’s mouth was curled into a smile, but her clear, ocean-like blue pupils were serene like ice.", "In the first place, Seol Jihu felt a strong sense of incongruity the moment he entered the place. A single young lady was the only one in such a huge palace? He felt like he was dreaming.", "“You’re right. My reception hasn’t been the best, even though such honored guests accepted my invitation. Please forgive this lady’s lack of thought with magnanimity.”", "Seol Jihu was taken aback. He hadn’t said anything, yet the young lady seemed to have read his thoughts.", "Her eyes then gently curled into a crescent shape as she raised both her hands.", "Clap!", "She clapped.", "Tutururu~!", "Seol Jihu almost fell backward in shock. It wasn’t just him, but everyone in the expedition team.", "People filled up the palace instantly. They circled around the expedition team, sang, played music, and threw flower petals into the air.", "“Don’t be so surprised.”", "A muffled giggle rang out.", "“This is the world of my mind.”", "A dreamy voice flowed out rhythmically.", "“Since this is a dream world, everything I wish for comes true.”", "Roselle flicked her hand like the conductor of a symphonic orchestra, and the people disappeared in an instant. The palace regained its serenity.", "“Did you like my welcoming show?”", "She asked, her head slightly tilted.", "Seol Jihu couldn’t say anything, setting aside whether he liked it or not. He had experienced all sorts of things thus far, but this was the first time he was experiencing anything similar to what he was experiencing today.", "“Now.”", "Roselle clapped again, and the scenery changed. The expedition team was now standing in the middle of a beautiful garden.", "A white, round table was placed in front of them, with pretty steaming tea cups placed on top of it.", "“Though it’s a little late, let me introduce myself.”", "The young lady gently placed her hand over her chest.", "“My name is Roselle La Grazia.”", "Seol Jihu barely managed to eke out a few words.", "“The Witch of Dreams…”[1]", "“Yes, I was once called by that insignificant name.”", "Roselle smiled brightly before sitting down on a chair elegantly. She then opened her palm and pointed at the other chairs.", "“Please, sit.”", "Seol Jihu hesitated for a moment, but soon steeled his resolve. The Witch of Dreams was treating them properly both as the master of this place and as the one who had invited them.", "As such, it was only proper that they treat her with the same level of respect as her guests.", "‘Do unto others as they do unto you.’", "“Thank you!”", "Once Seol Jihu sat down, his comrades began to sit one by one. But when everyone sat down, there was one seat left open.", "“Will the lady inside the pendant not sit?”", "Roselle spoke with a dreamy voice.", "[!?]", "‘She knows?’", "Seol Jihu opened his mouth in a fluster.", "“Ah, she’s not good with strangers… she gets a little shy.”", "“Eh? The esteemed daughter of the Rothschear House is… shy?”", "Roselle looked surprised.", "“I see… I was hoping to talk about all sorts of things with her…”", "Just as she reached out to the table with a slightly disappointed look—", "[Did Grandpa come here?]", "Flone hurriedly asked. Roselle didn’t say anything. She only stared at the pendant with a smile on her face.", "[Ah, um…]", "Flone must have made a mistake as she stuttered. She continued hesitantly.", "[Excuse me… I subconsciously blurted out…]", "Flone spoke with an elegant mannerism, which wasn’t like her normal self.", "“No, it’s completely fine.”", "Roselle spoke without losing her smile.", "“Both you and I are already dead. There’s no reason to upkeep customs from when we were alive.”", "[….]", "“Also, I heard that the youngest daughter of the Rothschear House is a pampered tomboy.”", "[!]", "‘Pampered? Tomboy?’", "The pendant shook like a flailing flounder. Roselle stared at it as if it was cute before clearing her throat.", "“To answer your question, yes, the head of the Rothschear House has indeed visited the Pagoda of Dreams. Realizing the greedy emperor was eyeing him, he requested that I hold onto a portion of the Rothschear’s inheritance. Although this happened hundreds of years ago, I remember it clearly.”", "Seol Jihu didn’t miss Roselle’s eyebrows turning sharp when she mentioned the emperor.", "“To be honest, I wasn’t a huge fan of the Spear of the Empire either, but since I hated the emperor more, I accepted the Rothschear Head’s request.”", "“Then—”", "“Yes, I am still safekeeping the inheritance.”", "Roselle answered as if she knew what Seol Jihu would ask. Then, she paused in the middle of elegantly raising her teacup. An intrigued smile bloomed on her face.", "Roselle opened her mouth.", "“Ah, fuck.”", "Seol Jihu doubted his ears.", "“This is getting boring. Just give us our shit and let us go. Why did this bitch even invite us in the first place?”", "Roselle spoke monotonously.", "“Hiiiiiik!?”", "Maria screamed.", "Seol Jihu exclaimed inwardly.", "‘No way.’", "Maria slammed her head down and pleaded.", "“I’m sorry! Please don’t kill me!”", "“No.”", "Roselle covered her mouth, smiled, then shook her head.", "“I would have picked fault with it if you said it out loud, but you only thought it. It’s my fault for reading your mind without permission. It’s a bad habit of mine, you see.”", "Maria stealthily raised her head.", "“I can give you the Rothschear House’s inheritance whenever. If you’d like, I can give it to you this instant.”", "Roselle took a sip of her tea, then carefully put the teacup down.", "“But I would be extremely grateful if you all would listen to why I invited you.”", "Seol Jihu opened his mouth.", "“Of course. By the way…”", "“Yes, as I said before, I am someone who died hundreds of years ago. My body most likely turned to ash and scattered away, so not a single piece of it should remain in the world. The person you are talking to now is—”", "Seol Jihu closed his mouth, not being able to finish saying ‘You said you died in the past.’", "“An existence that is a mere remnant thought.”", "For some reason, this woman…", "“…is full of herself. It’s something I heard a lot when I was alive because of my habit of reading other people’s thoughts. Please excuse my behavior.”", "“…Ah, yes.”", "“You don’t have to worry about it now. I can hold myself back if it’s just for a little bit.”", "Seol Jihu let out a dry cough.", "“When I looked at the historical records, everything regarding the Pagoda of Infection, or rather Dreams, was erased.”", "“Yes, it was a rather effective measure.”", "Roselle replied firmly.", "“I dearly wished that the dream infection would reach the emperor, but I never imagined he would respond so strongly as soon as it began to spread.”", "Roselle then added, “He had many enemies, so he was always in a hurry to protect himself.”", "“There wasn’t much I could do back then. I formed a powerful curse around the pagoda so no one could approach it, but I also couldn’t step a foot outside of it.”", "Seol Jihu examined Roselle closely. This witch had once planned to overthrow the Empire. But setting aside how incredible she was, he questioned her methods. Strictly speaking, the Pagoda of Dreams’ infection would have negatively affected the Empire’s innocent civilians.", "“You’re right. Because of my pagoda, countless good, law-abiding citizens died.”", "Roselle admitted without reserve.", "“But I don’t regret it. Because many followers of the emperor also died. And those people all deserved death.”", "Seol Jihu became a bit afraid, hearing how she made it seem like it wasn’t a big deal. He interlocked his fingers and asked.", "“I’d like to know why you went so far.”", "“Isn’t that obvious?”", "Roselle spoke in a singing tone.", "“To eliminate the war-crazed emperor…”", "Her tiny shoulders trembled faintly as she clutched her hands.", "“And the tyrannous followers, who support him in his madness…!”", "Seol Jihu instinctively shrunk back as chills suddenly ran down his spine and goosebumps spread around his entire body.", "A bitter coldness shot out of Roselle’s body like thorns. It was so cold that Seol Jihu imagined himself being in a large -40 degrees freezer. That was how enraged Roselle was.", "‘What power…’", "The energy she was giving off far surpassed that of Flone. Seol Jihu finally caught a glimpse of how powerful this witch was. She might be evenly matched even against a Parasite Army Commander.", "Roselle took a deep breath, then soothed her energy.", "“Excuse me.”", "Gasps flowed out from all directions.", "“Anyway, after this decision by the emperor, I made every effort to strengthen the curse. But there was an undeniable limit with a mortal body. Even after painstaking effort, all I obtained was the qualification to pursue the origin…”", "Roselle blurred the end of her speech, trailing into a hard-to-understand concept.", "“There is one reason why I invited you all.”", "After a brief moment of silence, Roselle took a sip of tea and spoke again.", "“Although the curse’s power has weakened immensely due to the passage of time, I spent my lifetime creating it. Since two of you were able to escape this curse through your own power, you must have strong willpower.”", "‘That’s not really it.’", "Seol Jihu scratched his head.", "“I will be open and honest. I am looking for someone who can fulfill the wish I failed to achieve in my lifetime.”", "Seol Jihu furrowed his brows. Roselle’s wish had to be the collapse of the Empire.", "“I know. The tyrannous emperor and his followers must have all died, and many things must have changed from the passage of time. Still— my desire to get revenge has not changed nor has it diminished. Going back to its founding, the Empire took root on a rotten ground, so it ought to be overthrown. Even if hundreds of years have passed since then.”", "She must have misunderstood Seol Jihu’s expression.", "“Of course, I don’t plan to force this task onto you.”", "And she really must have stopped reading others’ minds.", "“And I am not requesting that you do something about it either.”", "Or perhaps she didn’t know anything about the outside situation due to being stuck in this place.", "“But if you do accept my request, I will also help you to the best of my abilities.”", "No matter the case, she definitely had a huge misunderstanding.", "“This Pagoda of Dreams also has my inheritance. Its scale and importance are incomparable to that of the Rothschear House.”", "Roselle spoke proudly as she strutted out her small chest.", "Seol Jihu blinked.", "‘This person isn’t normal either, huh.’", "Resentment that remains even after hundreds of years… It was hard to understand where her thirst for revenge was coming from. Although it was only a guess, it didn’t seem like Roselle wanted to topple the Empire purely because of a war.", "‘There’s another reason.’", "There had to be a more certain reason that she hated the Empire’s origin so much.", "In any case, Seol Jihu decided that it wasn’t something the expedition team should be involved in. No, even if he wanted to help her out, her wish was no longer fulfillable.", "If there was one thing he could tell her, though—", "That was to tell an important truth to the young lady, who had been living in a dream for hundreds of years.", "Roselle asked, her pupils sparkling.", "“So? What do you think? Ah, you can take your time before answering.”", "Next, she raised her ⅓-full teacup.", "“….”", "In a way, what Seol Jihu was about to tell her was cruel. So, he hesitated a little bit before speaking.", "“It may be presumptuous of me, but there is something I would like to tell you before saying yes or no.”", "Roselle nodded her head, gesturing at him to go on.", "“The Empire…”", "With a short breath, Seol Jihu spoke firmly.", "“Has already fallen.”", "“Pfft!”", "Tea gushed out of her small, cherry-like lips, splattering everywhere.", "Roselle went stiff and stood in place holding the teacup as if time had frozen for her. The only thing that showed she was still conscious was her busily blinking eyes.", "Seol Jihu opened his mouth and put the nail in the coffin.", "“It collapsed more than 10 years ago. Its people were killed regardless of their social status, and not a single tuft of grass remains on the Empire’s territory.”", "Slowly, very slowly, Roselle raised her head.", "“….”", "Silence descended once again. The fall of the Empire, which stood strong at the peak of Paradise for a long time, must have come as a huge shock because she only stared blankly without even thinking to put down her teacup.", "“Ah….”", "Roselle’s tightly shut mouth opened slightly.", "“No.”", "And Seol Jihu…", "“Um…”", "Was able to witness…", "“…Excuse me???”", "Her ever-smiling face crumble down in an instant.", "1. This title is slightly different from what the mechanical voice said in the last chapter. Last one specifically said “The Dreaming Witch” while this one says “The Witch of Dreams”. ", "Name changed to Roselle La Grazia (Italian pronunciation, kind of like Cinzia's name)."]}