{"cid": "446", "title": "Chapter 446. While He is Gone (3)", "content": ["Over a dozen people were sitting in Valhalla’s grand conference room. Everyone who was related to Seol Jihu had come together to discuss plans for his revival.", "“There is something I need to say before this meeting begins.”", "Philip Muller, who was in charge of leading the meeting, spoke up.", "“As I’m sure you all know, contribution points can only be used individually, unless it’s for the purchase of stamps or the custody of the Neutral Zone.”", "Getting ‘carried’ or helping someone get carried wasn’t easy in Paradise. It was because Earthlings couldn’t give and receive contribution points.", "Furthermore, because the Seven Sins had strict rules in place regarding the distribution of contribution points, there was a limit to helping someone amass points.", "For example, even if Person A put a monster on the brink of death and had Person B finish it off, Person B would only get a limited amount of contribution points.", "It might be possible to borrow the power of an organization to create a situation where an individual could amass points, but there was a limit to how far one could go.", "This was also the main reason Sinyoung gave up on reviving Eun Yuri a long time ago.", "“In addition, each Earthling only has one chance to be revived in Paradise. There can be no exception.”", "Philip Muller emphasized this last point. If they somehow managed to revive Seol Jihu with a Divine Wish and he died again, then they would really be left without an option.", "“We have to understand that the Parasite Queen’s goal had been Seol Jihu’s elimination all along. It wasn’t the stele of the Imperial Oath.”", "Everyone nodded in agreement at Philip Muller’s explanation.", "“There is no way that the Parasite Queen doesn’t know about the Earthlings’ revival setting. She even has Sung Shihyun as one of her trusted aides.”", "Philip Muller continued.", "“Sung Shihyun was a Unique Ranker, a long-time veteran of Paradise, and the Executor of Gula. He must know about the revival setting better than anyone else.”", "Meaning, the Parasite Queen wouldn’t have stopped at merely killing Seol Jihu.", "“What’s important is that we don’t know the exact details of Seol Jihu’s death.”", "Philip Muller spoke calmly.", "“The witch called Roselle said she watched over the situation, but…”", "“It was only to a certain degree.”", "“We need to know what that degree exactly is.”", "“Teacher said she’s not sure.”", "Eun Yuri spoke up at Philip Muller’s request.", "“She can leave a mark of mana on her target to feel and perceive their surroundings, but it’s only a feeling of what’s happening on the outside. For example, feeling intense energy from someone or sensing unique bloodline mana.”", "Meaning, Roselle felt the raging storm of energy from when Seol Jihu died, but she did not comprehend what exactly was happening inside Seol Jihu’s body.", "“We’re just going to use her account of the incident as a reference. We won’t rely on it.”", "Philip Muller spoke firmly.", "“To be clear, we only have one chance. So I won’t accept any suggestions that banks on a best-case scenario or a maybe. I will only accept ideas that have a 100 percent chance of success that take the worst-case scenario into account.”", "With that, he scanned the room again.", "“…Let’s begin.”", "Only after confirming that there was no disagreement did he start the meeting.", "“First, we need a Divine Wish to let Seol Jihu regain his memories and re-enter Paradise.”", "Everyone agreed as they all thought the same thing.", "“The problem comes afterward.”", "Philip Muller smacked his lips.", "“Normally, a single Divine Wish is enough to revive someone to a functional state…”", "But it seemed that wouldn’t be the case this time judging by what Eun Yuri said.", "The Parasite Queen seemed to have done something to Seol Jihu, and because Seol Jihu also did something to counteract it, things got even more complicated.", "“Can you explain the situation from back then again? After Seol Jihu’s death was confirmed, I mean.”", "Eun Yuri nodded and looked up at the ceiling.", "“The Parasite Queen reached her hand out toward Jihu Oppa… and a cluster of light was supposedly put into his body. A terrifying energy raged inside him afterward, putting Oppa in agony….”", "Eun Yuri dropped her head and lowered her eyes.", "“Teacher said she never felt such powerful energy before. She guessed that it was the Parasite Queen’s divinity.”", "“Because Representative Seol has Temperance’s divinity and the rest of the Army Commanders are alive?”", "“Yes.”", "“If your teacher’s theory is correct, then that process must have been the Parasite Queen’s ploy to prevent Seol Jihu’s revival….”", "“Teacher and I are also in agreement. The Parasite Queen devoured Paradise’s Chief Deity, who was ranked above the Seven Sins, and there is also her original level of divinity to take into account as well. If Oppa died in that state… having an infinite number of Divine Wishes likely wouldn’t have been enough.”", "Philip Muller closed his eyes at Eun Yuri’s calm explanation. The saving grace was that the situation did not end there.", "“You said Seol Jihu did something after he escaped, correct?”", "“Yes, he used the Harmonia Magic Square.”", "A few people’s faces darkened at Eun Yuri’s explanation. They remembered how Jang Maldong said Seol Jihu must never use that item.", "Philip Muller rubbed his chin.", "“I do have my own opinion regarding this… but what does that witch think?”", "“I assume your opinion matches that of Teacher’s. The Harmonia Magic Square has the energy of Absolute Evil. It is an artificial divinity created by mixing the essence of the Seven Sins. Oppa must have realized the Parasite Queen’s goal and used it as a final resort.”", "“And?”", "“Teacher said that the Parasite Queen’s divinity and the Seven Sins’ divinity fought fiercely and ultimately neutralized each other. Apparently, the process was so intense that a crazy amount of energy was emitted outside….”", "“There’s one thing I don’t understand.”", "A sharp glint flashed in Philip Muller’s eyes.", "“Even if the two energies were polar opposites of each other, the Harmonia Magic Square should have tried to force them to co-exist, no? Of course, if that actually happened, that would have only helped the Parasite Queen’s goal.”", "“About that… I’m not sure either.”", "Eun Yuri shook her head.", "“Teacher said she felt a powerful reverse flow on top of the reverse flow that was already present….”", "Philip Muller’s eyes narrowed.", "“That’s a bit strange. Are you positive?”", "“Teacher said she could guarantee that there was another reverse flow energy. She said she didn’t know the principle behind it, though.”", "“Alright, let’s just say that is the case. Then did the two energies neutralize each other completely? What I mean is, is there any chance that some of it was left over?”", "“I’m not sure.”", "“What about the magic square that should have taken root inside his body? Do we know how it will affect him after he revives?”", "“No, that’s a mystery as well.”", "Eun Yuri shook her head once again.", "Philip Muller was about to ask again but swallowed his words. There was no meaning to it.", "Then again, the effect of two rampaging divine energies was something beyond human understanding.", "‘Son of a bitch….’", "Philip Muller cursed inwardly.", "The Parasite Queen’s divinity, the essence of the Seven Sins, a reverse flow of a reverse flow…", "He couldn’t begin to imagine just how much of a mess these elements must have made to the already damaged body of Seol Jihu.", "This was only the surface as well. There was also the possibility that his mana was reversed, or his body was contaminated.", "“Haa…”", "Philip Muller let out a sigh as the situation only got more complicated the deeper he delved into it.", "“So… just one Divine Wish won’t be enough?”", "When the two Magicians fell silent, Chohong carefully asked.", "“Yes. Even if we manage to revive him, it is likely that he won’t even be able to move, much less battle.”", "Eun Yuri spoke in a subdued voice.", "“His body might even explode the moment he tries to use mana….”", "She then did a double-take and blinked.", "“Ah, sorry.”", "“Sorry about what?”", "When Chohong asked, Eun Yuri glanced at Philip Muller.", "“I was supposed to consider the worst-case scenario… but I ended up talking about the best-case scenario….”", "“…What?”", "Chohong’s eyes widened. It wasn’t just her. Everyone’s faces froze up.", "That just now wasn’t the worst-case scenario, but the best?", "“T-Then in the worst-case scenario….”", "Yi Seol-Ah asked with a trembling voice.", "“There’s a chance….”", "Eun Yuri dropped her head.", "“That he might die as soon as he’s revived….”", "Gasps rang out from the surroundings. Chohong looked like she was having a hard time believing it, but she didn’t say anything out loud. It was because she remembered the horrific cracks on Seol Jihu’s corpse.", "“Even if he doesn’t die… he might fall into a coma immediately.”", "Chohong looked back at Philip Muller at a loss for words.", "“It will be meaningless if we revive him in a half-dead state. We need to make sure he at least has his consciousness and can move his body.”", "Philip Muller sounded somber.", "After a moment of silence…", "“…Two.”", "Philip Muller announced with a deep sigh.", "“We’ll need two Divine Wishes at the very least. One to revive him, and one to heal his body. This is also the minimum amount.”", "“Two….”", "Yi Seol-Ah frowned.", "“H-How about this? First, we revive him, and then we pour healing spells on him. Yuhui Unni can hold a Ceremony if she has to.”", "“No.”", "Philip Muller rejected the idea right away.", "“The level of injury he suffered this time is on a completely different level than the one he suffered during the Arden Valley War. Back then, Seol Jihu only reversed the flow of his own energy.”", "Philip Muller remembered Seol Jihu’s state vividly as he had personally examined him.", "“The Star of Lust held a Ceremony back then, and Master Jang and the Sacred Empress were both attending to him constantly. Even then, he only managed to hold out until the Federation arrived with the Elixeer.”", "“But…”", "“The problem this time is divinity. No matter how powerful the Star of Lust is, there is a limit to what she can do as a mere human.”", "Yi Seol-Ah clenched her teeth at Philip Muller’s logical explanation.", "“But… Orabeo-nim walked in that state for a while. Doesn’t that mean he—”", "“As I said before, Oppa’s death was confirmed before he escaped from the Parasites.”", "At that moment, Eun Yuri sharply interrupted Yi Seol-Ah.", "“Him not recovering any mana after he used the remainder of his energy is proof of that.”", "Yi Seol-Ah was at a loss for words.", "“As for how he got back up and walked for some time… Teacher said she couldn’t understand it either. She said it felt like she was looking at a different person.”", "“….”", "“There’s no way to tell whether it was from the influence of the raging divinity inside him or superhuman perseverance…. But what we can be sure of is that Oppa ignited his lifeforce when he faced the combined attack of the Army Commanders, and that this lifeforce flickered off when he was stuck in the pit.”", "Yi Seol-Ah’s lips trembled at the cold voice.", "“…Humans’ willpower indeed works in mysterious ways. I hear that there is a term called fighting spirit in Asian culture too.”", "Philip Muller muttered quietly.", "“There’s nothing more to say. Let’s say we only use a single Divine Wish to revive Seol jihu. Can you guarantee that he will be conscious and be able to move his body for a while? Even so, can you guarantee he will be able to hold on with just his willpower alone?”", "Yi Seol-Ah could only shake her head as Philip Muller asked if she could take responsibility.", "“…No.”", "In the end, she began to tear up.", "“It’s not that I don’t understand your sentiment…”", "Philip Muller smacked his lips.", "“But one chance is all we’ve got. Just one…. We can’t gamble with Seol Jihu’s life. If anything, for the penalty he will have to face on Earth.”", "Everything he said was right.", "“I won’t say more. We somehow need to acquire two Divine Wishes.”", "However, Philip Muller was at a loss for what to do. Acquiring one Divine Wish was difficult enough. Two seemed almost impossible.", "Frankly speaking, there wasn’t a single Earthling who could use a Divine Wish. Not only Philip Muller, but Baek Haeju and Seo Yuhui had also visited the temple to check.", "The answer they received from the Seven Sins was that they did not have enough contribution points to use a Divine Wish.", "“Now then….”", "Philip Muller discussed with everyone to solve this problem.", "Since no one had enough contribution points to use a Divine Wish at the moment, they brainstormed methods to acquire contribution points in the quickest way possible.", "As this was not a problem where the solution could be reached within a single day, they made slow progress, and the meeting went on for a few days.", "However, time did not wait for them. The situation everyone feared came true. It was a problem bigger than Seol Jihu’s revival. To be more precise, the Parasite Queen was not so kind as to wait for them to concoct a plan.", "The Parasites invaded humanity from two directions.", "With four Army Commanders leading the way.", "*", "News of the Parasites’ attack quickly spread throughout the Federation and humanity. At the same time, the meeting in Valhalla came to an end. Since they had to prepare for war, they no longer had time to sit around and rack their brains.", "That said, they came up with a temporary plan — to help one person gain as many contribution points as possible from the war.", "It really wasn’t much of a plan, but they didn’t have any other option.", "When the last meeting ended, Eun Yuri suddenly stopped while climbing the stairs to her room. Last night, Roselle had summoned her three disciples and made an important announcement.", "[Yuri will be my successor.]", "[I know all three of you have worked hard, so I wanted to watch over you all for a little while longer… but it seems the situation won’t allow it.]", "Roselle had finally decided on a successor to carry on the ‘Eternal Light of Wisdom’. Eun Yuri would have jumped with joy if it was at any other time, but with the current situation being what it was, she couldn’t be purely happy.", "In fact, she felt a tremendous weight on her shoulders that she did not feel before. It was because she knew what Roselle was expecting of her as her successor.", "Because of it, Eun Yuri’s feet took her to a different place. She stopped, not in front of her room, but in front of an office.", "It was the place Seol Jihu spent most of his time when he was in Valhalla.", "“Whew.”", "Eun Yuri went into the room, closed the door behind her, and sighed quietly.", "She then moved and stood in front of the office desk.", "She was the only one inside the room. The man who usually sat behind the desk was naturally not there.", "[Uh… I’m really okay….]", "Looking at the desk…", "[I see, I see. This feels much better. Thank you.]", "She recalled the time she helped Seol Jihu stand after he returned drunk from the pub.", "[I thought I’d be fine….]", "After Seol Jihu disappeared, yet another danger had descended upon them. Humanity now had to overcome this danger.", "But how?", "There were things Seol Jihu left behind—written oaths from influential organizations of each city, an alliance with the Federation, and the fortification of all cities, including Eva….", "But to be frank, this wasn’t enough. They needed something else.", "Just like how a certain person defended a valley fortress by putting himself out as bait.", "Just like how a certain person came up with a way to teleport into the laboratory and stopped the Parasites’ plan to mass-produce Mutant Orcs.", "Just like how a certain person killed Undying Diligence and sent the Parasites retreating.", "Just like how a certain person saved the Spirit Realm and protected Tigol Fortress.", "They needed a new way to break through this danger.", "Loneliness swept over Eun Yuri as she looked at the empty desk.", "She felt like she finally began to understand.", "“….”", "No, to be honest, she did not understand yet.", "[I thought I could do it somehow…]", "Eun Yuri did not dare to guess…", "[Sometimes I get so tired…]", "How Seol Jihu must have shouldered such a heavy burden all this time.", "“Oppa….”", "Looking at the empty desk and chair reflecting the light of the sun…", "“What….”", "Eun Yuri murmured in a daze.", "“What are we supposed to do…?”"]}