{"cid": "105", "title": "Chapter 105. The Village Head’s Gift (2)", "content": ["Hao Win!", "Seol Jihu couldn’t yell, given the intense atmosphere, but that was a name he couldn’t ignore.", "‘Similar situation?’", "From the looks of it, ‘Umi Tsubame’ seemed to be a team under an organization named ‘Japan Business Federation’. Kazuki seemed to be ostracized for going against the organization's orders, but what was this about Hao Win being in a similar situation…?", "“Are those guys still having internal conflicts?”", "Jang Maldong didn’t hide his feeling of discontent. Asking for cooperation in the middle of internal conflicts? It was up for interpretation, but it sure sounded like they were asking Carpe Diem to step their feet in the mud.", "However, Kazuki shook his head.", "“No, things have died down after a huge incident. There is still some veiled enmity and strife for political power… but it’s more of a rite of passage than a conflict.”", "Jang Maldong’s sharp eyes softened slightly. Kazuki continued.", "“As I’m sure you know, individuals who join an organization seek to be promoted through their activities in Paradise. The members of the Triads are good examples of this.”", "“True, they do encourage their members to actively participate.”", "“Yes, the Triads didn’t directly translate their internal hierarchy from Earth to Paradise. Instead, they chose to abolish some of the levels of hierarchy. Of course, they still included their core executives, but it was still an innovative idea at the time.”", "“Yes, it wasn’t bad. After all, that is what enabled them to grab hold of powerful authority in Paradise.’", "Difficult talks went back and forth.", "Chohong was yawning as if she was extremely bored, and Hugo was just standing there, completely zoned out. It really looked like he wasn’t thinking about anything.", "“But after their forces stabilized in Paradise, internal problems began to arise, eventually causing a collapse in their hierarchy.”", "“That is often the case with large organizations. The culture of the Triads organization was overly competitive. Their innovative idea of getting rid of the existing hierarchy simply came back to bite them. It must have been bad since I heard the news of assassinations even on Earth….”", "Seol Jihu listened to their conversation attentively. It was hard for him to understand everything they were saying, but he tried his best, remembering Jang Maldong’s words to ‘learn to read the political atmosphere’.", "Scientia potentia est. Knowledge is power.", "Even someone with great physical prowess would easily be taken advantage of if they were stupid.", "As Seol Jihu planned to form his own team in the future, he felt the need to learn to understand these kind of things, so as to be able to survive in Paradise. Of course, he was also curious since the story involved Hao Win.", "“The leading executives of the Triads knew about this problem, but they failed to control the discord. And because of the prolonged internal strife, they even had to give up the initiative to Sicilia.”", "“And the special countermeasure they came up with is this man named Hao Win?”", "“Yes.”", "“If the Triads’ culture hasn’t changed, he will just be treated as another amateur who got in through connections.”", "Kazuki slowly nodded.", "“But things have gotten better. After taking that huge blow from Sicilia, voices to change their culture have gotten louder. All members of the Triads want to recover their past glory. As long as Hao Win proves that he is capable, reuniting the organization shouldn’t be impossible.”", "“Hm…. What an interesting brat! So he wants to participate in the Banquet and prove his ability?”", "“That’s why I said this matter was similar to a rite of passage.”", "“That man named Hao Win. What do you think of him?”", "Kazuki put on an uncertain look, “I’m not sure, but he seemed like a cheerful guy on the surface.”", "Seol Jihu agreed with Kazuki’s evaluation and snickered to himself quietly. After that, a few more words were exchanged before silence descended. Then, Jang Maldong opened his mouth after a long deliberation.", "“As you already know, we aren’t in the best situation right now. Can you give us some time to think about it?”", "“Of course. We still have more than enough time on our hands after all.”", "“We’ll come to a decision by tomorrow. Anyways…,” Jang Maldong grinned, seeing Kazuki getting up from the couch. “Looks like you’re starting to think about going independent.”", "Kazuki shut his mouth for a moment, then heaved out a short sigh.", "“It’s just… difficult to go about things alone. Since I have the opportunity, I decided to grab it.”", "“The Federation Head indeed isn’t an easy opponent.”", "“I believe I’ve already done what was expected of me.”", "With that, Kazuki bowed.", "*", "Once Ayase Kazuki left, Carpe Diem’s office got a bit noisy to talk about their participation in the Banquet.", "“We should go! It’s an opportunity that comes around once every two years! I’m going for sure.” Hugo raised his voice, saying they should obviously participate.", "“I don’t know…. We only have three people. Let’s just look for an Archer.” But Chohong looked bothered by the whole thing and argued against Hugo.", "“Fuck, what, you don’t care anymore now that you’re a High Ranker?”", "“Hmph, you going won’t change a thing. I know you’re in a hurry, but do you really think you’ll make it to Stage 3?”", "Chohong and Hugo began to bicker. Jang Maldong stared at them with disappointment before turning around while massaging his temples. Then, he found the young man deep in thought and stared at him fixedly.", "‘Oh right….’", "He remembered Chohong hinting to make Seol Jihu the new leader. Although he planned to appoint the new Archer he would bring in as the leader, there was no reason Seol Jihu couldn’t be the leader either.", "He knew that it was better for someone established in the team to become the leader than someone completely new. Wanting to test Seol Jihu, Jang Maldong threw him a question.", "“What do you think?”", "“…What? Ah, I really don’t know….”", "Seol Jihu jumped in surprise at the sudden question and then shook his head.", "“It’s fine, so tell me.”", "When Jang Maldong pressed him, he took a moment to collect his thoughts, then spoke, “Considering Carpe Diem’s current position, I think it will be better to participate.”", "“Right?”", "Hugo screamed, thinking Seol Jihu was taking his side. Jang Maldong swung his cane and silenced the bickering duo before collecting his roughened breath and sitting back down on the couch.", "“Tell me the reason.”", "“As you know, Carpe Diem’s stock has significantly reduced in value.”", "“Stock?”", "“Yes, it lost the symbol of its team, after all.”", "“Well… yes. But by that logic, isn’t it important to absorb new blood into the team as quickly as possible?”", "“Blood can’t be absorbed unconditionally. I don’t think Carpe Diem is a type-O. In fact, I’d say it’s an RH-negative.”", "His analogy piqued Jang Maldong’s interest.", "“The problem here is, whether an Archer of Dylan’s caliber would be willing to enter this difficult-to-handle team.”", "“So you’re saying a skilled Archer wouldn’t want to enter the current Carpe Diem?”", "“I wouldn’t go that far, but he would certainly weigh his options.”", "“And you’re suggesting we come up with something to tip the scale in our favor.”", "Seol Jihu nodded.", "“Yes. From what I heard, this Banquet seems to be a special event that draws in attention from all of Paradise. I think this would be an excellent opportunity to prove our worth.”", "Seol Jihu further added that their success would have a synergistic effect of bolstering people’s expectations in them due to Jang Maldong’s temporary return and news of Chohong becoming a High Ranker.", "“Well, that’s just what I think from the perspective of our team.”", "Seeing the young man laugh awkwardly, Jang Maldong rubbed his chin.", "‘Hm….’", "His anger instantly subsided and a sense of relief rushed in. Chohong and Hugo had been troubling him, but he suddenly felt relieved.", "‘Dylan, you always had good eyes for people.’", "When he was looking for an Archer to join Carpe Diem, it seemed that he didn’t need to worry about finding one with qualities of a leader.", "“Chohong,” Jang Maldong smiled, “Go visit Umi Tsubame.”", "*", "Carpe Diem’s participation in the Banquet was decided.", "The answer was ‘yes’. After accepting Kazuki’s offer of a three-way team cooperation, Jang Maldong immediately began his preparation. Although they still had 6 weeks left until the start of the Banquet, the word ‘procrastination’ wasn’t in his dictionary.", "“You can say that the Banquet is part of an ancient inheritance.”", "Seol Jihu tilted his head at Jang Maldong’s explanation, “I thought it was either a dungeon or a ruin.”", "“You’re right and wrong at the same time,” Jang Maldong slowly continued.", "“Some say it’s a stage created by a god from the era of the ancient Empire to carry out some sort of a test. Others say it is a game created by a grand magician for his amusement. Some even call it a lair that the extinct dragons created as a dummy.”", "“How mysterious.”", "“If you want to know more, ask Ian. He likes things like this, so he’ll have more detailed information. Now, what we do know for sure is this…” Jang Maldong snatched the cane he’d been waving around in the air.", "“Entrances leading to an unknown place open biannually all across Paradise.”", "“That’s it?”", "“We also know that this place is separated into three stages, but what’s inside changes every year.”", "Seol Jihu swallowed his saliva. He thought that they would just have to fight some monsters and look for treasures, but the scale of the event was far bigger than what he’d imagined.", "Still, he couldn’t figure out why everyone was so worked up about this mysterious festival. It truly was an enigma.", "“To be honest..” The end of the cane pointed at Seol Jihu. “It’s way too early for you to participate in the Banquet.”", "“…I thought so.”", "“If you look at the distribution of participants, a vast majority of them are Level 4s. Almost everyone who is remotely decent will flock to this event. To be frank, if you’re alone, you’ll find it difficult to clear even the first stage.”", "Seol Jihu wasn’t angry, but he couldn’t help but feel a little bitter.", "“But since every participant is part of a team, there are some way outs.”", "Seol Jihu was afraid Jang Maldong would prohibit him from participating, so his eyes sparkled when he heard this.", "“You mean I can go?”", "“Yes, but under two conditions.”", "“Conditions…?”", "“Yep. First, you will have to take on the role of an Archer in this team.”", "Seol Jihu was dumbstruck by this unexpected condition.", "“I, I can’t. I don’t even know how to use a bow.”", "“You can’t shoot an arrow, but you have that, don’t you?”", "Remembering Mana Spear, Seol Jihu furrowed his brows. Jang Maldong continued without batting an eye.", "“Second, you’ll be required to quit and exit the Banquet at stage 2. Well, stage 3 isn’t a place you can go just because you want to.”", "Jang Maldong found Seol Jihu standing at a loss for words and stopped. Then, he heaved out a light sigh.", "“In the first place, it doesn’t make sense for a Level 2 to participate in the Banquet.”", "“I’m Level 3 now.”", "When Seol Jihu muttered quietly, Jang Maldong blinked his eyes. Chohong and Hugo, who were prowling about on the side, also paused their movements. But because they knew he had participated in the rescue mission, they weren’t too surprised.", "“Level 3? Really?”", "“Yes, I can show you if you’d like.”", "“Mm, that’s truly an incredible speed…. But still, my answer is no.”", "Seol Jihu’s eyes widened. Jang Maldong snorted.", "“Don’t make that face.”", "“But—”", "“Do you think the Banquet is a joke?”", "Jang Maldong’s voice carried a hint of annoyance. Having detected danger, Chohong and Hugo quickly signaled each other to get ready to bail.", "“Do you think you’re going on an expedition where you scurry onward and beat up some monsters? Even Dylan and Kazuki! Both of them participated in the Banquet twice and neither of them managed to step a foot inside stage 3!”", "“S-Sir.”", "“I’m not done. Listen. I’m not trying to get you to change your class. If the enemy breaks through the vanguard of the team, then you can act as a Warrior. Otherwise, you’ll be an Archer.”", "“….”", "“Just so you don’t misunderstand, I’m not treating you like you’re a burden. And I’m not allowing you to participate because I don’t have a choice. I would have held you back if I didn’t think you’d be useful.”", "Taking Seol Jihu’s silence as a sign of acknowledgment, Jang Maldong cleared his throat before continuing.", "“If you want to participate in the Banquet, you have to do it as an Archer. Spend the next six weeks focusing on training Mana Spear and you’ll be useful to the team. I also heard that you have an item called Festina Earring, so….”", "Just as Chohong and Hugo breathed a sigh of relief…", "“No.” Seol Jihu dropped a bombshell.", "“?”", "For a moment, Jang Maldong wasn’t sure he heard correct and blinked his eyes repeatedly. Chohong and Hugo jumped in disbelief and waved their hands in fear for what was to come, but Seol Jihu wasn’t looking at them.", "“You don’t want to go?”", "“I do, but—”", "“But? But what?”", "“What you’re saying is that I should just throw Mana Spears all the while being protected by the team.”", "“And what’s wrong with that?”", "Jang Maldong looked genuinely confused.", "“Do you think a spearman only swings his spear around? Spear throwing is a bonafide spear technique!!”", "“….”", "“What’s gotten into you all of a sudden? Listen, brat! I can’t let you take on such a dangerous position because the Banquet is too full of uncertainties!”", "“My answer is the same. I’m not an Archer.”", "Seol Jihu remained stubborn. Not expecting Seol Jihu to protest so adamantly, the hair on Jang Maldong’s aged face stood up with anger.", "“You…!”", "When he gripped his wooden cane, Chohong quickly ran for her life. However, Seol Jihu looked slightly angry as well. Staring at the old man’s furious gaze, he spoke clearly.", "“Let me participate as a Warrior.”", "“You little…!”", "When Jang Maldong was about to blow up….", "“I don’t want to run away.”", "Seol Jihu stared at him with a sincere look.", "“At Arden Valley. Inside the laboratory and outside. Even when I was escaping the Parasites’ blockade. All I’ve done is run away.”", "Jang Maldong became speechless and sat there with his mouth agape.", "“You—”", "Looking back, that was indeed true. Seol Jihu’s life in Paradise had so far been a series of escapes. Every time he encountered a serious incident, he ran away, risking his life to escape from his enemies’ pursuit.", "“I don’t want to do that anymore.”", "Most importantly, the time he fell down to the Forest of Denial was deeply engraved in his mind. Even when his thigh was pierced by the enemy, all he did was pray.", "For somebody to help him… For somebody to save his life…", "He remembered…", "“Sir.”", "…Just how pitiful he was…", "“I…”", "…And how much he despaired.", "He never wanted to taste that feeling of helplessness again.", "“I’m not training so I can run away.”", "Jang Maldong’s raised eyebrows twitched.", "“I want to fight proudly as a Warrior.”", "His eyes gazed at the young man who was bowing down to his waist.", "“…Please reconsider.”", "Hearing the young man’s earnest and desperate plea, Jang Maldong took in a deep breath. His gentle eyes gleamed with piercing light.", "“You… arrogant fool…. A weakling who’s only full of greed…!”", "His restrained voice could only be described as hoarse. After a minute that seemed like an hour….", "“…Keuk!”", "Drrrk! The sound of a chair being dragged rang out. Seol Jihu, who was expecting to get beaten, raised his head in shock.", "“You cocky brat! I went out of my way to think what’s best for you, but what? You say you’re not training so you can run away? You want to fight proudly as a Warrior!?”", "He could see Jang Maldong gritting his teeth in fury.", "“Fiiiine. Since you can’t understand it with your brain, I’ll let your body figure it out.”", "“S-Sir.”", "“And sure, if that’s what you so desperately want, I’ll allow it. That is, as long as you can follow my training regime.”", "Was this what the growling of an apex predator sounded like? Jang Maldong blurted out in a voice as heated as an erupting volcano. Then, he struck the floor hard with his cane.", "“HUGO!”", "Hugo was stealthily making his way out when he halted his steps at Jang Maldong’s sudden roar.", "“Pack your bags!”", "“B-Bags!? W-Why?”", "“We’re going to the Huge Stone Rocky Mountain! Do it fast!”", "Hiik—! Hugo wheezed out a gasp of horror.", "“I’ll have to tell Kazuki as well. That we’ll be back seven days before.”", "Jang Maldong stopped in the middle of his furious panting.", "“I’m letting you know now. This is what you asked for. You brought this upon yourself.”", "He half-raised his head and sent Seol Jihu an intimidating explanation.", "“Don’t you dare cry in the middle of it. I’ll kick you out right away. It’ll be the same if you can’t follow my training. And even if you do, I won’t permit you to participate in the Banquet if you can’t meet my expectations. Got it?”", "Jang Maldong was only glaring at him, but Seol Jihu felt like his body was shrinking automatically. He felt like he could even see intense flames shooting toward him.", "However, Seol Jihu didn’t cower.", "“Yes!”", "Instead, he shouted vigorously.", "“…Damned brat, let’s see if you can perform as well as you can shout.”", "After a final snort, Jang Maldong stomped out of the office.", "*", "Jang Maldong really packed his bags and borrowed a carriage that day. But Seol Jihu wasn’t the only one going. Poor Hugo was dragged along, even as he raved in refusal.", "Since they couldn’t leave the office empty, Chohong was told to remain as the proxy leader. She protested, of course, but when Jang Maldong asked, “Do you want to go to Huge Stone Rocky Mountain too?”, she accepted his order without a single word of complaint.", "Although it seemed like it was just the three of them going, two outsiders ended up tagging along. These two had expressed their desire to participate after learning about the situation, and although Jang Maldong didn’t seem too keen on the idea, for some unknown reason, he didn’t reject them either.", "The one thing Seol Jihu did know was that Jang Maldong asked them to help train him. The two of them agreed readily, which was unsurprising given that they would receive Jang Maldong’s guidance in return.", "Just like that, the group of five people got on the carriage to Huge Stone Rocky Mountain.", "“Giddyap!”", "The coachman swung his horsewhip, and the carriage pulled by four horses drove out of the castle gate.", "Click, clack!", "Clear hoof sounds rang out as the carriage made its way through the field. However, the inside of the carriage was filled with dead silence.", "Jang Maldong had his arms crossed and his eyes closed as if to rein in his boiling anger, while Seol Jihu was quietly burning his fighting spirit.", "The two outsiders, a man and a woman, remained silent as well.", "“Huaaaaaang….”", "Only Hugo’s sorrowful cries mixed into the air and flowed out."]}