{"cid": "455", "title": "Chapter 455. Different Choices", "content": ["Haramark regained tranquility after Abhorrent Charity perished, almost as if the battle that shook heaven and earth never happened.", "A loud cheer erupted not long afterward. The surviving soldiers, Earthlings, and foreign races all embraced each other in joy. While everyone shed tears of relief at having survived, Teresa recalled Jan Sanctus and hurriedly ordered the soldiers to search and treat the injured.", "As the battlefield was close to getting cleaned up, Sung Shihyun was still alive. Perhaps because he was a parasite that the Parasite Queen took personal care in creating, his body was continually regenerating even as it was instantly burned away. He was truly like a cockroach in that aspect.", "Seol Jihu woke up the twitching Sung Shihyun and pulled him up. Then, he released him. Since the border region wasn’t too far from Haramark, Seol Jihu even promised that he would not chase after them if he crossed the border with his own strength.", "Sung Shihyun let out an empty chuckle. He wasn’t so foolish as to think this was mercy.", "Despite this, Sung Shihyun walked. After all, there was a chance that help might come near the border region. And if he could somehow make it to the Parasite Queen’s territory, the chances of him recovering would go up dramatically.", "Because of this small hope, he dragged his feet and walked forward. However, he had to stop before he even took a few steps.", "It was because he saw Taciana Cinzia and others waiting for him at the border. Seol Jihu said he would not bother him if he went past the border. That obviously meant he would not be free of obstruction until then.", "“Haha… son of a bitch…”", "Seol Jihu surely must have gone through the same thing. After all, when he fought for a dozen days without stop and finally broke through the encirclement, the Parasite Queen and the remaining Army Commanders had been waiting for him.", "Sung Shihyun began to understand how Seol Jihu must have felt back then.", "“God damn it….”", "Sung Shihyun sprawled down on his back. He no longer thought about returning alive.", "The sky cleared up before he noticed. It regained its azure color as soon as the war was over as if it was never dark in the first place.", "“….”", "It wasn’t that he wasn’t aware that Seol Jihu had no intention of sending him back alive. But he also knew that there was nothing he could do to return alive.", "The reason he played along with Seol Jihu’s farce despite this was that he felt wronged.", "Looking up at the sky, the faces of three people flashed across Sung Shihyun’s mind. They were all friends who once stayed by his side.", "[Shihyun, is it true? Did you really do that? It’s not true, right?]", "[What do you mean? I just came back from chopping up another team. Rumors sure fly fast, huh.]", "[What?]", "[Oh, are you talking about the organization I destroyed four days ago? Yeah, I did it. I killed every single one of them without exception.]", "[W-Why….]", "[Their representative pointed his finger at me, calling me trash, with a news report that hasn’t even been confirmed. I meant to just break his teeth and fingers, but I went a little overboard.]", "[But you didn’t have to kill everyone…!]", "[Nah, it looked like the organization was closely related to the intelligence organization I destroyed not too long ago.]", "[Still, how can you….]", "[Well, it doesn’t matter even if that isn’t the case. It’s their fault for trying to protect that trash of a representative. Haven’t you heard of guilt by association?]", "Seo Yuhui.", "[Are you mad? Why would you do that when everyone is watching?]", "[Ah~ You mean the public humiliation and execution show? That fucker was acting mighty arrogant for someone who tried to kill me, so I captured everyone related to him. Turns out he has a family and girlfriend, so… kekekeke!]", "[You… you’ve really gone mad. Haven’t you thought about the aftermath? You might be okay, but what about the people around you?]", "[Iya~ Come on, Haeju, is this really coming from you? What happened to your live alone, die alone creed?]", "[I’m acting independently because of personal circumstances. I’m not acting without regard for consequences like you.]", "[You have to do at least this much. Otherwise, people won’t fear you. I wouldn’t have started if I was going to stop halfway. And I’m the one who decides how thoughtless I am. Don’t impose your standards on me.]", "[I’m not telling you not to do it. I have told you before—if you want to do something like this, form a force that can support and help you justify your actions. There’s a limit to how many times Yuhui and I can help you. Don’t you know we get criticized because of you?]", "[Aren’t we comrades? You can put up with that much, right?]", "[Comrades? Even though you don’t listen to a single word we say? Listen up. Yuhui and I aren’t your subordinates. Don’t you feel bad for Yuhui, who always has to clean up your mess?]", "[Oh come on, I didn’t ask her to, did I?]", "Baek Haeju.", "[Sung Shihyun, do you have to go that far?]", "[What was that? You want to get beaten up too?]", "[Since you entered my company, you are my employee. As the future representative, I have a duty to protect Sinyoung’s employees, so if you keep acting that way, I’ll have no choice but to change my thoughts.]", "[Acting what way?]", "[Are you a psychopath? Don’t you think beating someone up and stabbing him just because he glared at you is going too far?]", "[Hmm, I think the father who treats a kingdom’s queen as a whore and his daughter who pretends to be oblivious are the real psychopaths.]", "[…Listen, if you keep that up, you’re going to get hurt. There’s a limit to how much we can protect you.]", "[Aigoo~ I’m so scared. I got it, so shut the hell up, please.]", "[I’m warning you out of concern for you. Don’t forget that.]", "[I’m warning you too. If you want to keep those pretty teeth intact, shut up. Don’t forget that.]", "Yun Seohui.", "“….”", "Looking back, it wasn’t as if he didn’t have chances. Chances to not lose his mother, chances to not resort to the extreme measure of defecting.", "[I’m sure you have a lot to say. You have a reason for betraying humanity. I get that. I do….]", "Seol Jihu said he understood him, saying that everyone has a reason or two.", "[But can you really hold your head up high?]", "Indeed, Sung Shihyun did always go beyond what was justified.", "[Can you say with confidence that everything you’ve done since entering Paradise is fair?]", "No, that wasn’t the case at all. If his house was broken, he carried out revenge with the purpose of destroying a hundred buildings of his enemy.", "[Were your actions all just?]", "No, they weren’t. Because that was the only way he thought others would fear him.", "[I know I can’t.]", "Seol Jihu said his actions weren’t always fair and just.", "[And I don’t think you can either.]", "Sung Shihyun also knew his actions weren’t fair and just.", "[Or do you really believe that everything that has happened to you isn’t fair, but everything you’ve done to others is?]", "Instead… he was just curious. He wanted to know why they ended up differently, even though they were in similar positions and were equally unjust and unfair in their actions.", "[Let’s just say that we made different choices.]", "[…That’s all there is to it.]", "Just what choice made their futures so distinctively different, Sung Shihyun thought about it with his head on the ground.", "He tilted his back a little, and in the upside-down world, he saw Seol Jihu looking down at him. Beside him and behind him were countless people watching over him. Among them was Baek Haeju, looking at him with a sympathetic gaze, and Seo Yuhui, looking at him with pitying eyes.", "Sung Shihyun turned his eyes and looked around him.", "There wasn’t anyone. Not a single person, not even a single parasite.", "“…Ah.”", "He finally began to understand. If he had held himself back a little more, found comrades and a force to support him, or at the very least, didn’t turn his allies into his enemies, and if he didn’t consider himself his own lord throughout heaven and earth….", "“Whew….”", "Sung Shihyun heaved out a long sigh.", "‘Was I…’", "His eyelids slowly came down until his eyes closed halfway.", "‘Too egotistical…?’", "Soon, Sung Shihyun’s eyes closed all the way.", "And he ceased to move again.", "*", "“…I think he died.”", "Phi Sora murmured after a few minutes of absolute silence. Seol Jihu nodded his head silently.", "Sung Shihyun met his death alone without anyone beside him. It was a somewhat melancholic ending for someone who was once a legend of Paradise.", "Seol Jihu’s expression was complicated. Sung Shihyun was certainly similar to him in many aspects. However, the future they arrived at was completely different.", "‘It’s probably…’", "[That’s what it means to be a leader. You have the authority and the position to use that authority. That’s why you, of all people, should not have done that.]", "Kim Hannah.", "[…Alright.]", "[I don’t know what’s going on, but you must have your reason. Let’s go. You can explain later.]", "Chohong and Hugo.", "[That’s why I… would like to see you overcome your past. If you feel like you can’t do it alone, I will gladly lend you a hand. I am your teacher, after all.]", "Jang Maldong.", "[Don’t waver.]", "Phi Sora.", "[Don’t you have any thoughts about becoming a King?]", "Hao Win.", "[I’ll be cheering for you. If you run into any trouble, give me a call. This time, I will definitely be of help.]", "Teresa.", "[Don’t worry too much. I will help you. No matter what it takes.]", "Eun Yuri.", "[Do you think you’re Hegemon King Xiang Yu, exterminating all your enemies?]", "Philip Muller.", "[Don’t get swayed.]", "[If I had given in to my feelings back then… I might have become a Parasite and stood against you as an enemy. If that happened, I wouldn’t have been able to enjoy the happiness I have now.]", "Vlad Halep.", "[It’s okay.]", "And Seo Yuhui….", "[My Jihu can do anything.]", "Wait, no, that one wasn’t quite right.", "Anyway, it was thanks to everyone that he came this far. Whenever his eyes rolled back, they were there to hold his hand. Whenever something was about to happen, they supported him categorically.", "If it weren’t for his comrades helping him with their heart and body, he would not be standing here today.", "“…Why are you staring so much?”", "Phi Sora asked. Seol Jihu had been looking at his comrades one by one for a while.", "“…No reason.”", "Seol Jihu spoke calmly.", "“I was just grateful.”", "Phi Sora’s eyes widened.", "“What…”", "She blinked in a fluster at his honest confession and scratched her head while feigning annoyance.", "“Don’t just stare and say something. Because you’re doing that…!?”", "Phi Sora was interrupted, frightened out of her mind. It was because Seol Jihu suddenly collapsed.", "“W-What’s wrong!?”", "“Ah! Hey!!”", "With Chohong leading the way, everyone else rushed forward.", "“What happened!? Don’t tell me, you…!”", "“No….”", "“Priests! Someone call for Priests! Wait, no, we have two Priests here already. What are you two doing?”", "“No, it’s not that….”", "Seol Jihu licked his lips while collapsed.", "“I’m… hungry….”", "Growl! His stomach roared out a thunder.", "Everyone became dazed.", "Seol Jihu looked away furtively and blushed.", "*", "The war came to an end. Thanks to Seo Yuhui’s wide-area healing spell, Wings of Salvation, acute injuries were taken care of for the most part. Although the battlefield was cleaned up as well, Haramark was still bustling with the aftermath of the war.", "Eun Yuri, who fainted during the war, woke up as soon as she was moved to the intensive care unit. Her injuries were healed completely, and although she overburdened her mana, there wasn’t much trouble with Roselle’s help.", "Eun Yuri headed to the Haramark Royal Palace as soon as she woke up. After grabbing the first maid she saw and asking for Seol Jihu’s whereabouts, she hurried to the dining hall.", "Her steps were light, elated to finally meet her oppa after so long.", "But when she entered the dining hall, Eun Yuri stopped in her tracks.", "“It’s not ready yet?”", "“What do you mean? We just brought you some!”", "“I’m almost done with them!”", "“What? Shit! Someone run to Earth and get some bread!”", "A fierce war was underway in the dining hall.", "“Is your body okay?”", "Oh Rahee, who was running to the kitchen, saw Eun Yuri and asked.", "“Yes, I’m okay.”", "“Good. Then give us a hand.”", "“…Excuse me?”", "“You can cook, right? Anything is fine. The ingredients are in the kitchen, so let’s cook something up.”", "Oh Rahee grabbed Eun Yuri and headed to the kitchen. All Eun Yuri could see before she was forcefully dragged to the kitchen was Seol Jihu sitting in front of the dining table amidst a pile of plates.", "Munch, munch, munch!", "Seol Jihu was devouring food as if he was possessed. He stuffed a baguette sandwich filled with ham and lettuce into his mouth, and he spun his fork to roll pasta around it and then swallowed it in one bite.", "Immediately afterward, he emptied a bowl of rice with toppings, scraping up every grain with his spoon, and then gulped down beef-bone soup.", "He was even showing bizarre tricks like putting a chicken leg in his mouth and pulling it out with bone only.", "“Yo! Try this too!”", "Hugo walked out of the kitchen, carrying a giant iron plate. Although he suffered a massive wound from Sung Shihyun’s attack, Seo Yuhui’s Cure Critical Wounds had whipped him back to shape, and now he was helping the royal cook prepare food.", "“Meat is best for recuperating strength…?”", "Hugo blinked. He brought a heated iron plate to the table just now, but the perfect medium-rare steak had disappeared as soon as he put the plate on the table. When he turned his gaze up in a daze, he saw Seol Jihu licking his lips that were smeared with sauce.", "Next, Kazuki also brought food. It was only then that Hugo saw how the steak disappeared. Seol Jihu lifted Kazuki’s plate of sushi and poured it down his throat. Over ten pieces of sushi disappeared into his mouth in an instant.", "“…Luffy?”", "Hugo murmured while doubting his eyes.", "“I didn’t think Oda Eiichiro based his main character on a living person.”", "Kazuki wiped the sweat on his forehead with an exhausted look.", "“Tell me about it.”", "Vlad Halep walked through them and said while placing down a plate.", "“Starting from today, I might believe the saying that the human body is a microcosmic space. The stomach then must be a black hole.”", "And precisely one second afterward, he pulled the plate back up. It was empty.", "“Huh? Why’d you bring an empty plate?”", "Hugo yelled angrily.", "“I didn’t. I brought food. It just disappeared into that place.”", "Vlad Halep protested calmly and pointed his finger at Seol Jihu, who was pulling out empty skewer sticks from his mouth.", "Hugo looked speechless. He found it hard to believe despite seeing it with his eyes just now.", "“It can’t be helped. He became the Apostle of Gluttony.”", "Philip Muller walked up to the three men.", "“Is it normally that bad?”", "“You can hold it in if you really want to, but…”", "Philip Muller put down another plate of food while shaking his head at Hugo’s question. It was a frankfurter sausage that was the size of his forearm.", "“How you usually take care of your desires is important. You have to let it out every now and then, and this is what happens if you hold it in for too long before it bursts out. Come to think of it, I recall it was the worst when I first got appointed as an apostle. Because I wasn’t used to it.”", "“Uh… is that how it works?”", "“For Representative Seol, the memory of starving for twelve days must be etched in his head. I heard he didn’t eat well on Earth either. That must be why it’s so hard to resist the urge.”", "Hugo tilted his head before peeking toward the kitchen.", "“Then what about Lady Seo Yuhui?”", "“She’s not called a saintess for nothing. This is only my guess, but there are ways to relive that urge alone.”", "“A-Alone?”", "“Hello? Men?”", "Phi Sora raised her eyebrow while flipping over a strip of pork belly.", "“Enough with the chit chat. Go, make more food!”", "Hearing this, Philip Muller, Hugo, and even Kazuki and Vlad Halep turned around.", "“Hmph… why are y’all so interested in another man’s woman anyway?”", "Then, Phi Sora furrowed her brows while cutting up the pork belly. She couldn’t feel anything being grabbed on her tongs. When she turned her head in disbelief, she saw Seol Jihu swallow the pork belly by the strip.", "Phi Sora’s jaw dropped.", "“Can you slow down a little!? You’re going to upset your stomach!”", "“Cough!”", "Like a jinx, Seol Jihu coughed and smacked his chest. Phi Sora sighed and poured barley tea into a cup. Seol Jihu gulped down the drink before wiping his mouth and looking around the dining table.", "“…What are you looking for? Do you want more water?”", "“No… do you have any black bean noodles…? And some fried dumplings too…”", "“What? Listen here, if you have any conscience, just eat what you’re given. Or what, are you going to ask for spicy seafood noodles too?”", "Phi Sora grumbled because all Seol Jihu did after coming back was eat, eat, and eat. Tak. At that moment, four bowls of black bean noodles were placed in front of Seol Jihu.", "It was Seo Yuhui.", "Seeing her, a bright smile bloomed on Seol Jihu’s face. Just as he was about to call her, Seo Yuhui turned around without saying anything.", "Seol Jihu flinched.", "‘Ah.’", "He thought about why she was acting so cold and remembered. She must be angry that he forced her unconscious after saying they should escape together.", "Although Seol Jihu did so for Seo Yuhui’s sake, it made sense for her to be angry, given that she didn’t know the circumstances. It wasn’t as if he didn’t feel wronged, but after recalling Seo Yuhui’s past, he became even sorrier.", "‘I should apologize…’", "Seol Jihu put down his chopsticks and smacked his lips. Phi Sora must have felt bad seeing this as she glared at Seo Yuhui.", "“Ah, why are you making him walk on eggshells like this!? Can’t you see he’s eating!?”", "She yelled grouchily.", "Baek Haeju, who was coming out of the kitchen with fried dumplings, must have heard Phi Sora’s voice as she also gave Seo Yuhui a sidelong glance.", "After putting the plate of fried dumplings down, she picked up Seol Jihu’s chopsticks and put them back into his hand. She even tapped his back to urge him to eat.", "As for Seo Yuhui, who ignored all this and headed to the kitchen…", "“?”", "She came to an abrupt stop.", "It was because she saw Eun Yuri, who was dragged to the kitchen by Oh Rahee, coming out with a huge plate in her hand. Seo Yuhui’s hand flew out as soon as she saw the plate.", "“Kyak!”", "The plate flew into the air.", "“What are you doing!?”", "Eun Yuri shouted out loud in a rare fashion.", "“T-That should be what I’m asking. What did you make, Miss Eun Yuri!?”", "“Rolled omelettes! Do you know how hard I worked on those!?”", "“Rolled omelettes? Are you sure you didn’t make them using parasites or Nests?”", "Seo Yuhui flew into a rage, asking if she planned to kill Seol Jihu when he only just revived.", "Hearing this, Seol Jihu quietly retracted his hand, which was about to pull the plate in with Spatial Grasp. He quietly went back to eating black bean noodles and fried dumplings.", "*", "Seol Jihu ate and ate and ate.", "Becoming an apostle resulted in two changes. One was sharing their god’s values, personalities, and everything else. The other was having a stronger desire.", "He wasn’t sure about the former, but he certainly experienced the latter. Perhaps because he starved for so long, as Philip Muller said, he could not stop being a glutton once he began to devour food.", "It wasn’t until another forty minutes went by that Seol Jihu felt full and asked everyone to stop. By this point, the royal palace’s cooks and every member of Valhalla were in groggy states.", "“Fufu… we won against an Executor….”", "Chohong fell asleep peacefully, satisfied at the fact that she satiated the Star of Gluttony’s voracious appetite.", "“Right… even the Parasites couldn’t defeat him….”", "Teresa also dropped her head as drowsiness swept in. Soon, two snores rang out in the room. It couldn’t be helped since they started cooking as soon as they were healed from a prolonged war.", "Seol Jihu looked a little embarrassed since what should have been a touching, happy reunion had turned into a feeding contest because of him.", "“Don’t worry about them. You must be tired. You should get some rest too. I will have the maids move the other two.”", "Seol Jihu tried to take Chohong and Eun Yuri to their rooms, but Prihi stopped him.", "“Well, I suggest you try to cheer up one person in particular. She’s been suffering from guilt every day ever since she came back.”", "Prihi picked up Teresa by her arms before glancing toward the kitchen.", "“I wanted to support my daughter at first… but watching her made me pity her.”", "Seol Jihu hurriedly stood up. He didn’t understand what Prihi meant by supporting his daughter, but he felt like he knew who Prihi was talking about.", "Seol Jihu went into the kitchen and saw Seo Yuhui cleaning up the mess.", "Should I call her Noona or Yuhui? Just as he was pondering in hesitation, Seo Yuhui turned around.", "“Yes?”", "“Ah, um…”", "“Would you like me to make you more food, Representative?”", "Seo Yuhui smiled stiffly.", "“No, um, we can clean up together….”", "“It’s fine. I will take care of the kitchen, so please go rest.”", "Seo Yuhui turned around and went back to cleaning.", "Seol Jihu was taken aback. Seo Yuhui was smiling and not smiling at the same time, and her tone was exceedingly business-like.", "[She’s more extreme than you think. It’s true that she has a naturally benevolent personality and broad-mindedness, but once someone loses favor in her eyes, she will never give that person a second look.]", "[It’s because I am someone who lost her trust. Lady Seo Yuhui will never give her trust to someone she has turned her back on once.]", "Seol Jihu recalled what Yun Seohui and Roberto Serviollo said and trembled in fear. Thinking about it now, didn’t he betray Seo Yuhui’s trust?", "“Are you angry?”", "“No, I’m perfectly fine.”", "Seol Jihu asked in a fluster, and Seo Yuhui replied without even turning around. Seol Jihu scratched his head.", "What should I do?", "After pondering for a long time, he decided to crack a joke to lighten up the mood. For example, something with a nice alliteration like, ‘So sad, so sad, so Seo Yuhui~’", "But he swallowed the joke that was just about to come out of his throat. Gula’s values, which he began to share after becoming an apostle, were strongly telling him that wasn’t it. He felt like these values were vehemently pleading with him to shut up.", "‘…Then what am I supposed to say?’", "He felt like he could hear Gula’s sigh. In the next moment, Seol Jihu’s mind and body moved on their own.", "Standing behind Seo Yuhui, he coughed. Then, he spread his arms and gently embraced her.", "“…I’m sorry.”", "He whispered behind her ears.", "“I know why you came back, back then.”", "Seo Yuhui’s busily moving hands stopped.", "“It’s not like I was thinking, oh, it will be easier by myself. I had to make you go back even if I had to lie. I had a reason…”", "Seol Jihu continued calmly.", "“Of course, I know it might be hard for you to understand me right now….”", "“….”", "“And I don’t know if you ever will… but please listen. I will tell you why I did it, why I had no choice but to do it, all of it.”", "Seol Jihu swallowed his saliva. He rambled on about random thoughts that came to his mind and didn’t think about whether it would be okay. Perhaps it might have been better to lighten up the mood with a joke.", "At that moment, Seol Jihu felt a faint trembling in his hands. He saw Seo Yuhui’s shoulders shaking.", "Is she laughing? Was she actually pretending to be angry? Seol Jihu shoved his face forward with an awkward smile. Then, his jaw dropped.", "“Hic…”", "She was crying. Seo Yuhui’s eyes were tightly shut, and streams of tears were flowing down her cheeks.", "Seol Jihu’s head blanked out as this was the first time he was seeing her cry.", "Meanwhile, perhaps from the influence of becoming an apostle, Seol Jihu’s mouth was continuously apologizing for making her worry, and his hand was caressing her shoulder.", "“Huaaang….”", "Seo Yuhui spun around. She buried her face in Seol Jihu’s chest and bawled her eyes out.", "“Sorry… I’m so sorry…. Because of me, you….”", "Seo Yuhui trailed off, but Seol Jihu had an idea why she was acting this way. She must be thinking that it was her fault that Little Chick and Flone separated from Seol Jihu and ultimately led to his death.", "“If it wasn’t for me… if I didn’t go back on my own… maybe…”", "For all she knew, Little Chick and Flone wouldn’t have left Seol Jihu if it weren’t for her, and maybe he would have escaped alive.", "Of course, since the Parasite Queen personally took action, the chance that Seol Jihu would have survived even with Little Chick and Flone was close to zero. However, Seol Jihu didn’t say this out loud.", "“Uaaaaang….”", "He only said it was okay, that she was wrong, and gently caressed Seo Yuhui’s hair and back until she calmed down.", "Of course, he didn’t forget to thank Gula.", "*", "[Wheeeeew….]", "Gula let out a sigh of relief as she watched over the pair.", "[Good job. Your naming sense is terrible, but it turns out your talent was elsewhere.]", "Luxuria also breathed a sigh of relief as if she had been scared to death previously.", "[I think I meddled a bit too much….]", "[No, I think that was very well worth it.]", "[I agree. If he had really cracked that joke back then…]", "[…My daughter is kind, but she would have been sulky for at least two months.]", "[Tsk, I know he’s my son, but I just don’t get it. How can he think about making a joke like that in that situation?]", "Gula lamented as if she was completely incapable of understanding Seol Jihu.", "[T-That’s… true….]", "Luxuria reluctantly agreed. Luxuria always defended Seol Jihu whenever something happened, but…", "[So sad, so sad, so Seo Yuhui~]", "No matter how she thought about it, this was just going too far.", "[Anyway, this is good to see.]", "[Mmn. Isn’t this the first time my son is embracing your daughter and not the other way around?]", "[Oh my, you’re right!]", "The two goddesses, who got out of their shock shortly afterward, looked at the pair with heated gazes and had a pleasant chat."]}