{"cid": "118", "title": "Chapter 118. Result of Stage 1", "content": ["Stage 1 resumed. If anything changed, it was that six out of the seven members took on specific roles, even if it was only a formality.", "The process was a repetition of simple actions. First, Sophie Chalet would open the door and step to the side. Then, they would go in if no enemies could be seen. If there were enemies, Seol Jihu would first throw a Mana Spear before running in and commencing battle. The group would then move to the next room once the clean-up ended.", "Even though Seol Jihu had stepped up to lend Lara and Sophie his hand, it was still true that they were lacking in abilities compared to Straight Face and Snake Eyes.", "But in reality, the speed at which they were clearing the rooms was close to that of Straight Face and Snake Eyes.", "The key to this outcome was Maria. The blonde girl generously used the spells she had been saving up until now to support Seol Jihu. Just as Kim Hannah proclaimed, Maria was a Priest whose professionalism rivaled her love for money. Although she wasn’t happy with Seol Jihu’s decisions, she didn’t forget that he was her employer.", "Plus, Seol Jihu was a pushover who would easily throw out 80 silver coins. Unless he backstabbed her first, she had no reason to refuse to help, just because she disagreed with his decision.", "Maria wondered, ‘If I supported him without a word of complaint, wouldn’t he offer me another bag of money?’ With this expectation, she focused on supporting him to the best of her abilities.", "As a result, Seol Jihu was able to easily sweep through each room. The battles could be described as overwhelming victories, especially considering Seol Jihu was the only real fighter. However, Seol Jihu himself didn’t think that way.", "‘Thank goodness.’", "He credited his success to the intense training he had in Huge Stone Rocky Mountain. Having experienced the Banquet’s first stage, he was finally able to understand Jang Maldong’s words.", "If he had participated in the Banquet as he was two months ago, he would have been out of stamina before he could open just 20 doors. He might have been treated like a burden no different than Lara Wolff and Sophie Chalet.", "But many things changed after the hellish training. Originally, only his Dexterity was Intermediate (Low), but with his Strength and Stamina improving to the same level, the three elements began to work together.", "It was the same with his use of mana. In the past, he had gone all out no matter how strong or weak the enemies were, but now he could control the amount with finesse.", "His repertoire had gone from being crosses, hooks, and uppercuts to finally incorporating jabs. Of course, they were only jabs from Seol Jihu’s perspective. To the enemies who had to face his attacks, his jabs felt like multiple crosses coming in at once.", "In any case, his battle speed had increased significantly. Adding his long-ranged attack method in the form of his Mana Spear, the freezing effect of his close-ranged Ice Spear, and several other artifacts, the power he was displaying far surpassed that of a Level 3.", "And when Seol Jihu really charged through forty doors in a short time, Snake Eyes’ evaluation of ‘a decently useful guy’ and Straight Face’s evaluation of ‘new toy’ had no choice but to change.", "Although Seol Jihu fulfilled what he promised Straight Face, he continued to clear the way without a pause. This was partially because he had ample stamina left, but it was also because he wanted to show Straight Face and Snake Eyes through action that he ‘really wanted to clear Stage 1 as soon as possible’.", "He had no way of knowing how they took this subtle message, but he considered it a success since they stopped their snarky prattling.", "How much time went by? When Seol Jihu finally stopped, he had already cleared over 100 rooms. To be precise, it was 120 rooms.", "Only after clearing three times the number of rooms Straight Face asked for did the young man pause.", "‘This room…’", "The number of doors in the room went from three to two. Based on the direction he entered the room, the frontal door and the right-side door had disappeared.", "“How about we take a break? We can eat something too.”", "Hearing Maria’s words, Seol Jihu shook his head, “No, it’s fine. I can keep—”", "“No, but I’m not fine.”", "“….”", "When Seol Jihu looked around the room awkwardly, Maria continued with a dull expression, “You don’t need to worry about others. Think about the number of doors you opened. Anyone who says a word of complaint is the asshole.”", "Straight Face, who was listening silently, muttered with a chuckle, “Ha! That sure sounds like it’s directed at someone, kid.”", "“Call me a kid again and I’ll blow your head off.” Maria struck back without losing an inch. She stayed silent at first since Straight Face was doing all the work, but now that Seol Jihu had taken the lead, she had lost her reason to hold back.", "“Oh? Now that’s not a nice thing to say. Don’t people often tell you to watch your mouth?”", "“Mind your own business. What’s that got to do with you?”", "“You know what’s a good way to fix anger management issues? How about it? I’m starting to think I want to help you fix it.”", "“Hm, not really. You don’t look stronger than Agnes anyways.”", "“…What?” Straight Face furrowed her brows. “Claire Agnes?”", "“Let’s take a break.” Sensing that the conversation was heading in a hostile direction, Seol Jihu quickly intervened.", "Maria, who had her hair up like an irritated cat, harrumphed and turned away when Seol Jihu patted her back. While Maria sat down in the corner of the room and munched on dried meat, Seol Jihu fell in thought as he observed the room quietly.", "For the first time since they entered Stage 1, they had lost the ability to pick a direction. The way the frontal and right side walls were closed off, it was as if he was looking at a corner.", "‘Wait… corner?’", "A theory popped up into his head. At that moment, a small ruckus buzzed out.", "“What’s wrong with you? Did you finally lose your mind?”", "“Just let me see it.”", "“Look at yours. I know you drew one too.”", "“I only started in the middle, so I don’t know the beginning part. I just need to see it for a moment. Please?”", "Lara and Snake Eyes were arguing. Seol Jihu didn’t know what happened, but it looked like Lara was the one bothering Snake Eyes. Until a moment ago, it looked like she wanted nothing to do with Snake Eyes and Straight Face, so what had gotten into her?", "“1 minute, no, 30 seconds is enough.”", "“Screw off. Are you crazy? What, you gained some confidence because Prince Charming over there fondled your anus?”", "“Do you have to talk like that? I’m asking because I want to help. Besides, it’s not like it’s anything hard.”", "Snake Eyes chuckled as if she found Lara’s statement laughable. Shortly afterward, she relaxed her arms. “You’re right. It’s not hard.”", "“Then!”", "“Sure, take it.”", "“…Excuse me?”", "When Lara asked, Snake Eyes grinned. “I hate being hassled, so just take it.”", "“Where is it?”", "“Here~”", "Snake Eyes gestured at her half-open jacket with her eyes. To be exact, she was pointing to her bountiful cleavage that boasted a deep ravine.", "Lara was startled. “Wh-Wh-What? Are you joking?”", "“Not at all~ You said you wanted to see the map I put in great effort to make. Is taking it yourself that difficult?”", "“Is it fun teasing people?”", "“Yes, very. It’s so fun I might die.”", "When Snake Eyes snickered, Lara muttered, “Keuk”, and seethed in anger. Snake Eyes crossed her arms and tilted her chin up slightly.", "“What, you’re not going to take it? Then don’t~”", "Lara fumed, but she still brought her trembling hand up.", "Seol Jihu kept his eyes on the duo in case a problem broke out. It was then that he felt someone staring at him fixedly. When he turned around, he saw Straight Face staring at him with faint, manner-less eyes. She was right in front of him, having approached him before he noticed.", "“Can we talk for a moment?”", "“Talk?”", "“Yes. And let’s move over to a quieter place.”", "Straight Face glanced at the left door, which had not yet been opened. Then, she began to move towards it before Seol Jihu could say a word. A monster howled the moment she opened the door, but it collapsed with a mournful cry after a couple of flashes of light.", "Thud. Straight Face kicked the headless corpse of the monster before glancing at Seol Jihu and disappearing into the room.", "Even though Seol Jihu had seen her quickdraw countless times by now, it was just as terrifying now as it was in the beginning.", "When he entered the room leaving behind several gazes, he saw Straight Face sitting against the wall. In that short period of time, she had taken care of the remaining monsters in the room.", "“Don’t just stand there. Come sit.”", "Seol Jihu nodded and sat down next to her.", "“….”", "Straight Face closed her eyes before slowly opening her mouth, “People often tell you that you don’t know how to read the air, right?”", "“You told me to come sit.”", "Hearing the young man speak like he had been wrongly accused, the young woman looked up at the ceiling. Soon, a deep sigh escaped her mouth.", "After a brief silence, she spoke again, “Now that I’ve seen how you play, I understand why you were so bold.”", "“Is that a compliment?”", "“Yep.”", "“Thank you, but it would still be nice if a certain someone helped out.”", "Hearing Seol Jihu’s subtle suggestion, a smile appeared on her face. She faced the young man and spoke with a delicate smile, “I’ve put some thought into it and I think you’re right.”", "“?”", "“We’re only at Stage 1. Clearing it quickly will be convenient…. That’s why I wanted to ask.”", "With Straight Face being oddly submissive, Seol Jihu became worried. He was being sarcastic when he asked her to help him. Now, he somewhat regretted that decision.", "“You, me, and that snake. Why don’t the three of us go?”", "“…What?”", "“Ah, you can bring that kid too if you want. She’s infuriating, but she does seem to have some skill.”", "“That sounds like you want to abandon the other three.”", "Straight Face smiled, “Yep, that’s exactly what I’m saying. You can even include that Priest of Invidia. She might seem useless now, but we never know.”", "“By that logic, Miss Lara and Miss Sophie should also—”", "“Are you joking?” Straight Face cut him off as if he had just told the funniest joke.", "“I didn’t take you to be a fool who would place a Warrior and an Archer on the same level of importance as a Priest.”", "Seol Jihu was about to disagree and call that a flawed argument, when….", "“Plus, you know more than anyone else that those two aren’t useful.”", "He became speechless.", "“You don’t have to think so hard. I get how strong you are, so just support me as you did in the beginning. I’ll also give it my all, and we should be able to get through this place in no time.”", "Seeing that the young man had fallen silent, she continued with a look of joy on her face, “If this stage really has a time limit, or if it’s advantageous to get to Stage 2 faster, wouldn’t it be better to do as I say?”", "She wasn’t wrong. If Straight Face and Snake Eyes participated at full power, their speed would increase significantly. Maria would also be able to save her spells. However, Seol Jihu couldn’t help but think that this was all an excuse.", "Seol Jihu stared fixedly at the woman.", "“Am I wrong?”", "And just as he expected, she was looking at him with eyes full of anticipation. He felt like she was testing him. Although he couldn’t be sure, he had a strong hunch that this woman simply wanted to see him abandon the two women or, at the very least, retract the offer he made.", "‘What a personality.’ Seol Jihu grumbled inwardly while clearing his throat. This wasn’t all too surprising. After all, he didn’t have the slightest bit of expectation to clear Stage 1 so peacefully. Since he couldn’t fully stitch up the wound, he expected a critical moment like this to come.", "“Yes, you’re wrong.” Seol Jihu opened his mouth, “I think it’s better to bring them all with us.”", "“Hnng. Well, I’ll be looking forward to it.” Straight Face let out a nasal hum as if she had expected this answer. “So, how are you going to console me?”", "“I think you mean persuade.”", "“Well, go ahead.”", "“First, you know that this Banquet is different from the previous ones, yes?” Seol Jihu didn’t want to prolong this conversation, so he cut straight to the chase.", "“You mean the fact that teams were separated.”", "“Yes.” Seol Jihu continued, “But why? This has never happened before in the history of the Banquet.”", "Straight Face didn’t react. Taking this to mean that she was listening attentively, Seol Jihu got to his main point, “Haven’t you noticed that something is strange?”", "“Strange?”", "“Don’t you think this Stage 1 is too easy?”", "Straight Face’s eyes narrowed.", "“We’ve cleared 160 rooms so far, but none of them felt particularly difficult. In fact, they were all so-so.”", "“….”", "“The problem is that Stage 1 and Stage 2 have never been considered easy in the history of the Banquet.”", "“I’m not sure what you’re getting at.”", "As a reply, Seol Jihu began to recite a summary of all the past Stage 1s—", "That the participants were allowed to enter the past four Banquets as teams, and that Stage 1 had been difficult from the very beginning. Also, according to the records, every member of a team had to work together to barely scrape by.", "“It’s almost as if the Banquet imposed cooperation among the members who entered through the same entrance. If we were in their shoes, we wouldn’t have been able to abandon a team member so easily. After all, unless someone was a total troll, every head would be important.”", "However, this Banquet was the opposite. Teams were separated, and Stage 1’s difficult rate dropped significantly.", "“Maybe the difficulty dropped because of the separation of teams.”", "“That’s certainly a possibility, but it’s too convenient of an answer.” Seol Jihu shook his head at Straight Face’s counterargument. “Cooperation was the only factor that remained unchanged in the past Stage 1s and 2s. This Banquet is the first time the need to cooperate disappeared. I believe that this is a trap.”", "Although Straight Face did not notice, her eyes were widened to a circle. Her previous statement had been a lighthearted teasing, but the answer surpassed her imagination and made her mind reel.", "“So….” Straight Face murmured as if she was talking to herself, “We’ll fall into the trap the moment we abandon someone.”", "“Exactly.”", "“…Hmm.” Straight Face tilted her head slightly and mulled over the idea. She was intelligent and surely wasn’t a fool. She didn’t take Seol Jihu’s words lightly.", "“I understand what you’re saying… but it does sound a bit forced….” She tilted her head side to side before asking a sharp question, “What made you think this?”", "Seol Jihu smacked his lips. He couldn’t just say, ‘Because this entire area has the color of the Golden Rule.’ He had to make her understand some other way.", "He didn’t need to think for too long. Since what the white-hairband girl said gave him the idea in the first place, he could just tell her about that. Of course, he couldn’t just say to her face, ‘You’re the self-centered maverick.’ So, he changed the words around a little.", "“Counterparts, is it….” Thankfully, what the frail girl told him was enough to pique her interest.", "Straight Face rubbed her chin more seriously than ever before. After thinking for a long time, she glanced at the young man who was anxiously waiting for an answer.", "“Our prince,” leisurely sweeping her hair back, she opened her cherry-red lips, “…sure has a way with words.”", "‘I wish you’d stop calling me a prince.’ Seol Jihu smiled bitterly.", "“Iyaa~ This is hard.”", "“You don’t need to keep tugging them along. It will only be until Stage 1 ends.”", "“You’re right, but…. With my personality, letting them hitch a free ride is—”", "It was then….", "—Woooooooow!", "Before Straight Face could even finish her sentence, a loud cheer broke out in the room next door.", "The duo’s gazes went up simultaneously."]}