{"cid": "202", "title": "Chapter 202. There Is a Time to Avoid Fighting, Even in the Absence of the Law (2)", "content": ["“About 170cm tall.”", "Seol Jihu continued with a clear voice.", "“Face covered with a black veil, wearing a black patternless top and bottom. Body on the slimmer side, and what else… Oh yeah! This person is a woman, judging by the length of her hair and her curves.”", "Seol Jihu put what he saw in the vision into words, but made it sound like it was something he heard from Miss Foxy.", "“And also…”", "Seol Jihu didn’t miss a glint of surprise flashing across Pavlovici’s face.", "“A palm-sized purple snake tattoo on her neck.”", "Pavlovici’s eyes widened slightly. Seol Jihu rested his chin on the back of his palm and asked.", "“You know her, right?”", "He couldn’t jump to any conclusion yet…", "‘It doesn’t matter.’", "But he could always just make up a good excuse. Basically, all he was trying to do right now was probe the man.", "The vision Seol Jihu saw was this— the four people in front of him were lying dead in an alleyway, and not a single one of them had shown him a different vision. Meaning, these four would meet the same fate.", "Another thing to note was that all four would be killed by the mysterious female Earthling he just described. She was so scrupulous that she even had her face covered in his vision, but the scene of Pavlovici with a hole in his chest glaring at her until he died was still vivid in Seol Jihu’s mind.", "Pavlovici seemed to be shaking in resentment and injustice as well.", "“Ho… how….”", "Perhaps because of how shocked he was, he acknowledged that he knew her.", "Seol Jihu considered selling Kim Hannah again, then grinned. Sometimes, silence was more effective than words.", "A short silence flowed before Seol Jihu finally spoke.", "“You said you told us everything. Were you lying?”", "“We told you everything!”", "The man kneeling furthest back shouted. Judging by his face, he seemed to be the youngest sibling of the Alexei brothers. He was only 20 according to his Status Window.", "Pavlovici darted a quick glance at him, but he seemed to have already made up his mind.", "“The reason we didn’t mention that woman was because we weren’t sure she was related to the work we received.”", "“That woman?”", "“Yes. We met her when we got our first mission, but it was just once. Her face was veiled, so we didn’t see it. But we definitely remember seeing a purple snake tattoo on the left side of her neck.”", "Seol Jihu nodded his head, gesturing at him to go on.", "“After that, she notified us of work to do by sending her underlings.”", "“And what about this one?”", "“You see… we’re not really sure.”", "The man became more careful.", "“In the past, we could tell their relationship with that woman by their clothing or a mark on their necks. But the client this time was different. This person was hiding his or her identity with a turban and a gown, but that’s nothing uncommon.”", "Seol Jihu looked up before nodding a couple of times.", "“That person must be related to the snake tattooed woman. Probably.”", "Otherwise, she wouldn’t have appeared in his vision.", "“Judging by how meticulous they were, looks like they did their homework in researching my background. They were probably thinking, ‘If it works, it works. If it doesn’t work, that’s fine too’…”", "Seol Jihu blurred the end of his speech before glancing at the four men.", "“I can’t be sure, but it’s very likely. And well… They will probably kill you soon. Like killing a dog after the hunt is over.”", "Soon? The four men sent a dazed glance hearing the certainty in Seol Jihu’s tone.", "“What a pain in the ass. Even if you die here, those dirty bastards will package it to their advantage and publish it as a newspaper…”", "Seol Jihu cracked his head left and right while muttering as though the whole thing annoyed him.", "Pavlovici instantly realized that Seol Jihu was talking about them, but couldn’t tell whether he was telling the truth or not.", "But one thing that was certain was that Seol Jihu knew far more about this matter than they did, and that most of the things he said so far were true.", "Not only had he found out that they were brothers, but he had also described that woman accurately.", "That’s why Pavlovici couldn’t help, but be bothered.", "That they would soon die.", "“Right, there’s no reason to give them a news story. Fine, you can leave.”", "Seol Jihu shooed them away as if he was being generous.", "“The Priest should be coming soon. Why don’t you stay and get healed first?”", "He is letting us live? And healing us too?", "The four men’s eyes widened. It wasn’t because they were happy. Setting aside the fact that he was letting them live, it was more like he was trying to avoid a dirty pile of dog turd on the ground.", "“Ah, let’s get this straight, just so we’re clear. The four of you were alive when you left Carpe Diem. This is it for our relationship. Even if you get lucky and survive, don’t go around spreading false rumors about us, alright? If you do…”", "A sharp glint flickered in Seol Jihu’s eyes as he muttered grimly.", "At the same time, the suspicion in the men’s hearts solidified into assurance. Each and every word that was coming out of Seol Jihu’s mouth was foretelling their deaths.", "Seol Jihu waved his hand to quickly shoo them away, but the four men didn’t budge an inch.", "They found themselves in a rather ironic situation. Because they were now looking for a way to live in a place they thought would be their grave….", "“Um….”", "One of the men mustered up his courage and carefully began to talk. He was the youngest of the four brothers.", "“You said we will die soon… What do you mean by that…?”", "Seol Jihu, who was putting a cigarette in his mouth, blinked.", "“Oh, just think about it.”", "With a snort, he spoke as if he was too lazy to explain but had no other choice.", "“You lost your value the moment we published a rebuttal article explaining how papers denouncing me were written before you even provoked us at the pub. Publishing an interview article now would only exacerbate the public opinion against them.”", "Seol Jihu prompted, “Don’t you agree?” And the four men nodded their heads.", "“Anyways, everyone knows that you four were only tails to be cut off. Now, Carpe Diem will obviously do its best to find out who they are, and those guys will probably do their best to avoid being caught.”", "After a lengthy explanation, Seol Jihu fiddled with the end of his cigarette.", "“Considering how meticulous they are, I doubt they would let you walk around alive even if we let you live. At least… That’s what I would bet on.”", "The man’s eyes widened.", "“W-We only did what we were told!”", "And he shouted defyingly.", "“Never mind their organization, we don’t even know a single face of their members! We, we just—”", "“I know.”", "Seol Jihu affirmed calmly.", "“Then just continue to think like that— ‘Ah, we don’t know their faces or even their organization. We just did what we were told. They won’t kill us since we don’t know anything, right?’”", "Pavlovici’s pupils shook.", "“But consider this. They can kill you and mutilate your body, then throw out a story with a headline that reads, ‘Did Carpe Diem have to go this far?’”", "The more Seol Jihu talked, the more their faces contorted.", "“You’re free to imagine, but let me give you a word of advice. From now on, don’t stay together with just the four of you and join an organization to rely on. Though… I don’t know if the Haramark Royal Family, Sicilia, the Triads, the Assassination Union, or the other large-scale organizations would be willing to accept you.”", "Seol Jihu took his eyes off them and lit his cigarette as if he really was done with them. However, the four men still refused to move an inch.", "“…What?”", "Seol Jihu smirked.", "“You want to live?”", "The brothers, who were staring at each other worriedly, turned their gazes to Seol Jihu.", "“Unfortunately, my answer won’t change. There are two ways for you to survive, but neither of them is of any interest to me.”", "At that moment, Pavlovici, who was laying sprawled on the floor, groaned loudly. Furrowing his brows and sweating profusely, he brought himself onto his knees with great difficulty. His broken arms still hanging limp, he pleaded.", "“Pwease… hwep us….”", "His words were more intelligible than before.", "“Help you? Why not just run to Earth?”", "“Ewarth ishn’t swafe eisher.”", "Pavlovici shook his head with much trouble.", "“We arr sowwy. We’ll do ash you shay. Pwease hwep us…!”", "Thud! He smashed his head onto the ground.", "“Pwease! We’ll pway back thish debt bwig!”", "Please, we’ll pay back this debt big.", "Seol Jihu liked the sound of that. They weren’t saying they would pledge their loyalty, but that they would pay it back in equivalent value if he let them live.", "This was something that aligned with Seol Jihu’s principle. And in truth, it was what he was waiting for as well.", "“Hm, I don’t know….”", "But Seol Jihu didn’t take the chance immediately. Not only were words easy to say and hard to carry out, but the brothers shouldn’t have erased the doubt inside them completely.", "People like them, they wouldn’t truly understand something until they experienced it themselves.", "“I say all this, but it probably doesn’t feel real to you yet.”", "Pavlovici flinched. He raised his upper body once again.", "“So let’s do this.”", "With a grin, Seol Jihu called Marcel Ghionea. After the Archer of Steel walked in, Seol Jihu whispered something into his ear.", "“Yes, okay, got it.”", "Nodding his head in understanding, Marcel Ghionea glanced at the four men. He muttered as soon as the explanation was over.", "“It might be a bit difficult on my own.”", "“Will it?”", "“It’s highly probable that the enemy will move in a group, and people like them generally use different people to act as scout and attacker.”", "Marcel Ghionea thought about the matter for a while before saying.", "“I’m confident I can do it if I have a helper.”", "“Who?”", "“Someone like Miss Phi Sora… there aren’t many who are stronger than her in Haramark.”", "“I don’t mind, but do you think you can convince her?”", "Marcel Ghionea hesitated a little.", "“Uh… didn’t she borrow equipment from you, leader? If you tell her you’ll extend the lending period a bit, I’m sure she’ll agree even if she grumbles.”", "Seeing the ash-grey haired Archer tighten his grip on his own white bow, Seol Jihu gave an insipid smile.", "“Alright, if you can succeed, I’ll let you hold onto that bow for a long time.”", "Marcel Ghionea’s eyes sparkled instantly.", "“I’ll see to it that it is a success! As for Miss Phi Sora, I’ll talk to her before night falls.”", "“Thanks!”", "Marcel Ghionea then left the office, saying he needed to go shopping for the mission.", "“There. I just gave you a safety device.”", "Seol Jihu got up slowly and put his hand in his pocket. He tossed the round object he grabbed, and an orb rolled to Pavlovici’s knees.", "“You can use that communication crystal to call me.”", "“….”", "“Should I try predicting the future?”", "Seol Jihu spoke playfully on purpose.", "“Mister Pavlovici, you and your brothers will soon encounter a situation where you will have to make a choice.”", "Whether to change their destiny or accept their fate.", "“If you want to live… you’ll know what choice to make.”", "Speaking with a clear, silvery voice, Seol Jihu turned around.", "“That’s it then. We’ll continue next time we meet.”", "He was clearly chasing them out. He didn’t even look at them, as if it didn’t matter whether the brothers took the communication crystal or not.", "Pavlovici’s gaze slowly fell on the orb in front of him.", "Soon…", "Bow. Pavlovici lowered his head before tightly holding onto the blood-stained crystal.", "Almost as if it was a new life.", "*", "Under Seol Jihu’s permission, the four of them left Carpe Diem’s office after being treated by a Priest.", "“Ah— I really don’t get it!”", "And unsurprisingly, Chohong, who wasn’t aware of the details, exploded in anger.", "“Fuck, it’s already a miracle that they made it out of here alive, but what? You even healed them? Lookie here, we’ve got a saint!”", "“Seol, I don’t mean to intrude on your authority as the leader, but I just can’t agree with this. This isn’t it. I don’t get it.”", "Hugo became uncharacteristically serious and supported Chohong. Even Phi Sora snorted as if Seol Jihu was a kill-joy.", "“Quiet, all of you!”", "Jang Maldong roared, unable to bear the sight of their bickering, but Chohong yelled back instead.", "“Quiet? Why should we? You saw it too, old man! This son of a bitch just—!”", "“This son of a bitch?”", "Jang Maldong’s eyebrows perked up.", "“I know this is a small team, but it sure has turned to shit while I was gone!”", "“I-I mean! You saw what he did! How does this make any sense!?”", "Chohong smacked her chest as if the entire situation was frustrating her to death. But not caring about her outburst, Seol Jihu simply giggled and happily smoked his cigarette.", "Chohong grit her teeth ferociously and plopped down next to him as if to devour him alive.", "“Hey, just what were you thinking letting them go like that?”", "“Nothing. It’s just that I felt bad killing them when they were apologizing so sincerely. You know, it made me all uncomfortable.”", "Chohong’s face turned red with anger at Seol Jihu’s carefree explanation.", "“Jesus, I’m gonna go crazy. We’re perfectly justified, no one is going to bat an eye even if we kill them. You think people will think you’re kind because you let them live? Did you get infected by a goody-two-shoes virus? Hey, Ghio! Say something too! Wait, where did that son of a bitch go?”", "Turning her head left and right, Chohong growled once again.", "“Listen, man. This is going to make people think you’re a pushover, a gutless idiot. You think that’s it? Even the enemy will see this and mock you as a retard!”", "“That doesn’t sound that bad.”", "Seol Jihu spoke calmly. Chohong furrowed her brows.", "“Wha, what did you say?”", "“I’d love it if they thought that.”", "After replying calmly, Seol Jihu didn’t say anything else. He simply closed his eyes and smiled, fully revealing his teeth.", "At that moment, the room suddenly turned silent.", "“….”", "“….”", "When a stifling silence suddenly fell in the once clamorous office…", "“?”", "Seol Jihu opened his eyes and looked around.", "Everyone was staring at him.", "Just like when he refused to return to Earth after being discharged from the temple, their eyes were calling him out for acting strange.", "“What? Why?”", "When Seol Jihu made a confused expression, Chohong slowly closed her eyes and then opened them back up.", "“Hey, did you just…”", "“I’ll take my leave.”", "At that moment, Agnes got up from the couch.", "“I’ll see you off.”", "Normally, she would have said it was fine or that he didn’t need to. But this time, she didn’t say anything.", "The moment he walked out the door, he could hear Phi Sora shout, “See—! I told you that guy has a split personality!”", "‘What the hell is she on about?’", "Seol Jihu closed the door while grumbling. Then, just as he was about to say something to Agnes—", "“Close your mouth.”", "A cold voice rang out.", "Seol Jihu’s eyes widened slightly. Was she mad because he released the Alexei brothers she worked so hard to capture?", "Naturally, that was the first thing he thought of. But Agnes was only now starting.", "“Drop your head a little and loosen your pupils too. Try to remain as expressionless as possible.”", "The odd pressure behind her words forced Seol Jihu to follow her demand. Agnes then turned back to Seol Jihu and smiled lightly.", "“That’s better.”", "“?”", "“From now on, wear that face when you’re talking about something that you can’t tell others about.”", "What did that mean?", "“Loosen your shoulders if possible and straighten your clothes too.”", "When Seol Jihu tilted his head, Agnes dusted off his shoulders and straightened his clothes for him.", "“…In Paradise, martial prowess isn’t the be-all, end-all. A person’s face, expression, glance, gesture, appearance, and even the sound of their breathing… some can synthesize even the tiniest information to guess someone’s intention. This is an ability recognized by the Seven Gods, and some have even been promoted to a High Ranker because of it. Miss Foxy is one such example.”", "With that, Agnes clasped her hands in front of her skirt like she always did.", "“If you have time, try taking acting lessons. I’m sure it will be of great help.”", "“….”", "“Anyways, it hasn’t been that long since the war ended, yet you’re trying to start another one….”", "With a grin, she turned around.", "“What a shame. A war hawk like you is better suited to be in Sicilia.”", "Agnes walked forward.", "“It will be a long war. If we share the same enemies, Sicilia will be more than happy to cooperate. Good luck!”", "With these final words, she walked down the stairs modestly.", "“….”", "Seol Jihu quietly looked down at Agnes’ back before gently smoothening his face down.", "**", "After Agnes went back, Seol Jihu requested to hold a private meeting with Jang Maldong. Jang Maldong laughed, saying “Private meeting? Who’s the leader?”, but he didn’t refuse.", "“So, what did you want to talk to me about?”", "Seol Jihu waited for Jang Maldong to sit down before cutting straight to the chase.", "“I plan to create an organization.”", "Jang Maldong paused before replying as though he’d predicted as much.", "“That’s not a bad idea. So? I doubt you’re acting so serious just to say this.”", "“I plan to leave Haramark.”", "“…What? And go where?”", "“Eva.”", "Eva. That was— a surprise.", "Jang Maldong took in a heavy breath. He had instantly realized his plan after hearing the word ‘Eva’.", "It was clear why Seol Jihu wanted to move their base of operation. He was aiming for something much greater than just creating an organization. In that sense, Eva really was the best place.", "Rather, Eva was the only place.", "The seven cities that were under the jurisdiction of the Seven Kingdoms all had representative organizations, but Eva was in a slightly different situation than these cities.", "“Hm….”", "Jang Maldong maintained his silence for a long time. He had an idea where this was coming from. It was indispensable to achieve Seol Jihu’s goal, and the truth was that he had even been waiting to hear these words.", "The problem was the timing.", "“Is it because of the last incident?”", "“I can’t say it isn’t.”", "Seol Jihu continued calmly.", "“But I made up my mind after reading the records you gave me.”", "Jang Maldong’s eyebrows wiggled.", "“This incident, Yuhui Noona being attacked, and the records Master Ian wrote… I think these three things are closely related. Though I’m not sure, this disturbing feeling just won’t go away.”", "“I agree.”", "Jang Maldong nodded gravely. Then, he spoke in a deeper tone.", "“Jihu.”", "“Yes.”", "“The enemy is a monster.”", "“….”", "“There is a big difference in our strength, and they may be even trickier opponents than the Seven Armies because they are also human. This fight may affect your life on Earth too.”", "“I know.”", "Seol Jihu replied with a profound glint in his eyes.", "“But this is something that must be done.”", "Jang Maldong fiddled with his cane. It didn’t seem like Seol Jihu rushed to this decision, and he seemed oddly confident as well.", "He seemed to be asking, ‘So what should we do?’ To put it into words, he was acting like an adventurer, who had set out on a gamble.", "“In that case, I have three conditions.”", "Jang Maldong became curious where this confidence stemmed from.", "“I don’t think it’s right to leave right away. Setting aside spreading our influence, we need time to organize ourselves in a safe place.”", "“Of course!”", "“We need money too. A lot of it. We need to acquire enough funding to operate an organization.”", "“I’ll try.”", "“And lastly, this might be difficult, but I want you to win over another organization that can go with you. It can’t be just Carpe Diem. We need an organization that we can trust and rely on in case something like the last incident happens again—”", "“I already have one.”", "This time, Jang Maldong couldn’t be more surprised.", "“You already have one?”", "“Yes, I decided to join hands with the Triads. Mister Hao Win came to see me at the palace and made the offer.”", "The Triads!", "This changed everything. The Triads were thirsty for powerful Earthlings and Carpe Diem needed an influential force to back them up. The two groups would undoubtedly be a perfect match.", "Jang Maldong chuckled.", "“If that’s true… then there is only one thing left to do.”", "“Another one?”", "“What do you mean, another? Don’t you think we ought to change our name?”", "Jang Maldong grinned.", "“Your goal doesn’t really align with ‘seize the day’. Since this is an organization for you, think carefully about what to name it.”", "“Name…”", "Seol Jihu nodded his head, thinking that this wasn’t such a bad idea.", "“Anyways, I understand your goal. It looks like you have made up your mind, and I don’t see a reason to stop you either.”", "Jang Maldong got up.", "“The Triads… Carpe Diem and the Triads…”", "Muttering to himself quietly, Jang Maldong walked toward the door before suddenly stopping.", "“Let me ask you one thing.”", "He then asked as if he suddenly got curious.", "“Once you amass enough influence and consolidate enough power… And you find out who is behind all this, what do you plan to do then?”", "Though it was only for a split second, golden light flickered within Seol Jihu’s pupils.", "He slowly clasped his hands together, then dropped his head.", "He vowed at the Banquet.To not search for the gold color.But to become the Golden Commandment himself.", "Meaning, Seol Jihu was the Golden Rule, and the Golden Rule was Seol Jihu.", "Seol Jihu buried his nose between his interlocked hands and spoke in a low voice.", "“…I’ll show them.”", "The engine that had cooled down after the war…", "“That I am, Seol Jihu.”", "…began to heat up thunderously."]}