{"cid": "326", "title": "Chapter 326. Immediate Battle (5)", "content": ["As the green energy began to seep into the Unicorn’s outer skin, Seol Jihu pushed his spear in deeper while rousing the power of Soma.", "Thinking that this was the end, he exerted the anti-evil energy to the limit.", "Eventually, as golden arcs of lightning crackled on the overflowing holy water—", "PZZZZZZT!", "\"KIAAAAA!\"", "The Unicorn’s mouth split open. Inside a blindingly dazzling burst of light, it shook and thrashed its body in a frantic struggle, screaming at the top of its voice.", "However, not a single thing went its way. Threads imbued with holy power newly flew in and bound the Unicorn’s forelegs again. As a result, the Unicorn became frozen in place with its forelegs and hind legs spread wide, and the lightning current frolicked around in the green sea like an excited child.", "\"Kuooooo….! Kuaaaa….!\"", "The Unicorn’s squirming died down just as quickly as its screams. Its previously grinning eyes rolled back as it clearly looked to be on the verge of losing its consciousness.", "However, Seol Jihu did not drop his guard. His comrades had exhausted their power to create this single opportunity for him.", "The golden light surging around him already demonstrated that he was using the anti-evil lightning to the fullest, and he had no plans to pull his punches.", "And so, just as he was about to scrape up every ounce of mana in his body, risking potential damage to his mana circuit, Seol Jihu suddenly received a strange sensation.", "‘It’s being pulled in?’", "The lightning current that was running around like a playful child abruptly became orderly. Then, it suddenly stopped dancing and was sucked in one direction like a child answering its mother’s call.", "Taken aback by this sudden phenomenon, Seol Jihu cast an upward glance.", "The attack wasn’t over yet. The holy water’s aura shot up like a fountain and began to take shape. It split into twenty-six streams, spread out like a discus, and slowly rolled up from opposite ends.", "The final shape was that of a flower. The twenty-six streams of holy water came together and bloomed into a lotus.", "Next, as it absorbed the lightning current that was flowing in, a truly wondrous golden lotus flower bloomed.", "And thus.", "Boom!", "As one petal exploded in a terrifying flash of light—", "\"Kurarararararara!\"", "The Unicorn that was nearing its death once again rampaged in madness. It shook its head in all directions, reeling from pain as the lotus flower exploded inside its body.", "Meanwhile, the petals continued to explode one by one, raising a storm with extraordinary explosions.", "Seeing this, Seol Jihu narrowed his eyes. The light from the explosions was so intense that it was dyeing his vision white. Due to its fierce intensity, Seol Jihu worried he might lose his sight.", "Even the threads imbued with holy power were about to melt like wax under the sun.", "Glancing to the side, Seol Jihu saw Baek Haeju glaring fiercely with her hands pressed together. She was in deep concentration, sweating profusely with her mouth firmly shut.", "Seol Jihu also clenched his teeth and gripped the Spear of Purity. Once the twenty-six petals of the lotus flower all bloomed, the periodic explosions halted.", "Immediately afterward, the swaying horse head stood erect.", "\"Keeeeeeeeu!\"", "With heavy pants, Raging Temperance’s eyes lit up.", "Baek Haeju quickly shouted.", "“Get back!”", "In the next moment, the six Warriors who rushed in, including Baek Haeju and Seol Jihu, fell back simultaneously.", "At the same time, the Unicorn raised its forelegs and began to stomp down crazily.", "Boom, boom, boom, boom!", "Even after taking dozens of steps backward, intense vibrations could be felt under their feet. Although the Unicorn was attacking blindly without a clear target, it was still incredibly powerful.", "“He still has so much energy…?”", "“No.”", "When Chohong sighed with an exhausted look, Baek Haeju shook her head in denial.", "“A candle burns the brightest right before going out.”", "Hearing the calmness in her voice, everyone gazed at Raging Temperance. After finishing its short final struggle, the Unicorn was left in a sorry state that was hard to watch.", "Its bulky body had cracked up and was now looking grotesque like a deflated balloon. Its beautiful white hair had burned to a crisp, exposing a barren hill, and the way parts of its body were stained black, pus mixed with blood must have flowed out before being cooked by the flames.", "\"Uwuk, uwuk, kuwuk, kuwuk!\"", "It even started to dry-heave while dragging its four legs. It was easy to see that it wasn’t in the best condition. The expedition team’s killer move had done its job.", "Next, as if to prove this conjecture, the Unicorn’s legs buckled and it plopped down.", "Chohong’s complexion brightened.", "“Is it dead?”", "“Aaaaaaaah! Shut up! Take what you said back right now!”", "Hoshino Urara threw a fit as soon as Chohong asked.", "“Don’t you dare plant such a shitty death flag!”", "“What?”", "“Come on, if you say something like that, this bastard is gonna come back to life, saying something like, ‘Uhahaha! Not bad for a bunch of humans! I will show you my true power now!’ Don’t you watch movies!?”", "Hearing this, everyone shut up. They knew she was joking, but a part of them couldn’t help agreeing with Hoshino Urara.", "“…There’s no way he’s dead yet.”", "Baek Haeju sighed while watching the vomiting Unicorn.", "“Each Parasite Army Commander was bestowed with the power of a god and cannot be looked down on. Even if we get lucky and force them to the verge of death, they can always use Divine Manifestation as a last resort.”", "“Oh right!”", "Hugo did a double-take and asked in fright.", "“T-Then shouldn’t we hurry and finish it off? Before he uses that Divine Manifestation thing…”", "“No.”", "However, Baek Haeju shook her head once again.", "“Each Army Commander had a different degree of success in absorbing the divinity they were given. The more they failed to digest, the bigger the surge of power is when they release it. We have to be wary of being swept away by this terrifying storm. I can’t remember how many Earthlings died like this.”", "Hearing this, the vomiting Unicorn flinched. The way its burned, scar-filled face contorted, it must have been planning on doing this.", "\"You… you… you cowardly little bitch!\"", "It tried to stagger up, but ultimately fell back down. Hugo shouted again.", "“Then what do we do!?”", "“Just wait. For now, save every last breath you can.”", "Baek Haeju spoke firmly as if she couldn’t be bothered to explain more.", "It just so happened that Seol Jihu expended his full power in the previous attack. He didn’t mind taking a short break.", "Feeling like the inside of his body was completely empty, he quickly collected his breath. Soon, a voice rang out in his head.", "—As you can see, it’s almost over. All we need to do is force Raging Temperance to release its divinity and then escape.", "Everyone’s gaze fell on Baek Haeju at her unexpected words. Hugo was about to insensitively inquire, but Oh Rahee quickly kicked his shin and shut him up.", "—The Army Commanders don’t have their divinities sealed for nothing.", "—Each individual of each race has a clear limit as a vessel. In the first place, it is extremely difficult and rare for a mortal to fully absorb the power of an immortal.", "As Baek Haeju said, an Army Commander did not release their divinity unless it was absolutely necessary. Although each Army Commander was different, they could only last ten to thirty minutes once they used Divine Manifestation. Once that time passed, they would need anywhere from several months to a whole year to replenish their strength and recover.", "Meaning, Divine Manifestation was an extremely inefficient skill that was only used as a last resort.", "—But once they fully release their divinity, their strength will truly be on par with a god.", "—Without an expedition team full of Level 7s or a defensive measure rivaling Tigol Fortress at its prime, facing an Army Commander in that state is no different than suicide. Instead, we have to run.", "—But this also means that we only have to wait out this time. Moreover, releasing divinity in a healthy state is totally different from releasing divinity with such injuries. In the latter case, they won’t be able to sustain the divinity for as long.", "—Plus, given that Raging Temperance has the word ‘raging’ in its name, there’s a good chance that it will lose its mind.", "Seol Jihu nodded. Baek Haeju was saying they should wait until the Unicorn released its divinity before scattering and running away, then coming back to finish it off once it ran out of time.", "Although the enemy might curse them for being cowardly, there couldn’t be a better method for them.", "With Philip Muller’s Teleport around, their victory was practically guaranteed.", "Of course, the Unicorn might, in a fit of rage, choose one or two targets to chase down, but Seol Jihu shook off this worry. He wasn’t in any position to be nitpicking every possibility.", "Seol Jihu looked at Baek Haeju, who was calmly taking in deep breaths. He couldn’t hide his surprise. It wasn’t a lie that she had the most experience out of any Earthlings. The tide of battle had turned with a single attack, just like she planned.", "Accurately identifying the enemy’s weakness in such a short exchange and giving an effective solution. Admiring this ability of hers, Seol Jihu steeled his resolve.", "‘Let’s just do whatever Miss Baek Haeju says.’", "\"Keuu…. Keuuuu….!\"", "The Unicorn glared at the expedition team while panting heavily. It should have released its divinity by this point, but it must be hesitating because it realized Baek Haeju’s plan.", "It only scratched the poor, blameless earth with its foreleg, stalling for time. Seeing this—", "“…Even if it’s dangerous to get near him, it should be fine to attack him from afar, no?”", "Marcel Ghionea aimed his crossbow. Drrrk. Once he shot his bolts, the remaining members joined in.", "Having recovered a small amount of mana, Seol Jihu formed several Mana Spears and threw them as well.", "He knew such attacks wouldn’t be enough to bring it down. It was only a show to force it to hurry up and release its divinity.", "The attacks must still be threatening due to the gravity of its injuries as the Unicorn hurriedly stepped back. However, it fell back down a moment later and was forced to curl its body like a bullied kid trying to protect himself from rocks.", "Before anyone noticed, its body had gotten smaller. It was in a pitiful state compared to how proud it was initially.", "“Come on! Hurry up and release your divinity!”", "“You know you have to! Let’s see what you’re made of!”", "The expedition team began to mock the Unicorn as they continually sent one mana-infused attack after the other.", "\"Heeeeu, heeeeeu! How can I… how can I…!\"", "In response, the helplessly cowering Unicorn raised its head. Gritting its teeth loudly, a bitter hesitation flashed on its face.", "Thwack!", "\"Uuk!\"", "But after being hit by Seol Jihu’s Mana Spear, it could no longer bear it and finally spoke.", "\"D-Dammmnn it! H… Help me!\"", "Seol Jihu doubted his ears.", "What did it just say?", "\"W-Why are you just watching!? Didn’t you say the Queen personally ordered you to come!?\"", "It was then.", "\"…How embarrassing!\"", "A quiet, silvery voice resounded.", "Seol Jihu, who was about to throw another Mana Spear, unwittingly paused.", "He wasn’t the only one. Each member of the expedition team stopped moving and froze like statues.", "It wasn’t just because they heard a mysterious voice out of nowhere. It was more so because of a frightening presence that suddenly swallowed the area wholly.", "\"I was half doubtful, but alas, the Queen’s worry was not unfounded.\"", "Seol Jihu looked up in a daze.", "A figure with twin horns on its head and a long tail stretching out from its butt was floating in the air and proudly looking down on the ground.", "To be more precise, it was glaring at the Unicorn, not the expedition team.", "‘Since when?’", "Seol Jihu couldn’t detect it at all. This also meant no one else noticed this existence, not even Baek Haeju.", "\"Who was the one who told me not to butt in? Didn’t you say you would take care of them alone?\"", "\"T-That’s…\"", "As the reptilian pupils of its bright, yellow eyes slit vertically, the Unicorn furtively lowered its gaze and turned its head.", "\"Hah, I thought you were a fool who only knew how to be arrogant. Now that your life is in danger, you’re quick to sell off the little bit of pride you have left. What an embarrassment.\"", "Hearing the stern rebuke, the Unicorn’s face contorted with shame and humiliation. Its frustration was easy to see.", "The newly-emerged existence snorted, then pushed up its ivory-colored hair that flowed down like a waterfall.", "On the other hand, the expedition team was in a state of confusion. No one could open their mouths because of the strange goosebumps they were getting.", "This being’s presence was bigger than that of any other existence they had met. They could even feel a boundless, inestimable aura.", "This immense power was a cut above even Roselle La Grazia and Raging Temperance.", "At last, as their eyes met…", "“Run!”", "Baek Haeju, who had maintained her cool until now, surprisingly yelled out loud.", "Then, she launched herself like a flying tiger.", "Sensing an abnormal flow of air, Seol Jihu flinched. At the same time that a cool breeze blew past his neck, someone reached toward Seol Jihu from the sky.", "“Ak—!”", "He let out a yelp in the next moment. Looking back reflexively, he saw Baek Haeju with her arm raised. Her hand was in the shape of a blade as though she was planning to strike down on his neck.", "The problem was that she was standing stiff and doing nothing.", "She was trembling faintly in an awkward position as if something was binding her and preventing her from moving.", "\"Knocking him out and escaping with him against his will… I applaud your quick-thinking.\"", "Before Seol Jihu could figure out what happened, the figure in the air continued speaking.", "\"But since I’ve received an order, I can’t just let him go. Now that you’ve come all the way here, you’ll have to stay for a little bit.\"", "The figure clenched its open palm.", "“Kyaaeeu!”", "Baek Haeju’s grunt became louder. Her arms and the rest of her body began to slowly shrink.", "Once she barely managed to shake her arm with a heavy frown, the Tathagata Spear spun while emitting a green light. That must have freed her as she spat out the breath she had been holding in. However, the grimace on her face did not disappear.", "\"Oho, as expected of someone whose name is well-known to even the Army Commanders.\"", "The existence in the air looked slightly surprised. It retracted the hand it was reaching out with and dusted it off. Its expression was that of amusement and praise.", "“…No way.”", "At that moment, Philip Muller, who was staring with a stunned face, finally opened his mouth. His doubt seemed to become reality after seeing the existence using only one hand to toy with Baek Haeju.", "“No way, no way…”", "His voice quivered out as he failed to even form a proper sentence. He seemed to be rejecting reality or at least praying it was false.", "After a silence that seemed to last for eternity, Philip Muller spat out the words in his mind.", "“The Seventh… Army Commander… Twisted… Kindness….”[1]", "Although he stammered, the absolute silence in the surroundings helped his words get heard.", "The complexions of the expedition team members turned pale.", "While not much was known about the Seventh Army Commander, they had certainly heard some things about her.", "She was the last Dragon remaining in Paradise, the only Army Commander to have fully absorbed her divinity, and the only Army Commander that did not lead an army.", "Standing in front of her presence, they now realized that rumors about her were not exaggerated in any way. Their initial reaction to her description was a nonchalant, ‘I can see that being a thing.’ But now, they fully sensed how absurdly powerful this existence was.", "It was the same for Seol Jihu.", "Though they considered a second Army Commander being in the Spirit Realm, now that he was facing Twisted Kindness face to face, an indescribable sense of despair swept through his body.", "Going through great difficulties to find the spring and breaking through the Astral World to arrive at the Spirit Realm, they had expended a great amount of effort and were on the cusp of neutralizing Raging Temperance.", "But the light of hope that was in their grasp had suddenly flickered off.", "“Hmm, let’s see. Which one of you is…”", "And it was all because of the appearance of Twisted Kindness, the strongest of the seven Commanders, who even the First Army Commander, Undying Diligence, was said to be helpless against.", "1. So it turns out Twisted Kindness is female (not male, as I previously thought). I will be making that change going forward. "]}