{"cid": "18", "title": "Chapter 18. Rewards Befitting One’s Achievements (1)", "content": ["The morning sun rose up but classroom 3-1 remained still and quiet.", "The very first thing Seol did after waking up was to confirm that his Nine Eyes was still there; his vision became dyed in green before returning back to normal.", "Seol felt relieved after his ability activated without an issue. Then, he came to realize that there were three people missing from the classroom. The bespectacled middle-aged man hadn't been seen since last night, but now, both Yun Seora and Yi Sungjin were gone as well.", "'Where are they?'", "The time was 09:47 AM. There was still over two hours left until midday, so the Hour of the Deceased should still be active right now.", "'I'm sure they are fine.'", "Seol picked up his bag and the steel bar. Maybe because he and Hyun Sangmin ate a lot of food during the early morning hours, his innards were screaming out in bitter protest. Thankfully, toilets were located right near the stairwells of each floor, meaning the distance was rather mercifully short.", "After Seol took care of nature’s call and exited from the bathroom, he spotted Yi Sungjin walking down the stairs, looking visibly downtrodden. After spotting Seol himself, the boy hurriedly bowed his head.", "“Good morning, Hyung.”", "“Yes, good morning to you, too. Did you sleep well?”", "Yi Sungjin's smile seemed a bit awkward and weak as if he found Seol's politeness strange.", "“It's alright if you drop the honorifics, you know….”", "“Oh? That okay with you?”", "Seol stopped using honorifics right away; he also noticed the boy's anxious demeanor as well. It was as if Yi Sungjin wanted to hurry up and get going.", "“Still in the middle of the treasure hunt?”", "“….Yes.”", "“How many did you find so far?”", "“Uhm…. If I count the ones I found after waking up this morning, then it's enough to pay for my passage.”", "Considering the fact that Seol and Yun Seora had monopolized the majority of the coins, this amount was nothing to scoff at. Seol could imagine just how hard the boy must've worked to find that many.", "Seol carefully appraised the round, innocent-eyed teenager's face for a bit. Because of his slightly below average height and the baby fat still visible here and there, if he claimed to be a middle school freshman, anybody would be inclined to believe the boy. In hindsight, him hitting Kang Seok with a chair was a rather wonderfully mystifying act.", "“Thanks for your help last night. I made it because of you.”", "“Ah, that's not true. That hyung did most of the work, anyway.”", "Although the boy said so, both Yi Sungjin and Shin Sang-Ah combined their strength to knock Kang Seok out. The boy might not have come up with the plan, but his role in it was still considerable.", "“In any case, I didn't expect you to lend help.”", "“Of course I'd help. I too had to suffer because of him on the second floor.”", "“Oh? You did it out of revenge, then?”", "“No, rather than revenge…. I mean, he was deliberately indulging in only evil things. He had a really twisted, evil mind, you know?”", "Seol chuckled slightly after hearing the teen's declaration. Indeed, Kang Seok was an evil man. As if he had more things to say, Yi Sungjin hesitated and mumbled softly.", "“Besides…. I got a feeling that you would have resolved the matters by yourself, anyways….”", "“Mm? Why do you think that?”", "“I mean, you did kill that Gaekgwi monster so easily. And, also….”", "He hesitated again, before continuing on.", "“I kinda thought that noona was telling me to find you.”", "“Miss Yi Seol-Ah said that?”", "“Yes…. No, I mean, it's just my gut feeling. I'll ask her after I revive her.”", "Just the mere thought of his older sister must have made him happier because there was a radiant smile forming on Yi Sungjin's face. It was pleasing to see that the boy hadn't lost hope, so a warm smile also spread on Seol's face as well.", "“Yeah, I'm also getting curious, too.”", "Seol walked up the staircase. The boy's eyes dazedly chased after him going up. When Seol beckoned him to follow, Yi Sungjin hurriedly moved his legs.", "“I, I think there aren’t any more coins left on the fifth floor. And you don't have to….”", "“Nope. There are no coins left on the fourth floor for sure. But there should be four more left on the fifth.”", "Seol knew this because he had checked the Diary of the Unknown Student already.", "“Eh?”", "“Besides all that – how did you and your sister receive your Invitations?”", "Seol quickly changed the topic. Although Yi Sungjin tilted his head while looking unconvinced, he still honestly retold his tale in full detail.", "From the beginning when his mother was diagnosed with a terminal illness, and how the family had to go through a tough struggle for a while; how he had heard of a certain medicine that could cure the said disease existing in the 'Paradise' from the mouth of a person the family knew; finally, to how he and his sister got to receive their Invitations. When Seol asked about the matter of his schooling, Yi Sungjin mumbled some things and hurriedly glossed over it.", "Seol found the remaining coins while listening to the story, and the two of them headed off to the library next.", "The coins remaining in his possession was 885 – from the original amount of 1065, he gave 30 to Shin Sang-Ah, and he spent further 150 on trying to get the right medical supplies for Yun Seora. Now that there was no need to spend coins to open the sixth floor, even after deducting his passage fee, he could still freely spend 785 coins.", "“I'll try my best, but I can't give you any guarantees, okay?”", "Yi Sungjin looked like he still hadn't understood what was going on.", "“I have nearly 800 coins on me. The 'Revival' should be listed under SPECIAL, so I should be able to spin the machine twice.”", "Seol said as such while pushing open the library's door. Yi Sungjin's eyes grew very large.", "“H, Hyung?!”", "Belatedly regaining his senses, he quickly chased after Seol, but both of their steps came to an abrupt halt right afterwards.", "There was someone here already. On the floor around the item draw machine, twenty-odd coins were strewn about, and near them, the owner of the coins was squatting on the ground, her hood pulled up to hide her face. Her right arm hung limp.", "“Ah….”", "Yi Sungjin gazed on at this sight with pitying eyes, before he proceeded to pick up all the coins on the floor. Seol approached Yun Seora and asked her in a soft voice.", "“Are you feeling okay?”", "Her head buried between her knees trembled slightly. Seol thought she might be raising her head, but it turned out that she was just shaking it, instead.", "“Your right arm…. You can't move it? At all?”", "She silently nodded her head.", "“Uhm, here….”", "Yi Sungjin sheepishly entered into the conversation and cautiously reached out with his hands cupped together. Coins filled his hands.", "Finally, Yun Seora raised her head. She blinked her reddened eyes several times. Tear marks were still visible on her cheeks. Her slowly rising left hand trembled visibly to the naked eye.", "She received the coins with much difficulty and dropped her head again.", "Seol gently grasped the shoulder of the panicking and flustered boy. He then shook his head quietly, which led the boy to slowly nod his head in understanding.", "Seol then moved on, choosing to insert his coins into the machine in silence, instead. When he inserted the 300th coin, he could clearly hear Yi Sungjin gulping down a huge dollop of saliva. Seol looked down in time to see a familiar-looking item box fall down with a clung!", "[A quill pen of flowing consciousness, x1]", "'A quill pen?! What?'", "….Whatever it was, it definitely wasn't what he wanted. Which meant that he only had one chance left. Getting a bit more tense now, Seol began inserting more coins to the machine.", "The second SPECIAL he got was a box he hadn't seen before. His heart beat from anticipation as he opened the lid – only to find ten spell balls neatly arranged inside. Just to make sure, he picked each one up and carefully checked them out. Unfortunately, these balls seemingly weren't designed for things like reviving someone from the beginning. He found none that could help.", "“….I'm really sorry.”", "“I, it's fine. I know that you did this only out of your generosity….”", "Although he said that, Yi Sungjin was noticeably despairing. The higher one's expectations were, the greater the disappointment one would suffer – the teen was trying his best not to show it, but tears were forming on his eyes.", "But there was nothing either of them could do. The world didn't operate to their wishes and whims, after all. And all of the coins had been recovered by now, too.", "Seol was wondering how should he go about consoling the boy, but ended up flinching when a finger poked him on the ribs.", "“?! Oh, it was you, Miss Yun Seora.”", "She suddenly offered her hand.", "“Here….”", "She didn't speak for long, but it was clearly audible. And on her small left hand, a miniature bottle wrapped up in paper could be found. Seol dazedly stared at both of them.", "“This is the potion of revival.”", "It was the first time Seol heard her speak a proper sentence. There was a certain coldness to her voice, but it was also rather pleasing to listen to as well, just like a cool wind brushing past one's ears.", "“Are you… giving this to us?”", "“Yes.”", "This was unexpected. Why was this 'disinterest personified' doing an act of kindness out of the blue?", "As if she had read Seol's facial expression, Yun Seora tried to clear up her position.", "“I heard from the boy not too long ago. Yesterday….”", "When Yun Seora shifted her gaze to Yi Sungjin's direction, the boy got flustered and raised his voice.", "“I, I ran into her earlier during the treasure hunt! She, she asked me what was going on, so, I, uh….”", "While he was speaking up, Yi Sungjin's eyes were completely fixated on Yun Seora's offered hand.", "“Is it okay for us to receive this? What about your arm?”", "“This item won't work on a living person. You'll understand once you read the paper.”", "“….”Seol cautiously received the bottle. Her skin that came in contact with his was cold and very smooth.", "Yun Seora spat out a long sigh and brushed past the two males to leave the library as if she was finished with her business here.", "“I, uh, thank you so much!”", "Yi Sungjin shouted out loudly.", "“Thank you!! Really! Truly! Thank you!”", "Tears were already flowing out from the boy's eyes as he bent his back forward 90 degrees.", "“Thank you.”", "Seol too thanked her. She stopped walking, then.", "“….Me, too.”", "She then bowed slightly as well, before quickly leaving the library for good.", "'I guess she's a nice person, after all….'", "Seol tilted his head slightly, before quickly unwrapping the paper around the bottle. If he delayed any longer, Yi Sungjin might die of anticipation right in front of his eyes.", "[Requirements for usage]1. To be used on the Deceased only!2. A portion of the Deceased's body part.3. The cancellation of the state of insubordination for the Deceased – “death of the Gaekgwi.”", "“The first and the third requirements are met already, but… a portion of the body part?”", "“I know where to find that!”", "Yi Sungjin hurriedly pulled Seol along.", "The place the boy led them to was a laboratory. However, as soon as the boy enthusiastically jumped inside the lab first, Yi Sungjin screamed out in fright. Seol held the steel bar tightly and entered too, only for a shocked gasp to escape from his mouth.", "The middle-aged man, missing since last night, was lying on the floor – his body torn in half, from top of his head right down to his groin.", "“He, he wasn't here last night, though?!”", "Yi Sungjin fell even deeper into frightened confusion. However, Seol could roughly guess what happened here. Just by taking one look at that gruesome sight, it told him all he needed to know.", "'Did they hate him that much….? To kill their husband, a father, like this….'", "It was in stark contrast to Yi Seol-Ah, who allowed her younger brother to run away.", "“Sssuuunnnggg---Jjjiiinnn….?”", "An ear-grating voice came from the corner of the lab. Seol and Yi Sungjin spotted a figure squatting down there, just like how Yun Seora did back in the library. Checking the appearance of this figure, Seol's brows instinctively furrowed. It was his first time seeing a Deceased, and sure enough, it was as grotesque as he had imagined.", "“Noona!!”", "Yi Sungjin quickly recovered from the shock and jumped up and down.", "“You can live again!! Really!”", "“Llliiivvveee….?”", "“This hyung, this hyung got the potion to revive you!!”", "At the same time, Seol could feel his hand getting rapidly warmer. The miniature bottle in his hand began emitting bright light.", "He didn't know what to do next, so he simply removed the cork to see what might happen – then, the clear liquid inside the bottle flowed out by itself and slowly danced in the air.", "The way it wiggled like that, it seemed to be asking Seol who he wanted to revive. Seol pointed at Yi Seol-Ah. The liquid then smoothly flew over as if it understood his command. It disappeared as soon as coming in contact with the Deceased in the blink of an eye as if it got sucked in.", "Paat!", "A bright light exploded out from Yi Seol-Ah's figure. It was so blinding, Yi Sungjin near her had to squeeze his eyes shut.", "However, Seol could still see a blurry but amazing sight unfolding amongst the cascading rays of brilliant light. He saw her wounds slowly disappear, and new flesh grew to replace the missing parts.", "Then, with a sudden flash, the blinding light shower came to an abrupt end. At the spot where the light had died down, a girl was sitting on the floor, her eyes wide open and blinking non-stop. The previously-grotesque appearance was nowhere to be found, only to be replaced by the warmth and prettiness she used to have.", "Finally, Yi Seol-Ah had been revived.", "“N, Noonaaaa!!”", "Yi Sungjin ran as if he was flying and embraced his older sister tightly.", "The two of them must have more tears left to shed – Yi Seol-Ah remained confused for a while, but when she saw Yi Sungjin crying his eyes out, she too began sobbing as well.", "Seol quietly left the laboratory while closing the door behind him. It was a moving reunion, but he didn't belong there.", "He hesitated slightly, wondering whether he should leave them alone before he leaned against the door and crossed his arms. While listening to the siblings cry their hearts out, he fidgeted around with the steel bar.", "He was staying, just in case a Deceased overheard their cries and sauntered over here.", "*", "When Seol returned with the Yi siblings, chaos unfolded inside the safe zone. Hyun Sangmin was in the middle of chewing a piece of bread, but his jaw dropped so much that the piece actually fell out. Shin Sang-Ah's reaction wasn't all that much different from his.", "“Seriously now. The revival thing was all true.”", "After listening to a brief explanation, Hyun Sangmin laughed out loudly.", "Seol handed over a packet of food from the convenience store to Yun Seora as well as to the Yi siblings, who had been expressing their gratitude non-stop since from a while ago. Seol completely ignored their thanks and began roughly chomping on a convenience store riceball, as if he was completely fed up.", "When Hyun Sangmin threw him a questioning look, Seol finally relented and opened his mouth.", "“I heard them thanking me a thousand times while coming here. Now I understand why some people develop neurosis.”", "“Stop exaggerating.”", "“No, it's the truth. It started to get annoying around the 300th time they thanked me. I told them it's enough, but they won't listen.”", "Even then, the siblings were expressing their gratitude in a multitude of ways and gestures. Seol ended up facepalming, before pointing towards Yun Seora, who happened to be sitting away from them a light distance away.", "“Miss Yi Seol-Ah?”", "“Yes, yes! Thank you! I am truly grateful! How should I go about repaying your kindness? You revived me and helped me to meet my little brother again, so I'd like to somehow….”", "“Wait, wait. I got you. I hear you, but here's the thing – I didn't find the revival potion, but she did. She gave it to me.”", "Yun Seora stopped quietly biting into her sandwich and threw him a look of protest. Seol resolutely ignored her.", "“Is that true?”", "“Yes. If it weren't for Miss Yun Seora drawing the potion, reviving you wouldn't have been possible.”", "“Y, yeah! That's right, noona! That lady gave the revival potion to Hyung!”", "“Lady Yun Seora!”", "Yi Seol-Ah finally left Seol's side. He breathed out a sigh of relief and changed his target to Yi Sungjin this time. He pulled out 100 coins and handed it over to the boy.", "“Your noona's passage fee.”", "“…Ahh!”", "Yi Sungjin cried out as if he hadn’t thought about that until now.", "“Please, just stop.”", "Seol pleaded.", "“You don’t need to thank me. In fact, don’t even think to say thank you. You even mention 'tha' of 'thanks', I'm not going to give you these coins. Got it?”", "“….”", "“If you're grateful, then you quickly scoot over to Miss Yun Seora and tell her that. Just like your sister.”", "Yi Sungjin carefully received the coins with both of his hands. And, like a good boy, he did as he was told and after joining his sister, combined together with her to land as many attacks of gratitude on poor Yun Seora as possible.", "Only after somehow taking care of the crisis did Seol get to enjoy his meal in peace. Shin Sang-Ah and Hyun Sangmin simply giggled while watching this unfold.", "“I might die of laughter here, you know? Just look at Miss Yun Seora's expressions.”", "“Yeah, that's quite something else, really. By the way, hey man. How many coins do you have on you now? Besides the passage fee, that is.”", "Seol replied '85'; Hyun Sangmin used his eyes to send him a signal, telling him to look to his side.", "A trio of a man and two women couldn't participate in the relaxed mealtime, and they could only look on in daze from the corner of the classroom. Seeing them, Seol quietly asked Hyun Sangmin.", "“Aren't they going to have a meal, too?”", "“Oh, please. Why should I waste my precious food on those guys? Well, if they were my comrades-in-arms, sure, I might have spared some.”", "Even Shin Sang-Ah nodded her head in agreement.", "“And, also…. Not too long ago, they asked me if I could spare them any coins.”", "“Ah, that's right – their passage fees. They are short by how many?”", "“All three of them combined, around twenty, maybe thirty.”", "Hyun Sangmin whispered the information, before snorting out in dissatisfaction.", "“What a bunch of shameless fools. Hey man, you aren't thinking of helping them out, right?”", "“Don't help them. Like, never.”", "For some reason, even Shin Sang-Ah piped in with a small voice.", "After the incident on the second floor, her relationship with the trio had been soured somewhat. If they were like Yi Sungjin who at least tried to open the metal barrier, then who knows. However, as it was now, Shin Sang-Ah couldn't forget the looks of 'it'll be fine as long as you're not one of us' they gave her as soon as Kang Seok made his offer back then.", "Even putting aside the fact that they actually didn't do anything at all, she lost what little favorable impression she had, from their selfish desires to survive at someone else's expense.", "Seol didn't reply. Instead, he pulled out the remaining coins and handed them over to Hyun Sangmin.", "“Mm?”", "“You use them. There's still some time left before midday.”", "“You want me to spend them? On the draw machine?”", "“If you're scared of the Deceased, then don't. However, I haven't spotted a lot of them so far.”", "Hyun Sangmin's expressions became rather strange just then.", "“What the… I can really spend these?”", "“I'm telling you, yeah. You can.”", "Seol didn't have anything else to draw from the machine, anyways. Also, since he had peeked into Hyun Sangmin's Status Window, Seol figured it would be smarter to look after him every now and then. Not to mention, if it weren't for Hyun Sangmin, Seol might not have been able to kill the Gaekgwi, so this was sort of a reward as well.", "“Seriously? You aren't gonna say anything about how I spend these, right?”", "“Use them or throw them away – do whatever you feel like.”", "Since Seol said as much, there was no reason for Hyun Sangmin to refuse. With the coins in hand, the expression on his face resembled a naughty kid about to pull a prank. He then sneaked a glance to his side and left the classroom, his steps full of swagger.", "“Let me go with you!”", "Shin Sang-Ah stopped her meal and chased after him. The trio glared at Seol with resentful eyes and then, also left the classroom, clearly running after Hyun Sangmin and Shin Sang-Ah.", "Now that those three had seen the coins exchanging hands, they no doubt would beg for some of them. Seol sniggered and began enjoying his meal in peace for a bit while spectating on Yun Seora and her troubles.", "However, he nearly toppled over from his seat when the Yi siblings abruptly returned to his side instead. Yun Seora was ignoring them outright in the beginning, but in the end, even she couldn't endure and chased them away, while almost blowing up in anger.", "However, didn't the old saying go something like 'even if the heavens fell, there would always be a spot for one to stand up?'", "[A message from the Guide has arrived.]", "Before long, the midday had arrived.", "The message told them to gather on the sixth floor.", "*", "When Seol got to the sixth floor, he ended up feeling rather disappointed. He was wondering what kind of layout he'd get to see, but as it turned out, the sixth floor was just a normal rooftop.", "There was a round portal glowing in faint red light set up in the middle of the roof. The Guide, Han, and the blonde maid were standing next to the portal and waiting for the arrival of the survivors.", "“Hee-yeah. Yes, yes! You've all finally arrived. I must congratulate you on successfully passing all of your missions.”", "Han gave them a formal greeting. He also looked like a happy man today as well. So much so, he felt like a somewhat different person from the Han of the assembly hall.", "“Very good, very good! Now that everyone has gathered here, allow me to officially announce the completion of Area 1's Tutorial!”", "Clap, clap, clap, clap!", "The blonde maid silently clapped her hands. Of course, no one else followed her example.", "As the awkward atmosphere descended on the rooftop, Seol was realizing there was a slight inconsistency to the Guide's declaration.", "'Is this everyone?'", "Because there were only six people on the rooftop. The trio of the man and two women were nowhere to be seen.", "“From the beginning when 38 lives started this journey….”", "While Han started gushing on and on about something, Seol approached Hyun Sangmin who was whistling out in a carefree manner and asked softly.", "“What happened?”", "“Mm? Oh, you mean, with the coins?”", "“Those three people. Did you kill them?”", "“What? No! ….I gave 55 coins to Shin Sang-Ah. I told her to draw whatever. And whatever she got, we split down the middle.”", "“And the rest?”", "“….I'm sure you all wish to enter the portal right away, but regrettably, you will have to wait a little longer. We need to complete the setting of your dispositions, and also…. Most importantly, we need to distribute the completion bonuses as well.”", "Han was still in the middle of his speech. Hyun Sangmin stared at the Guide who seemed to have finally gotten around to the main topic while whispering in a low voice.", "“So, what do you think I did?”", "“?”", "“If you promise me not to get mad, then I'll tell you.”", "“I promise.”", "“I threw them away. All thirty coins.”", "Seol doubted his own hearing, then.", "“You threw them away?”", "“That's what I said. I chucked them down the toilet bowl and flushed them away.”", "Hyun Sangmin lowered his sunglasses. Even his eyes were smiling now, too.", "“Not only that, I did it while they were looking on! Dayum! What a shame. I wish I could've stayed and watched them throw a tantrum.”", "Hyun Sangmin continued to giggle away."]}