{"cid": "443", "title": "Chapter 443. The Star Sets in the Valley (2)", "content": ["Having crossed the Hiral Mountain Range, the Federation’s troops were in the middle of a fierce battle.", "They were advancing while fighting wave after wave of the Parasite army, but the situation was not good. Not only was it difficult to fight within the Parasite Queen’s territory, but it was also because the enemy troops were focused on delaying their march.", "Then, after a certain point, they began to rush forward as they normally did. According to a report delivered by the scouts, a large clump of the Parasite army deep inside their territory had just started to spread back out.", "“We’re retreating.”", "Realizing that they would end up besieged, Gabriel decided without a moment of hesitation.", "“We’re retreating?”", "A bespectacled, young man raised an objection.", "It was Philip Muller. He had run into the Federation’s forces by pure chance and realized that something was off about the situation.", "As Eun Yuri was in a critical state, he requested Marcel Ghionea to take her back while he began to move with the Federation.", "“No way. It’s only been a few days.”", "“It’s not just a few days.”", "With a melancholic voice, Gabriel brushed aside Philip Muller’s objection.", "“It was ever since you invaded the Empire’s territory… To think the Parasite Queen would go this far….”", "Quietly muttering to herself, she tilted her head back.", "“The star….”", "After looking up at the sky for a while, she heaved out a deep sigh and lowered her head.", "“It’s too late….”", "With a mourning lamentation, she turned around.", "*", "“Didn’t you say we’ll be safe once we cross this mountain?”", "Crossing a rugged mountain, Phi Sora spoke as she wiped the sweat off her forehead.", "“We should be as we’ll only be three or four days away from the border region.”", "Hoshino Urara replied unenthusiastically.", "“The first week was decently fun, but we haven’t run into any enemies for a while now!”", "“Are you complaining that you weren’t able to use us as throwaways?”", "Phi Sora shot back.", "“Just ignore her.”", "Chohong giggled as she followed them from the rear.", "“What’s there to be angry about? Just be glad we’re all alive.”", "“But still…”", "“I didn’t think we’d make it out of there alive. We got lucky.”", "Chohong spoke lightheartedly as if she couldn’t believe they escaped from hell alive.", "“Lucky, huh….”", "Phi Sora tilted her head doubtfully.", "“Well, we might have gotten lucky… but I wonder if it was the same for the other groups…”", "Chohong’s expression turned serious at Phi Sora’s murmuring. She was so happy to have survived that she did not think of her comrades.", "“Do you have a communication crystal?”", "Hoshino Urara shrugged at Chohong’s question.", "“I have one.”", "Phi Sora took out a transparent crystal orb from her pocket.", "“Where does it connect to?”", "“Where do you think? Valhalla, obviously.”", "“I don’t see a blue light… We didn’t get any calls?”", "“Who would call us? They don’t know what situation we or any of the other parties might be in. Unless one of the escaping groups contact them first, they won’t dare call us.”", "A few Parasite species were sensitive to mana. If they were discovered by the enemy because of an untimely call, how tragic would that be?", "So even if the reserve forces found out about their situation, they wouldn’t call the expedition team so recklessly.", "“Why don’t you give it a try? As Urara said, we haven’t run into any Parasites for a few days.”", "“I guess that’s true….”", "Phi Sora hesitated while fiddling with the communication crystal. Then, with a deep breath, she infused her mana into it.", "Woong!", "The communication crystal shone with bright light in less than a second.", "*", "Same time.", "The group consisting of Teresa and Yi Seol-Ah, led by Wu Lei, were about to escape the Empire.", "The three of them were in a similar spot.", "The tension was high for the first week. They ran into the Parasites’ forces several times per day. At times, they ran into them once every two or three hours. Going back a day’s worth of distance was normal, and there were even times when they had to remain in hiding for an entire day.", "If it weren’t for Wu Lei’s intuition-like instinct and Aura’s danger-sensing ability, they would have been discovered at least once.", "After seven days, the frequency of the Parasites’ appearances plummeted. A day or two after that, they were nowhere to be seen.", "It was also around this time that Teresa, who was resolved to die with a 99.9 percent chance, began to develop hope. Whether it was by heaven-defying luck or pure coincidence, they had crossed dozens of dangerous situations and were close to making it home.", "“We’ll be at the Delphinion Duchy’s border in a few days.”", "Teresa spoke as she led the way.", "“Once we cross the border, we’ll be able to breathe easy. Although we will still be in the Parasites’ territory, it won’t be under the control of the Parasite Queen.”", "Though her voice was laden with profound exhaustion, her bright tone gave a glimpse into her hope of making it back alive.", "“Once we cross the border, we will be able to get away from this energy-draining phenomenon too…. But don’t let your guard down until then.”", "A smile emerged on Yi Seol-Ah’s deeply enervated face.", "“Right, the Parasites are good at appearing out of the blue just when you think you’re safe….”", "“I appreciate the warning, but…”", "At that moment, Wu Lei broke his silence.", "“I think you jinxed us.”", "Teresa and Yi Seol-Ah stopped walking simultaneously.", "“Shit! I knew I should have kept my mouth shut! Aura!”", "Yi Seol-Ah spat out a curse as if she was used to it by now. She then sent Aura flying up while looking around in a hurry.", "Though they had yet to estimate the size of the enemy force, it was probably better to hide than to fight in their current state.", "However, the information that Aura brought back shortly afterward was not what any of them expected.", "“…It’s not the Parasites?”", "It was news that the army marching in their direction was not the parasites but the humans.", "The three of them ran forward, half in doubt, and soon confirmed the truth. A large human army was crossing the Delphinion Duchy and advancing into the Empire.", "They too, seemed to have noticed the trio as the front line forces immediately turned in their direction. At the same time, a magic circle formed in front of them, and a figure appeared.", "“You were alive.”", "The figure, Taciana Cinzia, spoke with a somewhat somber look.", "“So that confirms another party’s safe return…. I hope you understand. We can’t contact the parties first since we don’t know what situation they’re in.”", "Cinzia apologized in a low voice.", "However, neither Wu Lei, Teresa, nor Yi Seol-Ah was listening. Theyweren’t thinking straight ever since they discovered the allied force.", "They had expected to endure for a few more days at the very least. Never in their wildest imagination did they think the rescue team would come and greet them.", "No, the army was too big to be considered a rescue team. It was understandable given that the expedition team had entered the heart of the Empire, but the army still seemed too big.", "“My god, did you come here to wage war?”", "Teresa asked, having noticed a few suspicious points while making their escape.", "“…Let’s just say we were committed. We were determined to fight if need be.”", "Cinzia replied a moment later.", "“We set out as soon as we could after finding out… but it was already too late. Going to Arden Valley was still impossible with a quickly formed rescue team, so we gathered our troops and prepared supplies….”", "She heaved out a deep sigh in the middle of her sentence.", "“…But it was just too late. The Federation said they would be retreating as well. I’m sorry.”", "Cinzia apologized yet again.", "Teresa’s complexion, who had been enraptured with joy, quickly sunk. Saying they were committed and determined in the past tense… saying that the Federation was retreating… Teresa quickly picked up on the oddity and carefully asked.", "“About the other groups….”", "Cinzia did not reply. She only activated a communication crystal and handed it over silently.", "—Boss?", "A voice rang out just as Teresa took the crystal in a hurry. Agnes’ face appeared on the crystal.", "“Miss Agnes?”", "—You’re….", "Agnes’ eyes widened before she nodded.", "—The fact that you’re calling me on this communication crystal must mean that you met up with the reinforcements. Congratulations on making it back alive.", "“Thank you. We’re all safe. What about your group?”", "—We joined up with Miss Baek Haeju’s group in the middle. We’re currently heading over.", "“Really?”", "Rather than replying, Agnes moved her communication crystal to show Baek Haeju’s group.", "This naturally meant that the Imperial Oath was safe.", "—Unfortunately…", "Agnes paused before smacking her lips.", "—Anyways, with this, five… no, six of the seven groups’ safe return has been confirmed. We just received news of Miss Hoshino Urara’s group’s safe return.", "“Six groups…?”", "Teresa’s eyes narrowed. Of course, it was a good thing that so many people returned alive, but… there were just too many.", "Wasn’t the escape plan formed on the basis of five teams getting annihilated with the other two teams only having a chance of escaping?", "“Can you tell me what happened?”", "—…Of course.", "Agnes spoke with a slight hesitation in her voice.", "Baek Haeju, Philip Muller, White Tiger, and Hoshino Urara… Teresa’s face distorted as Agnes called out the teams that came back.", "“What about… the remaining group?”", "Agnes closed her mouth.", "“Did, did you not hear anything from them?”", "Teresa’s voice was trembling before she noticed. She thought things worked out well, but now that she looked at it, she seemed to have missed something important.", "“With Agnes’ group… Seo Yuhui separated half-way.”", "At that moment, Cinzia broke her silence and spoke up.", "“She supposedly felt that something was off and went her separate way.”", "Teresa looked back at Cinzia with a dazed face.", "“Then, a phoenix and a ghost apparently delivered the unconscious Seo Yuhui to the royal palace before going back. That is all we know.”", "Little Chick and Flone should have been in Seol Jihu’s group.", "Just then, a particular thought struck Teresa’s head like a lightning bolt.", "“…Don’t tell me.”", "Teresa immediately shoved her hand in her bag and rummaged through it. The bag had been giving off heat without her even realizing it.", "Then, once she took something out of her bag, her eyes widened and her jaw dropped.", "Observatio Vitae. It was a contract that allowed one to view the lifeforce of the contractor. Teresa had once asked Seol Jihu to sign one as a means of confirming his safety before he left for the Spirit Realm expedition.", "And this contract… was burning at a fierce rate.", "“Ah….”", "Teresa crumpled and flapped the paper to try to extinguish the fire. But nothing she did affected the blaze. In fact, it only got stronger over time and ate away at the paper.", "“No….”", "She refused to believe what was happening. Right, didn’t the same thing happen in the past? The Observatio Vitae had burned until only a small piece remained on numerous occasions. So, Teresa believed it would regain its original form before long, just like it always did.", "However, contrary to Teresa’s wishful thinking, the blaze burned up the contract completely.", "“No…!”", "Quickly and swiftly, before anyone could do anything about it.", "When even the tiny corner of the contract burned to cinders, Teresa’s pupils shook noticeably. Next, her expression sank in despair, and her breathing became rough.", "She had thought that something was off for a while now. Simply getting lucky wasn’t enough to explain what happened.", "That was what she thought, but…", "“….”", "She now realized that everyone could escape safely because one person was shouldering all the weight alone.", "She understood why Cinzia apologized.", "At that moment, a cold wind brushed past Teresa’s hand. The pile of ash in her clenched hand scattered into the air.", "“Eu… Ah….”", "Strength left her body as an indescribable sense of emptiness filled her. Her legs went limp, and she plopped down amidst the fluttering ash.", "“Euu…. Uaah…. Huaaa….”", "A choking voice flowed out of her agape mouth, and tears welled up in her eyes.", "“Why, why….”", "A stream of tears and then a second flowed down her gradually contorting face.", "“Why did you come so late…!?”", "In the end, she shouted resentfully and burst out crying.", "“If you had come earlier…! If you hadn’t taken so long…!”", "Teresa tilted her head up and wailed loudly. Wu Lei and Yi Seol-Ah, who had yet to understand the situation, stared at the crying Teresa dumbfoundedly.", "However, Cinzia’s expression was different as she had been entrusted with the Observatio Vitae once before during the Tigol Fortress War.", "“How much did he… all alone…!”", "A sorrowful wail resounded in all directions.", "Cinzia closed her eyes.", "And….", "*", "—Heuaaaaaaaaa!", "A sorrowful cry echoed out from the communication crystal. Baek Haeju, who was staring closely at Teresa, abruptly turned around and began to run.", "“Miss Baek Haeju?”", "Agnes noticed her rushing off and called out, but Baek Haeju had already become a small dot in the distance.", "Baek Haeju still wasn’t sure. She refused to come to a hasty conclusion until she confirmed Seol Jihu’s death with her own eyes.", "But when she saw the white paper burning up and Teresa crying like a deranged person, an inexplicable sense of foreboding crept up in her heart.", "‘At this rate…’", "It’s going to be too late.", "Baek Haeju bit her lower lip. While urgently running, she took out the communication crystal, hoping that the worst-case scenario she was imagining wouldn’t be true.", "‘Please, please…!’", "Infusing mana into the communication crystal, Baek Haeju traversed the area at a frightening speed.", "*", "Flone found Seol Jihu while she was making her way back to where they separated. She discovered a trail of blood and followed it, and lo and behold, she was able to find Seol Jihu collapsed at the foot of a hill near a valley.", "She also saw Little Chick next to him. Flone shouted in shock the moment she saw Seol Jihu. She quickly approached him while tightly clutching onto the pendant.", "Looking more closely, he was in a much worse state than she expected.", "[Are you okay? Hm? I’m here! I’m heeere!]", "She shouted in a fluster, but Seol Jihu did not reply. Even when she shook him, he only clunked around like a puppet with its strings cut. Never mind a semblance of lifeforce, Flone couldn’t even feel his soul.", "[I, I’m here…]", "Flone’s expression paled as she looked down fixedly at Seol Jihu. Having experienced death once, there was no way she didn’t understand what happened. It was just that she couldn’t accept it so easily.", "[W-What happened?]", "Flone looked back at Little Chick.", "[He’s not dead, right? Right?]", "However, Little Chick didn’t answer.", "“I’m fine…. I’m totally fine…. I’ve experienced my partner’s death many times already….”", "The small chick only murmured quietly with its body curled up in a ball.", "[I, I came too late, right?]", "Not knowing what to do, Flone first pulled Seol Jihu up.", "[Let’s go!]", "Hugging his cold body, she urged Little Chick.", "[What’s there to be so depressed about? We just have to heal him! So let’s go back quickly…]", "Paat! A light flashed.", "Flone, who was about to climb the hill with Seol Jihu, paused.", "[A-Aren’t you coming?]", "When she slowly looked back…", "[….]", "She didn’t see Little Chick. She only saw a small egg.", "Coming face to face with the harsh reality, Flone slowly scanned her surroundings.", "A cold, chilly corpse, a crimson spear drenched in blood, and a red egg sitting in the middle of nowhere….", "Flone stood in place for a long time…", "[…Agh, I’m already pressed for time.]", "And then went back and picked up the egg.", "[Oh yeah, I can’t forget this.]", "Next, as she bent down to pick up the blood-smeared Spear of Purity, she suddenly dropped her head.", "[Why aren’t you saying anything….]", "Hic. She sniffled. Flone’s body shook, and drops of blood fell from her tightly shut eyes.", "[Sorry….]", "Apologizing while tightly holding onto Seol Jihu’s cold corpse…", "[Sorry…. Sorry….]", "She climbed the hill, sobbing.", "*", "The sun that hung in the middle of the sky eventually set over the horizon. It was around this time that Seo Yuhui abruptly woke up.", "When she opened her eyes, she saw a soft bed and the insides of a luxurious room.", "What happened?", "After dazedly looking around the room for a few seconds, she suddenly widened her eyes and jumped out of the bed like a wasp stung her butt.", "She shook her head left and right before finding a terrace and throwing the door open. And then she saw an all too familiar city.", "‘This is….’", "Haramark.", "Seo Yuhui blinked her eyes as she blankly stared at the sunset-washed city. If she didn’t see wrong, the entire city had flickered with light just now.", "Seo Yuhui subconsciously tilted her head back, her pupils trembling. The sky dyed in a dusky sunset became bright for a moment.", "It repeatedly went bright and dark. It was almost as if something was exploding far beyond the atmosphere outside of the human eyes’ reach.", "Then…", "Paat! With an intense light bursting out and disappearing, the sky regained its original color.", "Seo Yuhui continued to stare at the sky despite it returning to normal…", "“Ah….”", "And she let out a soft groan.", "A shining object fell from the red sky. Showing a long tail like a comet, it quickly disappeared into the horizon where the sky met the earth.", "A star had set.", "“….”", "Seo Yuhui’s mouth slowly opened as if she wanted to call out to someone.", "Unable to overcome a sudden wave of dizziness, Seo Yuhui’s body shook strongly. She lost balance, and her knees hit the terrace floor. Her hands, which were placed on the guardrail, also fell forward helplessly.", "After dropping down, Seo Yuhui did not move in the slightest, like someone who had gone mad from a great shock.", "She only kept staring at the sky where the star had set with a blank face.", "This lasted all night long until King Prihi came to see her the next morning."]}