{"cid": "370", "title": "Chapter 370. Penance (1)", "content": ["One thing Seol Jihu noticed while walking on the Path of the Soul was that this place also had four seasons.", "It was exceedingly hot when he first entered, but now a cool breeze gently brushed against his skin.", "It was now autumn.", "But just because the season changed, it didn’t mean that he did anything different.", "Seol Jihu was still stuck at the first mountain path, trying to push the immobile boulder up.", "Thankfully, he wasn’t without progress. He now only had eighteen steps to go to reach the first peak, and it was steadily decreasing.", "Once the late autumn passed, the air turned colder by the day.", "Seol Jihu could see his own breath.", "Winter, and along with it a bitter coldness had arrived.", "In truth, the cold wasn’t much of a problem as his body was steaming anyways from climbing the mountain.", "One time, it snowed for seven days straight.", "And when the snow solidified, the slope froze up too.", "Pushing the boulder up was difficult enough. Now that Seol Jihu had to worry about slipping as well, he was on the verge of going insane.", "Getting used to the frozen slope was painful, but the eighteen steps he had left toward the finishing line increasing to fifty was even more despairing.", "He was so frustrated at one point that he gave up on the trial for several days and focused on breaking the ice on the path with the Spear of Purity.", "However, he soon realized it was meaningless as it snowed nearly every day.", "He also heard Black Seol Jihu say, “Aha, so even when you’re fighting an Army Commander, you’re going to say, hey, it’s slippery, so let’s stop fighting and clean up the ground a bit before continuing. Or we can fight when the weather’s better.”", "Then Seol Jihu stopped and quietly went back to pushing the boulder.", "In the end, yet another season had passed by the time he got used to the frozen ground and shortened the distance to less than twenty-five steps.", "The temperature warmed up, and the mountain threw its snow-white layer off.", "Although there were no trees or flowers on the mountain, a fresh, fragrant aroma filled the area.", "It was spring.", "With the frozen ground no longer being an obstacle, the distance to the finish line should have come back to eighteen steps.", "Of course, given the effort that he put in last season, he should be able to climb up a little more, but he didn’t expect it to be more than a few steps.", "He was wrong.", "One step, two steps, four steps, eight steps… fifteen steps.", "The seed planted in winter had finally bloomed.", "His strength stat had not increased to High (Low), but he could feel the change it underwent.", "The shaking of his arms and legs grew worse with each step, but the boulder moved from the spot he expected to stop at.", "Seol Jihu was climbing the slope, though with great difficulty. Even he was surprised at his own progress.", "But when he was just one step away, the boulder creaked.", "It didn’t stop. Instead, it swayed back and forth before the last step just like a rocking stone. It was as if it was making fun of him.", "Seol Jihu didn’t give up. He stomped the ground with his heels and made a small groove in the slope.", "This was a technique he picked up during the winter, which lessened the burden of the boulder’s weight by a bit.", "Planting his feet into the grooves, Seol Jihu collected his breath for a moment.", "The boulder still swayed back and forth, and Seol Jihu’s heart rocked along with it.", "Soon, Seol Jihu held his breath and glared at the boulder.", "He leaned forward and squeezed out every ounce of strength in his body.", "The outcome would be one of three things. His arm would bend in, his feet would slip out and the boulder would crush him, or…", "‘Please, please…!’", "Next, as Seol Jihu’s face distorted like a hahoe mask…", "Suddenly, the weight disappeared.", "The rolling that started from his arms caused his body to dance up and down.", "“…Uh…”", "With a slosh, he belatedly felt something going over his hands.", "Swaying from the sudden disappearance of the weight, Seol Jihu narrowly grabbed ahold of himself and stepped forward.", "Once he regained his balance, he no longer saw a sloped path, but rather a flat ground.", "His left foot was straddled over the first peak.", "“Ah!”", "There was no need to think any further.", "Seol Jihu immediately hopped up to the first peak.", "[You passed the first trial.][The restriction of class and miscellaneous abilities is lifted.][The restriction of mana is lifted.][All artifacts are unsealed.]", "Several messages popped up.", "He had seen a few of them before, but the first message was new.", "He had finally passed the first trial.", "“Uwaaaah….”", "A groan escaped his mouth, but his expression was fuzzy with happiness.", "Seol Jihu stared at the boulder, hopped up and down on the flat ground, then looked back.", "He could see a steep, sliding slope stretching far below.", "Only now did he feel how far he’d come.", "He was singing ‘I did it, I did it’ on the inside, but remained quiet on the outside. He sat on the first peak and dazedly looked down at the slope.", "A timely spring breeze blew and cooled off his heated body.", "‘I never thought this day would come…’", "Looking back, the first trial felt just like when he was in mandatory military service.", "[1]He couldn’t even speak as a private second class soldier. He felt like he was trapped in a bottomless pit as a private first class soldier. Time seemed to flow insanely slowly when he was a senior private class soldier, and he even hallucinated that he was trapped in a Hyperbolic Time Chamber when he was a master private class soldier.", "But the day he was discharged from the military — the moment he took one step out of the guardhouse — the world looked different.", "Just like now.", "Seol Jihu smiled as he stared at the mountain path stained with blood and sweat.", "He was both proud and thankful.", "Though there were some difficulties, he was proud of himself for gritting his teeth and climbing all the way up here.", "“Iyaaaaaaaaa!”", "Inspired by the indescribable sense of accomplishment, Seol Jihu shot his arms out and screamed at the top of his lungs.", "The stifling feeling in his chest finally burst open, and courage sprang up from the bottom of his heart. He felt like he could achieve anything.", "“…Whew….”", "Until a deep sigh poured cold water on him.", "“352 days to climb to the first peak… Was I that talentless back then? I didn’t think I was that bad. Ah, for what do I feel so ashamed all of a sudden?”", "Seol Jihu turned his head.", "Black Seol Jihu was squatting down on the ground, sucking on a tuft of weed like it was a popsicle.", "“Alright, let’s just say it took you 35 days. It’ll be less sad that way. It’s not completely wrong either since that’s how long it took in Paradise’s time.”", "Seol Jihu was taken aback by Black Seol Jihu’s serious tone.", "“I still passed though.”", "“I know, I can see you passed. But damn… don’t you have any shame?”", "Black Seol Jihu dropped his head and heaved out a deep sigh.", "Seol Jihu snorted. Even if he wasn’t going to congratulate him, did he really need to say that?", "“By the way, did you know?”", "Black Seol Jihu slowly turned his head.", "“That the first trial has a pretty low bar for passing.”", "“What do you mean by that?”", "“For example, if you can score up to 100 points on the first trial, you can pass even if you get a 60.”", "“…You mean I passed just barely?”", "“I wouldn’t even call it that. It’s more like you scored 59.5 and got lucky to have it rounded up to 60.”", "Black Seol Jihu said as he pointed to the two small grooves on the ground.", "“Anyway, a pass is a pass. What you did is still within acceptable limits, so con-fucking-grats.”", "“…Yeah, thanks a lot.”", "“Don’t mind my tone. Think about my position a bit. I had to stand here and watch you for a whole year.”", "Black Seol Jihu said dejectedly before pulling out another tuft of weed and biting down on it.", "“Well… be strong. The second trial won’t even give you the chance to round up your score.”", "Hearing this, Seol Jihu looked for the boulder.", "The boulder was sitting in front of the second slope before he noticed.", "It seemed to be waiting for him.", "When the nervous Seol Jihu stood in front of the boulder, an alarm struck his ears.", "[Follow the path and climb to the second mountain peak.]", "[1. Climbing while pushing the boulder up: you must take the boulder up to the peak without leaving a single scratch on it.]", "[2. Climbing without pushing the boulder up: you must reach the peak before boulders appear from the path and the crossroads.]", "[No shortcuts will be allowed during this process. To be acknowledged as passing the trial, you must step on the second peak with your strength alone.]", "“For the record, scratches that are made while rolling the boulder up the mountain count.”", "Black Seol Jihu’s voice was heard.", "“If you want to protect it from scratches, you need to cover the surface of the boulder with mana. It won’t be easy to use other high-level skills while maintaining that state. A fair restriction since you can use mana again, don’t you think?”", "Seol Jihu was silent for a long time.", "It wasn’t that he didn’t understand the messages or what Black Seol Jihu said. It was because he had no clue how to go about this trial.", "First, the second mountain path looked to be several times longer than the first.", "The slope was several times steeper as well.", "Remembering how boulders suddenly appeared in the path and the crossroads, he didn’t know how he would go about taking the boulder up without a scratch.", "The second method wasn’t any easier. It said he had to reach the peak before any boulders appeared, but it wasn’t a distance that he could race through in one go even if he used Flash Thunder and the triple-stacked Festina Earring.", "“Not easy, huh? Iya, I wonder how long you’ll take to complete this one. Since the first trial took one year… two years? Three years? Ah, wait, we have to calculate in Paradise’s time. 73 days? 110 days?”", "Black Seol Jihu’s snide remarks rang out.", "“Well… it will at least be more exciting than the first trial. Instantaneous decision making plays an important role in determining life and death, you see. Quick decision and quick implementation will be the key to passing this trial.”", "Seol Jihu heeded Black Seol Jihu’s advice as he hardened his will to fight.", "There was no need to be scared this early on.", "It was the same one year ago.", "Though the end seemed impossibly far away, didn’t he succeed in the end?", "Right, why not just face it head-on? Surely, he would get a feeling for it once he tried out different methods.", "Though he didn’t know how long it would take, but by the time he conquered this trial…", "“Wouldn’t my technique be complete to a certain degree?”", "“Hmm?”", "Black Seol Jihu’s eyes widened.", "“The first trial focused on my body.”", "“It’s true that the second trial focuses on your technique… but why do you ask?”", "“To set a goal for myself.”", "Seol Jihu said with strength.", "“I found that it helps to set a personal goal. I figured that passing this trial would balance my body and technique to a degree.”", "“…What?”", "It was then.", "Black Seol Jihu frowned ever so slightly.", "Seol Jihu didn’t know why, but Black Seol Jihu looked a bit uncomfortable.", "“…Fucking hell! Again with the damned mind, technique, and body bullshit. Just when I was thinking he was on the right track…”", "He murmured to himself, but Seol Jihu clearly heard what he said.", "Seol Jihu blinked in confusion.", "“Oi.”", "Black Seol Jihu spat out the weed in his mouth and shot up.", "“I gotta ask. Do you even know what it means to have a balanced mind, technique, and body?”", "“Well—”", "“Spare me the bullshit, please.”", "Black Seol Jihu waved his hand dismissively.", "“I’m asking if you can explain, in clear terms, what it means to have harmonized the mind, technique, and body into one.”", "Seol Jihu stared at his alternate self fixedly. He didn’t understand why he was talking so aggressively all of a sudden.", "“Well, what does it mean?”", "“I don’t know.”", "Black Seol Jihu answered.", "“I have no clue either. I’ve never achieved it. Hell, I’ve only heard about it in theory.”", "“….”", "“Tsk, tsk. It’s all because of Master Jang, that old man. He’s filled you up with this fancy talk that’s empty on the inside.”", "Seol Jihu looked offended. He was fine with being criticized, but he couldn’t put up with Jang Maldong being criticized.", "Seeing Seol Jihu’s change in expression, Black Seol Jihu’s brows went up.", "“Don’t glare at me like that. I’m qualified to say this.”", "Though this was a rather arrogant statement…", "[Brat, don’t ridicule them unless you’ve pioneered your own independent realm and can stand toe-to-toe with them.]", "[I can say this and that about High Rankers because I am a High Ranker myself.]", "[But the Unique Rankers… are like the stars in the sky. I can’t get anywhere close to them even if I reach out my hands, so how can I dare to evaluate them?]", "Seol Jihu held his anger in, recalling what Jang Maldong said in the past.", "Even Jang Maldong separated High Rankers into true and false ones. Who was to say Black Seol Jihu couldn’t do the same?", "“Ehew… you’re right, it’s not that old man’s fault. How would he know you have something like Future Vision? It’s my fault, mine.”", "Black Seol Jihu shook his head.", "“I shouldn’t have expected you to be similar to me in the first place. You don’t know a thing about independent realms.”", "“…You don’t need to go that far.”", "“What was that?”", "“If it’s One With the Spear, I also—”", "“God, you fuckhead.”", "When Seol Jihu tried to defend himself, Black Seol Jihu scowled.", "“Haa, so this is why people say that the ignorant with a creed is the scariest bunch. You sure know how to grind people’s gears. Hello? Mister Seol Jihu? Listen up, please.”", "He continued with an empty chuckle.", "“The realm I achieved in my later years isn’t something like One With the Spear, but Peerless Flawlessness which pursues absolute perfection. One With the Spear isn’t the only independent realm, and if I’m being honest with you, it’s hard to even call that an independent realm. Got that?”", "The way he was talking, it was like he was saying, ‘What do you know about independent realms?’", "“Let me ask you while we’re on this topic.”", "Black Seol Jihu placed his hand on Seol Jihu’s shoulder.", "“Explain to me what One With the Spear is. But shut up if you’re going to spout some nonsense about your spear becoming a part of your body.”", "Seol Jihu closed his mouth.", "Black Seol Jihu’s eyes narrowed.", "“You don’t know, do you?”", "“….”", "“Of course, you don’t. How could you? It’s not a result you gained through arduous training and experience. Instead—”", "Black Seol Jihu pointed down.", "Whish! Along with a fierce sound of the wind, the Spear of Purity flew toward him.", "“It was handed to you by this thing. You only know what it feels like. Obviously, there’s no way you would be able to give a clear explanation.”", "“….”", "“And you dare to say what? Can you still talk like that without this thing by your side?”", "Black Seol Jihu gave a pitying look before turning his gaze to the Spear of Purity.", "“I especially feel bad for this guy. It’s a divine weapon for god’s sake. How shitty must it feel!? Ah! I’m so strong! I have so much power! So why can’t my owner use my power properly? Why doesn’t he use me effectively? I gave him my heart and soul, so why doesn’t he treat me well? There’s no evil I can’t incinerate as long as he uses me properly~”", "Woong. The Spear of Purity vibrated slightly.", "Black Seol Jihu snorted.", "“You hear that?”", "He then raised the Spear of Purity up high and examined it closely.", "“Anyway… wow, this weapon sure is incredible. Not only does it look beautiful, but the energy it has is just… wow. If only I had this spear…”", "Black Seol Jihu lamented as he marveled at the Spear of Purity.", "Seol Jihu kept silent.", "Or rather, he had nothing to say.", "Though a small fire was kindled inside him…", "[The Spear of Purity has been talking to you ever since you awakened it. Even in the previous fight, it was screaming and yelling in despair.]", "[You never heard a thing though.]", "But because of what he heard from Little Chick, he really didn’t have anything to say.", "“That’s right. If you have even an ounce of conscience, you wouldn’t say anything.”", "Black Seol Jihu patted Seol Jihu’s shoulder.", "“Goal, you say? Fine, great. Dream? It’s not bad to dream big.”", "“….”", "“But buddy, at this point, you need to look at things more realistically.”", "“….”", "“Just focusing on the task at hand should take up all of your time. You only just started walking and don’t even know how to run yet, so how can you be dreaming of flying and soaring to the firmament?”", "“…”", "“Aigoo~ So frustrating. It feels like I’m reading a novel with nothing but frustrating development.”", "Black Seol Jihu threw the Spear of Purity down and turned back.", "“Snap out of it, pal~”", "Singing the lyrics to an old song, he trudged forward before glancing back.", "Seol Jihu was still standing in the same spot, expressionlessly.", "“….”", "After Baek Haeju went back, Seol Jihu had worked hard for eight months without a word of complaint.", "He had just passed the first trial after all that, so considering how elated he must have been, Black Seol Jihu agreed that he might have been a little harsh.", "Seol Jihu quietly turned back. He walked over to the boulder and dejectedly placed his hands on it. Though he tried to act unfazed, it was easy to see how dispirited he was.", "Black Seol Jihu sighed.", "“Man, you’re gonna get depressed just because of that? Might as well pull your dick off.”", "He spoke again as Seol Jihu tried to push the boulder.", "“What’s your plan, trying to push the boulder? Do you just want to get crushed by the rolling boulders?”", "Only then did Seol Jihu slowly turn his head.", "Black Seol Jihu raised his hands.", "“Oops, my bad. It was just too thoughtless of me to not say anything.”", "Then, he crossed his arms.", "“Now please, use your brain a bit. Didn’t you see the messages outlining the rules for the second trial? You can choose one of the two methods. You only have to complete one to pass. That’s 50 out of 100 points. And what? Harmonizing the mind, technique, and body? You can’t even score a 100, so why are you trying to aim for 10,000? This test isn’t that hard.”", "Aim to score 50 since you lack ability. Seol Jihu couldn’t disagree with these words.", "“This is the second trial, not the first. It’s good to set a goal, but make it proper. Don’t spout some nonsense and say, ‘Oh! Let’s just face this trial head-on like the first one!’ Can you blame me for getting pissed off? Hmm?”", "Black Seol Jihu approached Seol Jihu again.", "He stopped in front of him and stared at him fixedly.", "After a brief moment of silence, he said.", "“…Hey.”", "Seol Jihu reflexively shut his eyes just as he was about to reply.", "When he opened them back up, he saw Black Seol Jihu’s index and middle finger hovering right in front of his eyeballs.", "Black Seol Jihu had stopped just before stabbing his eyes.", "“How was that?”", "Black Seol Jihu asked.", "“Did you see me trying to stab your eyes?”", "“No.”", "Seol Jihu shook his head.", "“You didn’t, right? Then why did you close your eyes?”", "“…I don’t know. I just did it reflexively.”", "“Exactly. That’s it.”", "Black Seol Jihu continued.", "“Your brain sensed danger and sent neurotransmitters telling your body to protect yourself. It’s not that you noticed, ‘Ah, this fucker is trying to stab my eyes. I need to close them.’ If you did, you would have tried to avoid it.”", "“I, I guess so.”", "“Right? So if you want to speak about One With the Spear, do it when you can move your spear intuitively like you just moved your eyes. Otherwise, I won’t even feel like responding.”", "Seol Jihu looked at his alternate self with a renewed gaze.", "[What happened to the log training you did!? Did you forget already!? I told you not to hit after you see, perceive, and then think! Hit as soon as you see it! Move using your intuition!]", "[A true expert will land a successful attack before you can perceive it! By the time you try to move, your head would already be in the air!]", "Though it might be a coincidence, everything that Black Seol Jihu said seemed to be connected with Jang Maldong’s teachings.", "“Anyways… you want to get to a higher realm quickly, right?”", "“Of course. But I won’t be greedy.”", "“No, what’s the use in my blabbering on anyway? I need to make you learn through experience. Alright, be as greedy as you want. If it works out, great. If it doesn’t, I’m sure you would have learned something.”", "Black Seol Jihu spoke with the corner of his mouth curled up.", "It looked like he just got a good idea.", "“It’s not that there isn’t a way.”", "“Huh?”", "“You want to learn One With the Spear as a passive skill, don’t you? Of course, it’ll depend on your performance, but I can tell you a good method. It’s what I used in the past. Since you have Intuition, it might be a bit easier.”", "Seol Jihu’s eyes widened.", "“What is it?”", "“Lowering the difficulty of the trial.”", "“Huh? I thought I couldn’t change the content of the trials.”", "“You can’t, but where there’s a will, there’s a way.”", "With that, Black Seol Jihu rolled his eyes.", "“What to do… what to do… It’s a pretty brainless method. I think you’re gonna frown in the middle of it.”", "“I won’t.”", "“No, I don’t trust you. I’m you, after all… Ah, I guess it doesn’t matter even if you complain. I can just beat you up ‘til you shut up.”", "Black Seol Jihu spat out a threat before suddenly turning serious.", "“Are you really going to do as I say?”", "Seol Jihu nodded.", "“Then take off all your artifacts first. You can keep the Spear of Purity.”", "Seol Jihu obediently took off his Festina Earring and Blessing of the Circum.", "“You said you’d do it.”", "Black Seol Jihu asked for reaffirmation.", "“Yes, I will. Just what is it…?”", "After taking off his cape as well, Seol Jihu paused.", "Black Seol Jihu was still standing in front of him with his fingers pointing at his eyes.", "“Good. Now then…”", "Before Seol Jihu even had the chance to feel that something was off, Black Seol Jihu revealed a grin.", "“Shall we start?”", "At the same time, his fingers dug into Seol Jihu’s eyes.", "Piit!", "Blood spurted out from Seol Jihu’s pupils.", "“Aaack…!”", "And a belated scream echoed out.", "1. For mandatory military service, citizens go through ‘enlisted-ranks’ which aren’t real military ranks as they are considered non-commissioned officers. A soldier would go through four ranks — private second class, private first class, senior private class, and master private class — before being released. "]}