{"cid": "290", "title": "Chapter 290. Eun Yuri (1)", "content": ["Bzzzz", "A vibration filled the air as everyone stood in awe.", "[A message from the Guide has arrived.][Sender: The Guide]1. Gather at the next island within the time limit.2. Time left 00: 40: 00", "Seol Jihu clenched the phone in his fist. Although he had no idea what was going on, his instincts told him to head to the island.", "‘The Guide should know something,’ he thought.", "Seol Jihu departed as soon as he received the Guide's message. After finding a car, he found a person among the rescued who knew how to drive and left the injured to his care.", "The rest headed to the bridge. The four bridges that linked the islands hung precariously over a steep cliff.", "There was an odd clause highlighting that only one person was allowed to cross each bridge at a time. Seol Jihu quickly crossed the bridge, not paying much attention to this condition.", "A group of about ten people was gathered at the place. They must have either escaped by luck or had just arrived after receiving the Guide’s message.", "Seol Jihu waited patiently as a few other survivors arrived one after the other. The timer had gone down to less than 10 minutes when Phi Sora finally appeared.", "“Only 28….”", "Phi Sora counted heads and scoffed, but Seol Jihu could sense a faint air of concern from the look on her face.", "“What happened?”", "As soon as he asked, Phi Sora gently bit her lower lip.", "“…First things first.”", "She began but tapped on her phone in the next moment without finishing her sentence.", "[Sender: The Guide][1. Rules for the Scavenger Hunt]Avoiding the eyes of the Homunculus, which will soon arrive at the second island, search for the coins hidden across the island, and find a way to escape!", "[2. Conditions for Escaping]The entrance fee will be 100 coins.Offer the ‘sacrifice’, which can be acquired from the gacha machine with 666 coins, to the altar at the center of the island to activate a portal linked to the Neutral Zone.", "[3. Precautions]The Homunculus will be in a rampaging state and can exert 16 times its original strength.Guided by the grudge of ‘Absolute Evil’ looming over the island, the Homunculus’ target will 'first' be the survivor who annihilated the Sixth Mother.Its regenerative abilities will also soar, enabling the Homunculus to recover from mortal wounds.There is a limit to the resurrection, however. The Homunculus will no longer be able to heal itself after 5 mortal wounds have been inflicted to it.", "[‘Rampaging Homunculus’ will soon arrive on the second island.]", "Seol Jihu looked up from his phone and stared at Phi Sora. His eyes were demanding an explanation. The job of a Guide was to offer necessary guidance when needed, nothing more. However, seeing the confused look on Seol Jihu’s face, Phi Sora could no longer keep her mouth shut.", "“Dear, aren’t you forgetting one thing?”", "“?”", "‘Forgetting, forgetting….’", "Seol Jihu began to think. Suddenly, he remembered the ‘Diary of an Unknown Survivor.’", "“How to eliminate the killers.”", "“That’s right.”", "“Wait, but I didn’t forget about it. I just decided it wasn’t important. You’ve been watching, so you should know that the Sixth Mother—”", "“I know, just hear me out first.”", "Phi Sora interrupted Seol Jihu.", "“I don’t know where to begin.”", "She started with a sigh.", "“So you know that the Sixth Mother was a black mage. You also know that a failed experiment designed to combine conflicting energies destroyed her body and trapped her soul inside the body of an anti-evil energy user.”", "“Yes, yes, I know that. But—”", "“The black mage failed her experiment, but she didn’t give up on it entirely. Just before she perished, she transferred the energy of black magic to her five devotees, promising to meet again in the future. She planned on improving her experiment using what she learned from her failure.”", "Phi Sora spoke quickly, perhaps because they did not have much time on their hands.", "“In short, the ultimate goal of the Sixth Mother was her own resurrection. Her ambition went beyond freeing her soul. She planned to create a body that could carry both types of energies, and then transfer her soul into that body.”", "Seol Jihu felt dazed. Now he could understand the role of the Homunculus that, up until now, seemed to have appeared out of the blue.", "“Then, the Homunculus is….”", "“A new body that the black mage has prepared for her resurrection.”", "Seol Jihu’s face warped into a distinct frown.", "This meant that the cave from before was nothing but a decoy. He had assumed that the black mage’s wish was to set her soul free. However, as it turned out, the real objective had been elsewhere.", "“Of course, the conditions for the resurrection are not easy to meet. First, you’d need an Essence of Soma and the Absolute Evil, each representing one end of the conflicting energies. Then, the soul of the black mage, who will serve as a mediator controlling both energies inside the new body, would have to be freed.”", "“Absolute Evil?”", "“The killers. Though, they are really fanatics who served the black mage.”", "Phi Sora continued.", "“Sacrificing survivors in order to liberate the Sixth Mother— that was nothing but an ostensible objective.”", "“…”", "“There are a total of five devotees of the Sixth Mother, but you might as well as treat them as one. They became linked to each other when they received the black mage’s energy. What this means is that they, too, are nothing more than sacrifices that would eventually be used to resurrect the Sixth Mother.”", "So, the reason the remaining killers became stronger each time one of their own died was because the energy that had been divided into five pieces became closer to the whole.", "After hearing the explanation, Seol Jihu finally realized why the Sixth Mother had thanked him.", "“You’re saying that killing the killers is part of the process of completing the offering.”", "“Yes. When the five pieces come together, Absolute Evil is born.”", "Seol Jihu could only chuckle at the absurdity of the situation.", "“So, whatever I chose to do wouldn’t have mattered.”", "“No. That isn’t true.”", "Phi Sora shook her head.", "“Not everything was set in favor of the Sixth Mother.”", "“?”", "“As she said, it’s pointless for the survivors to kill the killers. But things could have been different had you fed the killers to the Homunculus locked away in the dungeon.\"", "The Homunculus was a vessel created to embody both the Essence of Soma and the Absolute Evil.", "That is to say, if he had let the Homunculus devour the killers, that would have been seen as an act of offering sacrifices, and the energy of the black mage would have remained inside the vessel without being delivered to the rest of the killers.", "“If you had taken the time to find the Homunculus and let it slowly devour three killers, things could have been different.”", "“What do you mean?”", "“Did you not read the third message? The one about the Homunculus gaining intelligence and a sense of self.”", "Seol Jihu blinked his eyes.", "“The Homunculus was born without a soul. But if it takes in the sacrifices not all at once but slowly, one at a time, it can absorb the energy of the Sixth Mother as its own and gain the ability to think independently. Then, even if the soul of the Sixth Mother was freed and the resurrection ritual was completed, the outcome wouldn’t have been the same as the one you’re facing.”", "“….”", "“The Homunculus, now fully intelligent, will fight to protect its body according to its survival instincts. It will fight over the ownership of the body and soul with the black mage who entered the vessel to take control of the energy within. Even the black mage would not have expected this. It’s a miscalculation on her part.”", "“But the Diary of an Unknown Survival hinted that we shouldn’t feed the killers to the Homunculus.”", "“That’s also correct. If the Homunculus gained more than three pieces of energy, it would have broken out of the dungeon. Then, it would have tried to devour everything in its path, be it the killers, the survivors, or the Sixth Mother.”", "Having finished her explanation, Phi Sora looked down at her phone nervously. Clearly there wasn’t much time left. It was then that Seol Jihu realized the mistake he had made.", "‘So this is what Attention Required meant….’", "The special tutorial contained a huge secret that was simply beyond his imagination.", "Seol Jihu thought he was being reasonable, but it turned out he had been making decisions based on only small parts of the tutorial.", "“I have one more question.”", "Seol Jihu said.", "“Why did the Homunculus enter a rampaging state?”", "“Because it failed to meet the conditions.”", "Phi Sora answered quickly.", "“Its body was made to contain opposite energies. But in this case, only half of those energies came in, and all at once too. So the Homunculus couldn’t properly digest the sudden surge of energy. And because the Sixth Mother’s soul isn’t there to control the energy, it’s natural for the Homunculus to go wild.”", "Then Phi Sora continued in a somewhat feeble voice.", "“Though… in this case, it did so on purpose to get back at you.”", "Seol Jihu closed his eyes.", "A mess. Everything was a huge mess. He felt wronged, of course. The Tutorial was simply too complicated.", "Seol Jihu was no Sherlock Holmes. It was virtually impossible for him to figure out the entire plot with such limited information. But he also knew this was an excuse. Looking back now, he could see that, though scarce, the hints were definitely there.", "[What is the Sixth Mother’s goal?]", "There was at least one hint in the Diary of an Unknown Survivor. He did think it was strange there were so many pages in the diary. Had he taken the time to collect all the pages and proceeded with caution, he might have seen through the Sixth Mother’s plans.", "Instead, he rushed and consequently failed. The noise inside his head was getting louder, but Seol Jihu defeated it with a shake of his head.", "In any case, what was done was done. He knew his priority should be solving the problem at hand.", "“To think that… of all the options, you’d choose the worst….”", "Phi Sora sighed. Their conversation came to a halt. As the silence prolonged, the survivors’ faces began to fall. They could see that both the Guide and the Invited were upset.", "“W-Wait.”", "Giving in to the pressure, one of the survivors finally raised his hand and asked.", "“So we have to find the coins or whatever to open the portal? Here, right now?”", "“Yes. For the record, there are 6000 hidden coins. Though, that covers the entire island.”", "“No, that’s not what I meant. I meant that… well, from what I heard, it seems there’s a scary monster on the way….”", "He mumbled and looked at Seol Jihu. Phi Sora raised her eyebrows slightly.", "“You’re blaming this man?”", "A look of disdain quickly crossed Phi Sora’s face. She knew he was one of the survivors Seol Jihu rescued. She couldn’t believe he was still looking for someone to blame, so much that she started to question his motives.", "“Now that’s too much!”", "Park Woori raised his voice.", "“What the hell do you want?”", "“Excuse me?”", "“You’d be dead anyway if it wasn’t for Hyung-nim! ‘Let’s do this together. Is there anything I can do to help?’ That’s what you should be saying! Where’s your conscience!?”", "“I-I haven’t said anything yet! I just—”", "“Not me.”", "As the man shrugged nervously, a sharp voice interrupted their conversation. It was from the same woman who argued with the young man at the empty lot. She looked at Seol Jihu and Park Woori with eyes full of discontent.", "“I haven’t received any help from the Invited over there. I made it here on my own.”", "She didn’t say much, but it was clear from the tone of her voice that she was pinning the blame on Seol Jihu and demanding him to take care of the mess that he had created.", "“All of you, shut up.”", "It was then that Phi Sora raised her voice.", "“I did warn you not to point fingers at others.”", "The tone of her voice was quite serious. She was clearly angry. The woman flinched when her eyes met Phi Sora’s threatening gaze.", "“I didn’t think that I would need to say this, but— do you really think you survived all on your own? If this man hadn’t distracted the killers, you would have died long before you reached the end of the bridge. Are you aware of this?”", "At this, the woman’s face hardened. Her lips tightened but her expression remained vexed, and one could tell she wasn’t persuaded. Phi Sora took a deep breath and calmed herself. Then, she looked at Seol Jihu, her eyes tight and worried.", "“Please don’t die.”", "“….”", "“I know the difficulty went up to Impossible, but it isn’t as bad as that time when the Seven Armies appeared.”", "“….”", "“Argh, say something! Didn’t you beat up Undying Diligence like a demon back then? Just where did—”", "Phi Sora disappeared before she could finish her sentence. It seemed that she had exceeded the time allotted for explanations and had been summoned back. And to prove that right…", "Koong.", "…The earth shook. This could only mean one thing.", "Stage 2 of the Tutorial had begun.", "Murmur The confused murmurs did not last long.", "“D-Damn it!”", "“Run!”", "Soon, the group of survivors scattered about, starting with a couple of people running away from the crowd.", "A few kept glancing at Seol Jihu as they ran. The reason was simple. They knew the Invited was the monster’s first target and planned to get as far away from him as possible.", "Not long after, only four people remained. Seol Jihu remained silent. With his eyes closed tightly, he seemed lost in thought.", "Koong… Koong…", "Meanwhile, the thumping sound grew louder.", "“H-Hyung-nim….”", "Park Woori looked at the bridge, then at Seol Jihu, and pressed carefully. Seol Jihu finally opened his eyes.", "“Mm…. Would you two mind keeping an eye out?\"", "“Pardon?”", "“Only for a while. It won’t take long.”", "“Ah, yes. Of course!”", "The quick-witted Park Woori immediately understood. He grabbed Yoo Yeolmu’s arm and moved out of the way.", "“…”", "Eun Yuri had been looking grim ever since this whole incident started. If she hadn’t suggested that they trace the killers’ souls, the situation wouldn’t be as bad as it was now. Feeling guilty, she said while fidgeting.", "“I’m sorry.”", "“Mm…?”", "To her surprise, Seol Jihu appeared calm.", "“It’s all my fault that this happened…”", "“How is this your fault?”", "Seol Jihu chuckled softly.", "“It was I who asked you to come and use the paper talisman.”", "There was no answer from Eun Yuri. Glancing at Seol Jihu, she simply put her hands in her pockets.", "“Didn’t you say you were saving that for some other time?”", "Her hands that were about to take the paper out stopped.", "“But….”", "“Miss Eun Yuri.”", "Seol Jihu whispered her name.", "“You said you majored in modern dance, right?”", "“Huh? Oh, um, yes.”", "A curious look crossed Eun Yuri’s face.", "‘Why is he bringing up my major?’", "“I was a gambler.”", "“Gambler?”", "“Yes, and I’m not proud of it. Ah, I’ve quit now though.”", "Seol Jihu gave an awkward smile.", "“It’s just that… I’ve been thinking. About why the Tutorial, which should have been easy, became like this. When did it all go wrong?”", "“…”", "“And I think I figured it out. We never approached the Tutorial for the purpose that it was designed for.\"", "Everything worked in a certain way. Of course, one didn’t always have to play by the rules. In some instances, one could gain more by defying standard tactics.", "But doing so always carried the risk of aggravating the situation. And this wasn’t the first time Seol Jihu overcame obstacles through creative means.", "He did so at the Forest of Denial, during the Arden Valley Baiting Operation, and then again during the Delphinion Laboratory Rescue Mission.", "None of them were easy. The results were all good, but even the slightest mistake could have resulted in his death.", "But fortunately, Seol Jihu had never failed before. And as a result, he developed a certain ‘habit’. This habit forced him to look for an easy way out whenever he came face to face with a problem, rather than following the standard procedure.", "Some might call him clever; others would mark him as impatient.", "This habit of his came in handy during emergencies, but it became a weakness when he was in a situation where he had to patiently follow standard measures.It was simple, really.", "Seol Jihu had approached the Tutorial in the same way he had approached other problems.", "It was just that this time, he didn’t get the same good results as before. The way he saw it, the time bomb that had been ticking for a while now had finally gone off.", "But there was a way to fix this. Seol Jihu spoke.", "“Go.”", "“Excuse me?”", "“I’ll distract the Homunculus. It seems that I’m the target anyway. I’ll keep it here for as long as possible, and meanwhile, I want you to find a solution.”", "Eun Yuri seemed perplexed by Seol Jihu’s words.", "“Can’t I go with you?”", "“I don’t think I’ll be able to protect you and fight at the same time.”", "Seol Jihu shook his head.", "“The situation has gotten worse, but let’s not forget that this is still a tutorial.”", "He continued firmly.", "“There’s got to be a way out of this. I think— no, I’m sure the Seven Gods have prepared a solution. And I believe you, Miss Eun Yuri, will be able to find it.”", "Still, Eun Yuri continued to fidget with the paper, reluctant to let go. Seol Jihu smiled bitterly.", "“I don’t think you should use the paper talisman.”", "“…”", "“Of course, if everything turns out well, we could easily defeat the monster. But there’s a chance that it won’t turn out well.”", "“…”", "“There is no doubt that the paper talisman is a powerful item, but it’s not a guaranteed solution to everything.”", "He was right. The paper talisman could take care of the problem at hand, but it couldn’t affect the root of the problem.", "Eun Yuri tightened her lips. She understood Seol Jihu’s concern. They weren’t sure if the paper talisman could kill the Homunculus just once or all five times. There might also be some secret to it that had yet to be revealed.", "“And frankly, I think it’d be a waste to use it right now. It would be better to use it according to your plan, Miss Eun Yuri.”", "“But….”", "Eun Yuri continued in a weak, hesitant voice.", "“If something ever happened to you, I….”", "“Come on. I’m not that weak.”", "Seol Jihu patted his chest lightly with his machete.", "“I don’t think you know this, Miss Eun Yuri, but I’m the one who killed the Parasite’s First Army Commander. I know that the Homunculus is in a rampaging state and whatnot, but I don’t think it’d be stronger than an Army Commander.”", "“…Really?”", "“Really. Now, let’s tackle this the standard way.”", "Seol Jihu shrugged.", "“You’ve seen my movement skill, right? If I find that I’m no match for the Homunculus, I’ll just run away. Then I’ll find you. We can use the paper talisman then.”", "Eun Yuri finally lifted her head up.", "Koong, koong!", "At the same time, the sound of the explosion became tangible. Seol Jihu heard Park Woori’s footsteps approaching him hurriedly.", "“I think we’re running out of time to talk.”", "He pushed Eun Yuri and whispered.", "“Just think of this as a game. If you find the solution before I kill the Homunculus, you can have the ice essence I got from the cave.”", "Eun Yuri, pushed and forced to walk by Seol Jihu, finally put on a determined look.", "“…Okay!”", "And she announced, “I’m definitely going to win.”", "Seol Jihu smiled.", "“I’ll look forward to it. Now then, the game begins now. Go on, run!”", "Eun Yuri began to run. She led Park Woori and Yoo Yeolmu to the island. Seol Jihu watched her go, then turned his gaze to the other side of the bridge.", "‘An impossible mission, was it?’", "Kim Hannah said before that a mid to large-sized team of Level 4 or above Earthlings would be needed to have a chance of clearing it. And Jang Maldong said that a ‘true’ Level 5 like Phi Sora could easily overpower a hundred Level 4 Earthlings.", "Of course, these analogies couldn’t be 100% true, and he knew that.", "Seol Jihu was less proficient than Phi Sora in terms of technique, and he didn’t have any of his usual equipment with him either. But these unfavorable conditions made him wonder how far he could really go.", "‘Let’s do this then.’", "Seol Jihu tightened his grip around the machete and raised his mana. And soon enough….", "Koong!", "Through the thick forest, a huge monster appeared."]}