{"cid": "328", "title": "Chapter 328. Awakening, the Last Stand (2)", "content": ["Twisted Kindness’ aura changed in an instant. The energy enshrouding her like a fog suddenly materialized and began to blaze as though a bucket of oil had been poured on top of a fire.", "Seol Jihu frowned, feeling a heavy pressure crushing down on his body.", "Her intent was clear. She was saying she would no longer go easy on them.", "Seol Jihu aimed the Spear of Purity forward and waited for an attack. Truthfully speaking, just confronting Twisted Kindness filled him with fright. He was very much tempted to just run away. But the moment he did such a thing, he knew that everything he had built up until now would crumble down.", "In the midst of despair, lacking any semblance of hope, Seol Jihu focused to get hold of himself.", "How would Twisted Kindness attack? It looked like she had a special ability other than her physical power.", "But then again, could he deal with her even if she used her physical power alone?", "All sorts of thoughts crossed Seol Jihu’s mind.", "At that moment, Twisted Kindness lightly kicked off the ground. She closed the distance between them before Seol Jihu could even blink.", "But despite being astonished at her speed, Seol Jihu managed to reflexively thrust forward, having expected this to a certain degree.", "However, Twisted Kindness dodged the attack by turning her waist slightly and reached out with her hand like lightning.", "\"Your first move was very disappointing.\"", "The moment her voice reached his ears, Seol Jihu immediately ducked and dodged the hand that was trying to seize him. And at the same time, he cut up vertically with his spear.", "With the short distance between them, he figured it would be impossible to dodge this attack. He had confidence that the Spear of Purity would hit its mark this time.", "But in the next moment, Seol Jihu realized his preconceptions were all meaningless. It was because Twisted Kindness spread her wings instantaneously and flew up.", "Her reaction speed was too shocking.", "\"Hmm. There is just no way Undying Diligence would have lost to this.\"", "The calm evaluation continued. As her shadow cast over Seol Jihu, he reflexively roused his mana. Electricity crackled beneath his feet.", "His brain sent warning signals, telling him to get far away, but he shook them off forcefully. Now that he decided to fight, backing off was no longer an option. He had to clash with his enemy head-on without leaving behind any spare energy.", "And so, he leaped up into the air in full force and stabbed with his spear. With an explosive pang!, Twisted Kindness’ figure disappeared.", "Seol Jihu subsequently felt something approaching from behind him.", "‘Shoot!’", "Seol Jihu quickly swung the Spear of Purity behind him. However, Twisted Kindness worked her legs with an indifferent face, and she moved glidingly while drawing a crescent line. Just like that, she positioned herself at Seol Jihu’s flank.", "Seol Jihu became dazed, feeling like he was fighting a ghost. He still turned his body and reacted, but Twisted Kindness moved her arm as well.", "The moment he saw her forearm, his ribs were struck with a dull pain. And by the time he felt this pain, Twisted Kindness’ forearm had broken past the barrier around his ribcage and dug into it.", "“Kuk—”", "In that instant, something that burst inside him almost came out of his throat through his esophagus.", "Seol Jihu barely swallowed it back down and tried to collect his thoughts, but before he could do anything, he was struck with another dull pain on top of his head.", "“Cough!”", "Blood spurted out from his nose and mouth. As his consciousness began to dim, Jang Maldong’s voice rang out in his head.", "[Get it together!]", "A frustrated scolding ensued.", "[What happened to the log training you did!?]", "[I told you not to hit after you see, perceive, and then think! Hit as soon as you see it! Move using your intuition!]", "[A true expert will land a successful attack before you can perceive it! By the time you try to move, your head would already be in the air!]", "It was just like he’d said. Seol Jihu couldn’t see Twisted Kindness’ movements at all. Since he couldn’t even see it, perceiving it and thinking about it was out of the question.", "This meant he would have to predict her movements and move intuitively… but the enemy’s movements surpassed his expectations completely.", "It was the same even now.", "Before he could even attempt anything, a light flashed in front of his eyes. Since a burning sensation was spreading out from his nose, it seemed he just received a good punch in the face.", "‘Damn it, damn it!’", "Thinking that he couldn’t just take a one-sided beating, he followed his instincts and thrust his spear indiscriminately.", "However, he couldn’t feel a single hit connect.", "Even Intuition was ineffective.", "The price of wasting his precious turns was, of course, a bitter counterattack.", "He felt a sharp, stinging sensation on his neck. Although he used Flash Thunder and hurriedly rushed back, the impact still struck a blow to his shoulders.", "Seol Jihu screamed internally as he felt his clavicles break.", "‘This….’", "His head tilted back. He unknowingly took in a deep breath, and the foul stench of blood flowed into his nostrils.", "Seol Jihu’s body staggered. What was driving him even crazier was that consecutive strikes came pouring in before he could even find his balance.", "Then, a one-sided pummeling ensued.", "How many times was he hit in this short instant? Ten times? Twenty times?", "He didn’t know.", "But if there was one thing he knew for certain, it was that his senses were becoming faint.", "‘No…’", "Having lost its strength at a rapid rate, his body swayed. But as he was doing a double-take, he suffered yet another blow. This time, from the bottom to the top.", "His faltering body returned to its standing posture following his enemy’s will.", "\"It seems…\"", "A disappointed voice rang out in his ears.", "\"This really is your true strength.\"", "Due to the pain of his internal organs buzzing, his vision became slightly clear. And what Seol Jihu saw in the next moment was a single palm accompanying an immense aura, slithering in like a snake.", "He had no means to dodge it, nor the strength to do so.", "Puk. The palm clashed with his chest. The front of his coat exploded, and a palm-shaped mark dug into his chest.", "Lightning flashed in front of his eyes. Seol Jihu briefly lost consciousness as his body was sent flying from the impact.", "‘…Huh?’", "By the time he recovered his senses, a red sky was spread out before him.", "His body was flying through the air. And soon, it slammed down on the ground like a used-up mop.", "After a near-endless period of pain, Seol Jihu could collapse at last.", "And at the end, awaited death.", "Twisted Kindness appeared above Seol Jihu, who was gasping for breath with great difficulty. Looking down with a gaze that clearly lost all interest, Twisted Kindness slowly raised her foot.", "\"Exterminating the First Army Commander… I will chalk it up to a series of perfect circumstances, human.\"", "Speaking with a voice full of disappointment, she slammed her foot down without hesitation. It fell, shattering layers after layers of barriers like glass plates, until—", "[Euuuuuu!]", "Seol Jihu’s body was suddenly pulled back.", "A cloud of black smoke was coiled around his armpits.", "Before Twisted Kindness’ foot smashed Seol Jihu’s head, Flone had taken hold of him and escaped at full speed.", "But she couldn’t help but gape her mouth in shock in the next moment, as Twisted Kindness immediately caught up to her.", "\"Don’t get cheeky and hand him over.\"", "[Hiik!]", "Flone shut her eyes, seeing Twisted Kindness appear next to her in an instant. As a fist carrying a terrifying aura hurled out toward the two of them, a large, swirling green light cut in between them.", "PANG!", "Two auras clashed violently. The shockwave of the impact sent Seol Jihu and Flone flying while Baek Haeju was also pushed back weakly.", "As for Twisted Kindness, she stopped chasing after Seol Jihu and paused when she saw the distinct green light wavering around Baek Haeju’s body. After carefully observing it, she let loose a chuckle.", "\"Awakening… No, you forcefully let it rampage. You would even bet your life on this?\"", "Baek Haeju quickly picked herself back up, then reflexively covered her mouth. She felt something rising from her stomach and wanted to vomit.", "Seeing this, Twisted Kindness clicked her tongue with pity.", "\"I applaud you for wanting to save a comrade… But you should know. Even if you consume your life like this, you will only be dragging out the inevitable.\"", "Baek Haeju did not reply. She only glanced behind her and clenched her teeth.", "\"Hmm… fine. At least you’ll be able to entertain me for a bit.\"", "Perhaps not expecting anything from Seol Jihu any longer, Twisted Kindness took her mind off him and cracked her neck.", "\"To show my respect for your life-blazing fighting spirit, I will play along.\"", "Soon, two huge auras clashed fiercely.", "On the other hand, Seol Jihu was lying in a dazed state. The red sky of the Spirit Realm had turned even redder from the fresh blood dyeing his vision.", "And while looking up at the sky endlessly, he suddenly felt his body turn warm. A white light was enveloping him.", "‘A healing spell…’", "He felt his body recover slightly, but what followed was an indescribable pain. His sense of pain had returned as he healed.", "‘Huuuuaaaaaaaaa!’", "He would have screamed his head off if he could.", "The sorry state that his body was in made him want to prefer death. While he had yet to take a closer look, he could tell easily just by seeing Seo Yuhui chanting a spell in shock and Maria splashing healing potions on him while crying.", "By the time this pain barely subsided, he was overcome with dejection.", "It didn’t even feel like he had a fierce fight. He failed to make a single proper attack. He was just… beaten one-sidedly.", "Recalling the previous fight, fear crept up and crawled on his skin.", "‘Insane… this is absolutely insane…’", "He finally realized why Baek Haeju urged everyone to escape the moment Twisted Kindness appeared. He also learned the significance of fully absorbing a god’s divinity.", "Twisted Kindness was simply an unparalleled monster. In his current state, he wouldn’t come out victorious even if he had a hundred lives.", "At that moment, a brilliant light spread out from Seo Yuhui’s hand, which was placed on top of Seol Jihu’s chest.", "“…up!”", "His ears started working again.", "“Get up! Get up, you son of a bitch!”", "Maria was shouting while crying a river. She seemed to be getting angry to cope with the fact that everyone would probably die.", "It seemed that his sense of hearing had recovered following his sense of pain as he could faintly hear loud ringing from a far distance.", "“Why!? Why can’t you fight as you did back then!? Why are you getting beaten so miserably!? You overwhelmed three Commanders back then!!”", "Seol Jihu blinked slowly.", "‘Future Vision….’", "A chuckle escaped his mouth.", "If he could, he would have used it a long time ago. However, Future Vision was an ability that activated at random. Although it saved his life on several occasions, he knew it would be wishful thinking to expect it to activate whenever he was in danger.", "“….”", "…Right, he knew that.", "But now that the situation had come to this, he couldn’t help but put his hope in Future Vision.", "‘…Fuck….’", "And while thinking this, a curse came out by itself.", "He had sworn never to rely on this ability ever again. He almost cried for being so pathetic.", "Looking back, it was always like this. No matter how much effort he put in or how much he struggled, the result was always the same.", "The enemy always forced difficult trials and tribulations upon him as if to mock and laugh at his struggles. Even when he broke through them by risking his life, only bigger despair would be waiting for him on the other side.", "It was no different this time. In the end, nothing had changed.", "‘I…’", "I did what I could.", "I’ve had enough. It’s exhausting.", "Now…", "‘No!’", "Seol Jihu clenched his teeth.", "He didn’t come to the Spirit Realm to have such miserable thoughts! It wouldn’t be too late to have regrets after he was dead.", "Until then, he had to find a way, even if he had to clutch at straws!", "It was at this moment.", "“How?”", "He heard a youthful voice.", "Little Chick had gotten on top of his body before he noticed. It looked down at Seol Jihu’s face, peering through the blood drenching it.", "“What are you going to do? I understand. You’ve come all this way, so obviously it would be a waste to give up.”", "“….”", "“But why don’t you lower your head and beg? Who knows, maybe that monster will accept your sincerity and give you a chance to rest.”", "Seol Jihu’s eyes shot open.", "Was that something to say in this situation?", "Seol Jihu glared at the smirking Little Chick.", "“Why? I think it’s a decent way out. You’ll get to keep your life at the very least.”", "“Shut… up…”", "Seol Jihu muttered in a cold voice and scowled in the next moment. He had tried to raise his upper body but was met with an acute pain that made him shiver.", "His body was still refusing to listen to him.", "“Hmm. I thought it was a kind offer though.”", "“….”", "“So what, you won’t accept that monster’s offer even if you die? Do you have any bright ideas?”", "“…I said, shut up…”", "Feeling a vicious glare, Little Chick snorted.", "“What a scary face! Anyway, if you’re out of ideas…”", "Then, it grinned.", "“Why don’t you hear me out, partner?”", "“…What?”", "“You see, I agree with you. Something didn’t sit right with me. I could tell something fishy was going on.”", "Little Chick’s attitude suddenly changed. Its smirking expression disappeared and was replaced by a serious look.", "“Listen, things aren’t looking good right now. I’m sure you know that.”", "Its black pupils glinted with a firm resolution.", "“I’ll save you the boring explanation, so pay attention. Right now, a considerable number of Spirits are gathered at the central area of the Spirit Realm. I can feel their auras. The younguns we met must have brought other Spirits. They seem to have realized we’re in a battle and are debating whether to come help.”", "“Those Spirits…”", "“But they must not come here. They won’t change a thing. I’m sure you know why.”", "Little Chick spoke clearly in a subdued voice.", "“So I will go over to them. But I’m going to need you to lend me an Archer, one who’s quick on their feet. It would be nice if that person is good with the bow as well.”", "“…You’re going?”", "“That’s right. I’ll go there and find a way out. You have to stay here until then and hold that monster down. Both monsters, in fact.”", "Seol Jihu blinked rapidly. He didn’t understand what Little Chick meant by all this.", "But he didn’t have the time to ask for details. He could feel Little Chick’s will, the will of the Arcus Spirit swearing to overturn this situation.", "“So? Do you think you can do it?”", "Seol Jihu thought for a moment before shaking his head.", "No, he was about to shake his head. But he couldn’t bring it upon himself to ruin a plan before it even started.", "“If it’s just a bit…”", "“Hilarious!”", "Little Chick snorted immediately.", "“What’s the point in acting tough? It’s not like I didn’t see that monster beating the living hell out of you. How are you going to last? You don’t even know how long it’ll take.”", "Seol Jihu was taken aback.", "“…To be honest.”", "Little Chick sighed.", "“I don’t really like you all that much.”", "It gave a rather out of the blue evaluation.", "But it seemed it wasn’t expecting a reply as it turned around and quickly moved.", "“I’ve never seen someone so selfish in my entire life. All the achievements you’ve made so far only stemmed from you trying to protect your place of escape. And at other times, you act like a total manchild…”", "Trotting lightly, it crossed its right wing.", "“But, I’ll admit.”", "Where it stopped was none other than Seol Jihu’s right hand. In this hand was the Spear of Purity, which he refused to let go even in his current state.", "“You’re a hell of a lot better than people who stop at thinking and never carry it out in action.”", "Little Chick raised its foot and wiped away the blood on the upper section of the spear shaft, or, more specifically, where seven concave holes were located.", "“And more importantly…”", "Then, it glanced back. Gazing at the slightly dazed Seol Jihu, it grinned.", "“I really like your refusal to give up. You burn your fighting spirit even in such a wretched state. At the very least, your fighting spirit surpasses the First Clan Head.”", "With that, Little Chick pulled out the three feathers on its forehead. They were yellow, green, and blue feathers, respectively.", "“Consider yourself lucky. You can even consider it an honor. Until now, I’ve never released more than two Authorities.”", "With that—", "“Holding your fighting spirit in high regard, I’ll give you a pass, partner.”", "Before Seol Jihu could say anything, Little Chick threw the feathers, which descended while swaying in the air.", "Then, the moment they gently landed on the Spear of Purity…", "Woooong!", "A vigorous sound resounded.", "As the three colors instantly dyed the Spear of Purity, Seol Jihu was startled by his own right hand, which began to shake like a coiling dragon.", "That wasn’t all. An unfamiliar, beautiful voice filled his ears. It whispered soft words that he couldn’t make out.", "‘This is…’", "Seol Jihu subconsciously cupped his hand over his ear.", "“Looks like you can finally hear it.”", "Little Chick lifted its chin.", "“That’s the Spear of Purity talking to you.”", "“The Spear of Purity?”", "“That’s right, partner.”", "Little Chick nodded and continued.", "“The Spear of Purity has been talking to you ever since you awakened it. Even in the previous fight, it was screaming and yelling in despair. You never heard a thing though.”", "Seol Jihu glanced at the Spear of Purity with a renewed gaze.", "Having regained its true color before he noticed, the Spear of Purity was radiating a much clearer and intense light. It was the type of noble, solemn light that didn’t give off a single impurity.", "And, as Little Chick said, Seol Jihu began to hear it.", "Woong—! Woong—!", "Why can’t you use me better? No weapon is my match when it comes to annihilating evil— Please use me properly!", "Woong—!", "He could hear the Spear of Purity being upset and lamenting Seol Jihu's improper use of the spear.", "In the next moment, Seol Jihu tightly gripped the Spear of Purity as though he had been bewitched. As he roused the tiny stream of mana flowing in his body…", "Bzzzzzzzzzzzzzz!", "The Spear of Purity resonated and spat out a previously nonexistent cry. At the same time, Seol Jihu’s eyes shot open, feeling a boundless power sweeping over from his right hand like a raging hail.", "It was a powerful aura he had never felt before in his life.", "As several alarms struck his ears, his eyes shot open and exploded out with elegant light.", "“…Miss Maria.”", "He spoke to the dazedly staring Maria with a subdued voice.", "“Call Mister Marcel Ghionea over.”", "And raising his shaking hand, it drew the Spear of Purity at Twisted Kindness, the enemy moving in to finish off Baek Haeju.", "After being swept away by her huge, merciless torrent of despair and frantically struggling to escape—", "[Crescent Blade Spear Technique, First Ultimate Art — One with the Spear — has been awakened.][Crescent Blade Spear Technique, Second Ultimate Art — Flying Spear — has been awakened.][Crescent Blade Spear Technique, Third Ultimate Art — Formless Spear — has been awakened.]", "Finally, he managed to clutch onto a straw. A slightly tough, durable straw.", "Then, as Twisted Kindness tried to seize Baek Haeju’s neck after striking her Tathagata Spear up—", "“HUAAAAAAAA—!”", "Unable to withstand the surging power, Seol Jihu bellowed his heart out and rushed forward."]}