{"cid": "466", "title": "Chapter 466. Two Cards (2)", "content": ["Just as Exploding Patience was about to order the Fifth Army to charge, a fairly large group of soldiers broke away from the Federation’s main force, as if they had been waiting for that instant.", "Exploding Patience furrowed her brows as she looked into the distance.", "On land, a group of Cave Fairies led by Yuirel was charging straight at her in a T-shaped attack formation. Similarly, in the sky, a fleet of Sky Fairies led by Taihi was flying at her.", "For a moment, Exploding Patience could not understand what was going on. She could not grasp the enemy’s intentions.", "Sure, the enemy had been going strong from the start, even surprising them with a secret weapon called the evil spirit army, but the Second Army had not yet collapsed.", "Likewise, the situation was looking grim for Unsightly Humility, but he still had a card up his sleeve. He hadn’t released his divinity yet.", "The enemy had already exhausted a fair amount of resources against the Second Army. The Fairies now made up the bulk of the Federation’s main force, so it just didn’t make sense that they were using them all against her, without even splitting the forces in half.", "Being as this was the final war, she understood why they were so desperate, why they didn’t want to lose the momentum….", "Nevertheless, this felt too reckless, even considering they had Seol Jihu on their side.", "Because the Sixth Army, in charge of the right, was still in good shape, and Twisted Kindness, the chief gatekeeper of the Parasites, had not even appeared yet.", "Most importantly, the Parasite Queen was alive and well.", "‘What are they thinking…?’", "Exploding Patience watched the fairies come closer and closer when suddenly her eyes widened.", "A bright and colorful light began to emanate from the fairies’ bodies….", "“What…!”", "The light, sparkling in five colors, flared like a million suns, swallowing the world in one gulp.", "The look of disbelief on Exploding Patience’s face turned into a look of certainty.", "Hehe! Hehehehe!", "The fairies’ laughter echoed throughout the battlefield like a song.", "Air, Water, Wind, Fire, Earth.", "Spirits of various elements surged like a storm in the sky and on the earth.", "And when Exploding Patience felt the enormous energy of the Five Spirit Lords in the lead….", "“Crazy bastards!”", "She cursed aloud in anger.", "But it wasn’t over yet.", "Suddenly, she sensed two terrifying presences, one above and one below her.", "Exploding Patience looked up, then quickly proceeded to pull herself back.", "Woooooooo!", "The sky was splitting open.", "And from the opening, a giant hand made of light came crashing down with a terrifying force, leaving a deep mark on the ground.", "Unwittingly, Exploding Patience looked down, and the next moment, her face turned pale.", "Wooooooooooo!", "Because the earth was also splitting open. She saw a hand made of darkness rising up from the boiling magma.", "Ophinü Odor and Diffidem Odor.", "The Lord of Light and the Lord of Darkness appeared, as if the Five Spirit Lords alone weren’t enough.", "By then, Exploding Patience was at a loss for words.", "She still couldn’t tell what the enemy was thinking, but one thing was for sure: they wanted nothing more than to destroy the Parasites’ left.", "“So you really wanna do this, huh?”", "Exploding Patience muttered menacingly and turned around.", "She had no choice but to withdraw as the enemy intended.", "She was worried about the spearhead but knew they could hold out.", "‘It can’t be helped.’", "She couldn’t possibly leave her post when the enemy was coming at her with all their might.", "‘Resist. All I have to do is resist.’", "Within this domain, time was on the side of the Parasites. The corrupted soil would slowly, but persistently, devour the enemy’s vitality.", "But even as she reassured herself, Exploding Patience couldn’t help feeling anxious.", "Until this moment, she had never felt so pressured by an enemy who wasn’t Seol Jihu.", "With a nervous face, she began to rouse her energy, gazing at the tsunami of fairies and spirits rolling toward her.", "Soon, the roars of the Banshee Queen and the two Spirit Lords echoed through the battlefield, and the two forces clashed violently.", "And then….", "It was the Sixth Army Commander’s turn.", "Vulgar Chastity’s opinion wasn’t so different from Exploding Patience’s.", "The front was getting pummeled, and the left seemed to be in danger, too.", "Should either of the two fall, the Parasite Queen would be up next.", "Of course, there was still the center army and Twisted Kindness… but it was her duty as the Army Commander in charge of the right to stop the enemy before the situation reached a crisis.", "She speculated that the attack just now must have exhausted the Federation’s forces. Now seemed like the right time to make a move.", "‘Twisted Kindness or Her Majesty can take care of him, right?’", "Not to mention that she felt uncertain whether she alone could handle Seol Jihu.", "But when she turned her head toward the Federation’s main unit, her thoughts changed.", "She saw a pack of black-winged figures spread their wings in the distance.", "It was the Fallen Angels.", "“…Today will be the end of everything.”", "Gabriel spoke calmly, gazing at the Sixth Army as it scattered into an offensive formation.", "“If this war ends in our victory, we will ask Valhalla’s representative to tell that man our story, about everything we have experienced in this world, and how we fought….”", "Licking her lips, she continued.", "“Should you fall in battle, do not be thrown into despair. The Four Archangels, including myself, will revive you even if it means we have to become the Martial God’s slaves.”", "Gabriel flapped her wings….", "“…However, in order for that to happen,”", "…And tightened her grip around the trident.", "“We must triumph in this last battle!”", "Then she soared into the sky like a fallen angel making her way back to heaven. Other Fallen Angels followed after Gabriel.", "“…Are they kidding me?”", "Vulgar Chastity appeared dumbfounded.", "She wouldn’t have felt so offended if the Beastmen Alliance came after her. The Beastmen were mighty warriors and also much greater in number than the Fallen Angels.", "The enemy could not be more transparent. They were obviously planning to hold her at bay with the Fallen Angels and a few Executors so that their main force could break through the center and the left.", "The light flickering across the sky was proof that she was right.", "‘I guess I have no choice but to fight them. No worries. If Twisted Kindness can keep that bastard busy while Her Majesty makes her move….’", "…The Parasites could easily reverse the situation.", "And everything would have gone as Vulgar Chastity had planned, had it not been for the two changes she overlooked.", "The first change was that Seo Yuhui was no longer the Seo Yuhui of the past.", "“…Huh?”", "As Vulgar Chastity roused her energy, she suddenly blinked.", "She sensed an alarming amount of holy power gathering in the sky.", "Hwaaaaaaak!", "The moment she tilted her chin up, a massive beam of light descended from the sky.", "Vulgar Chastity’s vision turned white in an instant.", "Level 9 Saint Empress — Ancient Ritual Prayer.", "O light, shine, burn, and cleanse.", "“What the…!”", "The prayer went far beyond her expectations. She had expected a meteor shower, but in reality, the light was shining over the entire right side of the Parasites’ army.", "When Vulgar Chastity felt the fluids of her body beginning to boil, she hurriedly raised her energy.", "Her vision slowly returned, and soon she saw an army of parasites and corpses wriggling with pain as the light burned their flesh.", "Even the Sixth Army was in danger. They were holding out against the light thanks to the pieces of divinity inside them, but were trapped from all sides by magic circles.", "The Star of Avarice had joined the Star of Lust in attacking the Sixth Army.", "Several small groups of Fallen Angels slammed their tridents into the succubi as they fell from the sky after being hit by magic, and then scattered.", "“Keuk…!”", "Vulgar Chastity clenched her teeth.", "She had expected something like this to happen, but not to this extent.", "The light showed no signs of fading.", "It was then.", "A huge icicle flew out of the light toward Vulgar Chastity.", "The Army Commander managed to grab it with her hair, for she had been on guard all along.", "“This is…?”", "Vulgar Chastity frowned, looking down at the icicle that had barely stopped before piercing her stomach.", "It looked oddly familiar.", "“How do you do?”", "Suddenly she heard a mysterious yet alluring voice.", "Startled, Vulgar Chastity looked around, until her gaze stopped in the air above her.", "Bright blonde hair and sea-colored eyes. At the center of the slowly diminishing light, a small witch wearing a conical hat and riding a broomstick was looking down at the Army Commander with a smile across her face.", "“You…!”", "Vulgar Chastity’s eyes widened when she saw the witch.", "“It has been a while, hasn’t it?”", "Roselle beamed.", "That’s right. To Vulgar Chastity’s surprise, Roselle was the second card prepared by Seol Jihu. He had appointed Roselle as his second Servant.", "Seol Jihu first thought of this method after departing Eva and before joining the Federation at the Hiral Mountain Range.", "Eun Yuri visited his tent late at night and asked him about the limitations on who could be appointed as his Servants.", "She told him that her master had agreed to help them, and maybe, if it was possible, he could appoint her?", "Seol Jihu had never even considered that possibility before.", "Roselle introduced herself as a will trapped in a dream world.", "And Black Seol Jihu, too, was a will from the future.", "This meant that if he could appoint Roselle as his Servant, Black Seol Jihu could also be possibly appointed as a Servant.", "Seol Jihu thanked Eun Yuri for the idea, hugged and bombarded her with kisses, and then contacted Gula through Kim Hannah, who remained in Eva.", "And this was Gula’s answer:", "[There is no limitation to who can become an Apostle’s Servant.]", "[A will is no exception. You may appoint one as your Servant, as long as it possesses a strong enough willpower to manifest physically.]", "[However, the Servant must exist in the same time frame as the Apostle.]", "In short, he could appoint Roselle, a will of the present, but couldn’t appoint Black Seol Jihu, a will of the future.", "According to Gula, the purpose of Future Vision had long been determined by Black Seol Jihu.", "She told him that, apart from the growth acceleration and the ‘overlapping’ effect caused by the Future Vision, there could only be one Seol Jihu in the present world, unless they were inside a special space that did not affect the middle world, such as the Path of the Soul.", "The goddess added that even she could not fathom what would happen if he tried to appoint Black Seol Jihu as his Servant and that Seol Jihu needed to be careful before making such a decision.", "Seol Jihu understood why Gula was so worried. She was obviously concerned that the laws constructing this world would operate in favor of the Parasites.", "After much consideration, Seol Jihu decided to take in only Roselle.", "It was regrettable that he couldn’t appoint Black Seol Jihu as his Servant, but there was no need to gamble.", "Because Black Seol Jihu had already promised him….", "[Don’t worry about it too much.]", "[Did you really think I’d make you fight her alone? I’ll at least make it a 5 to 5.]", "…That he would fight alongside Seol Jihu in a way that didn’t disturb the laws of this world.", "And so, Seol Jihu traveled to the dream world and accepted Roselle as his Servant, with her consent, of course.", "Using the Authority of Gluttony, he devoured both Roselle and the dream world and brought her outside.", "“No way….”", "By now, even Vulgar Chastity understood what was going on.", "Surrounded by the energy of Gluttony, the enemy wasn’t exactly trying to hide it. It was just hard for Vulgar Chastity to accept reality.", "She wasn’t worried about the other bugs, but she was worried about her.", "The Dreaming Witch, Roselle La Grazia, who once single-handedly brought the Empire to the brink of destruction.", "Vulgar Chastity had already experienced the witch’s strength during the Tigol Fortress War. Her energy was on par with that of an Army Commander who had yet to release her divinity.", "“He held my hand and asked me to be with him…. Oh, how it made my heart pound!”", "Roselle covered her mouth with her hand and smiled graciously.", "“You see, I had no reason to turn him down. I was curious about the outside world, worried about my lovely pupils, angry at those who snatched my prey away from me…. In fact, I should thank him for asking.”", "Chirping like a lark, Roselle suddenly pressed her finger to her chin and tilted her head.", "“So, I was thinking about how to repay his kindness….”", "Then she glanced at Vulgar Chastity, who was still frozen with shock.", "“And I’ve decided to capture and dedicate you to him. What do you think?”", "“…What?”", "“Think about it. You’re the queen of luxury escorts revered by all men. Don’t you agree you’d make an excellent present for him?”", "Roselle’s eyes curved in a smile.", "“This is clearly an opportunity for you. Provide a good service, and maybe he’ll come to love you.”", "Vulgar Chastity’s eyebrows wriggled.", "Back when the Empire was at the height of its glory, the succubi were treated as luxury escorts. This was the reason she turned to the Parasites, and also her sore spot.", "“What’s wrong?”", "Having successfully provoked her opponent, a smile spread over Roselle’s face.", "“Are you turned on just thinking about it? You can’t help who you are, hmm?”", "The broomstick carrying Roselle, who was giggling while holding down her hat with one hand, swirled in the air.", "Roselle then rolled up her sleeves and stretched both of her arms forward, her ten fingers dancing in the air.", "“━━. ━━━━. ━━. ━━━━.”", "At the same time, she began chanting a spell as if she were singing.", "It was Roselle Recital.", "“Fucking bitch…!”", "A fire sparked from Vulgar Chastity’s eyes.", "She shouted at the top of her lungs, raising her mana to the fullest.", "“DIEEEEEEE!”", "Vulgar Chastity’s entire body began to emit fire.", "“Next whore, please.”", "Roselle, too, finished her song and released the spell.", "An immense amount of steam began to rise from where the flame collided with the ice.", "“…Fool.”", "Twisted Kindness, who had been watching them from the rear, frowned in disdain.", "Right now, Vulgar Chastity’s primary concern should be to assemble her army and retain the status quo. But instead, she was wasting all her energy on a single witch, letting the enemy control her to their advantage.", "Twisted Kindness bit her lower lip.", "The situation was not much different in other sections of the battlefield.", "So far, the Parasites had been able to overpower the enemy, mostly thanks to their abundant resources. Even if the enemy managed to block one or two attacks, the Parasites had the resources to attack ten more times.", "And now, for the first time, the resources on both sides were equal.", "…No.", "The Parasites were actually losing this time. The front, the left, the right…. Not one of them was winning, in Twisted Kindness’ eyes.", "‘If only the First and the Third Army Commanders were here…!’", "She didn’t care at all about Raging Temperance, but had either Sung Shihyun or Abhorrent Charity been here, the Parasites would have overpowered at least one of the enemy forces by now.", "But this was no time to be feeling sorry.", "She had to help.", "Twisted Kindness wished nothing more than to set out. She could not move, however, because she sensed something strange from the Federation’s main unit.", "Tension began to rise as she stared at the enemy.", "The most powerful warrior of the entire Federation and humanity combined, the ultimate weapon created by the Seven Sins to obliterate the Parasite Queen — Seol Jihu — was finally ready to make his move."]}