{"cid": "203", "title": "Chapter 203. Chohong’s Vow (1)", "content": ["News quickly spread about Seo Yuhui leaving the intensive care unit, but the Temple of Luxuria stayed silent. It seemed like it was just yesterday that they threw a fit about having to find the perpetrators, but they suddenly went silent, as if a bucket of cold water was poured on a sizzling grill.", "It was rather suspicious given that the timing coincided with the news report published by the Assassins’ Guild, and anyone who was at least a little knowledgeable in the ways of Paradise would know that some sort of scheming was involved, but no one dared to say anything so rashly.", "The Temple of Luxuria was an organization of healing Priests and was the second most powerful union after the Magician’s Guild. No one wanted to be on their bad side, and justifiably so.", "Their influence was so great that even the Assassins’ Guild feared them, not publishing the fact that they tried to take Seol Jihu forcefully.", "Of course, people even cursed their own countries if no one was watching, so it wasn’t as if no one was voicing a word of complaint.", "“I just don’t understand that noonim.”", "Jang Maldong glanced at Chohong, who was sitting on the couch, constantly grumbling and smoking.", "“If she’s up, she should have learned what happened. Shouldn’t she take necessary measures to fix this situation? It’s not like we’ve known each other for only a few days.”", "Recently, Chohong had been complaining nonstop. She didn’t like this, she didn’t like that. She complained so much that scabs formed over everyone’s ears.", "“Shouldn’t she at least bring those sons of bitches who threatened us over and force them to apologize? Ah, just thinking about it is making me angry again.”", "Jang Maldong snorted.", "A class that was treated like nobles along with the Magicians, apologizing?", "There wasn’t a rule saying they couldn’t. Even Priests specializing in healing would have to bow their heads to some people.", "The problem was that they would never do such a thing to a small team like Carpe Diem. Not unless they were as influential and large as Sicilia.", "“Uaaaaah—!”", "Unable to restrain her anger, Chohong screamed once again.", "Jang Maldong wanted to tell her to shut up, but he held himself back. He knew how shitty it felt to be swayed by the enemy.", "Jang Maldong sighed before saying.", "“Don’t blame her. She won’t be able to do anything even if she wanted to.”", "“What does that mean? She’s the Executor of Lust! Isn’t she this in the Temple of Luxuria?”", "Chohong raised her thumb and rebutted, and Jang Maldong shook his head gravely.", "“She used to be.”", "“Didn’t she return during the war?”", "“To be precise, she retracted her withdrawal. She didn’t regain all of the influence she had when she was in her prime. In the first place, she let go of all those things when she retired…”", "He didn’t finish saying, ‘It would be hard to regain the authority she gave up’, but Chohong understood what he meant and scratched her head.", "“Aiya~ What a shame for someone whose name is a legend in itself.”", "“Well, given her name value, it isn’t as if she lost all of her supporters. But her ability as an Executor has been sealed, and she can’t use any of her skills as a Unique Ranker Priest, so she’s the perfect target for the people who are only seeking benefits.”", "“Jeez, what a mess they are.”", "When Jang Maldong smiled bitterly, Chohong smacked her lips.", "In truth, Chohong knew what situation Seo Yuhui was in and even empathized with her to a certain extent. After all, she had also entered Paradise as a Red Mark and experienced all sorts of dirty schemes to climb up to her current position.", "There were times she had to say thanks when she should have been thanked, and there were likewise times she had to apologize when she should have received an apology.", "This was precisely such a situation.", "“This goddamned world. I guess it’s my fault for not being strong enough.”", "Chohong swallowed her anger before looking side to side and blurting out.", "“And where did he go?”", "Jang Maldong crossed his arms and gestured at the building beyond the window.", "“He said he’d visit our neighbor.”", "Same time.", "“Eh?”", "Seo Yuhui, who returned home, was looking at a visitor with a flustered face.", "“What did you… say?”", "When she carefully asked again…", "“What do I have to do to restore Noona’s abilities?”", "Seol Jihu repeated what he just said without missing a single beat.", "Seo Yuhui gently closed her eyes.", "“So he told you.”", "She had pleaded with Jang Maldong to keep this matter a secret, but she knew Seol Jihu wouldn’t have let him get away without a proper explanation, given the incident that had just occurred.", "Seo Yuhui waved her hand with an awkward smile.", "“That’s something for me to take care of. I’m grateful that you’re worried about me, but you don’t have to bother with it.”", "And with that, she put on an apologetic look.", "“Sorry, because of me…”", "Seol Jihu shook his head, seeing as how Seo Yuhui couldn’t finish her sentence.", "“I think I’m the cause of this incident.”", "“No, you didn’t do anything wrong.”", "Seol Jihu shook his head once again.", "“I’m not talking about the Priests barging into Carpe Diem’s office. I’m talking about you being attacked.”", "Seo Yuhui stared at the young man, who was clearly voicing his thoughts. She was shocked speechless when she first heard what happened and thought he would be gravely distressed, but he seemed rather collected.", "He must have forgotten about the matter or be enduring it.", "Or perhaps he had another idea altogether.", "Regardless, it didn’t look like he would back down.", "“I have no problem carrying out my daily activities…”", "“Not if you consider your outside factors.”", "Seo Yuhui secretly let out a sigh with Seol Jihu being so adamant. She could tell that he had already made up his mind. Unable to win against Seol Jihu, Seo Yuhui confessed.", "“Okay… it looks like you already heard, but I’ll tell you about it in more detail. Most of my abilities have been sealed from the recoil of the Ceremony I held. I can’t say for sure, but I’m currently equal to a Level 1 or 2 Priest.”", "‘Level 1 or 2 Priest!?’", "Seol Jihu swallowed hard. Seo Yuhui was in a worse state than he imagined. At the same time, he admired her for being able to remain so calm and unperturbed.", "Something terrible might have happened to her, yet he couldn’t see a single hint of animosity or resentment from her.", "“It’s easy for me to heal. I just have to make offerings to Goddess Luxuria.”", "The answer Seol Jihu had been waiting for finally came out.", "“Offerings?”", "Seol Jihu tilted his head. He had expected her meridians to be blocked or her mana circuit to be broken, but offerings? It was an entirely new concept as far as he was concerned.", "“Priests are different from other classes in how closely related they are to their gods.”", "Seo Yuhui explained gently like a teacher educating a child, and it was only then that Seol Jihu remembered all Priests carried around offerings and an altar.", "Maria did so, and so did Alex. This was partly to prepare spells beforehand like Magicians did with their Memorize spell, more fundamentally…", "‘Priests borrow the authority of their gods directly, so they have to pay the price each time. Was that it?’", "While Seol Jihu struggled to remember what little he knew about the Priest class, Seo Yuhui’s explanation continued.", "“Separate from the condition of my body and the cost I paid for the Ceremony, I borrowed and used more divine power than what I was permitted. My abilities were sealed because of it.”", "“Ah!”", "Seol Jihu’s jaw dropped. It was clear how to restore Seo Yuhui’s abilities — to pay the equivalent amount of offerings as the power Seo Yuhui borrowed at the time.", "“I gave all the offerings I gathered so far… but I didn’t recover as much as I thought.”", "Seol Jihu took a moment to organize his thoughts before speaking.", "“What exactly are offerings?”", "“Mm… gods have their own preferences for offerings… but Luxuria-nim isn’t really picky. She likes offerings with holy power the most, though.”", "Seol Jihu raised a question.", "“Then how much holy power should an offering have to fully restore your power?”", "“Mm…”", "Seo Yuhui crossed her arms and tilted her head.", "“If I have something like the Moirai’s Souvenir, I think I’ll be able to recover my strength in one go….”", "Seol Jihu’s eyes widened.", "‘Moirai’s Souvenir….’", "That was an item that was sold at the Neutral Zone for Survival Points. Seol Jihu clearly remembered this item as it was the most expensive item among the available items in the VIP Shop.", "Seo Yuhui saw Seol Jihu’s face and smiled faintly.", "“It’s fine. Offerings are just the fastest way to restore my power. It’s not the only way. Though it will take more time, I can also recover by going to the temple and praying.”", "Seol Jihu made up his mind when he heard this comment from Seo Yuhui.", "With this incident, he saw the dark side of Paradise clearly and learned many things. Not all humans were on the same side. Some were hidden enemies, who wouldn’t hesitate to turn their spears if it benefited them.", "In other words, he couldn’t guarantee that it would be safe to remain on the humans’ side. Even the Temple of Luxuria could be compromised.", "Because of this, Seol Jihu spoke up.", "“I have a request for you, Noona.”", "“Hm? What is it?”", "What was making him so serious? Seo Yuhui blinked her eyes curiously.", "“You said you can recover your strength by going to the temple and praying, but I don’t think that’s a good choice.”", "“….”", "“Of course, I’m sure you have your own thoughts about this issue, and I’m sure you have many supporters as well. But… I can’t help but think that going to the Temple of Luxuria will be like marching into enemy territory. You might get attacked again soon.”", "Seo Yuhui neither confirmed nor denied Seol Jihu’s suspicion. Seol Jihu took her silence as a sign of agreement.", "“I’ll be straight. Won’t you team up with Carpe Diem for a while?”", "“…Eh?”", "Seo Yuhui’s eyes widened. It seemed this was completely out of her expectations.", "The Iron Wall. Seol Jihu knew what Seo Yuhui was called in Paradise. He quickly added, so that she wouldn’t misunderstand.", "“I don’t mean to pressure you or force you in any way. I won’t mention it again if you say no.”", "“W-Wait. I won’t really be of any help right now—”", "“I’m not expecting any. I’m not trying to recruit you. Just think of Carpe Diem as a place to rest while you recover.”", "Seol Jihu paused for a moment before continuing softly.", "“It’s just… I’m too indebted to you. I want to pay you back no matter what.”", "Seo Yuhui’s lips pursed. The way her eyes blinked incessantly, she seemed more than a little flustered.", "Seol Jihu fell in thought. ‘Let’s work together to find offerings. That’s the safest and the quickest way of recovery.’ There were many things he wanted to say, but he swallowed his words.", "Revealing his honest feelings seemed to be the best choice. So that’s what he did.", "“I’ll protect you.”", "It was then.", "The flustered Seo Yuhui’s eyes widened slightly. She took a deep breath, and her snow-white neck turned red like a river reflecting a sunset.", "Coughing meaninglessly, Seo Yuhui muttered quietly.", "“…I see your sudden catches still haven’t changed.”", "After a moment of silence, Seo Yuhui calmly collected her breath. She truly looked like someone who was struggling to calm down.", "“You’ll give me some time to think, right?”", "“Of course!”", "Seol Jihu replied as if it was the most obvious answer.", "He hadn’t expected her to answer immediately anyways, and in his perspective, Seo Yuhui seemed to have doubts.", "Was he being thoughtless and impudent?", "Seol Jihu’s intent was clear. Rather than staying in a place surrounded by enemies, he was telling Seo Yuhui to rely on him and receive thorough protection.", "It wasn’t just empty words considering that Carpe Diem was the undisputed best team in Haramark. The problem was that Seo Yuhui joining Carpe Diem would result in Seol Jihu making even more enemies.", "The meaning of embracing Seo Yuhui in Paradise— Seol Jihu didn’t quite know this as his thoughts were mostly on repaying his debt to Seo Yuhui according to the Golden Rule.", "Soon, the sound of Seol Jihu getting up was heard.", "“I’ll take my leave now.”", "Seo Yuhui opened her eyes in a fluster.", "“H-Hm? Ah, you’re leaving?”", "Seol Jihu tilted his head. He was worried that his offer would have made her uncomfortable, but she seemed strangely happy.", "“Yes, and—”", "Standing up, Seol Jihu continued.", "“Don’t worry too much. We’ll find the culprits.”", "Seo Yuhui smiled softly.", "“Don’t push yourself too much. They won’t be easy opponents.”", "“Of course, I don’t plan to rush this at all.”", "With a bright reply, Seol Jihu bowed before turning around. And soon… Tak, the moment the sound of door closing rang out, the brightly smiling Seo Yuhui immediately turned solemn.", "When she heaved out the breath she had been holding in, the redness she had been suppressing slowly crept up and spread. Her face reddening in an instant, Seo Yuhui put her hands over her cheeks to cool them down.", "‘What do I do…’", "Possessed by a severe internal conflict, the young man’s words from the past suddenly crossed her mind.", "[Let me protect you.]", "Shutting her eyes, Seo Yuhui reflexively put her hand over her left chest. She could clearly feel the throbbing of her pulsating heart.", "‘Why did he have to say that all of a sudden….’", "Although she looked like she was embarrassed…", "‘Jeez…’", "Seo Yuhui had to try her best to suppress the corners of her mouth from curling up."]}