{"cid": "259", "title": "Chapter 259. Fox, O Fox (5)", "content": ["Darkness blanketed the city. Shrouded by the dusky light, Yang Yang was carefully observing the main gate of Carpe Diem’s building.", "Men who looked like members of the Triad were wandering in front of the gate.", "‘Twelve at the main gate, eight on the roof…’", "Counting the number of people guarding the area, Yang Yang furrowed his brows faintly.", "‘That’s it?’", "He had brought elites of the three organizations just to be safe, but now he was starting to lose steam. Yang Yang retracted his gaze and looked back. Dozens of people were waiting for his order in the alley.", "Of course, this wasn’t the only alley where people were stationed. Once Yang Yang gave the command, the forces surrounding Carpe Diem’s building would rush in from all sides.", "Yang Yang asked quietly.", "“Where’s Miss Noah Freya?”", "“On standby, sir.”", "“Red Hwaru isn’t here yet?”", "“Yes, it seems that person is stepping out of this operation.”", "“Hmph.”", "Yang Yang clicked his tongue but didn’t mind it too much.", "‘I guess it doesn’t matter. I was thinking I brought along too many people anyway.’", "Ochoa Cartel was drawing attention, but that didn’t mean Yang Yang could operate without worry. The Red Hwaru that Park Dongchun supported was closer to an intelligence organization than a military one. Rather than inviting members who wouldn’t be all that useful for battles, it might be better to quickly proceed as things were.", "Yang Yang collected his thoughts and then looked at the building again. He heard that Carpe Diem’s Level 5 Warrior, Chung Chohong, had remained behind, but they had Noah Freya on their side.", "As long as things went according to plan and the Triads stayed out of this, Yang Yang had confidence in winning.", "‘I bet they’re all sleeping without a care in the world.’", "As he waited in anticipation, he felt his body heat up. Soon, the Daughter of Luxuria would be in his hands. Thinking about pushing down that voluptuous legend and having his way with her, his lower body began to stand.", "‘Hurry, hurry….’", "How much time went by? Finally, the moment he had been waiting for arrived..", "The men in front of the gate began to murmur. Soon, the building’s door opened wide, and what seemed like members of the Triads hurriedly ran out.", "The ones keeping watch on the roof also came down.", "‘Just like I thought! There were more!’", "Although he had been briefed beforehand, he had a sliver of doubt in his heart. But seeing dozens of people run out, his doubt grew smaller.", "Soon, every member of the Triads ran off toward the pub.", "‘Good.’", "Just in case, Yang Yang waited a little longer. Not long afterward, he received news that the members who had just left arrived at the confrontation taking place at the pub.", "Only then did Yang Yang give the command to charge in.", "The Triads must have been in a rush as they carelessly left the gate open. Even the building’s front entrance was slightly ajar.", "After checking that everyone was present, Yang Yang threw the door wide open without hesitation.", "It was dark inside. But having done this more than a couple of times already, Yang Yang and the others quickly spread out and began their search.", "“There’s no one on the first floor.”", "One Archer came back and reported, while Noah Freya smacked her lips. She looked uncomfortable with the situation.", "“It’s too quiet…”", "Just like she said, the building was eerily quiet. They could even hear the breaths and gulps of their allies.", "‘Did they go without saying anything?’", "Well, since the Triads had betrayed Carpe Diem, it made sense. Just as Yang Yang was about to proceed according to plan, he caught sight of a faint source of light.", "It was coming from the sixth floor.", "‘That’s one. But anyway, what a stupidly large building.’", "Yang Yang grumbled inwardly before giving a command. A portion of the invading force was to guard the entrance while the rest would spread out and search the other floors.", "“Most are non-combatants or are low-leveled, but be careful of Chung Chohong. Don’t fight her if you can help it and call for help immediately.”", "With this, Yang Yang turned around.", "“As for you, Noah Freya-nim…”", "“I know. You want me to wait at the entrance and deal with Chung Chohong?”", "“Yes, thank you.”", "Yang Yang bowed, then turned his steps to the stairs. He gave the signal with his hand, and his men concealed their footsteps and quickly climbed up the stairs.", "Yang Yang’s squad took charge of the sixth floor. The source of the light was a small gap in a door.", "‘This is always the most exciting part.’", "Who was inside? What kind of face would they make?", "Yang Yang reached towards the doorknob, feeling thrilled like a child who was about to open his Christmas present.", "Kiik— The door creaked open, and the room came into view.", "Yang Yang immediately stopped. There wasn’t just one, but four people were gathered in the room.", "‘Were they having a meeting this late? Didn’t the Triads not tell them anything before they left?’", "Yang Yang’s eyes quickly scanned the room as a hint of suspicion flashed by his head.", "An old man and a teenage youth calmly stared at him, one young woman looked at him apathetically, and…", "‘Oh?’", "When Yang Yang saw a woman raising her upper body from the bed, his jaw dropped open.", "‘Incredible!’", "Silky black hair and pupils that were like a tranquil lake. Although he had heard the rumors, Seo Yuhui’s appearance surpassed his wildest imaginations!", "“Who are you?”", "She asked in a soft voice, a gentle smile on her face. Yang Yang grinned, barely managing to hold onto his composure.", "Lady Luck must be on his side as Chung Chohong wasn’t in this room.", "“I came here to pluck a flower.”", "Yang Yang introduced himself in a ‘gentlemanly’ way, making another young woman leaning against the wall giggle. She dropped her head down and shook. Though Yang Yang had never seen her before, he guessed that she must be Miss Foxy.", "Yang Yang turned his gaze back to the woman on the bed.", "‘So that bitch is the Daughter of Luxuria.’", "Even within the loose pajamas, her voluptuous breasts drew a hearty mound. Seeing this, Yang Yang swallowed hard. But feeling his disgusting gaze, Seo Yuhui’s expression quickly stiffened.", "Yang Yang replied with a vulgar smile. He didn’t care about the change in Seo Yuhui’s expression. In his mind, her expression would make a 180 degree turn sooner or later…", "‘Wait.’", "Then suddenly, he was struck with a strange feeling. Although Seo Yuhui asked who he was, she was a lot calmer than he expected.", "Other than a young girl who was staring at him nervously, the rest of Carpe Diem’s members were only staring silently. Looking back, even Seo Yuhui’s smile seemed odd.", "It no longer seemed warm, but completely cold. It was as if she was sneering at him coldly.", "Then, she pulled the blanket up to her chest, staring pitifully at Yang Yang.", "“It looks like there’s nothing more to see.”", "A giggle broke the silence. Kim Hannah raised her head, her hand covering her mouth and her eyes gazing at a spot in the air.", "“Do your thing, Flone.”", "Yang Yang looked up reflexively.", "“!”", "Then, he subconsciously stopped breathing. A black smoke circled around the air before transforming into a human-shaped figure.", "[Dirty bastards.]", "The figure crossed its arms and looked down with white sclera that lacked black irises.", "Yang Yang was lost for words, seeing this extraordinary scene. As he was standing in a daze, he suddenly realized something else that felt off.", "He had not entered this room alone. There should have been over a dozen of his comrades behind him. If they also saw what he just witnessed, they should have said something by now. But it was too quiet.", "“….”", "Suddenly, the atmosphere turned cold.", "He wanted to turn around, but his brain was sending all sorts of warning signals. An ominous feeling slowly crept up inside him, making him a little dizzy.", "Although he knew he shouldn’t, Yang Yang slowly turned around.", "There, he clearly saw a bizarre scene — his comrades’ heads dropping, their limbs limp.", "Looking closer, their feet were slightly hovering in the air, not touching the ground. It was like seeing stringed puppets.", "“What…”", "Yang Yang muttered in a daze.", "“W-What… why is everyone…”", "He stammered.", "[How long are you guys going to possess them?]", "Yang Yang flinched, panic slowly setting in.", "[I don’t care if you kill each other or just break their necks. Just hurry up and come out.]", "A cold voice rang out in his head.", "[Then, for the guys between the 2nd floor and the 8th floor…]", "[I’ll give you 10 minutes to kill them all. Go!]", "And with that, the drooped heads of Yang Yang’s comrades cracked up. The moment the startled Yang Yang turned back to the front, the comrades’ eyes shone with a chilling blue light.", "*", "On the other hand…", "“KUAA—!”", "One of the squad members searching the 5th floor stopped.", "“…A scream?”", "Although the voice cut off in the middle, unless he had misheard, it was definitely a scream. The squad member looked up at the ceiling before stopping the search and quickly leaving the room.", "Running through the dark, empty hallway, he tilted his head. If he didn’t mishear the scream, shouldn’t one or two of his comrades have rushed out to the hallway by now?", "“Did I really mishear it?”", "He looked around, trying to find someone he could ask. Then, he just happened to see a half-open door and walked over.", "Once he entered, he saw his comrade frozen in place from shock.", "“You heard it too?”", "The comrade’s head creaked to the side slightly.", "“That scream, I mean. Shouldn’t we go upstairs?”", "This time, it creaked to the other side.", "“Hello? Why aren’t you saying anything?”", "Then, it began to bob left and right like a pendulum. The squad member frowned.", "“Will you cut that out? This isn’t the time to be fooling…”", "He trailed off. He had not noticed until now because of the dark, but he could see his comrade’s face and back from the same direction.", "It was impossible unless his head was twisted back 180 degrees.", "But what was stranger was that his face turned side to side even as his neck rattled, and his mouth slowly opened until it split all the way up to his ears, making a bizarre smile.", "KIHIHIHI!", "A truly disturbing laughter rang out before he suddenly convulsed as though he’d been electrocuted. Then…", "Pak! He suddenly exploded, blood and flesh flying everywhere, sticking to the face of the dazed squad member.", "Seeing this grotesque sight, the squad member lost control of his emotions.", "“Heeu—!”", "But because he was so surprised, he couldn’t even scream properly. His voice got stuck in his throat. Then, following his instincts, he turned back and ran.", "Racing through the hallway, there wasn’t a single thought in his head. His instincts had completely taken over, telling his shocked body to escape from this terrifying place.", "He hurried to the stairs to join his comrades on the first floor, but he had to stop because a dark figure was obstructing the staircase.", "He couldn’t see clearly in his panicked state, but he could tell that the figure was tall enough to touch the ceiling. Moreover, a squirming evil will emanating from the figure made him think it was anything but human.", "“You… what are you…”", "He was cut-off from both sides. Unable to go front or back, the squad member stumbled backward before tripping on his own foot and falling on his butt.", "Ssk. The dark figure instantly closed in on the man and snatched up his neck. As the figure slowly lifted him up, the man’s feet flailed in the air.", "Crack! Along with a hard crack, the man’s feet flew up. That was it. His body sagged down like a wet mop.", "“It doesn’t look like there’s anything on the 5th floor…”", "At that moment, a woman walked out of a door at the end of the hallway. Feeling like someone was sneaking a glance at her, she stopped and paused.", "An unknown sense of nervousness surged up. A human being’s intuition was better than one would think. The woman checked her surroundings almost instinctively.", "And when she slowly raised her eyes and glanced at the ceiling…", "“Ah?”", "A figure dropped down, its mouth wide open like a crocodile.", "Before her head was swallowed whole, the woman’s eyes split open.", "KYAAAAAAAH!", "*", "By now, Noah Freya had noticed the peculiarities. And with the previous scream, she was convinced.", "An unexpected accident had occurred.", "‘Is it Chung Chohong?’", "That was the most probable theory she could come up with.", "“Damn, I don’t know what bitch that was, but she sure can scream.”", "“Did these fuckers start before us?”", "Noah Freya pitifully glared at the members giggling to themselves before grabbing her sword and walking forward. But soon, she realized she didn’t need to go up the stairs.", "Splat! A person fell to the first floor with a muddy splat. Organs spilled out from the corpse, cut in half from the neck down.", "Next, a corpse missing its upper body fell down spinning. It rolled on the ground, gushing out blood, before finally coming to a stop.", "A bloody stench mixed with hot steam stung Noah Freya’s nose. The jokes immediately stopped, and the surroundings turned silent.", "But the fall of the two corpses was only the start. Before anyone could say anything, more corpses began to drop from the upper floors.", "Like heavy snow, they fell and formed a mound on the first floor until all members who had gone up returned.", "It didn’t even take 10 minutes for the dozens of the corpses to form a pool of blood in the lobby.", "Drrrr. The last corpse rolled down the mountain and hit Noah Freya’s feet.", "“…Yang Yang?”", "Although the corpse’s eyes were dug out and its limbs were ripped off, it was Yang Yang without a doubt.", "“Kuk… kuk….”", "With two hoarse gasps, he stopped breathing.", "Seeing the pitiful death, Noah Freya’s face went stiff. She didn’t know what happened upstairs, but a clear fear remained in Yang Yang’s lifeless expression.", "‘It’s not Chung Chohong.’", "Noah Freya hadn’t heard anyone fighting. No, she didn’t hear anything at all other than the scream that pierced the entire building.", "“….”", "Something had gone wrong. Majorly wrong.", "While everyone was standing at a loss for words, the Level 5 Noah Freya moved nimbly. She pulled out her longsword, held up her shield, and slowly backed off.", "Although she had the choice of leading the remaining members, all she could think about was getting out of this building as soon as possible.", "Only then did she feel like she could live.", "Just as she was about to use her comrades as meat shields to escape…", "“Ah.”", "Noah Freya failed to achieve her goal.", "Because the entrance was opening by itself.", "A group of people was standing beyond the slowly opening door.", "Noah Freya’s mouth dropped open."]}