{"cid": "107", "title": "Chapter 107. Budding", "content": ["Just like its name suggested, the Huge Stone Rocky Mountain was extremely rugged from all the rocks that covered its surface. It also had several peaks piercing through the clouds to the skies.", "“Huk, huk! Huk, huk!”", "Furthermore, the word ‘rough’ didn’t begin to describe its roads. The mountain’s wildly curved ridges were full of sharply protruding rocks that caused more than a few difficulties when running.", "“Uuaaaaah!”", "Not even five minutes had passed since Seol Jihu started running, but he was already screaming as his feet kicked off the rugged ground. The slope toward the mountain peak wasn’t any different. If anything, the added steepness only made it worse, greatly exacerbating the burden placed on his thighs and calves.", "‘This isn’t running…!’", "It was practically impossible to rein in curse words, but he was too busy gasping for breath to let them escape his mouth. Just moving one leg forward took two seconds. It was more fitting to say that he was climbing the mountain rather than running on it.", "That wasn’t all. Since he didn’t know when a monster or a wild beast would pop out of the woods, he had to stay mentally alert at all times….", "“!”", "Did he lose his focus for a moment? Just as he was about to reach the mountain peak, he lost his footing and slipped.", "“Aaaah!”", "The hands he threw out to balance himself grabbed onto a rock. He pulled himself up to the peak clutching this rock like a straw, and then he finally heaved out the breath he’d been holding back.", "It was so miserably dreadful and tiring. He was panting rapidly as if he was on the verge of taking his last breath. When he turned around with his raspy breathing, his gaze pierced through the foggy clouds around him and landed on the starting point in the distance.", "Seol Jihu’s face contorted. He bit his lower lip hard enough to leave a clear mark, then started to make his way down.", "People who rock-climbed for fun all said the same thing - that the descent was far more exhausting than the ascent. In other words, Seol Jihu couldn’t ease up on his run just because he was going downhill.", "Because of the steepness of the slope, he accelerated naturally. Speeding down a rugged terrain was no different than committing suicide. One would normally have to control themselves so as to not gain too much speed, but the current Seol Jihu found it extremely difficult to do this.", "“Keeeu!”", "Each time he stepped on the ground and forcefully suppressed his momentum, his feet felt like they were on fire. Because there were too many things going on at once, he lost his focus and fell forward from the burden on his body.", "Thankfully, he was able to get back up without major injuries, but he couldn’t do anything about his trembling legs.", "Seol Jihu fell down and rolled on the ground several more times before he finally made it back to the starting point. By this point, he was half delirious. However, Jang Maldong only watched him silently, and Seol Jihu had to turn around as if a powerful pressure pushed him forward.", "Once, twice, thrice…. The more trips he made back and forth, the more injuries he got on his body. Sweat oozed out from every pore in his body, and his heart pounded as if it would burst out at any moment.", "He was at his limit.", "‘No.’", "For some reason, he felt something was off with this training. However, Jang Maldong spoke clearly, like a judge passing down a punishment to the accused.", "“Forty-five remaining.”", "Instantly, Seol Jihu felt his legs go limp. Was this what it felt like to be a criminal sentenced to death? He had already suffered so much just to complete five trips, yet he had to make forty-five more?", "He wasn’t even half-way done, but despair began to set in. That was how painful and brutal this training was.", "“Why aren’t you running? What, you’re quitting already?”", "Seeing Seol Jihu hesitate, a fiery order descended.", "“Don’t rest. At the speed you’re going, you won’t be done until the morning.”", "“But—”", "“But? You said you wanted to be a Warrior, didn’t you?”", "Jang Maldong spoke with indifference.", "“Unless you want to admit you’re all talk with nothing to show for yourself, take your foot off in the next second.”", "“S-Sir.”", "“Pack your bags.”", "Jang Maldong turned back. Seol Jihu gritted his teeth and kicked off the ground.", "In the end, he ran for the entire day before managing to complete the fifty trips. When he came back to the cave, it was already dawn. Although dinner was prepared for him, he collapsed before the thought of eating even brushed his mind.", "Chwaaa! Suddenly, cold water fell on his face. When he blinked his eyes open, he saw Jang Maldong standing with a bucket.", "“Damned brat, why aren’t you up? I thought you were dead!”", "“H-Huh?”", "“Get out here! The sun’s already up! How long do you plan to continue sleeping?”", "Seol Jihu looked forward in a daze. Serene morning sunlight was illuminating the entrance of the cave.", "‘No way.’", "He felt like he closed his eyes just a second ago. However, he heard Jang Maldong shouting at him to get out.", "“Keu….”", "He was sore and stiff all over. When he took a step, even his foot hurt. It had to be a mess full of popped blisters.", "He didn’t have the courage to take a look. When he staggered out of the entrance, his sandbags and Ice Spear came flying at him.", "“Ten-thousand times.”", "“?”", "“Perform the Thrust, Strike, and Cut ten-thousand times each.”", "Seol Jihu was putting his sandbags on one-by-one but paused when he heard this. It wasn’t ten-thousand times total, but ten-thousand times each. In other words, he had to perform the techniques thirty-thousand times.", "“And after you’re done, run just like you did yesterday, except this time, it’ll be 100 times.”", "“Uuk.”", "He almost vomited just from hearing this. His training load had more than doubled in a single day. Seol Jihu covered his mouth and let out a pained moan.", "*", "A day went by, then another. On the third day, heavy rain poured down.", "However, the training continued without a hitch. Even as he was battered by the pouring rain, Seol Jihu desperately thrust, struck, and cut.", "“I don’t understand.”", "Agnes, who was quietly staring outside of the cave entrance, opened her mouth.", "“This training will hurt his body. You should at least let him eat nutritious—”", "“If you’re talking about breakfast, I already gave it to him.”", "Jang Maldong muttered as he chewed on vegetables he harvested in the mountain. As the two of them had great respect for each other, the way they talked was extremely polite.", "“Well, he ended up throwing it all up during the training, though.”", "“If I may be impertinent, I’d like to ask why you are pushing him so far…. It’s not like you, Master Jang.”", "It was a rare sight seeing Agnes so worried. However, she couldn’t be blamed as Seol Jihu’s condition was racing toward the absolute worst.", "His bright eyes had turned lifeless and the smile had disappeared from his face. The way he tottered around, it really looked like he was a dead man walking.", "“I have no other choice.”", "Jang Maldong replied calmly.", "“I think he realizes it himself, but he’s currently twisted completely. His mind, technique, and body. All of it.”", "Kazuki and Hugo looked as if they couldn’t understand. However, Agnes, who had experience teaching Seol Jihu, carried a complicated look.", "“Are you talking about the incongruity in his mind, technique, and body?”", "“It’s not so simple.”", "Jang Maldong shook his head gravely.", "“For him, all three of these fundamental elements are twisted. His talent is exceedingly average, but his mind is incomprehensibly chaotic; his technique seems to be high level, but he can’t use it properly; it’s the same with his body - he has powerful hidden strength, but his physical body can’t handle it.”", "Jang Maldong fully understood Seol Jihu’s dilemma. Comparing him to a geometric shape, he was like a strange polygon with one or two vertices shooting out abnormally.", "When Jang Maldong first saw him, he thought, ‘What the heck is he?’ And he didn’t have the slightest idea how to go about fixing him.", "“Before we discuss the disharmony in these three elements, we have to correct the parts that are warped out of shape….”", "If the young man continued to grow like this, it would be irreversible. He would truly become a chaotic mess.", "“Then….”", "“There are three ways to fix him.”", "Jang Maldong furrowed his brows as if the problem was giving him a headache.", "“The first method is to abandon the mind and the body and focus on training the technique to the limit.”", "“You mean to draw a line on his growth potential?”", "“I understand why you would feel that to be a shame, but even then, he will at least become a High Ranker. If he had chosen the path of the Magician, he might have even reached the Unique Rank.”", "‘That much?’", "A hint of disbelief emerged on Agnes’s face. Jang Maldong was implying he would eventually reach a limit, but that this limit would have an abnormally high ceiling.", "Agnes knew how special the young man’s Status Window was ever since she was in the Neutral Zone. But the word ‘Unique Rank’ wasn’t one that could be thrown around so easily.", "“The second method is to suppress the growth of his technique to the limit while he improves his mind and body until the three elements are even.”", "“You mean to correct him by balancing his mind, technique, and body.”", "“It will take time, but this is the surest way of going about this.”", "However, Seol Jihu refused this.", "There was only one method remaining, and that was to combine the first method and the second. More precisely, it was to not limit the technique’s growth, bring up the mind and the body to the same level of the technique, and fix the warped parts of the three elements. All of this had to be done in harmony.", "Since there were more than two things that needed to be done simultaneously, it was only obvious for the difficulty to skyrocket.", "‘Would I be able to do it?’ Agnes thought for a moment before shaking her head.", "“There is a limit to one’s willpower. That is not something a ‘human’ is capable of.”", "“I concur.”", "Jang Maldong also agreed. The final method couldn’t just be described as ‘difficult’. One truly needed willpower transcending the human realm to be able to even attempt it.", "“So he needs to come to terms with it himself.”", "Hearing this, Agnes finally realized why Jang Maldong was making Seol Jihu repeat such a crazy training regime. It was to tell the young man that if he didn’t stop now, things would get much harder in the future.", "“In any case, this is quite a surprise. I didn’t expect you, Miss Agnes, to worry about him so much.”", "“Ah, that’s….”", "When Jang Maldong brought up this topic, Agnes told him that she taught Seol Jihu back in the Neutral Zone. Jang Maldong put on a surprised look.", "“So that’s what happened…. Did he handle your training well?”", "“He completed it outstandingly.”", "“I see…. Well, you wouldn’t be here if he didn’t, fufu.”", "Jang Maldong laughed and got up as if he finally understood.", "“I was thinking he was lasting well. It makes sense if he trained under the infamous Demonic Instructor. Thank you for the good info.”", "Jang Maldong grinned.", "*", "Fourth day.", "The rain stopped. As if the previous day’s downpour was a lie, scorching sunlight beat down.", "The training changed too. The intensity went up, and a new drill was added.", "The training started out the same way as always - performing thirty thousand spear techniques in the air. As soon as this ended, Jang Maldong made Seol Jihu wear all twelve sandbags, and today, he said he would change the running course.", "He said to make the mountain peaks on the left and right side as half-way points. In other words, rather than going back and forth in a straight line, Seol Jihu now had to run in a zigzag.", "As he was finally getting used to the straight path, this change struck him like a bolt of lightning from the clear sky.", "That wasn't all. Every time he completed ten trips, he was made to perform the Thrust, Strike, and Cut a thousand-times each. What pained him the most was that Jang Maldong began to actively intervene in the training.", "He didn’t give Seol Jihu even the slightest break between each drill. In just ten or so minutes, Seol Jihu had to complete three sets of burpees and kettlebell swings.", "And when he was about to collapse at the end of it all….", "Tak, tak, tak, tak!", "“Who told you to faint? Get up!”", "“Aak…. Aak….”", "Jang Maldong brutally swung his cane.", "In the end, Seol Jihu had to grit his teeth and turn his steps to the mountain peak.", "*", "Fifth day.", "Jang Maldong wasn’t always with him when he was training. There were times when he left to see how the others were doing, but that didn’t mean no one was watching Seol Jihu.", "Today, Kazuki came as a replacement.", "After Seol Jihu completed his thirtieth trip and was repeating the Thrust, Strike, and Cut….", "“Wuuuuek!”", "Vomit suddenly poured out of his mouth. His stomach had been unable to digest the lunch he had forced inside.", "However, he only faltered for a moment. He immediately went back to performing the Thrust, not caring to even wipe his mouth.", "“…You shouldn’t overdo it.” Kazuki was silently watching him until now, but he finally opened his mouth.", "“No one has ever seen the end of the Banquet on their first time.”", "Seol Jihu didn’t say anything. Kazuki could tell he was listening from the way he glanced his way once, but the young man didn’t open his mouth. It couldn’t be helped since the current Seol Jihu was pushed to the point where every single breath was precious.", "“You’re still a Level 3. You can try again two years later when you’re Level 4 or higher.”", "Seol Jihu’s face contorted. Sometimes, the kind sister-in-law’s concern seemed more annoying than the nagging mother-in-law. He was already exhausted and on the verge of breaking down, so he was angered by Kazuki’s meddling words.", "“If it is because of Master Jang, you don’t have to worry. He is waiting for you to realize it yourself. Sure, he might yell at you, but since you’ve come this far….”", "Swish! The end of the Seol Jihu’s spear suddenly headed towards Kazuki. Although it stopped before it reached his neck, the dulled blade regained its sharpness momentarily.", "He was telling him to shut up unless he was going to help him.", "Kazuki’s eyes narrowed to a slit.", "“What’s the meaning of this? You’re asking for a fight?”", "“…Don’t bother me.”", "A raspy voice rang out. Kazuki’s eyebrows twitched.", "“What?”", "“I’m telling you not to irritate me. I don’t know what I’ll do in my current state.”", "Seol Jihu pulled his Ice Spear back as he glared at Kazuki with his dim eyes. Then, he went back to performing the Thrust.", "Kazuki rubbed his neck and gritted his teeth.", "“Are you really going to be stubborn?”", "“Shut up. I know what you mean, so shut up!”", "Seol Jihu growled. He was pushed to the corner and didn’t have the peace of mind to behave normally.", "“I don’t understand. What’s so wrong for a spearman to throw a spear?”", "“Who said I wouldn’t?”", "PANG!", "The Thrust. In an instant, the sound of air exploding rang out from the tip of the spear. Startled by the noise, Kazuki doubted his ears belatedly.", "“W-What?”", "“I’ll use it! I’ll use it, but…!”", "PANG! PANG!", "His Strike and Cut began to carry the same shockwaves as his Thrust. However, Seol Jihu remained oblivious and shouted without rest.", "“I’m saying I don’t want to just throw my spear!”", "“But why?”", "“What if there’s a situation where the Mana Spear doesn’t work?”", "“You’re right, that can happen. If there’s a situation like that, just leave it to us. There’s a reason Earthlings move around in teams.”", "“What if the team is in trouble when my Mana Spear doesn’t work!?”", "“Are we playing 21 Questions?”", "Seol Jihu laughed. It was a clear, derisive laugh.", "“Want to know what I heard!? I heard that the Banquet is full of uncertainties and randomness!”", "Kazuki became speechless.", "“Can you guarantee what you just said?”", "“….”", "“You can’t!”", "“….”", "“No one can be sure about anything! So what’s wrong with wanting to prepare for that one in ten-thousand chance!?”", "Seol Jihu roared as if he was shouting his death throes.", "“I don’t want to stand there unable to do anything, like that time Chohong collapsed…!”", "From the way he was babbling on, it sure looked like he’d gone crazy. Kazuki smacked his lips and let out a long sigh.", "“…Crazy fool.”", "Crazy fool. Do I look like a crazy fool to others? ", "Fine, they can call me crazy all they want.", "After finally finishing his 3,000th Thrust, Strike, and Cut, Seol Jihu threw his spear down and began running like crazy.", "Just like that, the fifth day went by as did the sixth. Finally, the seventh day dawned.", "That was also the first day that a hint of bitterness appeared on Jang Maldong’s face.", "*", "There was a time when he thought this. That it was his fate to come to Paradise.", "He couldn’t be blamed. He had a Gold Mark and two Innate Abilities, neither of which anyone else seemed to have. Furthermore, everything he did was smooth sailing. He remembered snickering to himself, thinking that if a protagonist existed in Paradise, it had to be him.", "However, this thought started to fall apart when he left the Neutral Zone. Seol Jihu wasn’t the protagonist. He felt it.", "When he looked around even a little bit, he saw people who were a thousand times stronger than him. Because he always put himself in missions exceeding his capabilities, he almost lost his life multiple times.", "He survived pitifully and desperately. He was nothing like what the protagonist would look like.", "It was the same for getting stronger. The protagonists from novels got stronger easily by finding treasures and having fortuitous encounters.", "But he wasn’t like that. His talent was exceedingly average, and although he was giving it his all, he wasn’t seeing much progress.", "And now, even the abilities that made him special were beginning to strangle him. It wasn’t anyone’s fault but his.", "He could only arrive at one conclusion — to put in more effort.", "The moment the young man realized that he wasn’t special, the only thing he could do was put in painstaking, bloodcurdling effort.", "This was the reason Seol Jihu didn’t quit this hellish training.", "Suddenly, his escape from the Delphinion Duchy’s laboratory popped up in his mind. When he was hungry at first, all sorts of food bounced around in his head. Then, he suddenly thought of the refreshing taste of Coke but ultimately desired water.", "To be more precise, his body began to crave water. His brain, his head, his organs… every cell in his body searched for it.", "It was the same with training.", "At first, he was approached by all sorts of temptations: to take a break, to rest when no one is watching, or to take a sip of water and smoke a cigarette.", "The temptation would tell him, ‘Why don’t you take it easy?’", "But once he passed this phase, he became reluctant to give in. Even if he wanted to take it easy, he gave it his all because he didn’t want to waste everything he’d endeavored before.", "From that point on, no thoughts entered his mind, and his body moved on its own.", "But just like Agnes said, even the strongest willpower had its limit.", "A silent night. Seol Jihu had been unable to complete today’s training due to his piled-up exhaustion and was staying up alone to finish it.", "‘…What number was I on…?’", "Was that the fortieth?", "He looked up at the mountain peak with half-closed eyes. He staggered side to side as if he would fall at any moment. Then, he felt something ‘snap’ in his head.", "‘Huh?’", "When he opened his eyes, he saw the ground. He was just about to climb the mountain slope, so why was he seeing dirt?", "‘…Ah.’", "His mouth widened. He seemed to have lost consciousness for a couple of seconds. However, he didn’t really care.", "‘…The end….’", "He felt the strength supporting his body leave.", "‘…Should I lie down?’", "It’s fine. I just have to faint.", "‘I’m not quitting.’", "It’s just that I have no choice but to faint.", "Right, it was an impossible training regime from the start.", "Kazuki said it too. That this training was designed to make me quit.", "‘Let’s lie down. I did more than enough.’", "Slowly, he grew closer to the spider-filled dirt. A thin smile emerged from his widened mouth.", "‘I just have to close my eyes.’", "It will feel like heaven when I lie down on the wet dirt. It will cool my heated body and embrace me gently.", "‘It’ll be comfortable….’", "Since there’s something blocking my path like a wall, it’s not like I can run anyways….", "‘…Wall?’", "Strength entered his lifeless eyes. Even at this moment, he was getting closer to the ground. On one hand, he felt a strange sense of deja vu. Almost like he had experienced this once before….", "Just as his face was about to touch the ground, the young man’s complexion was suddenly captured by his mental conflict.", "I want to lie down. I want to lie down and close my eyes….", "“!”", "Kwak!", "His hands touched the ground by a hair’s breadth.", "‘Wall!’", "The wall! The wall had finally come for him. The moment before his collapse, he finally saw the limit he could overcome.", "Now what?", "‘I have to overcome it.’", "He focused strength into his arms and pushed himself up. He stepped forward onto the mountain slope with his screaming legs. And thus….", "“Uwaaaaaah!”", "Seol Jihu began to run once more.", "*", "‘Crazy.’", "That was the evaluation Jang Maldong gave after watching Seol Jihu reach the mountain peak. He thought the young man would finally collapse, but he put his arms out at the last moment and pushed himself up. He then managed to run to his destination.", "‘You…’", "In truth, he never expected him to follow his training. In gaming terms, it was as if he defeated a boss that couldn’t be killed by dealing damage to it. In war terms, he had broken his way through ankle mines, PMD series mines, M16 mines, claymore mines, trap wires, and even anti-tank mines.", "‘Just what—’", "At this point, it wasn’t a simple matter of being stubborn or tenacious. The human body was more honest that one might think. Even if someone tried to hold on with their willpower, the brain would cut off all signals if things seemed dangerous.", "But the fact that he was going this far…", "‘Just what are you?’", "…Meant that he had endured pain exceeding this training. Although Jang Maldong’s training sought to put his life at risk, it was still a simulated risk. The young man had clearly confronted multiple, real life-threatening experiences.", "While Jang Maldong was standing in shock, Seol Jihu ran to the other mountain peak, leaving only a single hill behind.", "One step, then the next. Soon, he slowed down and faltered.", "Jang Maldong stared at him nervously before blinking his eyes in surprise.", "“You….”", "He was crying. What was he so frustrated about? His eyes were still rolled back, but he was gritting his teeth to continue climbing.", "Jang Maldong was about to subconsciously make his way down but stopped. He bit his lower lip before opening his mouth, “…There’s one left!”", "When the young man staggered and almost fell, Jang Maldong scowled and struck the ground with his cane.", "“Hurry up! Are you going to give up now when you’re almost done!?”", "Twitch. Seol Jihu flinched.", "“Uuk… heuk….”", "With his trembling arms and legs, he clenched his teeth and held back his tears before finally managing to return to the starting point!", "Crash. A tumbling sound rang out the moment he arrived. Soon, his trembling body sprawled down.", "After a moment of silence, Jang Maldong opened his mouth.", "“What’s the reason?”", "“….”", "“I’ve lived a long life, but I’ve never seen anyone like you. What’s the reason you’re going so far just to participate in the Banquet? Crazy brat!”", "“…Neutral Zone….”", "It seemed he hadn’t fainted yet as mumblings came out along with his panting.", "“I became blind… without any preparation… skeletons….”", "“?”", "“Almost died… so… I vowed….”", "Words that were hard to understand came out of his mouth.", "“…I see your determination.”", "With a short sigh, Jang Maldong threw what was in his hand. Tk. A fist-sized pouch landed next to him.", "“It’s Competence.”", "Seol Jihu’s eyes shone. There was Competence among the village head’s medicine? No, Paradise had Competence?", "“Competence…?”", "“What’s there to be surprised about? Most items in the Neutral Zone were made in Paradise.”", "Now that he thought about it, it really was like that. Psychi’s Tears was something a Paradisian concocted as well.", "“Well, I didn’t think I’d see it here either. After all, its brewing method disappeared when the Empire fell.”", "“….”", "“Because of its rarity, it should fetch a nice price…. Do you want to sell it?”", "Seol Jihu shook his head vehemently. Why would he sell it when he desperately wanted them? Jang Maldong opened his mouth as if he predicted as much.", "“Then starting from today, drink one bottle before you start your training. The quality of training will go up starting tomorrow. You might be able to pull it off if you drink that Competence.”", "When Seol Jihu opened the pouch and saw bottles filled with milky liquid, his head shot up.", "“…Pardon?”", "“Nothing’s changed.”", "Jang Maldong grumbled with a somewhat solemn voice.", "“What matters is that you lasted another day. I’ll pack my bags the moment I see you slacking, got that?”", "Jang Maldong turned around. He paused his steps before he went back into the cave and spoke with a softened expression.", "“…Rest. It will only get harder from tomorrow.”", "No, perhaps it was more appropriate to describe his expression as ‘I lost’. If Ian knew, he would most certainly fall backward in shock. After all, the young man had defeated the old man who was known for his stubbornness.", "“Go take a shower too before you come back. You smell horrific.”", "Hmph. With a snort, Jang Maldong slowly disappeared into the cave.", "Seol Jihu remained collapsed on the ground for a while before he staggered up. When he held the pouch in his hand, his exhausted expression became dazed. He had been too out of it to notice before, but a few message windows were hovering in the air.", "[Trait ‘Tenacity’ has been created.][Trait ‘Patience’ has evolved to ‘Self-command’.][Your Stamina stat increased from ‘Low (High)’ to ‘Intermediate (Low)’.]", "He’d done it. Having the second part of the stat change wasn’t an easy thing to do. Not only did it require more points to increase them artificially, but there was also a huge difference between Low and Intermediate.", "What mattered was that Seol Jihu didn’t use points to level it up. Unless one was an athlete who trained regularly, the Strength and Stamina stats were extremely difficult to breakthrough by training. However, Seol Jihu managed to succeed.", "‘It didn’t increase for the longest time.’", "That was to be expected. Although Seol Jihu never skipped out on training until now, he had never pushed himself to his absolute limit. That was why his stats were maintaining their current rank without going up.", "But the harsh training he endured in the past week had combined with what he had built up until now, resulting in this increase in Stamina. Once he let his body recover, he would be able to feel the difference.", "Seol Jihu got up with a lighthearted face. He couldn’t help but feel ecstatic. During the past seven days, he had to constantly fight himself without rest.", "Of course, as a former gambling addict, this wasn’t the first time he fought with himself. However, he had only lost until now.", "But today….", "“…Hehe.”", "He had acquired his first victory. So how could he not be happy?"]}