{"cid": "295", "title": "Chapter 295. An Unexpected Clue (2)", "content": ["The Tutorial ended.", "Marcel Ghionea led the survivors who passed Area 1 to a place with a stage, much like a theatre.", "Seol Jihu did not go with them. Although he was a Helper during the Tutorial, it was time to go back to his role as the head manager.", "He was the one originally responsible for activating Synchronization and explaining the goal of the Neutral Zone to all Area participants. But he entrusted this role to Kim Hannah.", "This was because the fatigue that had been building up inside him finally exploded the moment he entered the Neutral Zone.", "It was only natural, considering the amount of work he had to put up with before the activation of the Neutral Zone, plus the fact that he had just fought with an atrocious monster for hours in a Tutorial that he thought was going to be an easy breezy.", "So after delegating his job to Kim Hannah, he headed to the manager’s room.", "‘So there was a place like this.’", "The head manager’s room resembled a secret monitor room often seen in movies. Every communication crystal inside the tower was connected to this room, so the manager could keep an eye on all parts of the Neutral Zone. Looking around, Seol Jihu smiled. He had discovered a small chick dozing off on the couch.", "“Hey, you. How have you been?”", "“…Pyak?”", "When Seol Jihu picked him up, the chick squirmed in his grip, unhappy with being woken up. With a grin, Seol Jihu sat on the couch and leaned back. The chick yawned and curled up on top of Seol Jihu’s chest.", "At that moment, one of the many monitors in the room displayed Kim Hannah speaking in front of a crowd. Seol Jihu watched, stroking the soft feathers of the baby chick with his fingers.", "—You will have to gather 1,000 Survival Points during your 3-month stay here at the Neutral Zone….", "Kim Hannah’s explanation was more straightforward than that of Cinzia. By properly announcing the set period and specifying goals, she helped the participants learn the direction they needed to take in tackling the problem at hand.", "Her explanation was simply flawless, but Seol Jihu didn’t pay much attention to it. Not only did he know most of the information already, but he was also distracted by Seo Yuhui and how she looked in her suit.", "On the other hand, he couldn’t help but laugh when the camera showed Hugo in his excessively tight suit and Yi Sungjin with a dopey face.", "With his eyes half-closed and his lips grinning, Seol Jihu continued to watch until he finally started to nod off. It wasn’t long before he fell asleep, sitting upright on the couch.", "*", "‘…Hmm?’", "When he opened his eyes again, Seol Jihu realized that he was in a strange situation. He was sitting with his leg up on a table and a teacup in his hand in a garden. A pair of hands was massaging his shoulders quite skillfully from behind.", "“…”", "He didn’t even have to ask. This wasn’t the first time he visited this place, so he was no longer surprised. Seol Jihu spoke calmly, enjoying the taste of tea in his mouth.", "“This tea tastes great.”", "“Why, thank you.”", "As expected, a dreamy voice came from behind him.", "“I prepared it especially for you, Respected Visitor-nim.”", "Listening to the soft voice, Seol Jihu smiled. He knew why she called him here. Seol Jihu cleared his throat.", "“Kuhum, you didn’t call me when I really needed you.”", "“Oh my. I was quite busy. I had my hands full with teaching Charlotte Aria. Fufu.”", "“Still, how could you cut me off just like that? Honestly, I was a little upset.”", "“Awww, I’m sorry. I’m begging you, please don’t be mad at me!”", "Roselle patted Seol Jihu’s shoulder affectionately, speaking in a nasal voice.", "Seol Jihu chuckled softly. Never in a million years would he have guessed that the terrifying witch who once tried to destroy the Empire would try to curry favor with him.", "Anyhow, because he didn’t want to risk his life by irritating her, Seol Jihu decided to drop the act and ask her the question he was extremely curious about.", "“I’m surprised. I didn't expect you to call me here so soon.”", "“And I never thought I’d get this excited. In fact, I even lost my composure watching and spat out curses. Ufufufu.”", "“Curses?”", "“Yes. Truthfully, I don’t remember a thing, but Charlotte Aria informed me so.”", "Roselle smiled.", "“‘Damn! What talent! Just where the hell has she been all this time!?’ was apparently what I said. I was also told that I was jumping up and down in euphoria. Though, I suspect Charlotte Aria might have exaggerated a little.”", "It seemed that Roselle felt sorry that Eun Yuri had no experience with magic until now.", "“Is she that amazing?”", "Seol Jihu put his cup down and turned around.", "“A genius, perhaps?”", "“…A genius.”", "Suddenly, Roselle fell silent. She looked up at the sky with her hands still on Seol Jihu’s shoulder. After a moment of silence, Roselle replied.", "“Well, I’m not sure.”", "“You’re not sure?”", "“Because these kinds of standards are subjective, particularly in a case such as this. There is no absolute standard for evaluating a person. So the evaluation is always relative.”", "“Mm… I guess you’re right.”", "Seol Jihu pretended to agree while wondering all along what Eun Yuri’s talent would look like compared to Roselle’s. But he thought it would be rude to ask.", "Of course, he did this because he knew Roselle could read his mind.", "“My, aren’t you cunning.”", "As expected, Roselle read Seol Jihu’s mind and giggled.", "“I’m sorry, but if you’d like to compare her to me, that’s another reason for me to postpone my judgment.”", "“How come?”", "“I take pride in the achievements of my later years. Because I know myself well, I have no choice but to use stricter standards.”", "In other words, though Roselle acknowledged that Eun Yuri was gifted, she couldn’t decide for sure if Eun Yuri’s talent exceeded hers at this point in time.", "Even with that, Seol Jihu was satisfied. For Roselle, the prideful and unparalleled genius, to contemplate this matter seriously— that certainly was something.", "“I understand.”", "Seol Jihu smacked his lips.", "“If that’s the case, how about you give her a month or so? She has to wait until the Awakening Chamber activates to get her class. I planned to have her focus on physical training in the meantime.”", "“No.”", "Roselle shook her head.", "“I agree that she needs physical training. Magicians need stamina to maintain stronger spells for longer durations. But—”", "She paused for a second before continuing.", "“I don’t see any reason to wait. The training takes place in sleep, so we won’t have to worry about intruding on each other's training time. And I don’t care if she’s an Archer, a Priest, or a Warrior. No matter what her class is, she’s destined to walk down the path of magic.”", "Seol Jihu widened his eyes at Roselle’s declaration. Her eyes that were still fixed on the sky, grew dim.", "“Yes…. That’s right. That genuine, overwhelming, innate sense for mana! That is pure talent and nothing less.”", "Roselle announced confidently.", "“I have no doubts. The decision is ultimately hers, but if she chooses not to study magic, it will be a great loss to her country— no, to the world.”", "‘…Did I just hear a huge compliment?’", "After a moment’s thought, Seol Jihu nodded. He decided it would be best to follow the expert’s advice.", "“Then….”", "Seol Jihu said, tilting a cup of tea that was now slightly cold.", "“Things will start to get busy from now on.”", "Of course, not for him, but for Eun Yuri.", "*", "The next day.", "When he woke up, Seol Jihu realized he was lying in bed. Someone seemed to have moved him here from the couch. There were neatly folded clothes by the bedside.", "Smiling, Seol Jihu got up from his bed. He took a shower, put his clothes on, and left the room. He then saw Eun Yuri eating alone at a table in one of the cafeterias. She didn’t seem very enthusiastic about the food, but her face brightened when she saw Seol Jihu approach.", "“Hello.”", "“Good morning. Did you sleep well?”", "“I did, for the first time in a long time. My room was very nice.”", "“Ah, you mean the first ranker’s room. It’s a nice room, the best in the Neutral Zone, in fact.”", "No official report had been received yet, but there was no doubt in his mind that Eun Yuri was the top ranker.", "“In order to make the most of that room—”", "Seol Jihu paused and put on a bitter look. He noticed Eun Yuri’s spoon was moving faster than ever as if her appetite had suddenly returned.", "Like a kitten, she was wary of everything, but now that the mother-cat was here, it seemed that she felt safe enough to bury her head in the food bowl.", "“…Why were you not eating earlier?”", "“I just felt awkward eating alone.”", "Eun Yuri glanced sideways. Looking up, Seol Jihu quickly understood what she meant. Some people were watching Eun Yuri from outside the cafeteria, clutching their hungry stomachs.", "Come to think of it, it was still their first day in the Neutral Zone. People with zero Survival Points couldn’t afford a meal.", "“You should’ve called Park Woori or Yoo Yeolmu.”", "Eun Yuri did not answer. She went on eating in a hurry, afraid that her mother-cat was going to leave.", "Seol Jihu continued, “Listen as you eat. Now that you’ve reached the Neutral Zone…. Well, I suppose you’ve already learned the basics from Kim Hannah.”", "“I remember.”", "Eun Yuri swallowed a spoonful of rice while wiping the sauce off the corner of her mouth.", "“Don’t worry. I’ll definitely keep my promise.”", "Seol Jihu shook his head.", "“Well, there’s that too, but more importantly— do you remember me telling you that Valhalla would help you as much as possible?”", "“Yes.”", "Eun Yuri answered without hesitation.", "“I’ll do as you say.”", "Seol Jihu squinted his eyes, looking at her in a renewed way.", "“Mm…. Actually, I wanted to hear what you had on your mind.”", "“Honestly, I want to learn magic properly….”", "Eun Yuri mumbled.", "“But I don’t think that’s going to be easy given the circumstances. So I thought it’d be better to do as I was told.”", "Seol Jihu was elated to hear that. He was worried that Eun Yuri might not be interested in magic, but from the looks of it, he had been worried for nothing.", "Everything seemed to be working out for the better, but it wasn’t just mana that Eun Yuri had to train.", "‘Stamina is everything.’", "Eun Yuri was expected to raise her physical abilities by making the most of the opportunities available only in the Neutral Zone. Seol Jihu had already devised a master plan, called ‘Operation Princess Maker’.", "He waited for Eun Yuri to finish her meal and took her to the VIP store. He handed the Guide’s Note to Maria, who worked as the store’s clerk, and purchased all 60 bottles of the Special Competence.", "And then he gathered Eun Yuri, Park Woori, and Yoo Yeolmu in the plaza and introduced a man to the trio. The man— was none other than the best trainer in all of Paradise.", "“Pleased to make your acquaintance. My name is Jang Maldong.”", "Jang Maldong spoke solemnly, waving his cane back and forth slightly. Park Woori and Yoo Yeolmu clearly seemed nervous. Their bodies were rigid with tension.", "Jang Maldong carefully scanned the three. Suddenly, his eyes twinkled.", "“You— you seem to have quite a body. Are you an athlete?”", "He was referring to Eun Yuri.", "“I’m especially impressed with your flexibility and resilience.”", "“…Yes.”", "“As I thought. A body like yours can’t be made overnight. It is the fruit of restless training from a young age. My guess is either rhythmic gymnastics or practical dance… no, but your standing posture is upright. So it has to be either ballet or modern dance.”", "Eun Yuri nodded lightly. Seol Jihu was simply astonished by Jang Maldong’s insight. He had figured out Eun Yuri’s major just by looking at the shape of her body.", "“And you. Your method is a bit tactless, but I can tell you’ve been working out.”", "Yoo Yeolmu gave a shy grin. Park Woori appeared to be looking forward to his turn, but Jang Maldong glanced once and then walked past Park Woori, clicking his tongue and shaking his head without a word.", "“I will make it short.”", "Upon finishing the inspection, Jang Maldong said.", "“I’m never the one to interfere with other people’s decisions. I came here at the request of Representative Seol. But if possible, I’d like to devote my time to something more valuable.”", "‘Walk away if you want. I won’t stop you.’ That was what he was trying to say.", "“I’ll warn you now. My training will be very difficult, and I have no plans to force you into it. If you're not up for a challenge, I recommend you leave now.\"", "Park Woori and Yoo Yeolmu shouted out to express their enthusiasm. They didn’t need to hear more. They came here not by force but by choice.", "And frankly, they couldn’t pass up the opportunity to learn from Jang Maldong, a trainer many Earthlings dreamed of having.", "‘…That’s probably what they’re thinking right now.’", "Seol Jihu smiled bitterly as he watched Jang Maldong take the trio to the noticeboard.", "Agnes, Kazuki, Marcel Ghionea, and even Seol Jihu himself had broken into tears. The infamous training regimen that made every single famed Earthling in Paradise cry without exception— Seol Jihu wondered, ‘How long will those three last against that?’", "His question was answered by evening.", "Towards the end of the training, Seol Jihu headed back to the plaza only to be greeted by loud weeping. With a haggard, worn-out appearance, Park Woori sat bawling like a baby.", "The same went for Yoo Yeolmu. The burly man was sniffing with tears in his eyes. He wasn't as loud as Park Woori, but Seol Jihu could see his lips tremble.And Eun Yuri was….", "‘She’s not here?’", "“Where did she go?”", "“Back to her room, I presume.”", "Jang Maldong said as he watched Yoo Yeolmu help Park Woori get up from the ground.", "“Unlike those two, she trained to the end. So I sent her home early.”", "Surprised to hear that Eun Yuri had actually followed through to the end, Seol Jihu asked immediately.", "“How was she?”", "“Tenacious.”", "Jang Maldong made a clear assessment.", "“She is exceptionally competitive. She came at me persistently as if I really was her enemy. She has a certain air of desperation, though I know nothing about her circumstances.”", "After that, Seol Jihu hurried to the first ranker’s room. The door was half-open. He knocked twice at the door out of courtesy before entering the room.", "Immediately, his jaws dropped. The room was an absolute mess. All the ornaments around the room and the items she got from the Tutorial were mingled together on the floor like trash.", "Eun Yuri was sprawled out on the floor. Sleepy-eyed, she stared at the ceiling, wiggling her fingers. Every time her index finger moved, an ornament glided through the air.", "“…What are you doing?”", "Tak! The ornament fell.", "“Training….”", "Eun Yuri answered softly.", "“Mana training….”", "Seol Jihu gave a bitter smile. To think she’d drown herself in more training after a day of Jang Maldong’s training…. He couldn’t believe his eyes.", "“Are you okay? I heard you finished your training regime.”", "“…I thought I’d die….”", "“Then take a break.”", "“My body is resting…. I’m only moving my mana….”", "Eun Yuri groaned.", "“I just thought… it’d be a waste… to not take advantage of the Special Competence… until the end….”", "‘…I see.’", "As a fellow training maniac, Seol Jihu understood what she was trying to say. With training efficiency soaring eight times the normal rate, it would be wasteful not to train to the end.", "“You should at least do it in bed. That way you’ll get more rest.”", "“I was going to… but I collapsed… on my way there….”", "“…”", "“I’m sorry… but could you… move me there….”", "Seol Jihu, smiling blandly, lifted Eun Yuri up and dropped her off on the bed. Now seemed like a good time. Seol Jihu watched Eun Yuri struggling to settle into bed before finally speaking again.", "“Miss Eun Yuri.”", "“?”", "“What if I told you there’s a way to study magic while sleeping?”", "Eun Yuri did not answer. The look on her face told Seol Jihu that she was clearly confused.", "“I can tell you’re very serious about this.”", "Seol Jihu continued casually.", "“If you’re going to do it, you might as well as do it right, no?”", "He took something out of his pocket. It was a link that bore the mana of the pendant, just like the hairpin he gave to Charlotte Aria.", "“You said back at the cafeteria that you’re serious about learning magic.”", "Eun Yuri’s eyes twinkled.", "“Do you know a good teacher?”", "Even her voice sounded lively again.", "“Not in the Neutral Zone, but there’s a way you can meet her.”", "Eun Yuri’s eyebrows wriggled. With a faint smile, Seol Jihu gently pulled Eun Yuri’s left hand. He didn’t bother explaining in detail. That would be Roselle’s job.", "“Just think of this as a reward for completing Master Jang’s hellish training. A reward just for you, Miss Eun Yuri.”", "“Just for me…?”", "At that moment, Eun Yuri opened her eyes wide, startled. She even flinched a little bit.", "“H-Hold on.”", "“Shh. Stay still.”", "“Wait. What are you…?”"]}