{"cid": "291", "title": "Chapter 291. Eun Yuri (2)", "content": ["The monster smashed its way through the trees. The Homunculus was here.", "Its appearance was definitely bizarre. Not one good thing could be said about it. The monster was at least four meters tall, but oddly slim compared to its height. Its skin was chapped and gray with occasional black spots. Because of this, Seol Jihu briefly mistook the monster for a tree.", "But once he laid eyes on its lengthy limbs— each half the length of its entire body— and its sharp, hook-like claws, he knew this creature was definitely dangerous.", "Perhaps the worst feature of it all was the shape of its skull which was much too long, as often seen in alien movies, or the two large holes representing its eyes.", "‘The ears are also huge. And sharp too.’", "It was then that their eyes met.", "“Kirrrr!”", "And at that moment, Seol Jihu saw the inside of the Homunculus’ mouth. It was full of numerous teeth that resembled those of a shark. The monster seemed elated with its discovery of the prey.", "Immediately, the Homunculus curled up. It was preparing to jump over the cliff.", "‘When it jumps….’", "He’d gotten plenty of practice at parrying leaping attacks since the Tutorial. Seol Jihu roused his mana, wary of the enemy’s attack. His machete vibrated as golden sword qi swirled around its blade, and sparks of electricity flickered beneath his feet.", "All of a sudden, the Homunculus raised its head from the curled up position.", "Kwang!", "Seol Jihu stood rooted, wide-eyed and surprised. The smell of blood stung his nose. He hadn’t let his guard down, and yet, the monster’s sharp teeth and crimson lining were gleaming right before his eyes.", "What an incredible speed!", "But what surprised Seol Jihu even more, was that the Homunculus flew straight at him without leaping in the air, just like a bullet. A movement like that was simply impossible without a superb elasticity.", "‘Damn it!’", "Astonished, Seol Jihu still managed to block the attack, thanks to Jang Maldong’s shadow boxing training. He was expecting the monster’s movement to be similar to that of Phi Sora, and his body moved on its own.", "Slap!", "Without caving in, he used Flash Thunder to avoid the monster’s attack. At the same time, he leapt forward, swinging his machete with all his might, keeping in mind the colored stone training.", "Swish!", "He felt the hit. The strange sensation of chopping frozen meat spread in his grasp. His machete had pierced the skull of the Homunculus and escaped through the back of its head.", "‘Did I do it…?’", "Suddenly, a sense of impending doom swept through Seol Jihu.", "It was not over yet. Seol Jihu quickly lowered his left arm to his ribs, and, almost simultaneously, the monster swung its arm to slap him in the chest.", "Thwack!", "“Ugh!”", "As he felt his elbow bone shatter, Seol Jihu’s eyes reflected the blue sky. When he came to his senses, his body was already in midair. Only after he crashed into a rock did the forced flight stop.", "“Cough, cough!”", "After being thrown to the ground, Seol Jihu coughed repeatedly as his face slowly warped to a frown. A painful, burning sensation engulfed his left arm.", "He tried to endure the pain and attempted to raise himself using his machete as a cane, but the machete snapped in half, and he stumbled. Perhaps the mana of sword Qi was too exhausting on the blade, or it might have been the Homunculus’ attack.", "There was no way of knowing for sure the exact cause of the break. In any case, he had just lost his only weapon. Worse still, this was their first clash.", "‘Shit….’", "Seol Jihu cursed under his breath and got up. He grabbed his left arm, now limp from the attack, then squinted his eyes to focus.", "The Homunculus was reeling in place, half of its head missing. Though it stumbled, it quickly regained its balance. Soon, strange bubbles formed at the cross-section of its wound and new flesh began to rise.", "Having witnessed the monster’s head regenerate, Seol Jihu grimaced. The Homunculus had just recovered from a mortal wound. This had to be the result of its soared regenerative abilities.", "As soon as he saw the Homunculus looking his way, Seol Jihu felt somewhat dejected. The monster wasn’t impossible to defeat, but it wasn’t an easy opponent either.", "In terms of raw power, the Homunculus was superior. In terms of speed, they were equivalent, but only if he relied on Flash Thunder. The problem was that the longer the battle dragged on, the worse it would start to get for him.", "He had neither a weapon nor an artifact. He could only rely on his mana and his body. And the latter wasn’t perfect as one of his arms had already been rendered useless.", "‘Four left.’", "Seol Jihu spat out saliva mixed with blood. A wave of electric currents began to encompass him. Soon, the golden qi and the monster clashed again.", "*", "Meanwhile, as Seol Jihu confronted the Homunculus, Eun Yuri took Park Woori and Yoo Yeolmu to the gacha machine.", "According to the map, there were a total of four gacha machines on this island. These machines were placed far apart from each other, and the trio had traveled to the nearest one to check the list of prizes.", "[List of Prizes]1. 1-9 coins: ramen, daily necessities, Guide’s note, medical supplies…2. 10-49 coins: relief goods, souvenir, map, Maid’s letter…3. 50-99 coins: Survival Points, cell phone (latest model)…4. 100-299 coins: potion, weapon, equipment, survival kit, combat ration, coin lottery (1-499 coins), spell ball5. 300 coins: SPECIAL6. 666 coins: offering (guaranteed)", "Seol Jihu hoped to try the standard way. In the second stage, that would be to use the gacha machine. However, Eun Yuri soon ran into a problem.", "There wasn’t enough time.", "Maybe it wouldn’t be so hard if they were inside a closed space, like a school. But on an island this size, just walking around took a significant amount of energy, and the hints about the whereabouts of coins were obscure.", "For example, even if one knew that a coin was buried under a rock in a certain direction, there would simply be too many rocks in the said direction. Even with the help of the Diary of an Unknown Survivor, it would take Eun Yuri an entire day to check all the rocks.", "She didn’t have that kind of time right now. She had to collect as many coins as possible, use them to win a useful prize from the gacha machine, and deliver the prize to Seol Jihu, all just in a couple of hours.", "How, though?", "Eun Yuri glanced back. Park Woori and Yoo Yeolmu were following her silently, but they both looked like they had a lot of questions.", "‘I can’t trust them.’", "She knew she couldn’t tell them the whole truth. Though they did remain until the end back at the gathering place, they could still change their minds once they learned that Eun Yuri didn’t have as much strength as Seol Jihu.", "That being said, they were the only two allies she had at this point in time. Eun Yuri was never the type to trust others easily. However, the situation called for a compromise. To get her plan going, she first had to convince the duo to help.", "“…”", "All of a sudden, Eun Yuri stopped walking. She locked her fingers together and stretched, showing off her slender figure. Then she sat down on a nearby rock.", "“Let’s rest up here. We should eat. I’m hungry.”", "When she took out food from her backpack, the two men opened their eyes wide.", "“Aren’t you gonna sit?”", "“W-well….”", "When Eun Yuri asked casually, Yoo Yeolmu stuttered.", "“But… is this really okay?”", "“What do you mean?”", "Eun Yuri asked.", "“He….”", "Yoo Yeolmu trailed off, his gaze traveling sideways. Then he narrowed his eyes, tightened his lips, and looked at Eun Yuri again, his expression stiff.", "“Ah. You mean him.”", "With a piece of bread in her mouth, Eun Yuri answered casually.", "“Don’t worry about him. He’s off playing with that monster, the Homunculus.”", "“Huh? Playing?”", "Park Woori exclaimed in surprise before his face lit up.", "“Aha! I knew he had a plan. Am I right?”", "“Well, yes, he could certainly take the monster out if he wanted to.”", "“How? How?”", "“Mm….”", "Eun Yuri pretended to hesitate. After a while, she said cautiously as if revealing a big secret.", "“He’s actually not an Invited.”", "“What?”", "“He’s the one who invited me here, to be precise. You could say he’s a special kind of Guide who can interfere with a Tutorial.”", "“Wait, so… you’re saying that he has already entered the other world?”", "“Yes. A Contracted doesn’t have these kinds of privileges. It’s a bonus privilege given only to an Invited with the highest grade, the gold mark.”", "When Eun Yuri opened her status window and showed them her grade, Park Woori let out an exclamation of surprise and joy.", "“Ah! So, this means… wait, hold on a second.”", "Then he tilted his head in confusion.", "“Mrs, then why was he like that back there? He looked pretty bummed out alright.”", "Eun Yuri flinched. She cleared her throat.", "“Hm. First, I’m not his wife. Second, I wouldn’t say he was ‘bummed out’… rather, I think his pride was hurt.”", "“?”", "“When we were alone, he gave me a lot of excuses. It didn’t seem like he had expected the Homunculus to enter a rampaging state.”", "Eun Yuri continued.", "“Though Special, this still is a Tutorial. And because he’s a big shot in Paradise, not being able to control something as petty as a Tutorial is embarrassing for him. Apparently, we’re being broadcasted all over Paradise, so there’s the matter of saving his face, too.”", "Park Woori remembered Phi Sora yelling at the sky and opened his mouth wide, convinced of Eun Yuri’s explanation.", "“I’m sorry to interrupt.”", "Yoo Yeolmu cut in.", "“But I think you’d better call him.”", "He lowered his voice and continued.", "“I’m suspecting we have followers. And it’s not just one or two.”", "Eun Yuri’s eyes gleamed.", "“W-What? Where?”", "Park Woori jumped in surprise.", "“Don’t look.”", "He almost looked back but stopped at Eun Yuri’s words.", "“For now, just pretend you didn’t notice.”", "Eun Yuri whispered and looked at Yoo Yeolmu.", "“Unfortunately, we can’t ask him for help.”", "“Why not? At this rate, we’ll—”", "“I’m in the middle of a test. A special kind of a test.”", "Yoo Yeolmu frowned in confusion.", "“The truth is….”", "Eun Yuri sighed.", "“There’s a specific reason he came all the way to this Tutorial at the expense of using his gold stamp on me. He wanted to activate the Special Tutorial and claim the special reward. And he already achieved this goal.”", "“Then….”", "“Well, that doesn’t mean I was abandoned. He just wants to see me try. He said that if I can’t overcome something as simple as this, I don’t belong in Paradise….”", "Eun Yuri licked her lips.", "“So anyway, I’m being tested, and I have to prove my worth to him. That’s why—”", "She took a brief pause and glanced at Park Woori and Yoo Yeolmu.", "“I want you two to help me. If you do, I promise to pay you back twice as much in the neutral zone.”", "Yoo Yeolmu nodded without hesitation.", "“Of course I’ll help. But are we allowed to do that?”", "“He never told me that I couldn’t form a team. And the rampaging Homunculus is the final boss of the Tutorial. Capturing it will earn both you and me a lot of points.”", "Park Woori had been listening with much anxiety, but after hearing this latest comment, his eyes sparkled.", "“The test is simple. I have to find a way to defeat the final boss. But he told me that he’ll value the process more than the outcome.”", "“The process?”", "“I’m assuming he meant he’ll measure how fast I find the coins and use the gacha machine. The faster I am, the better score I’ll get.”", "Yoo Yeolmu nodded.", "“How can I help?”", "“I have a plan. You said you’re an actor?”", "“Yes. Although, I’m not very famous.”", "“Okay. But first, let’s go someplace else.”", "Mindful of the surroundings, Eun Yuri rose from the rock. She then headed to the nearest cabin.", "The trio went in, and 20 minutes later, only one of them came out.", "“Okay! I’ll be right back with it!”", "With a cry, Yoo Yeolmu slammed the door and began running in the opposite direction of the cabin.", "“Busy, busy!”", "He muttered to himself and ran as fast as he could as if some urgent quest had befallen him. In his hands was a piece of paper.", "*", "Not long after, Yoo Yeolmu stopped.", "“South of the gacha machine… at the rock underneath the tree with a white cloth hanging on a branch….”", "Muttering, he looked around and soon discovered the said tree.He then pushed the small rock underneath the tree.", "“Wow. They’re really here.”", "He exclaimed in surprise when he discovered the hidden coins.", "“One, two, three, four…. Damn. It sure rocks to be the Invited.”", "He smirked at the sight of the coins.", "“Let’s see. Next is left from the rock with the coins….”", "He picked up the coins from the ground and moved about two dozen steps to the left. Then, he dug the soil beneath red flowers and, again, gave an exclamation of joy.", "“Awesome! I found them again.”", "Yoo Yeolmu straightened his back and turned around, humming to himself.", "“Next—”", "He then smirked at the sight of a large boulder.", "“Perhaps behind that boulder?”", "It was quiet. He couldn’t feel anyone nearby, yet Yoo Yeolmu did not stop talking to himself.", "“That’s odd. I really think there’d be some behind that boulder.”", "Because he remembered what he saw back at where the gacha machine was.", "“It’s not the coins I’m talking about.”", "But there was still no response whatsoever.", "“…Augh.”", "Yoo Yeolmu sighed loudly as if he wanted to be heard.", "“Man, you’re dense. Just stop and come on out.”", "“…”", "“I know you people have been following us. I saw you back at the empty lot.”", "He announced in a deep voice and finally heard a rustle. About four or five people appeared from behind the large boulder. One of them was the young man who tried to shift blame to Seol Jihu back at the empty lot.", "“Finally.”", "“…How did you know?”", "“I told you, I saw you. Of course, I’d notice a naked woman hiding behind a bush.”", "As Yoo Yeolmu pointed out, some people in the group were either not dressed or barely wearing a top, though the young man was an exception. They were the survivors who had been captured by the pervert killer and rescued by Seol Jihu.", "“Damn it! I told you this was a—”", "“Hold on. Let me just make this clear. I haven’t told anyone yet.”", "The young man stopped and frowned.", "“What?”", "“I said, I haven’t told anyone. I’m the only one who knows you’ve been following us. Do you understand?”", "Yoo Yeolmu asked, tilting his head back just slightly.", "“Now, if you’re not idiots, you should know the reason I haven’t told them yet.”", "A look of suspicion crossed the young man’s face.", "“What are you playing at?”", "“Playing? No, no. I just had the same thoughts as you guys.”", "Suddenly, Yoo Yeolmu began gazing around restlessly. Soon, he fixed his eyes on something and pointed his index finger at it.", "“Right over there. Do you see that blue rock? Can someone move it?”", "“What the hell are you talking about? What blue rock—”", "The young man stopped. There really was a faintly glowing blue rock in the direction that Yoo Yeolmu was pointing. Of the many rocks around, only this was a different color.", "“Move it. Just do it, and we’ll talk. It’s not exactly a hard thing to do, is it?”", "Still suspicious, the young man walked over to the rock and kicked it lightly. Then, his eyes went wide.", "“You see it? The coins.”", "The young man hurriedly picked up all the coins and looked at Yoo Yeolmu with a dopey look on his face.", "“How did you know?”", "Instead of answering, Yoo Yeolmu threw the piece of paper in his hand to the young man. The young man caught it just barely and frowned while reading it.", "“This is….”", "In cute, round handwriting, the note listed where the coins were hidden.", "“You were right about one thing. The Invited are different from the Contracted. Apparently, they’re given a bunch of advantageous privileges from the start.”", "The young man clenched his teeth.", "“Fuck. I knew it. This was all a scam.”", "He feigned a smile then looked at Yoo Yeolmu with one eye opened wide.", "“The fact that you’re showing this to me… does this mean you want to join us?”", "“You’re quick. I like that.”", "Yoo Yeolmu announced with a grin.", "“Yes, I’d like to join you. But tell me, what exactly are you planning to do?”", "“Why do you even ask? We’re gonna follow them, and—”", "“If you think you can just take her privileges, you’re wrong.”", "Yoo Yeolmu cut in without giving the young man a chance to finish.", "“Calm down and think for a moment. If that was possible, then I would’ve taken them a long time ago, instead of asking to join you.”", "Yoo Yeolmu was right, and the young man fell silent.", "“Unfortunately, the privileges can’t be stolen. They appear in the form of a message, apparently.”", "“Message?”", "“Yeah, like the status window. This means that we can neither see them nor touch them.”", "The young man cursed under his breath at the unexpected turn of events.", "“What about it? Can’t we just capture her and ask her about these messages?”", "Asked one of the young man’s friends.", "“How are you gonna make her talk?”", "“Well, I mean… we could threaten her, or….”", "She hesitated, and Yoo Yeolmu scoffed.", "“You sure about that?”", "“Pardon?”", "“She seemed like a tough nut to crack. What will you do if she refuses to speak?”", "The woman shut her mouth. After chewing his lips nervously, the young man opened his mouth again.", "“Do you have any other plans?”", "“I do.”", "Yoo Yeolmu grinned.", "“Come sit here.”", "He took out from his pocket a map of the island and spread it out on the ground.", "“A map?”", "“It was inside my leather backpack. We haven’t got much time, so I’m gonna cut right to the chase. You are aware of the situation, no?”", "Yoo Yeolmu urged and the young man settled at a spot across from him.", "“Let me first tell you about our— no, her plan. The bitch wants to take down the final boss.”", "“What? Is that even possible?”", "“Of course not.”", "Yoo Yeolmu smiled bitterly.", "“She told me that the male Invited was buying us some time with his privileges… but I don’t believe that bullshit. If her plan was to gather coins as fast as possible and activate the portal, I wouldn’t have betrayed her. But she’s too stubborn.”", "“We’re both looking for a lifeline, so enough with the excuses. Just tell me about your plan. What are you gonna do?”", "“Look right here. You see all these lines and numbers drawn on the map?”", "As he said, the map showed lines drawn in pen in the shape of a snail and numbers starting at one written at regular intervals in ascending order.", "“What is this?”", "“The lines represent the course. The numbers are the gathering spots.”", "“Tell me more.”", "Yoo Yeolmu tapped on the map.", "“Her plan is simple. I am to move along this course and collect coins as they come. Then, at every gathering spot, I have to hand over all my coins to her.”", "“Why?”", "“Well, it’s understandable. She doesn’t trust me enough to leave the coins in my possession. And she’s right not to trust. Look where I am now.”", "“The bitch is smart.”", "“So the situation is a bit difficult, but we still have an advantage.”", "Yoo Yeolmu smirked.", "“She’ll collect as many coins as she can, and then try to activate the gacha machine. That’s when we strike.”", "A devious look crossed the young man’s face.", "“…So what you’re saying is that—”", "He licked his lips like a snake.", "“We should help the Invited collect coins.”", "“That’s right. You guys just follow us quietly from behind. And whenever I come to you with the list of hidden spots, assist me in finding the coins. That way our search will take less time.”", "“And when we’re done finding all the coins….”", "He glanced down at the map. Next to the gacha machine, where the line ended, was the number ‘20’.", "“…We’ll turn on her and take all her coins.”", "“Yup. That’s exactly right.”", "Yoo Yeolmu cackled, clapping his hands in joy.", "“We can’t see or even touch the privileges, but the coins….”", "Yoo Yeolmu left his sentence unfinished on purpose. Anyone with a working brain should know what would come next. The corners of the young man’s lips slowly curved upwards.", "“I was just gonna take some passage fee… but this is better.”", "“Shoot for the stars, am I right? Is there a rule that prohibits a Contracted from having a monopoly?”", "“No.”", "The two men exchanged smiles.", "“Good. Now tell me about your group. How many of you are there?”", "“Five here, including me.”", "The young man replied, glancing over his shoulder at the party.", "“And three more back at our cabin. So eight in total.”", "“Eight… I see. You should try to recruit more people. That way, we’ll finish the search faster.”", "“Even more than now?”", "“Look. I know you want as many coins as possible, but let’s be realistic. If that monster discovers us while we’re searching, we’re all doomed.”", "The young man seemed doubtful.", "“I don’t know. Isn’t eight enough? If we’re too fast, then she might suspect something is wrong.”", "“I’ll take care of that. Actually, she’s in a hurry. She says her plan is feasible and that everything will work out, but… why would she be in such a hurry if that really was the case?”", "“Mm….”", "Yoo Yeolmu’s argument sounded logical and, finally, the young man agreed. Folding the map, Yoo Yeolmu spoke again.", "“Let’s summarize. After we take the coins from her, we’ll use 666 of them for the sacrifice, then divide the remaining coins among ourselves, in equal portions. What you do afterward is nobody’s concern but your own. Draw the gacha, pay the passage fee, whatever. Got it?”", "“Okay, okay.”", "“Good. Then—”", "Yoo Yeolmu held out his hand, which was as big and sturdy as a pot lid, palm side up. The young man smirked. He then placed his coins on top of Yoo Yeolmu’s palm.", "And so, the number of people looking for coins increased from three to eleven."]}