{"cid": "285", "title": "Chapter 285. After the Setup (6)", "content": ["Tak! The shocked Eun Yuri’s eyes waned. She expected the axe to split Seol Jihu’s head in half, yet nothing happened.", "No, it wasn’t exactly nothing. Now that she took another look, the killer’s wrist was held in place midair. The reason it took her so long to realize this was because Seol Jihu was still looking at her. He had stopped the attack without even looking at it.", "“You’re sure, right?”", "He asked again as if nothing happened. Staring dazedly, Eun Yuri nodded. Seol Jihu turned back.", "“Haha, little brat.”", "The arm in Seol Jihu’s hand trembled. It was only a few centimeters away from its intended target, but there was a terrifying pressure completely holding it in lockdown. The killer couldn’t help but feel that its hand was stuck inside a boulder.", "“Kiiiii!”", "As he struggled desperately, the axe began to go down by microscopic lengths.", "“Hmm?”", "But when the intrigued Seol Jihu tightened his grip, even that came to a complete stop.", "Seol Jihu never used his mana. His Strength stat was Intermediate (Intermediate). Even though this was a special Tutorial, his strength wasn’t something that could be withstood by a monster that wouldn’t last a day in the ancient emperor’s villa.", "Crack! In the end, the killer spat out a groan with a loud crack.", "“This wouldn’t have happened if you didn’t follow us.”", "Seol Jihu twisted the killer’s wrist without dragging things out.", "Craaaack!", "“KUAAA!”", "The killer shrieked. He must have a sense of pain as he was writhing in agony. Although he still managed to seize the axe in his left hand and swing it—", "“Nice try.”", "He let go of the axe when a powerful punch twisted into his stomach. When Seol Jihu dealt another blow in the same spot without a break, the killer fell on his knees with a thud. Once a swift kick swept past his lower jaw, he collapsed completely.", "‘So he was green because he was weak…’", "He must have posed no threat unless Seol Jihu knowingly pulled his neck out and said, ‘Please kill me.’ As Seol Jihu was hoping for a thrilling life-or-death battle, he couldn’t help but shake his head in disappointment.", "At the end of the day, this was the Tutorial. There were thousands of things to do in the Neutral Zone. It was better to take the easy route and get there as quickly as possible.", "“Krrrrr….”", "The axe killer bared his teeth and glared at Seol Jihu.", "“Don’t show your teeth.”", "However, Seol Jihu’s foot slammed down on the glaring killer’s teeth and shattered them completely.", "Bzz, bzz! The phone vibrated again. Seol Jihu had no clue what was updated but was observing the killer’s waist closely. Just like Eun Yuri said, several weapons were hanging there. Unfortunately, he did not see a spear.", "“No spear? Why don’t you carry one around?”", "“Wuuu…. Wuu….”", "A sorrowful cry flowed out, but Seol Jihu clenched his fist grumpily.", "“Shut up, bastard.”", "Thwack! Once he delivered a powerful hook to the killer’s bloody mouth, the killer quickly became silent. Seol Jihu picked up a machete before giving it a few swings and turning back to Eun Yuri.", "“Do you want to deal the finishing blow? That should be enough to get you some points.”", "Eun Yuri shook her head vehemently.", "“Oh, then I guess I’ll kill him.”", "“No! That’s not it.”", "As Seol Jihu stepped on the killer and raised his machete, Eun Yuri ran up to him in a hurry and held his arm.", "“Look at this.”", "Eun Yuri showed her phone to the confused Seol Jihu.", "[Sender: Unknown]#Forest (Diary of an Unknown Survivor — Page 22)", "‘We’re already on page 22…?’", "Seol Jihu was somewhat surprised at their progress as he calmly read the content.", "", "We finally got rid of the killer! Although two of us got hurt, we all shook in excitement knowing the killer who made us tremble in fear was dead.", "Someone suggested holding the killer captive while discussing what to do with him, but how could we? Everyone happily joined in on hacking the killer to death.", "As the killer screamed its last breath, black smoke shot out of his body and disappeared into the far distance. Was an evil spirit possessing the killer’s body?", "The important thing was that this damned killer was finally dead. We all laughed and celebrated victory for the first time in a while. We should be able to get some sweet sleep tonight.", "…Less than an hour later, something absurd happened.", "Damn it! She was right! The Sixth Mother is angry! We shouldn’t have taken the killer’s life with our hands!", "", "After reading the diary, Seol Jihu understood why Eun Yuri stopped him. It was spelled out for him. That a survivor should not kill the killer with their own hands.", "‘The Sixth Mother is angry?’", "He didn’t know the meaning of this sentence, but now it didn’t feel right to kill him so easily. Perhaps killing the killers was one of the conditions for increasing the Tutorial’s difficulty.", "‘So I shouldn’t underestimate this Tutorial?’", "Well, let’s see how amazing the rewards are then. Seol Jihu grumbled inwardly while lowering the machete.", "He didn’t want to kill the killer, but he didn’t want to release him either. Just as he was wondering what to do…", "“Um…”", "Eun Yuri carefully held up the rope. Seol Jihu’s eyes lit up.", "“Ah, that rope is supposed to neutralize the killer, right?”", "“Yes.”", "He wondered what use it would have when he first saw it, but now he understood.", "Eun Yuri tied up the killer on her own even though Seol Jihu didn’t say anything. He expected her to simply spin the rope around the killer, but she surprisingly made a tortoise-shell bind. Her hands moved very naturally.", "Bzz, bzz!", "", "[Sender: Unknown]#Forest (Diary of an Unknown Survivor — Page 24)", "We captured another killer. The losses this time were greater due to the killers’ increased strength. This time, to not repeat the same mistake, we tied up the killer with a rope.", "But what should we do? How can we eliminate the killer without the Sixth Mother finding out?We need to look for a way… but the killer’s howls are too noisy. We need to hurry up and do something about it…", "The Diary of the Unknown Survivor updated again. Seol Jihu focused on the phrase, ‘without the Sixth Mother finding out.’", "Suddenly, more information was revealed. Seol Jihu spoke, thinking that they needed some time to reorganize themselves before taking further action.", "“Let’s get a move on first. Ah, give that here.”", "Seol Jihu took over the rope, opened the map, then started walking while dragging the bound killer on the ground.", "*", "Fifteen spots were marked on the map. Except for the three marks that had special shapes, the rest were all shaped like a house.", "Walking to the nearest house mark, just as expected— Seol Jihu saw a cabin with its lights turned off.", "Due to the entire island being covered in a forest, the cabin looked more like a cabin from a horror movie than a vacation cabin.", "", "[Sender: Unknown]#Cabin (Diary of the Unknown Survivor — Page 2)", "We chanced upon a cabin while frantically running away. Only after walking inside and locking the front and back door did we breathe a sigh of relief.", "Finding shelter is nice and all, but what are we supposed to do from now?No, snap out of it. There must be a way out! Let’s search around the cabin first. There might be something useful.", "We should leave the lights turned off, right? This cabin isn’t necessarily safe, so we should be careful not to attract unwanted attention…", "Seol Jihu threw the axe killer somewhere nearby and entered the cabin. Just like the diary said, he locked the front and back door. Only, he turned the lights on.", "The cabin had two floors and was about 130 square meters in size. Seol Jihu and Eun Yuri searched the cabin thoroughly, but contrary to their expectations, there was nothing other than a little bit of canned food and two bottles of water.", "Although they also found a map, it was unnecessary since they had the Diary of the Unknown Survivor.", "Once the search ended, Seol Jihu looked for Eun Yuri. She was fiddling around with the paper talisman.", "“The paper talismans are like the Necessary Boxes. The spell you need the most in your current situation will activate.”", "Eun Yuri flinched. She put the talismans away like a child who was caught doing something wrong.", "“I wasn’t going to use any.”", "“It’s fine. I was hoping for one, but we got three. Just save one and you can use the other ones whenever you want.”", "Seol Jihu said with a smile.", "“Oh, by the way, are you hungry? Do you want anything to eat?”", "Eun Yuri shook her head.", "“Or you can sleep for an hour or two. You must be tired.”", "Shake, shake.", "Seol Jihu shrugged.", "“Alright, then let’s talk.”", "He sat down in the dusty living room. Once Eun Yuri sat down as well, he took out his cellphone.", "“Let me explain what we’re going to do from now on.”", "He pointed to each of the three special marks on the map.", "“Bridge, car, and ship… that’s what they look like right? Well, it could be a boat. Anyway, these three are probably ways to get out of this island.”", "“Right.”", "“Taking a bridge at the end of the island, hopping on a car to throw off the pursuing killers and taking an escape through the center of the island in a roundabout way, or getting on a ship and sailing away. They all make sense. But, they probably won’t be easy.”", "“….”", "“There must be traps or schemes that would hinder us. No matter which, the Tutorial probably won’t let us escape so easily.”", "Remembering the trap on the stairway to the second floor and the steel bars that blocked the way to the gathering point, Eun Yuri nodded right away.", "“To be honest, escaping this island isn’t all that difficult.”", "Seol Jihu crossed his arm.", "“If we set our mind to it, we can even leave this instant.”", "But both Seol Jihu and Eun Yuri knew that should not be done.", "“Although I’m not sure whether one exists on this island, we have to find a hidden space. There’s a good chance that the special reward will be in this hidden stage.”", "Seol Jihu smacked his lips.", "“But I can’t figure out just where it could be. There’s nothing on the map that looks out of place… how troubling.”", "Seol Jihu sighed as he tapped the screen.", "“If only we had a clue…”", "Eun Yuri murmured to herself. After much thought, she looked at Seol Jihu and held her breath. Suddenly…", "[That doesn’t mean there is nothing for you to do, Miss Eun Yuri. There’s one thing you need to remember no matter what.]", "What Kim Hannah said to her crossed her mind.", "“…Um.”", "With a moment of hesitation, Eun Yuri carefully spoke.", "“I think there is a clue.”", "Seol Jihu’s eyes widened.", "“It’s just what I think, but can I still tell you about it?”", "“Ah, yes, of course.”", "Eun Yuri spoke calmly.", "“First, given the information we have so far, I think there are five killers.”", "“Why?”", "“Page 22. The Sixth Mother is angry. This part.”", "Eun Yuri swiped her cellphone and turned the Diary of the Unknown Survivor to page 22.", "“I think mother in this context is metaphorical.”", "Seol Jihu rubbed his chin.", "“The earth is the mother of all things… something like that?”", "“Yes. The way I interpret it, there are five killers— the first to fifth— and the Sixth Mother must be the one controlling them.”", "“Mm… What are the chances there is a mother for each of the killers? In that case, there might be at least six killers.”", "“I considered that when I first read page 22, but the next page that opened up showed that this wasn’t true.”", "Eun Yuri turned to page 24.", "[We captured another killer.][How can we get rid of the killer without the Sixth Mother finding out?]", "“As you can see, they captured a killer after the first one they killed. Two killers were gotten rid of, but the Sixth Mother was mentioned in both.”", "Seol Jihu was astonished.", "“Ah, so that’s why…”", "“I think this Sixth Mother is related to the hidden space.”", "Seol Jihu’s eyebrow went up.", "“The contents of page 22 and page 24 can be connected. If a survivor kills a killer, the Sixth Mother will find out and become angry.”", "“Right.”", "Seol Jihu then thought, ‘if they wanted to eliminate the killers, they needed to find a way to avoid the Sixth Mother’s detection. Otherwise, the Sixth Mother’s rage would cause the remaining killers to get stronger.’", "However, what Eun Yuri said next revealed that her thoughts were different.", "“When you captured the axe killer before, was there anyone near you?”", "“No, I don’t think so.”", "“If the Sixth Mother wasn’t there, how would she know that the killer was killed?”", "“Well… I suppose they can communicate somehow. A link that only the killers and the Sixth Mother share.”", "Eun Yuri quietly stared at Seol Jihu.", "“I think so too. But you said before that the Diary of the Unknown Survivor updates depending on the situation and that I should read it carefully because it may contain hidden hints.”", "“Ah, yes, I did.”", "“If there is a reason that this part was included in the diary, then I think it has to be the hint.”", "Eun Yuri turned to another page and pointed at the two lines.", "Seol Jihu clenched the hand he was rubbing his chin with. He felt like he understood what Eun Yuri was saying. But how did she plan on finding the hidden space?", "He leaned forward, intrigued by what Eun Yuri had to say.", "“Can you explain in detail?”", "“Yes, I’ll tell you now.”", "Eun Yuri cleared her throat. Next, she slowly explained her plan.", "Soon, when the explanation came to an end, Seol Jihu’s brows narrowed. Eun Yuri stared at Seol Jihu nervously, like a student awaiting the result of a test.", "After a moment of silence, Seol Jihu took his eyes off of the cell phone and raised his head. He looked at Eun Yuri with a renewed gaze.", "Kim Hannah said she was a college student?", "“Miss Eun Yuri.”", "Suddenly curious, Seol Jihu asked.", "“What’s your college major?”", "Eun Yuri tilted her head but answered flatly.", "“It’s modern dance. Why do you ask?”"]}