{"cid": "379", "title": "Chapter 379. Spring, the Season That Flowers Bloom (1)", "content": ["The winter of that year was cold.", "It was a particularly cold winter.", "Left alone, Seol Jihu’s words became few.", "He restricted his senses by himself and quietly pushed the boulder up.", "The season passed.", "As spring arrived, so did Baek Haeju.", "After hearing that Black Seol Jihu left, she made an odd expression and murmured, ‘I brought fried chicken…’", "Baek Haeju stared at Seol Jihu for some time. Then, unlike usual, she struck up a conversation.", "The topic was about the outside world, which she had avoided bringing up until now.", "It started with small matters like Charlotte Aria, Odelette Delphine, and Eun Yuri starting to hold a Magician’s gathering, or the Halep siblings coming back to Paradise and staying in Valhalla. Apparently, Seo Yuhui had also returned and was wetting her pillow with tears every night after hearing about him.", "But what caught Seol Jihu’s attention the most among her stories wasn’t Seo Yuhui, but Yi Seol-Ah and Yi Sungjin.", "“Sungjin hit it big in an expedition, and Seol-Ah obtained a Spirit from the Federation and is working with their scout team. It’s been a while since all this happened.”", "“Seol-Ah isn’t back yet?”", "“She said she wouldn’t come back until she becomes a High Ranker. Miss Phi Sora snorted, but I think it’s possible.”", "“I think so too.”", "Seol Jihu nodded his head.", "“Seol-Ah was the kindest, most talented kid in the Neutral Zone. That’s why I brought her into the team… I feel bad because I haven’t taken care of her properly…”", "Seol Jihu spoke in a somewhat apologetic tone. He then put down his chopsticks and got up.", "“I should work hard too so that I’m not embarrassed when I go back.”", "“You already completed the trials… when do you plan on coming back?”", "Baek Haeju asked furtively after finally finding the opportunity. She immediately added, “Miss Foxy wanted me to ask you.”", "“Did something big happen outside?”", "“No, it’s been quiet.”", "“Then I’ll stay a little longer.”", "With that, Seol Jihu went back to training.", "Baek Haeju didn’t try to stop him either.", "*", "The atmospheric temperature changed.", "A scorching summer arrived.", "Seol Jihu began to train Flash Thunder.", "Leaving the boulder at the bottom of the first peak, he repeated going up and down the slope.", "Perhaps because he acquired Thousand Thunder, he could get a grasp on the next stage without much difficulty.", "All that was left was to do was practice, and more practice.", "By the time summer and then fall passed by and late winter arrived, he saw some progress.", "It was early fall when Flash Thunder reached Pinnacle rank. When winter came, his body surpassed the speed of sound, starting to move through space rather than distance.", "A year after Black Seol Jihu left, Seol Jihu was able to use something similar to Ethereal Shift for the first time.", "The day he succeeded, Baek Haeju coincidentally visited the Path of the Soul again.", "She blinked in confusion as she picked up the bento boxes she had left last time. More than half of the rice and side-dishes were still left over. In the past, the bento boxes would always be emptied clean.", "Baek Haeju looked at Seol Jihu with pity. Though he tried to act otherwise, she could see with a glance just how lonely Snowy was without Blacky.", "Despite him trying so hard to hide it, Baek Haeju could see that he was just holding it in.", "Then, she suddenly widened her eyes while wondering what to say.", "Seol Jihu started laughing quietly in the middle of eating.", "“…Back then.”", "“?”", "“I suddenly remembered he pulled that prank on you back then.”", "Baek Haeju furrowed her brows.", "It wasn’t a memory she wanted to recall in particular.", "One time, when she came to visit as usual with bento boxes in hand, she found Black Seol Jihu lying on the ground full of wounds. When she asked what happened in a startle, he had said that Twisted Kindness suddenly appeared in this place and had taken Seol Jihu away.", "[How can that happen?]", "[I… don’t know…. You need to get out of here…. There’s a chance… Gula might have betrayed the other gods… and defected to the Parasite Queen…]", "He was clearly accusing Gula of betraying humanity.", "Baek Haeju tried to ask for more details in a fit of fright, but a bolt of lightning suddenly struck down from the sky at Black Seol Jihu.", "Gula’s voice promptly rang out, saying, ‘Don’t go too far.’", "It turned out that Seol Jihu was training perfectly well on the other side of the starting point. Black Seol Jihu had purposely changed his usual training location so he could pull this prank off without a glitch.", "When she went back to find him in a belated fit of rage, Blacky had long since run away.", "[Stop right there!]", "[Why don’t you put that spear down first!?]", "[I’ll kill you, you damned rabbit!]", "[Who are you calling a rabbit!?]", "She chased him all day with the Tathagata Spear, but he was just too good at escaping.", "‘I should’ve kicked his ass back then…’", "She seethed with anger whenever she recalled that incident.", "“Um…”", "As she was grunting in anger, a careful voice was heard.", "“It’s fine now.”", "Snowy stopped eating.", "Baek Haeju glanced at the bento box.", "He had barely eaten anything.", "“Is it not good?”", "“No, it’s delicious.”", "“Then are you craving something in particular?”", "Seol Jihu shook his head.", "When he first ate after acquiring Heart and Soul as One, the food was one of the tastiest he had ever eaten.", "The experience was similar when he ate while training with Black Seol Jihu.", "He made attainments this time as well.", "But for some reason…", "“It just doesn’t taste the same as before…”", "“….”", "“I don’t really need to eat to sustain myself in this place… Also, I’ve been wanting to do things alone.”", "Though Baek Haeju was a little disappointed to hear this, she nonetheless nodded her head in agreement.", "She felt like she knew where he was coming from.", "In a way, she was relieved to hear this. She was worried that Seol Jihu would become a lunatic who was crazed on training, but the fact that he was feeling lonely meant that he hadn’t lost his emotions.", "Seol Jihu was becoming a monster at an astonishing rate, but as far as she could tell, he was becoming a monster with emotions.", "That was fine with her.", "Baek Haeju picked up the bento boxes and got up immediately.", "After leaving the Path of the Soul, she did not come back, just as Seol Jihu wished.", "And so, Seol Jihu was left alone once again.", "*", "After entering the realm of Perfect Harmony, the world as Seol Jihu saw it, changed.", "But simply knowing that it changed was not enough. He had to evolve his skills to match this change. And so, he started with the basics.", "Using the fundamental principles of Thousand-Ton-Pushing Strength, Floral Substitution, and other techniques, he tried to engineer his other skills to evolve.", "The feeling of Thrust, Strike, and Cut changed. Just by stabbing the center, boulders shattered into pieces.", "Mana Spear changed to a barrage of sword qi that was shaped like spears.", "His Status Window was changing by the day, but Seol Jihu still wasn’t satisfied.", "He felt that something was lacking. Although he could use the skills, he wasn’t satisfied with his performance when compared to Black Seol Jihu or Baek Haeju.", "Thinking about it carefully, he realized that it was due to mana.", "It wasn’t a matter of amount, but rather, efficiency. Simply pouring mana into a skill didn’t solve anything. He had to maximize the output using a fixed amount of mana and pursue the most efficient way.", "[The key is to consume minimal energy to create Mana Spears.]", "[No matter who or what you’re fighting, you tend to pour your mana in without restraint.]", "[It’s a matter of efficiency.]", "[Since you always use all of your mana to defeat your target, you’re unable to delicately control it. In other words, your control over mana is poor.]", "He had heard this problem of his ever since he was a low-leveled Earthling. Now, he finally understood what this meant.", "From this day onward, Seol Jihu stopped all training and focused on his Mana Cultivation.", "He climbed to the summit and sat cross-legged. Then, for the next few months, he immersed himself in moving his mana.", "He didn’t move even when it rained or snowed. Perhaps because of Heart and Soul as One, he did not budge an inch until the winds touching his skin changed.", "When the seasons changed and he came down from the mountain, the areas he had been lacking in were somewhat filled.", "With the density of mana increasing, so did the power of techniques and their speed.", "Perfect Harmony’s increasing rank was clear proof of this being more than Seol Jihu’s imagination.", "Although he still wasn’t satisfied with some parts, that couldn’t be helped as he was comparing himself to Black Seol Jihu.", "He managed to take yet another step forward, but he did not stop.", "He trained like he was possessed.", "And whenever he did, he would find new faults with himself.", "Each time he found a problem, he would immerse himself in fixing it.", "He had yet to fully digest Perfect Harmony, so there was no need to aim for a higher realm.", "He found himself getting stronger each time he detected a flaw and got over it.", "Repeating this process again and again, Seol Jihu developed a better understanding of the so-called Seamless Sublimity that Black Seol Jihu reached in his final days.", "A realm that pursues absolute flawlessness.", "Though he had no way to be sure, Black Seol Jihu must have reached this realm after honing himself again and again until he eliminated even the slightest flaw and reached the extremity of perfection.", "Seamless Sublimity was good. However, it was a realm that the current Seol Jihu did not dare to covet.", "But it wasn’t as if there was only one independent realm. Moreover, Black Seol Jihu had repeatedly told him not to follow in his footsteps.", "Because he had already failed once.", "Since Seamless Sublimity wasn’t enough, he had asked Seol Jihu to aim for a higher realm.", "“Go where you want to go,” he said.", "Recalling these words, Seol Jihu went back to training.", "Meanwhile, the seasons cycled through again.", "*", "The four seasons had come and passed almost three times since Black Seol Jihu left.", "It was the third winter.", "Seol Jihu did not know how much time had passed since the day he entered the Path of the Soul. Counting days just seemed meaningless.", "Seol Jihu was still alone, moving busily in this world of slowed time.", "He no longer slowed down while climbing up the first peak. Pushing the boulder up was easy if he used both hands, and with some effort, he could even do it with one hand.", "He developed various ways to climb the second peak as well. He tried manipulating the falling rocks to protect himself and the boulder, and he also tried destroying them with sword qi as soon as they appeared. If that was too much of a hassle, he could even cross the entire second peak before the rocks even appeared.", "In the third trial, the pain he felt decreased significantly.", "There was one time when he accidentally tripped and was run over by the boulder. However, he didn’t die. Although he suffered a serious injury, his bones were unhurt.", "It was the result of his Endurance increasing after suffering through endless, excruciating pain. Of course, it still hurt.", "Many things changed compared to the past. He was now used to being alone, and his head was filled with thoughts of fixing his flaws.", "Eventually, a day came when he could no longer find flaws other than parts that he could not do anything about at his current level.", "The air began to get warmer.", "It was spring. The season when seeds sprouted and bloomed into flowers arrived.", "[Time taken to pass the trials for the 10,092nd time: 9 minutes 58 seconds.]", "[If you want to reset the trials, roll the boulder down the mountain.]", "[If you want to end the trials, please stand in front of the altar.]", "Day 2,508.", "Seol Jihu stared at the alerts after stepping onto the summit.", "He succeeded in breaking his previous record of 10 minutes and 2 seconds. He finally had succeeded in breaking through the 10-minute mark.", "Should I roll the boulder down again?", "Seol Jihu debated while smacking his lips. Then eventually, he lowered his arms.", "“…I’ll stop.”", "Though there wasn’t anyone around, he murmured as if he was talking to someone.", "“I expected to run into it one day and I did. A huge wall that’s incomparable to the one I faced before.”", "Recently, his progress had slowed down to a snail’s pace.", "Although he tried fixing minute flaws, the effects were minimal.", "He knew how to get stronger. He just didn’t know the exact process needed to get there.", "“I want to continue… To be honest, I did. I wanted to achieve that Trinity Harmony. If it wasn’t for that, I could have left a year or two ago…”", "Seol Jihu shook his head and then sighed.", "“I thought I’d grasp something if I used One With the Spear and Perfect Harmony simultaneously. I guess it isn’t that easy.”", "He scratched his cheek as if he found it funny that he was talking to himself.", "“But… I did see a glimpse. I barely caught onto the tail… I just don’t know how long it will take me to pull it toward me. So…”", "Seol Jihu turned around.", "“I’ll leave now.”", "He walked toward the altar and stopped.", "Paaaaaat!", "A pillar of light shot up from the altar, and a circular portal appeared above it.", "Seol Jihu stepped into the portal without hesitation.", "2,508 days, or 251 days in Paradise’s time.", "He was finally going back after eight months.", "It was then.", "Seol Jihu hesitated before fully burying his body in the light.", "He turned his head and looked back.", "The world in which he spent close to seven years entered his view.", "After staring intently with lingering attachment, Seol Jihu gave a subtle smile.", "“…You know.”", "Then, he said what he couldn’t say before.", "“Wouldn’t it have been fun if we met in the present world?”", "Though no reply came back, Seol Jihu smiled faintly.", "“At least, I think so.”", "With that, Seol Jihu cast aside his attachment and threw himself into the pillar of light.", "As he fully entered the portal, his field of vision was dyed white, and his consciousness faded away.", "In the last moment before he completely lost consciousness—", "Though it may have been an auditory hallucination, he felt like he heard Black Seol Jihu’s laughter resounding behind him.", "*", "When he woke up, Seol Jihu found himself sitting on the ground.", "Nothing had changed.", "Stale air, clean marble floor, and Earthlings that were quietly praying… everything was the same as the day he left.", "Seol Jihu blinked rapidly.", "He sniffed and then touched the floor.", "Inside the Path of the Soul, the time he did not have his senses was longer than the time that he did.", "Since the surrounding scenery changed as well, everything felt new despite his familiarity with the place.", "If he had to describe it, it was like coming back home after being away for a long, long time.", "[You’re finally back.]", "A voice he had not heard for a long time rang out.", "Seol Jihu looked up.", "He could see a grey statue in front of him.", "‘It’s been a while.’", "[It may have been for you, but not for me.]", "‘You’ve been watching me?’", "[Sometimes. But Luxuria has been watching you everyday.]", "‘I’m embarrassed.’", "[Embarrassed?]", "Gula laughed.", "[Now that is interesting. Your will was truly incredible. Not only Luxuria, but even Superbia was moved to tears. When you took that step forward before succumbing to total collapse, even I was moved greatly.]", "A high praise continued.", "[Not stopping there, your endless desire to improve yourself has moved us all. Ira retracted the statement she made about you during the Banquet. That is the level of austerity you showed during your time of tribulation. It’s hard to believe that you are a human!]", "Ira’s statement from before…", "‘What was it again?’", "Seol Jihu tilted his head.", "[So, did you obtain what you were seeking?]", "Gula asked.", "Seol Jihu thought for a moment before replying.", "‘I’m not sure.’", "[The time you spent there was not short. You still are not sure?]", "‘Rather than being sure… what I learned through the trials was how lacking I was. The effort I put in was to make up for the things I was lacking.’", "Seol Jihu continued his thought.", "‘But I’m not satisfied. It isn’t as if I didn’t make any gains, but I don’t think I’ve gotten everything. That’s why I’m not sure.’", "Gula smiled quietly. His answer was slightly different than the first time he used the Divine Stigmata.", "[I am happy that your reply shows your growth.]", "At the same time, an isolating barrier formed around them.", "[It is time. Rise.]", "Gula’s statue, or to be more precise, the eyes of Gula’s statue were shedding tears.", "The streams flowed down her cheeks and came together at her chin before finally falling as a small teardrop that shone faintly in the air.", "Seol Jihu immediately stood up and lowered his head.", "The time to end this long, arduous tribulation had come.", "Now, it was time for everything to change.", "[In the name of Gula, I hereby acknowledge Seol Jihu’s passing of the trials.]", "The cluster of light quickly descended. As it seeped into Seol Jihu’s stomach, a slight pain arose.", "When Seol Jihu lifted his shirt, he could see a flux of light spreading out from his belly like a spider’s web.", "Excluding the small ones, three stems were spreading out into the shape of a scar.", "[To the one who walked up the Path of the Soul three times.]", "Gula’s voice echoed out.", "[I bestow three divine vestiges and the Authority of ‘Godslaying’.]"]}