{"cid": "169", "title": "Chapter 169. Skirmish (4)", "content": ["\"Halt! All units halt!\"", "He screamed for the soldiers to stop before ordering them to quickly take up a defensive formation.", "Seol Jihu was able to take a breather thanks to Flone who had been sweeping the area, so he hurriedly ran up to the soldier and asked.", "\"What happened?\"", "The soldier raised his trembling finger.", "\"They’re… running.\"", "It was a weak voice.", "Seol Jihu moved his gaze towards the direction the soldier had pointed.", "It was true. The Medusa that his and five other teams were targeting was running off into the distance.", "\"Must we really catch the Medusa? If it’s running away…”", "The soldier asked with great difficulty.", "\"…We must kill it.\"", "The Medusas were only the first step of their mission. Their ultimate goal was to take down the Nests.", "The Medusas were different from other Parasites in the fact that they were the direct offsprings created by the Nests. They had reproductive and absorptions abilities in addition to their excellent control ability. Their high intelligence was incomparable to the Hydras, which were also classified as high-ranked species.", "As such, Teresa had used the Nest’s sole weakness of ‘being unable to do anything during summoning’ to execute a plan.", "In other words, taking down the Medusas meant forcing the Nests to make a choice.", "It was either ‘to stop the summoning and control the battlefield’ or ‘to continue the summoning and give up troops.’ The first would be better, but the latter was also fine. This was because a single Medusa controlled up to at least a thousand troops, so getting rid of one would imply a significant weakening of the enemy’s strength.", "The Hydra was holding out, but there was only a single one present, not to mention that it was a monster with next to no control ability since it only had its fighting power maximized.", "“That’s why it's crucial to take down all the Medusas…”", "The soldier didn’t know how to reply.", "It wasn’t that they couldn’t chase after them, but going too deep into enemy lines would pose a large risk.", "Additionally, their team’s advancement speed was too fast, causing the defense line to be out of alignment with the other teams. The possibility of getting surrounded was high if they went further in.", "Rather, they will get surrounded.", "A Medusa was extremely crafty unlike other Parasites, so it was highly likely that it was intentionally luring them in.", "And in reality, the constant attacks from the Parasites had completely stopped even when they were standing in the middle of the battlefield. It was as if they were waiting for them to come further out before surrounding them.", "“Damn it! They’re scurrying away after pissing us off!”", "A soldier was furious.", "Seol Jihu confirmed his target. The Medusa was slowly running away while sneaking glances behind its back.", "Seol Jihu silently stared at it for a moment before secretly raising his pendent and whispering to it.", "\"Flone. Are you there?”", "[Yeah!]", "Flone replied, hearing his voice. And when the black smoke flew out into the sky…", "\"Oooooo!\"", "The soldiers raised their heads and let out a cheer.", "A hammer that emitted a brilliant light was forming in the sky. Mjolnir. A divine attack skill that one could learn after becoming a High Priest.", "A Priest that was at least a High Ranker was probably supporting them after being informed of their situation by an Archer.", "The shining hammer crashed down from the sky like heavenly tribulation.", "The Medusa which had focused its entire attention on luring them did not notice the hammer and was consequently struck square on the back of its head.", "“Keeeuaaaaaaaah!”", "The Medusa writhed with half its head blown away from the surprise attack. The Parasites that were escorting it also spasmed.", "It wasn’t a major wound considering its regenerative abilities, but due to the fact that the attack contained holy power, its body was momentarily paralyzed.", "The Medusa forcefully raised its body and was about to turn around before it flinched and tried to escape again.", "It was then.", "Pak. The Medusa’s head exploded without any warning.", "That wasn’t all. Its chest was ripped apart, and its body was violently twisted, causing chunks of its flesh to fly out.", "The enormous tower-like body of the Medusa was being disassembled.", "Upon careful observation, one was able to see its body covered in a thin layer of black smoke, but no one had the leisure to notice it in this dangerous situation.", "\"It’s our chance! Charge!\"", "The soldier who had concluded the phenomenon as support fire from a Priest and a Magician, shouted with all his might.", "[Yeaaaaaah!]", "Flone cheered, thinking that she had wonderfully completed the task given to her.", "But that cheer quickly turned to…", "[Huuuuuh?]", "…in only a few seconds.", "The ripped pieces of flesh were crawling towards each other and began sticking together like jelly. The mass of flesh quickly built up a tower, layer by layer.", "[W-what? What’s that!?]", "No matter how much the panicked Flone ripped and scratched at it, the rate at which it regenerated only became a little slower.", "The Medusa was steadily reviving.", "Seol Jihu sighed.", "The Medusa inherited absorption abilities and was a mass of Parasites like the Nest, so its regeneration speed was unmatched. Not to mention that it was surrounded by its minions and other corpses, so it was able to revive as much as it wanted. It could only be killed by lighting it up with holy power or by incinerating it with fire.", "It was too much to expect from Flone who was, in a way, similar to the undead.", "When he chucked a few Mana Spears at it just in case, its minions desperately blocked them with their own bodies.", "The soldiers and his team members were charging with all they had, determined not to let this chance slip by, but the retaliation from the Parasites who had almost lost their mother wasn’t weak.", "And above all, he could see the Parasites that had stealthily prepared to surround them, approach.", "The fact that its control ability did not disappear implied that the Medusa’s mind was still alive despite having its body destroyed.", "'How do we…?'", "At that moment, Seol Jihu who had been clenching his teeth suddenly had a shine in his eyes.", "\"Flone!\"", "Not knowing what to do, Flone immediately returned upon hearing Seol Jihu’s call.", "[What should I do? I, I…]", "\"It’s okay. You did well.\"", "Seol Jihu soothed her before asking her to help him one more time, and she happily agreed.", "The next moment, Seol Jihu’s body flew up into the air.", "He chose to approach the Medusa like he had done when he went to the ancient emperor’s villa.", "According to the soldiers, a result of some sort was bound to be created as long as they were able to kill the Medusa.", "The majority of the enemy troops were surrounding the Medusa, attempting to protect their mother, so it was a prime chance.", "Everything would be settled in an instant.", "He was able to catch up to the Medusa in a short time as he flew in a straight line across the air without any obstructions.", "Once there, he tried to agitate the Medusa by throwing Mana Spears at it without rest, but it didn’t work out as planned.", "Ten Cockroaches that flanked their mother’s sides as if they wouldn’t allow a second surprise attack, powerfully flapped their wings and rose up into the air.", "Just as Seol Jihu prepared to activate the Blessing of the Circum and break through…", "Pak!", "An arrow shot through the body of a Cockroach and knocked it out of the sky, causing Seol Jihu to widen his eyes.", "Cockroaches fell out of the air one by one following piercing screams of air being split apart.", "The marksmanship was extremely fast and accurate. The enemy’s final hope crashed out of the sky without being able to obstruct Seol Jihu.", "Seol Jihu confirmed the iron shafts of what were difficult to be called as arrows and guessed the identity of the Archer.", "'Marcel Ghionea!'", "But there was no time to rejoice. The Medusa that had fully recovered in the meantime was furious.", "A pillar of flames erupted out from its jaws.", "Seol Jihu was about to use the bracelet for real this time before a snow white barrier unfolded in front of his eyes.", "There were two layers.", "Chiiiiiik!", "The barrier melted down with white smoke, but the flames that had threatened to incinerate him died down.", "And finally arriving right on top of the Medusa, Seol Jihu shouted without hesitation.", "\"Now!\"", "Seol Jihu’s body vertically dropped down as Flone let go of him.", "He looked right in the eye of the monster below as the wind powerfully brushed against his face.", "The Medusa extended its long tongue.", "As if it still had a trump card, its chest area formed by entangled corpses began squirming.", "[Watch out!]", "Flone quickly descended after him, but Seol Jihu was already curled up in the air.", "Flash Step was not a foot technique but a body technique.", "'In that case…!'", "The moment Seol Jihu spread out his body and exploded his mana…", "\"Kyaa…?\"", "The Medusa that was carefully measuring the distance suddenly widened its eyes.", "There wasn’t anything else it could do. It hadn’t even blinked its eyes. The moment light suddenly flashed, the remaining distance instantly became naught.", "All it could see was a human calmly staring at itself and raising his spear with both hands. The Medusa’s face distorted one step later. Its chest ripped opened and from inside it, multiple flailing arms extended out.", "But at that moment…", "\"Kii…!\"", "A spearhead that was emitting a brilliant, half-foot-long golden aura was cutting its head exactly in half.", "\"Kiiiiiaaaaaaaahhhhh!\"", "And in the next moment, Seol Jihu could definitely feel it even while having his ears ring from the scream.", "He could feel the sensation of cutting through a sticky substance followed by large chunks of meat as his spear traveled down from its head.", "It sliced through the head and body…", "Boom!", "And made a large indentation on the ground as it landed.", "\"Keuk!\"", "Seol Jihu groaned before quickly raising his gaze.", "He saw the Medusa bewilderedly raise its hands and press its temples. It already knew it was done for, but still desperately struggled in vain.", "A golden streak of light shone out from its head to toe, like a water droplet trailing down a windowpane. Following the quickly traveling streak of light, the Medusa’s body separated in half. Ice circularly spread out on the cut surface before the whole body suddenly burnt black.", "Soma’s Essence was made specifically to hunt down evil.", "The Medusa that was hit by that power quickly turned to ash before it scattered away into the wind.", "It was the end of the Medusa.", "And it was the moment when the trembling in Seol Jihu’s feet turned to relief.", "*", "\"Wow!\"", "Teresa who had been watching from the fortress with crystal binoculars clasped her fist.", "She had wondered what was going on when she saw an Earthling shoot up into the sky.", "When she found out it was Seol Jihu, she screamed for the first time. And when she anxiously watched him with sweaty hands and saw him kill the Medusa, she screamed for the second time.", "Teresa put down the binoculars with a dazed face.", "\"No way…\"", "All the teams excluding the ones with Claire Agnes and Erica Lawrence had been struggling.", "Seol Jihu’s team wasn’t exactly struggling, but they were still the first to take down a Medusa. More importantly, the Medusa that they killed was also the only Medusa that had retreated back.", "Of course, it was all possible thanks to Flone being there, but Teresa who wasn’t aware of this could only be shocked.", "\"Princess. The spell is compl— What is the matter?”", "Ian who had come to inform the completion of the spell, asked after seeing Teresa’s expression.", "\"My hubby, dear, darling!”", "\"Excuse me?\"", "\"N-nothing. What did you say again?”", "\"The spell is complete. Should we activate it now?”", "\"…Wait a moment.\"", "Teresa raised her hand.", "\"How long can you hold the spell before its activation?”", "\"Well. We’re sharing the burden so it’s possible to delay it, but… isn’t it better to use it right away?”", "\"N-no.\"", "Teresa shook her head.", "\"30 minutes… no… Just 10 minutes.”", "Ian made a face like he could not understand.", "The Earthling they had hired from Scheherazade with a lot of gold was a rare Magician specializing in mind magic. Their original plan was to cast a large-scale jamming magic on the battlefield to cause confusion and attack the Medusas.", "So Ian could only tilt his head in confusion at the sudden request to delay the spell.", "But after witnessing Seol Jihu’s accomplishment and his immediate movement towards the next Medusa, Teresa decided to delay the plan.", "A start was half the journey. A wind of change had started to blow on the battlefield.", "It meant that there was a way to use the spell more efficiently.", "She abandoned their previous plan in her mind and started to craft a new plan. She had witnessed his abilities multiple times in the past, so she was fully confident in him.", "Teresa who was making a new board centered around Seol Jihu had a bright face.", "It was the first ray of hope after the news of the Parasites’ advancements.", "*", "At the same moment.", "Undying Diligence, who had just entered the valley, stopped his steps. He stared past the peaks that were engaged in war with slightly surprised eyes.", "Unsightly Humility and Vulgar Chastity looked the same way.", "\"Ho!\"", "\"Oh my!\"", "They each let out short gasps and looked surprised.", "Undying Diligence, who had received a brief report on the situation opened his mouth.", "\"…What happened?\"", "Unsightly Humility burst into laughter.", "\"Isn’t this a surprise? The sight of the Queen’s army driven back this far by the insects… did this ever happen under the Empire?”", "\"Indeed. This is strange.\"", "Vulgar Chastity flapped her wings.", "\"I thought we’d be able to stride right in by the time we arrived.”", "\"Well… the Nests are safe so it doesn’t matter.”", "Undying Diligence smirked.", "\"It was just a greeting anyways.\"", "\"Funny. Were you really thinking of talking to them?\"", "\"That’s what the Queen wished for. There’s no reason not to.”", "Unsightly Humility giggled.", "\"I’m curious about the way you think. Then why did you send the troops as a greeting? The Queen will be disappointed if she finds out.”", "\"The insects’ psychology is just so. They tend to listen well after bashing them a bit.”", "\"Then, they won’t listen even more after this.\"", "\"Silence! The result will be the same whether they talk or not.”", "After coldly replying, Undying Diligence walked away.", "Unsightly Humility shrugged his shoulders and patted his spectral horse.", "Even though it was a spirit without a body, the sound of the horse trotting away silently echoed out into the valley."]}