{"cid": "427", "title": "Chapter 427. Supernova (1)", "content": ["Seol Jihu stood speechlessly for a while.", "It would be a lie to say he wasn’t shocked.", "Success had been at arm’s reach, but just as he grabbed it, it had disappeared like a mirage.", "He only realized after the matter that he had failed, not succeeded.", "The shock he received was even more prominent because of it.", "At that moment, he felt a hand being placed on his shoulder. When Seol Jihu turned his head in a daze, he saw Philip Muller staring at him with sunken eyes.", "“I don’t know how this happened… but staying here is absolutely the worst thing we can do.”", "Seol Jihu’s heart sank, and he snapped back to his senses.", "Now wasn’t the time to dwell on failure, not when every second was pivotal for survival.", "Although Eun Yuri had managed to help everyone escape, the Parasites’ forces must be closing in even at this moment.", "“Damn it…. Just what the hell is going on…?”", "Hugo pressed his forehead and sighed lightly.", "“We should worry about getting out of here first.”", "Teresa spoke nonchalantly, but her voice was trembling.", "“The enemy’s sudden change in the movement must mean Representative Seol’s plan hit the nail on the head.”", "Philip Muller said after a brief moment of silence.", "“Whether this was their aim or not, the Parasites’ intention is clear. They want to retrieve the last piece of the stele from us.”", "That was the only logical conclusion they could come to. It was simply too difficult to think that the Parasites had orchestrated this entire move for something else— for example, to kill Seol Jihu.", "Abandoning the occupation of Nur and Scheherazade, going so far as to use a hidden card like a long-range teleportation spell, all to kill one person?", "No one imagined that the Parasites would do something so absurd.", "“Gorad Boga’s barrier is still up, right? They must be planning to take our piece of the stele first before going back to Scheherazade and retrieving the last piece.”", "Right, this was a more realistic conclusion.", "In reality, the Parasites would have to consider many factors before thinking about performing long-ranged teleportation back to Scheherazade. Still, given the lack of information on the expedition team’s side, this was a rational judgment on their part.", "“That means this piece of the stele can’t be a negotiation tool. That said, this doesn’t change the fact that we need to secure this piece of the stele no matter the cost.”", "Philip Muller looked around at everyone before speaking with a low but clear voice.", "“We have two choices remaining. Obviously, we have to pick one.”", "He continued quickly.", "“The first is to stick together and pave a way out. I can’t say it’s the best option given the situation we’re in. We’re sure to lose the stele, and there’s a chance that we’ll all be wiped out. We won’t even have the time to use someone as a decoy and run.”", "It was the cold-hearted truth.", "They couldn’t expect a repeat of the Tigol Fortress War.", "In fact, it was the opposite. The enemy was charging toward them in a straight line, and they didn’t have the defender’s advantage either.", "Furthermore, the Empire’s territory was contaminated to the soil by the Nests’ influence. As the effect of this contamination was the same as the Parasites having several corrupted World Trees, the Parasite Queen, the Army Commanders, and even the lowest-ranked Parasites should receive a boost in their strength.", "What if the expedition team chose to go with the first option?", "They would have to push through wave after wave of Parasites before being surrounded and succumbing to pitiful deaths.", "“To be honest, neither option is particularly hopeful, but strictly looking at things from the perspective of protecting the stele, and with a little bit of luck….”", "Philip Muller trailed off and then looked back at Seo Yuhui.", "“Can you hide the aura emanating from the stele? It’s fine even if it’s for a few days.”", "“Yes, I should be able to if it’s only a few days.”", "Seo Yuhui nodded.", "“Good. In that case…”", "Philip Muller adjusted his glasses and explained the second option.", "*", "Soon, the expedition team went through a small change.", "They had split into groups of three.", "No one said a word.", "Everyone had grim, solemn looks on their faces.", "“Miss Baek Haeju.”", "Inside the somber atmosphere, Seol Jihu turned to Baek Haeju, who had formed a group with Maria and Kazuki.", "“We’ll leave it to you.”", "He spoke briefly.", "Baek Haeju had a profound and mysterious look as she stared back at Seol Jihu. She looked angry and pitifully sad at the same time. She also looked like she had something to say and seemed reluctant to leave.", "However, after receiving Seol Jihu’s strong gaze, Baek Haeju bit her lower lip. She then turned around and began to run in one direction.", "Kazuki ran after her…", "“Seol Jihu, you cursed son of a bitch!”", "And Maria spat out a curse before chasing after them.", "With this, one group had set out.", "“See you guys on the other side…. Well, I guess that’s not exactly realistic.”", "Philip Muller smiled bitterly after finishing a chant.", "“Don’t worry. I’ll keep using Teleport until my body breaks down. I’m sure there will be a way if we can somehow make it back in one piece. Anyway, we’ll be going.”", "As Philip Muller glanced to the side, Marcel Ghionea walked up to his side while holding onto the unconscious Eun Yuri in his arms.", "Next, a faint magic circle shone below their feet, and the three of them vanished without a trace.", "Yet another group had set out.", "“Jihu….”", "Seo Yuhui staggered up and held Seol Jihu’s hands.", "“…I’m sorry.”", "Seol Jihu smiled bitterly.", "“No, don’t say that… You have nothing to be sorry for.”", "Seo Yuhui shook her head slowly.", "“I….”", "She closed her mouth just before saying something.", "Just like Baek Haeju did.", "“If you’re going to cry, can you hurry up please?”", "Agnes reprimanded her from the back.", "It was as she said. This was no time to stand around and film a soap opera. Hesitation would only put the groups that had left first at a greater risk.", "Seo Yuhui clenched Seol Jihu’s hands one last time before turning around. With Agnes taking the lead, Seo Yuhui and Oh Rahee set out.", "Seo Yuhui kept looking back with apprehension, but she eventually disappeared into the horizon.", "“Should we get going as well?”", "White Tiger cracked his neck left and right, then warmed himself up.", "“Okay! I’m ready!”", "“Ah, shit, I feel like we’ll be the first group to die.”", "Hugo and Audrey Basler also chattered while stretching.", "“Seol! You better give that thing to me later!”", "Hugo shouted loudly while chasing after White Tiger.", "“Hmm, you better keep up, little brat and Haramark’s princess.”", "The Star of Wrath, Wu Lei, also signaled his departure.", "“Orabeonim! I’m going now! Don’t forget to act like you know me when you see me on Earth! I’ll pretend to know you too!”", "Yi Seol-Ah waved her hand.", "“Darling~? I have something to tell you when you come back. You’re curious, right? You must be dying to know! So you better make it back to Haramark alive.”", "And Teresa winked at Seol Jihu.", "Once Yi Seol-Ah summoned Aura, the three of them ran like the wind and quickly became a dot in the distance.", "“The great escape is upon us! Everyone get ready!”", "Hoshino Urara hopped around the area as if she found the situation enjoyable.", "“To be completely honest, I might have regrets, but I don’t resent you.”", "Phi Sora said to Seol Jihu before leaving.", "“Joining Valhalla, coming here… everything was my choice.”", "Hearing this, Seol Jihu revealed a faint smile.", "Phi Sora laughed as if she found the smile unsatisfactory.", "“Stop showing such a sad smile and think about doing your job. You get what I’m saying, right? Don’t try to draw the enemy’s attention for us.”", "Right, the second method that Philip Muller spoke of was hiding the aura of the stele, splitting up into several groups, and running away in different directions.", "Each group would have one person to pretend to carry the stele. The other two would be used as decoys to bind the Parasites’ feet if needed.", "Since the Parasites had no way of telling who had the stele, they would have no choice but to split up their forces, and the encircling net would naturally become thinner as a result.", "The most important aspect was shaking off the Five Armies. With this method, at least two groups would be able to escape without facing an Army Commander’s pursuit. This naturally meant that they would have a higher chance of escaping.", "Of course, this was only a play on probability discounting any variable that might come up.", "Besides, even if the one holding the stele managed to escape an Army Commanders’ pursuit, they would have to fight the Parasite army without a doubt.", "Whether the groups could overcome this life or death crisis depended solely on their luck and individual strength.", "If there was one thing that they were hopeful for, it was that the Federation and humanity would notice their situation quickly and come to help.", "If the reinforcements hurried, perhaps, just maybe, they might be able to save a couple of people before it was too late.", "And if one of the saved people included the person with the stele, this operation would be a success.", "The reason two throwaways were included in each group was to increase the chance of success, even by a little.", "“Alright, Seol! We’re going now!”", "Chung Chohong and Phi Sora left with Hoshino Urara leading the way.", "With this, everyone had left the area.", "Each in a different direction.", "The only one left now was Seol Jihu…", "“….”", "As well as Flone and Little Chick.", "“…We should get moving too.”", "Little Chick murmured calmly.", "Seol Jihu nodded his head silently.", "“…Ah.”", "Seol Jihu stopped just as he was about to run.", "“What’s up, partner?”", "“Wait, just a second.”", "He then opened his status window and took out a small pouch from his pocket.", "*", "The Parasite Queen was welling up with indescribable excitement.", "Her enemy, the Brightest Star, had finally moved according to her plans for the first time and had finally fallen into her hands.", "[Hoh.]", "Then, the Parasite Queen exclaimed quietly.", "She had read the expedition team’s movements.", "[Running in seven different directions…. But what use will that be?]", "From the looks of it, the Brightest Star and his comrades seemed to still think that their goal was the stele.", "That didn’t matter. In fact, she welcomed it.", "How could she be anything but excited when the chance to eliminate the Brightest Star and the core of the enemy’s forces, and even retrieve the stele was delivered to her doorstep?", "—Your Majesty~ Do we have permission to chase them down and kill them all?", "Exploding Patience’s lilting voice rang out in the queen’s head.", "[Of course!]", "The Parasite Queen replied without hesitation.", "[I already deployed Unsightly Humility and his army. Even if he can’t finish the job, he will be able to buy time for our arrival!]", "She announced to the Army Commanders with an animated voice. She had no plans to miss this golden opportunity. As far as she was concerned, this matter was already over.", "—No, you can’t.", "That was, until Sung Shihyun cut in.", "—Your Majesty, you still haven’t given up yet?", "Immediately, the Army Commanders broke out in a clamor. Most were denouncing the First Army Commander’s impudent comments as the Parasite Queen stood at the absolute peak of the Parasite hierarchy.", "However, Sung Shihyun continued to speak his mind firmly.", "—Didn’t you say you would transfer the command of this operation to me?", "[You brat…. I’ve been too lenient with you….]", "A hint of displeasure flashed across the Parasite Queen’s face. If she had not granted Sung Shihyun the right to speak on equal footing, she would have already handed him severe punishment.", "[You mean to let go of everyone besides the Brightest Star?]", "—No, we don’t need to let go of them. I’m just saying… well, actually, yes. I’ll make this simple. That is what we ultimately need to do.", "Sung Shihyun cleared his throat.", "—But I will agree to pretend to chase after them to separate them from Seol Jihu and to make them believe that we’re after the stele.", "[Why?]", "—Because this plan, from beginning to end, was only about eliminating Seol Jihu.", "[….]", "—Your Majesty, Seol Jihu instantly created a variable from a situation of crisis, and I struck back by taking out my own variable. It worked, and that’s how we got to where we are now…. But, that’s as far as it goes.", "—We have a golden opportunity in our hands now, but that doesn’t mean we’ve followed through with it. It’s not over until it’s over.", "The Parasite Queen fell into deep thought at Sung Shihyun’s earnest plea.", "Then, just as she was about to say he was worrying needlessly, Sung Shihyun’s next words caught her completely off guard.", "—When Seol Jihu rushed to Scheherazade, he single-handedly beat Vulgar Chastity to near death, Exploding Patience was busy running away, and Twisted Kindness also failed to land her attack and took a hit instead.", "[…What?]", "The Parasite Queen’s excitement vanished, and a chilly wind blew in her heart.", "[Is that true?]", "—Of course! Shocking, isn’t it? The problem is that we don’t know how much strength he is hiding.", "Sung Shihyun continued.", "—We have used all the cards in our arsenal, but who knows what cards he still has up his sleeve?", "—We confirmed that he has Special Thunders, but would he have come this far without a plan? No, I don’t think so.", "—That’s not all. If he goes berserk in a last-ditch effort and somehow succeeds in creating another variable, what will you do then? Who knows if he will just disappear like how he invaded the Empire?", "—We can’t let our guard down for even a second until we confirm his death with our own eyes. If it’s him, he will cook something up while we are distracted. I’m sure of it.", "Sung Shihyun spoke quickly before heaving out a sigh.", "—Most importantly… killing him once won’t be enough. We need to kill him twice.", "The Parasite Queen groaned quietly.", "—Of course, actually killing him twice won’t be possible, so we have to make it so that he’s as good as dead even if he revives.", "[Mmm….]", "—Despite all this, you want to chase after the others and even secure the stele? You want to eliminate the Brightest Star while going around and enjoying every dish like you’re at a buffet? No. Absolutely not. Just dealing with Seol Jihu is difficult enough.", "Sung Shihyun took a brief pause. Then, when the Parasite Queen didn’t say anything, he clicked his tongue.", "—Well, do as you’d like. It’s not like I don’t understand your sentiment.", "—But, if Your Majesty chooses to do this, just know that I will take my hands off of it.", "Meaning, he would follow the Parasite Queen’s orders but would not take responsibility for the operation’s success or failure.", "—Ehew, I can see it already. I should have gotten rid of him at the valley…. No, I should have listened to the First Army Commander back then~ You’re not going to say this later, are you, Your Majesty?", "The Parasite Queen bit her lip at Sung Shihyun’s biting words.", "She was deeply conflicted. Giving up on the rest was too much of a waste, but looking back, it wasn’t just once or twice that she thought, this should be enough, and came to regret it.", "‘Indeed, if we can just eliminate the Brightest Star….’", "With the advent of Seol Jihu in Paradise, the future of the Federation and humanity, which had been spiraling toward destruction, changed.", "If she could eliminate the cause of this change, there was a good chance that things would return to the way they were before the change.", "Of course, the Parasites might have an easier time in the future if they could kill humanity’s elites and retrieve the stele, but it would be fine even if they didn’t.", "After all, the Federation’s and humanity’s fate would be sealed as long as the Brightest Star could be destroyed.", "It was then.", "Flash!", "[?]", "The Parasite Queen, who had returned to the Empire’s territory from the Hiral Mountain Ranges, suddenly felt a strange sense of disharmony.", "‘Sunlight? No, this is….’", "The property of the light was different than the light shone from the sun. Though the difference was minute, the Parasite Queen was capable of recognizing the subtle difference.", "What she felt wasn’t warm sunlight but cool, silvery starlight.", "The starlight was quietly seething up like it was about to explode.", "It wasn’t night but the middle of the day, yet a star was emitting a light stronger than the sun?", "The Parasite Queen unwittingly raised her head at the absurdity of the phenomenon.", "Then, as she finally looked up at the celestial bodies…", "[Just what…!?]", "Her brows jolted violently."]}