{"cid": "142", "title": "Chapter 142. Choice of Destiny (2)", "content": ["“It’s a place I should never go?”", "Seol Jihu raised his voice subconsciously.", "[After the previous emperor was executed, the emperor that succeeded him declared it a forbidden place.]", "‘Forbidden….’", "It wasn’t a strange concept. No matter the era, it wasn’t uncommon for the ruling party to designate some places as forbidden grounds.", "It was just that this Sacrificium place had been designated as a place one couldn’t visit easily by an emperor of the Empire, a nation which was said to have reached the apex of magic engineering. The weight of the ban was far heavier than normal.", "“Why did he designate it as a forbidden place?”", "[Uuuuun~]", "Flone groaned, seemingly having trouble recalling something that happened such a long time ago.", "[I think it’s because people kept dying even after the death of the previous emperor.]", "‘After the death of the previous emperor?’", "Seol Jihu tilted his head.", "“Was he raising a monster in his villa or something?”", "[I don’t know.]", "The smoke shook side to side.", "[Many people wondered what the exact reason was, but no one could figure it out. The only thing everyone knew was that the only person to survive after going into that villa was that greedy emperor himself. Both during his lifetime and after.]", "“Do you think you could explain this in greater detail?”", "At that moment, a small cough rang out, causing Seol Jihu to jump in surprise. Jang Maldong was staring at him with narrowed eyes.", "“Are you calling someone?”", "“Huh? Ah, yes.”", "“You can talk normally. You don’t have to whisper.”", "“Thank you.”", "Jang Maldong closed his eyes again after giving Seol Jihu a fixed stare.", "Seol Jihu had many questions he wanted to ask Flone…", "“….”", "But because it felt like Jang Maldong noticed something, he couldn’t open his mouth easily.", "*", "When Seol Jihu returned to Haramark, he saw that Kim Hannah was calling him. He immediately placed his hand on the round crystal, and they were connected in less than 10 seconds.", "The reason she had called was to notify him that she had found the Heaven-Slaughtering Star and the white headband girl.", "The brother and sister duo were last seen in Eva. But seeing as how they disappeared after going into the temple, she said they had likely gone back to Earth and that she would notify him when they returned. It was at this moment that she realized Seol Jihu wasn’t really listening and furrowed her brows.", "—What’s up with that attitude? You’re the one who asked me for help.", "“Oh yeah, thanks.”", "—Do I have to fish for compliments? What’s wrong? Is something worrying you?", "‘Should I say it?’ Seol Jihu hesitated. Although he wanted to confide in someone, Bok Jungsik had asked not to let the Yi siblings know about the transfer, and had even asked for a non-disclosure request.", "But because Seol Jihu wanted to obtain information, he asked in a roundabout way so as to keep the secret.", "However, Kim Hannah wasn’t someone to be looked down on.", "—Archer? You mean, Yi Seol-Ah?", "She instantly realized what he was worried about when he said, ‘Master visited White Rose because they had a talented Archer.’", "“No?”", "—Don’t lie. Ordinary Archers won’t catch Master Jang’s eye. Since you said White Rose… it either has to be their top Archer or a rising star.", "“Well, he actually went to see their top Archer.”", "—Oh yeah? What was that Archer’s name?", "“Uh, what was it again?”", "—Funny. You’re saying that without even batting an eye? Hey, don’t lie to me. That top Archer I just mentioned? He recently ended his contract with White Rose and left.", "When Seol Jihu fell silent, Kim Hannah laughed as if his attempt to trick her was cute.", "—Who are you trying to fool? Wet your mouth a little before you try.", "Seol Jihu looked dumbstruck. Kim Hannah cackled, then rested her chin on her interlocked fingers.", "—Anyways, I’ll keep it a secret, so just say it.", "“….”", "—Or don’t, if you don’t want to. You think I won’t find out just because you stay silent?", "In the end, Seol Jihu revealed everything that happened until now.", "By the time the explanation came to an end, Kim Hannah’s eyes had narrowed to a slit.", "—He~eh. A collaboration for an expedition in exchange for a transfer….", "Her eyes rolled.", "—That’s intriguing, for sure. The conditions are too good.", "“You think so too, right? Maybe they’re targeting me.”", "Kim Hannah looked at Seol Jihu strangely before going ‘Ah.’", "—Right, Master Jang is there.", "“…You really don’t think I might have figured this out?”", "—As if.", "Seol Jihu smiled bitterly.", "—Anyways, expedition… expedition…", "Kim Hannah tapped on her desk. It wasn’t as if she knew everything there was to know about Paradise, and it certainly wasn’t a strange thing for Earthlings to go on an expedition.", "But Kim Hannah showed suspicious movements like tilting her head or twisting up the corners of her mouth.", "—It smells…", "“Smell?”", "—It smells fishy.", "Kim Hannah revealed a furtive smile.", "—I can practically smell the rotting odor of shit.", "Seol Jihu couldn’t help but think about how Kim Hannah compared things to poop whenever something happened.", "—Given what I know about that old man Bok Jungsik, there’s no way he would proceed with something so reckless…. Aha!", "Tak. She smacked the desk before staring at Seol Jihu.", "—Hey.", "“?”", "—You haven’t gone ahead and accepted the offer, have you?", "“Why would I? I refused, obviously.”", "—Good. I’ll be clear just in case. Don’t interfere in this matter. Don’t get yourself involved and don’t be related to it in any way. Got it?", "“I told you, I refused.”", "—We’ll see about that.", "Kim Hannah snorted.", "It wasn’t until a few days later that Seol Jihu found out what she meant.", "**", "“Welcome. It’s pretty hot today, isn’t it?”", "“It’s been a while, Princess.”", "“Yes, come in.”", "Teresa came out to greet Seol Jihu and personally led him to the reception room.", "Teresa wasn’t in her usual military uniform and was wearing an apron instead. Because of it, she exuded a cozy and graceful atmosphere rather than a lively and energetic one.", "“I heard that you became Carpe Diem’s new leader.”", "“Ah, yes.”", "“You must not have been taught all the duties and responsibilities that come with that position. It’s hard, isn’t it?”", "“It is a bit unsettling, but I’m sure I’ll get used to it.”", "“Oh, I’m sorry to hear that. Would you like to wash up and rest? Or maybe you’d like to eat something first?”", "Saying this, Teresa suddenly blocked her mouth with her hand and dropped her head. Seeing how her withdrawn shoulders were trembling slightly, she seemed to be making considerable effort to rein in her laughter.", "‘What’s wrong with her?’", "“No, I already took a shower this morning. I also—”", "“I see, then why don’t you eat first?”", "Teresa spoke gently as she personally took Seol Jihu’s jacket off.", "“Ah, I’ll hold onto it.”", "Despite Seol Jihu’s refusal, Teresa more or less ignored him and headed to the dining hall. As a result, Seol Jihu was able to enjoy the unexpected luxury of having the Princess’s handmade food.", "Other than Teresa constantly asking ‘Is it good?’ and staring at him with her chin cupped in her hands, the meal couldn’t be more excellent.", "Teresa spoke as she watched Seol Jihu tap his mouth with a napkin.", "“Mm, I guess this is enough for today.”", "“Excuse me?”", "“No, I was just talking to myself. Anyways~”", "Teresa threw off her apron and returned to her usual appearance.", "“I heard that you became Carpe Diem’s new leader.”", "“Didn’t you say the same thing just a while ago?”", "“Eii~ The meaning is different, you know~?”", "Teresa giggled.", "“Anyways, how does it feel, being a leader?”", "“Mm….”", "Seol Jihu thought for a moment before replying.", "“There are many things I want to do, but not much that I can actually do? That sounds about right for now.”", "“Why? There’s something even our Hero of Haramark can’t do?”", "Seol Jihu didn’t know when he received another strange nickname, but he still smirked.", "“There are things in life you just can’t do without money.”", "Hearing the bitterness in Seol Jihu’s tone, Teresa folded her arms.", "“You’re right. Money doesn’t guarantee happiness, but it at least guarantees leisure.”", "Seol Jihu couldn’t help but agree seeing how realistic this was.", "“Don’t worry too much. If you’re lacking money, you can just make more.”", "“Right, like how you can eat cake if you don’t have bread.”", "Seol Jihu nodded his head in agreement.", "“Aii, that’s not what I meant.”", "Teresa shook her hand.", "“I’m asking if you’re interested in making money.”", "“?”", "“Listen. We’re not the ones who came up with this plan, but an interesting proposition has been made to us a few days ago….”", "As Seol Jihu listened attentively, his expression became more and more distorted.", "Teresa was chatting away until she saw Seol Jihu’s grim expression.", "“What’s wrong?”", "She trembled inwardly, wondering if she said something wrong.", "“Did White Rose make this proposition?”", "And when she heard this, she blinked her eyes.", "“…Oh, you already knew?”", "“Princess.”", "Seol Jihu’s voice suddenly dropped an octave.", "“Did White Rose tell you to ask us?”", "His manner of speech changed as well.", "Feeling that something wasn’t right, Teresa quickly fixed her posture.", "“No. White Rose made this proposition to collaborate, then asked us to introduce them to a good team if we knew one.”", "“….”", "“It sounded like a good offer, and Darling’s, I mean, Carpe Diem’s team popped up in my head….”", "Teresa was speaking fluently when the end of her speech became blurred.", "“Princess.”", "Seol Jihu slowly opened his mouth.", "“In truth, we visited White Rose a few days ago and heard the same offer.”", "“Oh, you did? I didn’t know.”", "“Yes, and we refused.”", "Seol Jihu had thought the matter was over when he refused them. However, the same offer had now returned to him through the Haramark Royal Family.", "Was this a coincidence? Or was it part of Bok Jungsik’s scheme?", "Or… was this destiny?", "Seol Jihu’s eyes narrowed.", "“Have you accepted?”", "“We haven’t given a definitive answer.”", "Teresa shook her head.", "“But we gave a favorable answer. The evidence they provided was flawless. Since the villa belonged to an ancient emperor, even a rock lying around there might be made of gold. We could tell that White Rose made careful preparations for this expedition. They were offering us an opportunity to take a bite out of an already-prepared meal, so we didn’t really want to refuse outright….”", "Teresa mumbled before asking carefully.", "“Why did you refuse?”", "Seol Jihu became speechless. At this rate, there was a huge chance that the Haramark Royal Family would participate in this expedition.", "He wanted to tell them not to go, but he couldn’t think of a proper reason.", "Saying, ‘You’ll die if you go’; he would be lucky to not be treated as a madman.", "‘Maybe I should reveal the existence of my Nine Eyes….’", "If it were Teresa, perhaps she might believe him.", "He bit his lips lightly and fell into deep contemplation. Meanwhile, light flickered in Teresa’s eyes as she watched the young man intently.", "The Seol Jihu she knew didn’t cower no matter what wave came crashing in. He didn’t shrink, nor did he back away.", "In fact, the more difficult the problem was, the more he would work to find a solution. The result he produced always impressed her as well.", "But now he was showing such disapproval for what seemed like a well-planned expedition…", "‘Could it be?’", "After staring at him for a moment, she initiated a conversation.", "“You see— I’ve actually been thinking about not going….”", "Seol Jihu shot his head up.", "“Well… White Rose’s offer was good and all, but I wasn’t really sure about having to enter the Parasites’ territory. I mean, they did tell us that they would travel by sea, and not land, but… you remember, right? What we experienced while we were escaping from the laboratory.”", "Teresa continued nonchalantly.", "“I’m still jolted awake from sleep whenever I think about it. I don’t want to crawl into that situation again just to make money.”", "“Then…”", "Checking that Seol Jihu’s complexion had brightened, Teresa dealt the finishing blow.", "“Eii, I’ll just not go. Life is more important than money anyways.”", "“Princess.”", "“Please understand. I’m a fickle woman, you see.”", "“Right, I agree. Well thought, Princess. Well thought.”", "Seol Jihu didn’t nitpick about she changed her tune completely. He nodded his head, relieved from the bottom of his heart.", "Seeing how the young man smoothed down his chest to finally relax, Teresa was convinced.", "‘I dodged a bullet.’", "She hadn’t changed her tune for no reason. Teresa had noticed the secret Seol Jihu was hiding a long time ago.", "To be more precise, it was when they were escaping from the Delphinion Laboratory. Although Teresa was the one who led the way, Seol Jihu was the one who told her about the enemy’s whereabouts.", "At first, she found this rather mystical. But when the young man was spot on 100% of the time, she couldn’t just chuck it up to him having good intuition.", "It wasn’t as if he was an Archer. No, even if he was a High-rank Archer, it would be impossible for him to be right hundreds of times consecutively.", "She wasn’t sure about the details, but it seemed likely that this mysterious ability of his had activated this time as well.", "In other words, there had to be a reason.", "A reason that the young man known as the ‘problem-solver’ was taking his foot out of this matter.", "Moreover…", "‘If Hubby says don’t go, I won’t.’", "Teresa smiled bashfully as she rubbed the apron she took off."]}