{"cid": "100", "title": "Chapter 100. The Threads of Bonds Coming Together (2)", "content": ["“Hm? What is it?”", "“Also, I have a couple of favors I’d like to ask you.”", "Prihi stared at Seol Jihu, who suddenly turned serious. What was the young man trying to say?", "“I’ll listen to the favors first.”", "“Can you prepare a new habitable land in Haramark using this gold bar?”", "“…Land?”", "Prihi’s tone went up, and his usually-calm eyes narrowed slightly. It was as if he heard something completely unexpected.", "Seol Jihu continued without a pause.", "“In addition, please lend me Master Ian.”", "“Ian Denzel?”", "Prihi’s eyes clearly narrowed to a slit, his expression forming a frown. Ian Denzel was a Magician affiliated with the royal family and one of the few Earthlings Prihi trusted. There was no need to even mention the value of a Magician. He might understand if the young man gave a good reason, but he didn’t feel good being told to ‘lend him’ out of the blue.", "“Father.”", "When Teresa tried to step in, Prihi raised his hand to stop her.", "“Is this related to what you wanted to tell me?”", "“Yes.”", "Prihi gave the young man a deeply profound look. Seeing this gaze that seemed to be asking for an explanation, Seol Jihu opened his mouth. He told him about the village head of Ramman Village and the ghost saintess trapped in the Forest of Denial’s tomb. As the story continued, the king’s indifferent expression changed to one of interest.", "“…I see.”", "Prihi leaned forward, locked his fingers, and rested his chin on them.", "“You want us to accept the villagers into the city.”", "“I heard that the castle has limited capacity, but I’d like to ask you if it is at all possible.”", "“Hm, to be frank, it is quite difficult. The castle is already at max capacity. A couple dozen might be acceptable, but accepting hundreds of villagers is a bit….”", "Prihi sounded reluctant. Helping a large group migrate wasn’t an easy task. If he simply allowed them into the city and forgot about them, they would only become homeless and displaced. If that were to happen, it was better to not accept them in the first place. Thus, granting Seol Jihu’s request meant he would have to prepare them shelter as well as means of living.", "“Your Majesty, you said that the royal family is fair in rewards and punishments. One is a retired old man living in seclusion and the other is a soul, but I believe they have the right to be rewarded more than anyone else who participated in this mission.”", "Seeing the king in thought, Seol Jihu pleaded earnestly.", "“…It is true that Ramman Village is in an awkward location. I won’t deny that I thought it couldn’t be helped.”", "Prihi let out a deep sigh and nodded his head.", "“This isn’t a matter I can decide on easily. But with this gold bar, I can examine it favorably.”", "“Then!”", "Just as the young man rejoiced….", "“But, why?”", "Prihi’s eyes suddenly flashed.", "“I want you to hear me out without misunderstanding me. Are you not an Earthling?”", "“Your Majesty.”", "“I am not trying to discuss philosophy, nor am I trying to discuss right and wrong. It is just that… you are an Earthling.”", "Prihi emphasized the last line.", "“Setting aside the matter of the Forest of Denial, is there a need to do so much for Ramman Village?”", "“….”", "“I don’t doubt that you understood me, but I will be frank. The villagers will be ecstatic and grateful if you simply send them a supply of food. You will also have repaid your debt to the village head.”", "It wasn’t that Seol Jihu hadn’t thought of this. A part of him wanted to put on airs and take the gold bar for himself.", "“If it is weighing on your conscience, I shall tell you this. The current Haramark cannot afford to look after its people. I can easily decline your request of kindness given the circumstances we face.”", "He was right. Pleading with the king only to be turned down because it was difficult. What better excuse was there?", "“In other words, no one will criticize you for taking this gold.”", "He was right again. Who would criticize him? All he had to do was keep his mouth shut. Moreover, he would become rich as long as he took this gold.", "“You want to use this gold for a cause which will not benefit you. I can’t help but be curious about your ulterior motive.”", "Right, it wasn’t that he was selfless. However, to him, there was something even more important than the gold in front of him. If he didn’t look at the gold bar with his Nine Eyes, he wouldn’t have noticed it until the end. But he had seen it and come to a conclusion.", "“There is nothing I’d call an ulterior motive.”", "He could now say this without hesitation.", "“I am only acting according to my rule.”", "“Rule?”", "“If you owe a debt, it is only natural to pay it back. An opportunity to do so has landed right in front of me. What reason do I have to not take it?”", "Prihi looked dumbfounded.", "“I do not understand you at all. You don’t seem to be the type who likes to play with words.”", "Seol Jihu almost answered, ‘I do, actually’, but he managed to stop himself from ruining the tension. He got to the main point.", "“I call it the Golden Commandment.”", "“Golden Commandment?”", "“The ghost saintess and the village head. Both of them treated me well. I cannot shamelessly pretend the achievements were mine alone, and it is improper for me to compromise with myself when I am treating others. After all, doing so would be deceiving my benefactors. I would rather not treat them unless I do it to my fullest power.”", "“….”", "“Your Majesty, if I cannot pay my debts to those two, I cannot expect them to treat me the same again. That is what I fear the most.”", "When the young man looked up at the king after a long monologue, he saw the king blinking his eyes repeatedly. He looked as if he had taken a blow to his face.", "“You cannot expect them to treat you the same again….”", "A few minutes went by before the king decided to open his mouth again.", "“Indeed.”", "He leaned back on his chair and said as he massaged his nose.", "“I am beginning to understand you better. Humans all have a limit to their vessel. The same goes for ghosts.”", "‘A limit to their vessel….’", "For some reason, that line touched him. He felt like it was the perfect summary of the Golden Commandment.", "“Thank you for your understanding.”", "“I didn’t give a clear answer yet, so I want to ask you one final question.”", "Prihi asked in a soft voice.", "“Is this truly what you want?”", "“Yes!”", "Seol Jihu answered without hesitation. Rather than being uncomfortable, spending the gold this way made him feel a thousand times better. Seeing the bright smile on the young man’s face, Prihi made his decision.", "“…I see.”", "So this is why you wanted me to meet him so much. He murmured to himself quietly so that Seol Jihu couldn’t hear him.", "“Then fine.”", "Finally, the decision was announced.", "“I, Prihi Hussey, hereby permit all villagers of Ramman Village to settle in the city. The gold bar rewarded to Seol Jihu shall be used to support them both materially and spiritually.”", "A royal decree. Although his position no longer possessed the glory it once held, the weight it carried made it such that his decisions could not be flipped lightly.", "“Furthermore, we shall partially support the appeasing of the pitiful soul trapped inside the Forest of Denial’s tomb.”", "Partially support? What did that mean?", "“He means he will raise the level and quality of the Ceremony.”", "Teresa whispered in his ear.", "“Her status does not disappear just because she became a soul. Although it was hundreds of years ago, didn’t you say she was canonized by the Empire? I mean to show her the appropriate level of respect.”", "Seol Jihu’s jaw dropped at Prihi’s statement. He had been expecting a simple rite where she was offered food and someone to talk to.", "When he imagined how much the saintess would rejoice, a smile bloomed on his face. And seeing this satisfied smile, Prihi rested his chin on his hands.", "“And?”", "“Pardon?”", "“We can finish discussing official work here. Why don’t we continue what we were talking about before? Something small, if possible.”", "Seol Jihu wasn’t an idiot. He realized what the king was implying right away. Although he put a restriction of it having to be small, he was saying he wouldn’t allow the young man to return empty-handed.", "“Uh… well….”", "The king waited patiently, but Seol Jihu didn’t know what to say. This truly meant that the young man did not want anything other than what he requested before.", "“You can take your time. The night is long.”", "After saying so with benevolence….", "“I will have to get going. I’m not the type of person who likes to procrastinate. It will take a few days for us to come up with a solid plan.”", "He picked up the gold bar and got up.", "“Father, you’re leaving? You should stay a little longer.”", "Teresa muttered as if she was asking how he could leave a pair of healthy man and woman alone at night. Prihi looked dumbfounded.", "“Hoho, I have quite the vixen as my daughter. Don’t say something you don’t mean a tiny bit. The one who told me to look for an opportunity to leave was….”", "He was mumbling with a wry chuckle….", "“I came up with the perfect excuse to leave you two alone. How can you be so blind?”", "Crack, crack- But he changed tune as soon as he heard the sound the bones cracking. Teresa, who was cracking her neck and knuckles, smiled brightly.", "“Oh, this young lady misunderstood her father’s intention. Please leave this to me and focus on state affairs.”", "“My…. It’s like I am entrusting a fish to a thieving cat.”", "“Did you say something?”", "“I’m going to risk my well-being and just say this. You can enter the storage, but don’t touch anything from the royal treasury.”", "“Geez, don’t be such a worrywart. Besides, it’s not like the royal treasury deserves to be called that.”", "Teresa grumbled, and Prihi smiled bitterly.", "“I’m just telling you not to empty out the way of living. I know that a married daughter is no better than a stranger, but have some self-restraint. When your older sister got married, she….”", "“Eii, who do you think I am? I’m not like Older Sis. I’ll leave the furniture and tableware at least.”", "While saying that, Teresa stealthily avoided Prihi’s gaze. By now, even a fool would realize what they were talking about, yet Seol Jihu was staring at them blankly with an innocent face.", "Prihi clicked his tongue.", "“Really, both in this world and that world, heroes are quite the peculiar group of people. Maybe it isn’t a matter of genes, but some sort of outside interference.”", "He mumbled regrettably before saying his farewell.", "“That was an interesting story and an enjoyable meeting. It was a time well spent. I’ll take my leave so you can enjoy at ease.”", "Seol Jihu didn’t know what he meant by enjoying at ease, but he quickly got up as well. However, Prihi placed his hand on his shoulder as if such motion was unnecessary and spoke.", "“Also.”", "His clear eyes stared at the young man, and a gentle smile spread across his face. It was the first smile he was showing since their meeting. Teresa’s eyes widened.", "“Thank you for saving my daughter.”", "At that moment, the sense of incongruity Seol Jihu had been subtly feeling disappeared instantly. Should he say the distance between them had shortened drastically?", "“I’m humbl-”", "“Ah, please.”", "“N-No problem.”", "With a chuckle, Prihi tapped on his shoulders twice before leaving.", "“…Well that was a surprise.”", "Teresa also chuckled, seemingly caught off guard by her father.", "“It’s been a while since I’ve seen Father laugh.”", "“Does His Majesty not laugh often?”", "“Rather than that, he….”", "Teresa was about to say something but swallowed her words back down. She felt like it was something she didn’t need to mention.", "“Anyways, why don’t we go somewhere cozy and finish talking about your reward?”", "“Oh, are we going to the storage?”", "“Aii, geez, don’t be in such a rush. Let’s chat while we slowly eat some dessert. We have lots of time.”", "‘Dessert!’", "Seol Jihu didn’t have any reasons to refuse. He was nervous and full of tension while he was eating, so he could barely taste the food. Now that the talk had gone well and he was left with someone he was more comfortable around, his taste buds returned and were roaring to eat. He gulped.", "“I’d love to try it.”", "“You can look forward to it. Once you taste it once, you’ll never be able to forget it.”", "After announcing this confidently, Teresa got up.", "“Alright, let’s go!”", "“Where?”", "“My bedroom.”", "“Huh? We’re not eating it here?”", "It was a justified question given that they were in the dining room. Teresa giggled.", "“This dessert has to be eaten in a secluded place. Though, eating it where you can be found out would give it a special flavor as well.”", "The young man tilted his head. Teresa made an alluring smile and wagged the bait seductively.", "“Come on, get up. Hurry! Not anyone can eat this dessert, you know!”", "“Wow, it must be really precious.”", "Teresa looked as if that was obvious.", "“Of course, it is. Father and Mother only made one in the world.”", "The king and the queen personally made it?", "“What is it called?”", "“It’s no fun if I tell you beforehand.”", "“Eii, come on, tell me.”", "Seol Jihu asked again, wondering how eating a dessert could be fun in the first place.", "“Hn~ng.”", "Teresa licked her lips before staring at him coyly. Then, she exclaimed.", "“It’s me.”", "*", "Seol Jihu refused vehemently, but when Teresa threatened to not give the reward, he bit the bullet and followed her to her bedroom. Thankfully, the dessert was a true delicacy. It was soft and flavorful, making him devour it eagerly, forgetting about saving face.", "He enjoyed eating Teresa Hussey, and because the Princess got happy seeing him eat so tastily, he was able to return with all sorts of additional rewards she gave.", "‘Who would have thought there was a dessert like that?’", "There really was a dessert called ‘Teresa Hussey’. It was a cute, no, a refreshing strawberry-flavored pink cake. Apparently, the king and the queen had personally made it for their youngest daughter, who was a helpless sweet-tooth. The cake was then given Teresa’s name as it was created on her birthday.", "‘That was great.’", "He wanted to taste it again. Enjoying the cake’s sweetness still lingering in his mouth, Seol Jihu returned to the office.", "‘It’s a good thing I went.’", "He felt like today was his lucky day. Not only was did he pay back the debt he owed the village head, but he was also able to care for the ghost saintess.", "That wasn’t all. Looking at the rewards he put on the office table, a feeling of satisfaction spread across his face. Although he didn’t get to enter the nominal royal treasury, the items he received made him wonder if it was okay.", "First was a metallic mace called ‘+2 Thorn of Steel’. Crafted by refining a meteorite, it boasted hardness that was ten times that of ordinary steel, and it was enchanted with magic that doubled its attack power when it successfully hit its target.", "‘Chohong should love it.’", "He got it as a gift for Chohong, who was likely to become a High Ranker soon. He could only imagine how giddy she would be.", "He also received a crucifix artifact. Although it wasn’t as good as the Proof of Chastity, it was still an item that money couldn’t buy. He was certain it would be an excellent bait to lure out Maria when he needed her.", "When he was about to leave the palace’s storage room, thinking just these two were enough, Teresa told him to wait before bringing him a black belt. The belt was enchanted with a permanent ‘Pocket’ magic, allowing it to store two bags’ worth of items.", "The one thing that bothered him was how she carefully looked around the area while telling him to hide it on his way out. When he asked if he could really take it, Teresa immediately exclaimed that she didn’t steal it from the royal treasury. As Seol Jihu trusted her wholeheartedly, he took it at ease.", "Finally, she handed him 500 silver coins, saying it was a ‘small expression of gratitude’.", "“Ah~”", "While he was happily looking at the items, he suddenly remembered the bracelet the ghost saintess gave him. He immediately took it out from his pocket.", "‘I wonder what effect it has.’", "Since it was an item from the Empire, it was unlikely to be simple. Seol Jihu activated the Nine Eyes’ color of General Observation and gazed at the golden bracelet.", "Soon….", "“…Hah?”", "His smiling eyes opened wide."]}