{"cid": "60", "title": "Chapter 60. Princess Knight", "content": ["After the discussion with his teammates, Dylan decided to escort Ian to the rendezvous point.", "The Forest of Denial was located on the southernmost border of human territory. It was also an area where the territories of mankind, the Federation, and Parasites overlapped with one another.", "So perhaps unsurprisingly, the rendezvous point lay somewhere in the way back home to Haramark. And quite obviously, they couldn't let Ian return all on his own when he didn't possess a lick of close-quarter combat skills to speak of.", "There was the slight inconvenience having to take a bit of a detour, but regardless, an escort mission was a still mission, just like any other. Since they were promised suitable compensation, the members of Carpe Diem didn't complain much.", "Seol Jihu also decided to accompany them on this trip to escort Ian, precisely because of those reasons.", "While Dylan was negotiating with the two porters, Seol Jihu went to speak to Chohong. She was still in the midst of trying to cool her head, but her crumpled facial expression displayed how incensed she still was. She even intermittently spat out several choice words like 'fuck this', 'bullshit', etc, etc.", "And then, upon sensing Seol Jihu’s gaze on her, she spun her head towards him abruptly and formed a tearful face.", "“You were planning to ask me something again, weren't you?”", "“….”", "“How is it possible for a guy to be this curious about everything??”", "“….Okay, okay. Fine. I will never ask you a question ever again.”", "While feigning a look of dejection, Seol Jihu turned around to leave. But, when he did that….", "“No, waaaait!”", "Chohong hurriedly ran up to him and grabbed his arms.", "“Hey, hey! That's not what I'm trying to say!”", "“No, I know. It's my fault for being so tactless.”", "“Hey, will you just listen till the end?! Whenever you are curious about something, you always ask me! But, compared to me, Dylan is….”", "Chohong was about to point at Dylan, but then, stopped midway. He was still busy with negotiating a new contract with the porters.", "“Well, there’s Master Ian too….”", "Ian had his eyes closed, his expression one of pain and deep contemplation. And then….", "“….”", "After spotting Hugo rolling around on the grass field for fun like the thoughtless idiot he was, Chohong's head slowly dropped to the ground.", "“…Go ahead.”", "“It's fine. It wasn't that important anyway.”", "“Wait, are you sulking right now? A man is sulking like a little girl?!”", "Chohong glared at him in exasperation, but Seol Jihu was smiling to himself.", "'I knew it. She's still a big softie in her heart.'", "Of course, he made sure that the smile would not be noticed by her.", "“Just what is this Arden Fortress?”", "Chohong slowly facepalmed as if she knew he'd ask about that.", "“It's a fortress located in a certain canyon, on the border against the Parasites. It's still under construction, I think.”", "“Why were you so incensed back then, though?”", "“Well, that….”", "Chohong looked a bit troubled, then.", "“Well, it's complicated.”", "“Is it related to the rebellion?”", "“Oh? Where did you hear about that?”", "He just threw that out there hoping, but Chohong's complexion brightened up considerably.", "“Okay, come and take a seat over here.”", "He came to ask her a question, but instead, he ended up getting caught by her. Even before anyone had time to notice it, she was no longer annoyed by his questions anymore. Chohong began unfolding her tale with some relish.", "“Remember what you said earlier? The one about the war between the Federation and the Parasites intensifying?”", "“Yeah.”", "“Okay now. Think about it for a sec. Those two are preoccupied with ripping each other apart, so is there a reason for us to jump in the fray? I mean, we're the weakest of the lot too.”", "“I…. uh, guess so?”", "“Damn right it is! I mean, it's not even enough for us to keep our heads down and shore up our strengths. Yet, we're busy building a fortress in the border, so what would the Parasites take that as?”", "“They would take that as a provocation.”", "Chohong slapped her knee.", "“Exactly! That's why, I'm like, why are they poking a bitch that is minding her own business? When the royals announced this plan, the majority of the High Rankers active in Haramark all objected, but they went ahead with it anyway, saying it's something that must be done or some crap like that!”", "Chohong began to properly explode in dissatisfaction now.", "“They did whatever the fuck they pleased, and now they want our help? Did they really think no one's gonna attack them? Did they expect that hostile-as-hell Parasite Queen to sit quietly and wait until the fortress was finished?! Gimme a freaking break. What a bunch of morons.”", "After Chohong added, “That's why I'm really pissed off. Wouldn't you be, too?”", "Seol Jihu began contemplating quietly. He could understand many parts of her complaints. If he looked at the situation using Kim Hannah's analogy of Paradise being a game, then it would be like the Earthlings being forced to take on a quest they didn’t want to do.", "However, Paradise was without a doubt 'reality'. One had to listen to both sides of the story first. There had to be a reason for the Haramark Royal Family to pursue the construction of the fortress.", "Seol Jihu became curious about how he should think of this princess named Teresa Hussey.", "Chohong had complained to her heart's content, but when Seol Jihu didn't side with her immediately, she began pouting a bit.", "“Well…. I know. As long as we are in Paradise, we have duties to fulfill and all that. But there is a limit to being loyal, you know. They wanna go to war whenever there's a chance. They keep creating troubles for us all the time, and every day they go, 'Do this!' or 'Do that!'. Don't you think it's just too much?”", "Only after Seol Jihu quietly nodded his head did Chohong form a satisfied expression.", "*", "The rendezvous point was where the roads merged into one and led to the canyon. It was about two days' travel away from the Forest of Denial, but the expedition decided to increase their pace after receiving the request to arrive there as soon as possible.", "The expedition marched for the whole day, and when the sun dipped below the horizon, they set up camp for the night. Dylan was quite satisfied with their progress, saying that they should arrive at the rendezvous point tomorrow morning, what with them having covered so much ground today.", "After dinner, Ian asked if Seol Jihu would let him appraise the earring. The youth was curious about its effects too, so he handed it over without saying anything. When Ian told him that the appraisal process might take a bit of time, Seol Jihu chose to take a smoke break and walked to the edge of the camp. He was still feeling a bit restless.", "While he sat on the ground sucking on the cigarette, he suddenly felt a warm air tickle his cheek. Dylan was pushing a teacup at him.", "“Thank you.”", "“Rather than words, it's the physical things that convey your meaning better.”", "Seol Jihu chuckled and pulled out an extra cigarette before handing it over. Dylan lit up and inhaled deeply, a look of rejuvenation forming on his face. He settled down next to the youth.", "“What were you thinking about?”", "“I was just thinking about Samuel and Alex.”", "Seol Jihu answered frankly. Dylan stopped tilting the teacup to his mouth.", "“Oh my gosh. I was wrong again.”", "“?”", "“I thought you were thinking about the war.”", "“Ah, that. Well, that's something I'm bound to experience sooner or later anyway.”", "Seol Jihu smiled weakly and spoke in a dispirited voice.", "“It's just that…. I still can't wrap my head around what happened.”", "“First time seeing someone die?”", "That wasn’t the case. But from Seol Jihu's perspective, both Samuel and Alex were not some random strangers.", "“The life in Paradise is like that. The guy you had a nice chat in the morning would return as a corpse in the evening.”", "“You seem fine, Dylan. Master Ian, too. Same for Chohong, Hugo….”", "“….Hmm.”", "For some reason, Dylan seemed to be at unease, unable to open his mouth. Seol Jihu wondered if he said something he shouldn't have and decided to change the topic.", "“By the way, what will you do when we get there?”", "“Mm? Ah, that. We are thinking of joining the war as long as the royals don't ask for something ridiculous. And, although he hasn't said anything, it looks like Master Ian also wishes for that, too.”", "“Won't Chohong go crazy?”", "“Nope. She may look like that, but she still knows how to separate her duties and her feelings. Of course, I'll have to convince her first, but a chance to have a Magician in your debt isn't easy to come by. It's all worth it.”", "Seol Jihu wasn't sure, but by the look of things, Dylan made his choice in consideration of Ian. Was he trying to buy a Magician's favor? Although Dylan sounded like he was coldly calculating profits and losses here, Seol Jihu wasn't put off by that.", "Once that discussion came to an end, a moment of silence drifted in between the two men. The only sounds to break it was the tea being gulped down, as well as cigarette smoke being puffed out.", "A short while later, Dylan opened his mouth.", "“Seol.”", "“Yes?”", "“I don't know if this is too early for you, but…..”", "It was then – a voice came calling from behind, looking for the youth. It seemed that Ian was done with the appraisal.", "“Oh. Should we go and take a look?”", "Even though he was interrupted, Dylan didn't mind it and stood up from the spot.", "'What was he trying to say to me, I wonder….'", "It didn't sound like he was trying to recruit Seol Jihu; it was as if Dylan had something else in mind. Seol Jihu carried his unsolved curiosity with him and walked back to the tents.", "Inside the tent, the smiling Ian was waiting for the youth's arrival. Meanwhile, both Chohong and Hugo were staring at the earring with their eyes sparkling brightly.", "“Congratulations.”", "As soon as Ian saw Seol Jihu, he congratulated the youth.", "“As expected of the Empire. I still can’t understand how a nation capable of producing such goods was destroyed so easily.”", "Ian chuckled jovially and handed the earring back.", "“The name of this item is 'Festina Earring'. That saintess has gifted you with something truly wonderful.”", "“Is it a good item?”", "“Of course! Now, let's see. First of all, this Festina Earring will become bound to the very first person putting it on.”", "“So, you gotta think about it carefully. The moment you put it on and activate it, the earring will become utterly worthless.”", "When Chohong quickly followed up, Hugo snorted loudly.", "“What is there to even think about? Of course, Seol should use it. That accessory's been designed for Archers and Warriors, anyway.”", "“Now, now. Let's put aside the unnecessary side broadcasts for the time being.”", "Ian cleared his throat and continued on.", "“When you infuse your mana into 'Festina Earring', the 'Boost' function imbued within it will activate. Meaning, it will increase the speed of the person wearing it. According to the result of my appraisal magic, your overall speed should be enhanced by about 1.5 times the normal, and the effect will last for around one minute.”", "“Keuh!!”", "“On top of this, you can use the Boost up to three times. Whenever you activate the effect, it automatically charges back to full again. The time needed for a full charge is around six hours.”", "“Kyah!”", "Seol Jihu remained quiet, but it was Hugo who was making all the sound effects. Ian then spoke with an expression that said, “You will definitely react to what I have to say next.”", "“But, most importantly, both the number of usages, as well as the activation time, can be stacked on top of one another.”", "“Oh.”", "Seol Jihu let out a soft gasp.", "“So, if I use the Boost three times in a row….”", "“Your speed will be boosted by up to 3.375 times, lasting for three minutes. Meaning, you will be maintaining the speed fast enough to clear 100 meters in three, four seconds for three minutes straight!”", "Ian spoke triumphantly, even though the earring didn't even belong to him.", "“As long as the wearer can utilize it properly, he will be able to display fearsome combat prowess.”", "Seol Jihu looked down at the earring in his hand. Crafted out of silver material and shaped like the Star of David, there was an ivory-colored jewel stuck in the middle that scattered gentle light.", "“How much would this go for?”", "“Hey, you!”", "Hugo cried out in alarm. Ian grinned brightly.", "“As much as you want it to be. However, will you really sell it?”", "“Not at all. I mean, I got this during the expedition, so….”", "“That's nonsense.”", "Ian waved his hand around.", "“Both the Proof of Castitas and the Festina Earring are rewards you earned through your independent actions. You won't find any sons of bitches among us who'd even think about taking a share of your achievements.”", "Hugo barked out loudly like a dog. When Ian glared at him as if he was a helpless idiot, Hugo whimpered and quickly backed down.", "“In my personal opinion, it'd be for the best if you used it. That earring is far too valuable to sell.”", "Seol Jihu cautiously equipped the earring. He initially thought that he needed to pierce his ear, but when he brought the earring close to his left earlobe, it just attached itself there like sticky glue.", "“Very good. Now, infuse some of your mana into it.”", "This earring would become his the moment he used it. Although he was momentarily taken by indecision, Seol Jihu quickly made his mind up.", "'….It's not like I'm in need for money, anyway.'", "And so… It happened when he closed his eyes and roused his sleeping mana.", "Pow!", "His hair suddenly danced around, and at the same time….", "“!!”", "A powerful gust of wind swept past him before disappearing in the blink of an eye.", "Seol Jihu quickly scanned his body, utterly mystified. It felt like a certain formless aura had wrapped around him.", "“Would you like to run and see for yourself?”", "Running was Seol Jihu's specialty. So, he began running with everything he had.", "Soon enough, Seol Jihu had run out of the campsite and found himself running on the grassy plains, completely failing to hide his shock.", "'Holy shit.'", "He could definitely feel the difference once he started running with all his might. When he sneaked a glance behind him, he spotted the campsite rapidly getting further away. He even thought that this couldn't have been his own body.", "'I can stack the effect, right?'", "While circling around the plains, he roused his mana once more.", "POW!", "Seol Jihu freaked out at the sudden feeling of his entire being entering a strange state. The surrounding objects brushed past him in a streak of a blur. The headwinds felt sharp enough to slice his flesh. His chaotic thought process was cleared up in an instant and indeed, it felt like he had entered a brand new world.", "Ian was right. Depending on how it was used, this earring would exhibit truly unimaginable effects, be that in the middle of battles, while trying to rush forward, or even when running away. If he could control it properly, then it'd be the same thing as holding an absurdly powerful weapon.", "He gradually got closer to the campsite. Seol Jihu thought that now would be a good time to slow down, so that's what he did. No, that's what he tried to do.", "“Uh…? Uh, uh, uhhhh?!”", "His legs didn't want to listen. As if he was a circus performer, his legs got all tangled up, and eventually, he couldn't win against the inertia and his limbs began performing a bizarre dance routine.", "“Euh?! U-uwaaah?!”", "Tumble!! Crash! Smash!!", "In the end, as soon as entering the campsite, Seol Jihu fell hard and tumbled on the ground. He rolled forward for a long time before finally coming to a stop.", "“Argh, ouch, ouch, ouuuch…”", "Chohong and Hugo were watching on dazedly until then, but they exploded in a fit of laughter and nearly toppled over. Even Dylan and Ian were laughing out loud as well.", "As the night deepened, the campsite was coming alive with the sounds of laughter.", "*", "Next morning.", "The expedition arrived at the rendezvous point even before the sun reached its halfway mark in the sky. Ian contacted the royal family and then, conveyed the message to the rest of the team that the army should be arriving soon. Seol Jihu suppressed his pounding heart and scanned his surroundings.", "The surrounding topography wasn't that interesting to look at. The road to the canyon itself was rather rugged, though. Boulders could sparsely be seen here and there, but their numbers gradually increased the further his sight shifted towards north-east. Even further away, one could see an imposing mountain range, well beyond the boulders the size of houses.", "'So, we’re going into that mountain range, huh….'", "No, going there hadn't been decided yet. Although he had half a mind to return home immediately, but…. Surely, his 'Nine Eyes' would help him choose the right option.", "“This must be your first time meeting a royalty.”", "Perhaps finding all that waiting around boring, Ian initiated a conversation. Seol Jihu nodded his head while fidgeting with the Festina Earring.", "“Hmm. Not sure what you're thinking of here, but it'll be better to lower your expectations.”", "“?”", "“Even if one's a royalty, you're still a human being, no? There's no need to be tense.”", "“Are you implying that the royals have lost their power?”", "Ian smiled brightly. If he were to ask the very same question to either Chohong or Hugo, they would just form an expression that said, “What are you talking about?” But, this young man in front of his eyes seemed to make his reply always after giving it some thought first.", "“What comes to your mind when you think of Haramark?”", "“Uhm…. A castle? A city?”", "“Indeed. Most of the Earthlings would answer in a similar fashion.”", "Ian spat out a sigh.", "“Rather than as an actual kingdom, everyone now sees Haramark as just another city. The extent of the current Haramark Royal Family's influence is only around their current address. That's about it.”", "“The side effects of the rebellion must've been great.”", "“Indeed, you'd be a fool to deny that. However, after the rebellion itself, the king of Haramark willingly cast away the authority of the ruler.”", "“The king…. did that?”", "“He didn't have much of a choice. He learned that neither the king's authority or the forceful approach worked with us, the Earthlings. He had no choice but to change his stance. In order to survive, that is.”", "The mention of one trying to survive sounded a bit desperate.", "Seol Jihu had been quietly mulling over what Ian said, before opening his mouth.", "“What kind of a person is the princess, the one coming here?”", "“Teresa Hussey. She's one hell of a woman.”", "Ian grinned deeply. His eyes lit up warmly like a grandfather proudly boasting about his own granddaughter.", "“She grew up watching the invasion of foreign races. Well, she's a rather special case among the Paradisians.”", "“Special? How?”", "“The Paradise System we know and use is actually the providence bestowed onto the Earthlings only. However, she is one of the very few original residents who has been blessed with the same providence.”", "That was his first time hearing about such a thing.", "“So, that's how it was. Paradisians can also….”", "“From what I hear, they invoked something called the 'Royal Family's Promise' and received the providence in return. I understand where she's coming from, though. As a woman in this world, you'd need great power if you wanted to safeguard your remaining family, especially when there are only two of you left.”", "“What's the level of Princess Teresa Hussey?”", "“Hoh? Now that I take another look at you, I see that you're quite interested in that lady!”", "Ian suddenly formed a lewd expression and then, lightly poked Seol Jihu on the side.", "“Very good! Of course, I'll tell you! First of all, she's 32D around her chest, and her waistline is like…..”", "“….Master Ian.”", "“Haha, I’m kidding. Just kidding! She's also a High Ranker. Level 5 Princess Knight.”", "Princess Knight? Seol Jihu tilted his head after hearing a term he had never heard of before.", "“Yes, the name of her class is kind of funny. However, do not be mistaken. You need to discard the preconceived notion of princess knights being held hostage by the orcs.”", "“Looks like they are here.”", "Just before Seol Jihu could ask for the clarification from Ian, Dylan opened his mouth first.", "The youth reflexively shifted his gaze to look, and his sight caught onto something running towards the group while kicking up a mighty dust storm from afar."]}