{"cid": "272", "title": "Chapter 272. The Savior of Eva (1)", "content": ["Seol Jihu blinked stupidly for a long time before he heard Roselle’s explanation and finally understood the situation.", "But that did not mean he was feeling any less disconcerted.", "“A Magician? The queen is?”", "“Yes! She has the aptitude to become a powerful Magician! Purely in terms of talent, she is overflowing with it.”", "Seol Jihu’s face flickered with doubt. The Charlotte Aria, known for being a sucker and a fool, had the aptitude to become a Magician which only the extreme minority of Earthlings could become?", "It was somewhat hard to believe.", "“It looks like you have a minor misunderstanding.”", "Roselle smiled brightly.", "“Being talented does not mean being smart or intelligent. It also has nothing to do with how they normally act.”", "Seol Jihu flinched, his inner thoughts having been read, but he accepted it quickly. He remembered that Roselle had the ability to read other people’s thoughts.", "“Talent refers to the natural aptitude and ability needed to accomplish a certain task. Substituting this definition directly, the aptitude and ability needed to become a Magician is simply mana.”", "Seol Jihu nodded his head without realizing it. Thinking about it now, even for Earthlings, the first condition necessary to become a Magician was mana level.", "“Mana, by nature, is largely innate. Of course, there are exceptions, and I certainly don’t mean to ridicule the hard-working people who built up their foundation over their lifetime. It’s just that bloodline plays a huge role in determining one’s mana.”", "Meaning, Charlotte Aria was a natural talent.", "In truth, Seol Jihu was somewhat similar. Although his innately high mana did not have anything to do with his bloodline, he had been subconsciously training his mana from a very young age due to the Nine Eyes that he was born with. He would definitely be one of the exceptions Roselle mentioned.", "Seol Jihu smacked his lips.", "“I’m still not sure I get it. I understand that she has talent… but if her mana is so great, then why wasn’t she trained from a young age?”", "“Your question stems from your lack of knowledge about Paradise.”", "Roselle replied firmly.", "“Paradise is a strictly patriarchal society. Even for a woman of high social standing, the only difference is how they are used, and their fundamental societal expectation does not change. Even the youngest daughter of a royal family will only be raised as a political tool to be used for the nation’s benefit.”", "“….”", "“When they grow up, they will most certainly be sold off. Naturally, royal families do not want their hostages to know magic.”", "“What do you mean?”", "“Political marriages are simply an exchange of collaterals. The daughters-in-law should be obedient and not cause any trouble. So what would the royal or noble families think if their hostages had a mysterious power like magic? They would be anxious, especially if that hostage comes from the Aria family.”", "Seol Jihu was lost for words. He felt like Roselle was indirectly telling him, ‘Don’t make any conclusions on your own.’", "“Well… I’m a rather special case.”", "Roselle smiled bitterly.", "“And that’s not all. You have to think about the circumstances that child has been under. Didn’t you hear that the war against the Parasites broke out before she even became aware of her position?”", "Roselle persuaded Seol Jihu enthusiastically as if she did not want to miss this opportunity.", "‘She’s right.’", "According to the report, the Parasites had invaded when she was only four, and she was on the run when she was eight.", "Seol Jihu nodded his head with difficulty. With the Dreaming Witch, who single-handedly drove the Empire into an unprecedented crisis, assuring him to this degree, Seol Jihu really could not deny it.", "In regards to the discipline known as magic, he had no reason to doubt Roselle La Grazia’s knowledge and prestige.", "“I understand. I must have subconsciously set the standard too high because I thought I needed to search for a Magician capable of inheriting the Eternal Light of Wisdom.”", "“Ah, you have a point.”", "Roselle smiled happily as Seol Jihu subtly praised the accomplishment she made in her later years.", "“But don’t worry! An excellent master has no deficient disciples!”", "Roselle praised herself before stealthily glancing at Seol Jihu.", "“But since there is a chance that she might not be the most suitable candidate… I would greatly appreciate it if you could introduce a few more talented children…”", "Seol Jihu narrowed his eyes. He thought just finding one potential inheritor would be enough.", "[Of course, I would be elated if he or she had a natural talent, but I would really love for this person to be hard-working and constantly striving to study this discipline.]", "Wasn’t that what she said?", "“Eii, when I said that, the standard of talent was naturally me.”", "Roselle thumped Seol Jihu’s chest with her tiny fist before spreading her lacking chest out.", "“Being taught one thing and being enlightened on ten things, then using those ten things as a foundation to devise hundreds, thousands, or even millions of creations and changes. Such a talent might not exist even in a thousand years, so it would be unrealistic of me to ask you to introduce me to someone like that.”", "Seol Jihu felt a little bitter, though Roselle continued speaking like the flowing water.", "“I never meant, ‘It’s fine even if that person isn’t talented!’ It would be great if they’re both hard-working and talented. It really would, fufu.”", "Laughing somewhat mischievously, Roselle gave a flashing glance.", "“But it’s not like I’m doing this just for myself. It’s a win-win for both of us. You won’t be losing anything by bringing more candidates.”", "Seol Jihu tilted his head curiously. Roselle put her right hand over her heart and spread her left hand out before continuing grandly.", "“I don’t want to sound like I’m constantly praising myself, but this dream world I manifested through great effort is the best environment to research the discipline of sorcery. You can create whatever you imagine, so even a complete beginner can train easily and have fun at the same time.”", "“Ah.”", "It was then that Seol Jihu realized what a great fortune he was holding on to.", "No, he already knew. It was just that he had not thought it would be this great.", "“You’re right. Okay, I can try talking to the queen.”", "“No, it’s fine.”", "Roselle shook her head.", "“I appreciate your offer, but I only requested Seol Jihu-nim to find potential candidates. Persuading them is my job. I would not dare to burden you any more than this.”", "Seol Jihu nodded. Since Roselle said she would take care of the matter by herself, he had no reason to interfere.", "“Got it. Then what should I do for you?”", "Seol Jihu asked while fiddling with his pendant. Roselle smiled like a mischievous child.", "“It’s nothing difficult.”", "She neared Seol Jihu’s ear and whispered in a quiet voice.", "*", "Chak. The moment Roselle clapped her hands, Seol Jihu’s eyes shot open. He raised his upper body, finding himself in a familiar place.", "“Ppi!?”", "An almost uncomfortably large bed and an equally large room that made him feel isolated.", "“Pyak! Pyak!”", "As he was lost in a daze, a loud chirp woke him up. Seol Jihu looked down only to see a furious little chick.", "The way it flapped its little wings with its tiny bean-sized eyes wide open, it almost looked like it was protesting begrudgingly. This was because it was sleeping soundly on Seol Jihu’s forehead before he suddenly shot up and caused the chick to fall.", "“S-Sorry.”", "“Piaaaaa!”", "Seol Jihu apologized, but Little Chick's anger didn’t show any sign of calming down.", "“If you keep screaming, you’re going to get hoarse, little guy.”", "Not even a month has passed since it was born, so what was it screaming so loudly for? Seol Jihu grumbled inwardly.", "“Alright, alright, I’ll place you back on my head. Happy?”", "For some reason, Little Chick liked the top of Seol Jihu’s head the most. Once Seol Jihu grabbed the little fuzzball and placed it on his head, the crying died down immediately.", "“Ppi….”", "Judging by the way it wiggled and moaned, it seemed to be satisfied.", "‘This isn’t the time for this.’", "Now that he was fully awake, Seol Jihu hopped off the bed and left his room, then cut through the hallway quickly.", "The plan he made last night with Kim Hannah was created under the assumption that Charlotte Aria would be useless. Since this was no longer the case, the plan obviously had to change.", "Even if he still followed the plan, he had to at least let her know what happened. Seol Jihu knocked twice out of courtesy before opening the door.", "Seeing Kim Hannah sound asleep, he thumped the bed violently.", "“Kim Hannah! Kim Hannah!”", "Thumping the mattress again and again, he urged her to wake up.", "“!?”", "Struck by an earthquake in the middle of the night, Kim Hannah floundered like an octopus, scared out of her senses. After shooting up and seeing Seol Jihu drumming away at the bed with a little fuzzball sitting on his head, she spaced out for a moment before…", "“Are you crazy!?”", "…screaming aloud.", "“Hey! Do you know the time!? Entering an unmarried maiden’s room! You finally lost your…!”", "She must have been greatly startled as she couldn’t even form complete sentences.", "“I have something to tell you.”", "However, Seol Jihu’s face was completely serious. Kim Hannah’s expression relaxed, albeit only a little.", "“…Is it urgent?”", "“I don’t know if it’s urgent, but I figured I should tell you before noon.”", "Kim Hannah raised an eyebrow. She knew that ‘noon’ was referring to the time they were visiting the royal palace. That was when they would meet the queen for lunch.", "“Say it.”", "Kim Hannah fixed her posture.", "“Kim Hannah, it would be great if someone with an established position in Paradise awakened as a Magician and became a reliable ally, right? Someone like Princess Teresa, I mean.”", "It was a truly abrupt question. Kim Hannah blinked quickly before dropping her head.", "“Jihu…”", "“Yeah?”", "“I was wondering what was so urgent… Didn’t I tell you before? That Magicians are like the stars in the night sky.”", "She continued with a deep sigh.", "“In Paradise, the Magician class is kind of like a free pass. Do you remember the organization registration process? If Carpe Diem had a Magician, we wouldn’t have needed to prepare so many things. Without a huge disqualifying reason, any city would have given the OK. Why? Because we would have a Magician.”", "Kim Hannah looked up helplessly.", "“You’re right, having a Magician like that would be greatly appreciated. But recruiting a Magician is like plucking the stars out of the sky.”", "“No, that’s not what I meant.”", "Sensing a small misunderstanding, Seol Jihu quickly explained.", "“What?”", "After his brief explanation ended, Kim Hannah’s tone went up instantly.", "“Fuck, what the hell does that mean? That stupid brat has the talent to become a Magician?”", "“You can’t believe it either, right? I was the same. I was going to say no, but Lady Roselle kept emphasizing that she’s positive.”", "Seol Jihu tapped his pendant and spoke.", "[Mueeeeee…]", "And a sleepy voice flowed out.", "[Don’t hit me… don’t hurt me….]", "“Ah, sorry.”", "After apologizing to the sleeptalking Flone, Seol Jihu stared at Kim Hannah, whose expression had distorted heavily.", "Her mind was spinning from everything she had to consider now. In Paradise, the value of a Magician did not need to be said.", "But this matter wasn’t about an already precious Magician, but a totally new class called Sorcerer? This Sorcerer could potentially be the queen of a city and a reliable partner? And this queen wasn’t meticulous like Teresa Hussey, but a complete pushover who threw herself at anyone who was kind to her?", "If Seol Jihu was telling the truth, coming to Eva wouldn’t have just been the best choice, but also the greatest.", "Comparing this situation to a game of Poker, it was like cold-calling a four-bet with a subpar pocket pair and ending up with quads!", "It was just too good to be true, even making her doubtful.", "But it was unlikely that Seol Jihu had come all this way in the middle of the night to spout some nonsense. No matter how mischievous Seol Jihu was, he would not be this far-removed.", "In the end, Kim Hannah could only say with suspicion.", "“Explain in more detail.”", "*", "Jung Sua went to the palace as soon as the morning dawned. This wasn’t a big deal since the palace was like a second home to her ever since she got close to Charlotte Aria. However, she had a separate purpose today.", "She received news that the queen would have a meeting today with Valhalla’s representative.", "As she met up with the queen and had breakfast, she naturally brought up the topic.", "“Don’t worry too much.”", "Charlotte Aria tilted her chin solemnly while biting down on a fork.", "“I will meet him today and talk to him personally.”", "Jung Sua raised an eyebrow. The queen’s manner of speech had changed. Normally, she spoke like she would take her side and fight for her, but her tone had softened greatly. It really sounded like she would only talk to Seol Jihu.", "“He was a better man than I thought. Err, I liked him. I’m sure he will listen to my request.”", "‘Request…’ Jung Sua narrowed her eyes.", "“Have you met him?”", "Charlotte Aria widened her eyes.", "“Why? Is there a reason I can’t?”", "“No, that is not what I meant.”", "Jung Sua immediately fixed her expression and put on a bright smile. She moved her frozen arms and spoke as if it wasn’t a big deal.", "“I was just worried.”", "“You’re worrying about nothing. Did I not tell you? Valhalla’s representative is different than those thugs.”", "“….”", "“He was righteous for an Earthling. Teresa Unni was right.”", "Jung Sua’s hand, which was gripping a spoon, tightened. With what Charlotte Aria just said, she was convinced. She figured out the reason as well.", "‘Teresa Hussey.’", "To think she would interfere in the matter of another royal family.", "‘This isn’t good.’", "Jung Sua sensed the unfavorable flow of air and said.", "“Your Majesty.”", "“Hmm?”", "“Do you mind if I also participate in today’s meeting?”", "“I don’t really mind… but it’s fine even if you don’t come. Won’t you be uncomfortable?”", "“For me, putting all this burden on you is more uncomfortable. I’m fine, so please let me participate as well.”", "Although Jung Sua made it sound like she wanted to help the queen, she sounded somewhat forceful. It was almost like she was saying, ‘You’re really not going to listen to me when I’m going this far?’", "But the moment Charlotte Aria thought this, she was surprised at herself. Never in her wildest imaginations did she think she would view Jung Sua in this manner.", "Not once did she have negative thoughts about her no matter how many times Sorg Kühne and Teresa Hussey tried to convince her.", "“To be honest, I’m curious.”", "Seeing that Charlotte Aria was silent, Jung Sua added eloquently.", "“Valhalla’s representative for one, but I’m mainly curious about the Earthling called Miss Foxy.”", "“Miss Foxy?”", "“Yes, her real name is Kim Hannah. She used to be a member of Sinyoung but moved to Valhalla recently. She is a famous scammer who is known as a crafty vixen, so I’d like to try meeting her.”", "“R-Right, I see. Okay.”", "Charlotte Aria unwittingly agreed to Jung Sua’s request. Following which, an odd silence flowed in the air.", "After a moment of silence, Charlotte Aria, who was nibbling on her poor fork, carefully spoke up.", "“Um…”", "“Yes, Your Majesty?”", "“It’s about the city.”", "Jung Sua’s eyes turned into circles. She was surprised that the queen was bringing up government affairs on her own.", "Charlotte Aria quickly continued.", "“Sorg Kühne said that the public is impoverished and needs urgent help to sustain their livelihood….”", "“Ah, you were nagged at again.”", "Jung Sua made a sympathetic expression.", "“The royal administrator sure is mean. Doesn’t he know that Your Majesty already has it rough?”", "She was used to hearing the queen’s complaints. As far as she was concerned, all she needed to do was act empathetic and console her a bit.", "“That’s right, he said a bunch of things to me again.”", "Charlotte Aria played along.", "“He said that the public is in distress, openly cursing the royal family for their lack of support. Then, he asked how long I was going to just sit by and do nothing…”", "“Oh my, he went a bit too far this time.”", "Jung Sua put on a regretful face.", "“Your Majesty, like I have said time and time again, it is not your fault that things have become like this. It is the Parasites’ fault. Aren’t you a victim as well, my queen?”", "“R-Right.”", "“How can the victim be criticized? The public is not dumb. They resent and fear the Parasites. Why would they hate Your Majesty?”", "“But the royal administrator said…”", "“Of course, it’s true that they’re impoverished and that their living conditions are worse than before, but that can’t be helped. All cities are like that from the long, drawn-out war. Compared to them, Eva is in a much better situation.”", "Normally, Charlotte Aria would have breathed a sigh of relief and said, ‘I see. I thought so.’", "But after seeing and hearing for herself, her thoughts had changed. No matter how hard she tried to shake it off, the residents’ words and the conversation between the two Priests lingered in her mind.", "Moreover, the shock she received when she saw the alleyway was etched deep in her conscience.", "That shock gave birth to suspicion, and so she asked.", "“Are you saying that the royal administrator lied?”", "Jung Sua laughed.", "“It’s a lie if you want to call it that. He probably exaggerated a little to get Your Majesty’s approval.”", "Charlotte Aria’s complexion darkened slightly, but Jung Sua continued without minding it too much.", "“Don’t think badly of him. He might be a little old-fashioned, but not many people are as considerate of their country as Administrator Kühne.”", "Jung Sua was saying this, knowing how long Sorg Kühne had counseled Charlotte Aria.", "The young, delicate queen in front of her only pleaded for someone to sympathize with her. She did not know how to harden her heart and be vicious.", "If Jung Sua told her to chase the old advisor out, Charlotte Aria might be burdened by the idea, so Jung Sua was managing her distance with Sorg Kühne in this manner.", "Of course, she did not forget to add, “But only thinking about the public is unfair. It would be great if he thought about Your Majesty’s feelings as well.”", "Seeing Jung Sua smile faintly, Charlotte Aria meekly nodded her head.", "Once breakfast was over, Jung Sua left the grand hall. She heard that Valhalla’s representative would arrive at noon, so she decided to come back then.", "As she left the palace, her complexion wasn’t so bright. She was an Earthling who climbed to her current position through nothing but politics.", "As much as she was skilled in noticing and guessing someone’s emotions, she was well aware that the queen’s attitude was different than usual", "‘So annoying.’", "In truth, the best outcome for Jung Sua was to have this incident buried into non-existence.", "Although the queen assured her not to worry, she should not have acted of her own accord. But for whatever reason, she seemed to have actually gone out on her own.", "With the queen doing something out of the ordinary, a sense of unease crept up on Jung Sua. While she wasn’t particularly worried, she kept thinking about it as if a small fishbone was stuck in her throat.", "‘Miss Foxy, huh.’", "The recent incident must be Kim Hannah’s doing. Although Valhalla’s representative was Seol Jihu, she should hold the position of the control tower.", "There was no room for doubt. Unlike when they were one-sidedly beaten up in Haramark, they were handling the public opinion flawlessly.", "Jung Sua shook her head strongly in the middle of walking.", "‘I guess I have no choice.’", "Rather than leaving things to play out on their own and have the matter potentially become too big for her to handle, settling the matter with her own hands seemed to be the best choice.", "This was the primary reason that she asked to participate in today’s meeting.", "At the end of the day, all Earthlings were the same.", "They must be driving her into a corner because they regarded her as a remnant force of the Alliance. Once she properly explained the relationship between Evangeline and the Alliance and then promised to completely hand off the benefits the Alliance had, it was likely that they would start singing a different tune.", "‘It’s not difficult.’", "The only work would be replacing the Eva Alliance with the Triads and Valhalla.", "It was fine even if they did not accept her offer. Jung Sua had the confidence to hold on tenaciously until her opponents backed down from exhaustion.", "Although Charlotte Aria changed a little, she still trusted her. As long as the queen’s protection was with her, she was confident that not even Sinyoung would be able to touch a hair on her body.", "*", "“What are you doing?”", "“Hmm?”", "“Why are you rubbing your pendant on that hairpin?”", "“Ah.”", "Hearing Kim Hannah’s question, Seol Jihu stopped rubbing his pendant on a hairpin and spoke.", "“Have you heard of the infection?”", "“?”", "“The infection of dreams. I didn’t know how she summoned me into her dream, but I found out she put a little bit of her mana in this.”", "Seol Jihu raised the pendant, and Kim Hannah’s eyebrows went up.", "“Wait, then am I also—”", "“No.”", "Seol Jihu smiled flatly.", "“Don’t think of it as a curse, but a means of communication. It’s the medium that connects Lady Roselle’s dream world to me.”", "“Isn’t it affecting me as well?”", "“No, I asked her, and she said she put a restriction so that it only responds to my mana. So don’t worry.”", "Seol Jihu spoke as if it wasn’t a big deal.", "Kim Hannah wanted to ask, ‘Is that possible?’ But she held her tongue. From what she was told, this Roselle woman was a witch who devoted herself to sorcery for hundreds of years.", "She was not even a Magician herself, so she did not dare to judge someone who had achieved great mastery in this field.", "“So you’re going to gift the queen that hairpin and introduce them to each other.”", "“Yep. Of course, I’d have to give a proper explanation too.”", "Kim Hannah rested her chin on her hand with a look of disbelief.", "“I still can’t believe that bratty queen is a Magician…”", "“She’s not yet. We’ll have to see.”", "Having the aptitude to become a Magician was different than being one. Like the saying, a great talent is useless without the will to improve, the question was whether Charlotte Aria had the desire to research the discipline of sorcery.", "Just to be safe, Seol Jihu rubbed the pendant on every nook and cranny of the hairpin.", "“Anyway, I don’t know if the plan will work.”", "“It will.”", "Kim Hannah said clearly.", "“How can you be so sure?”", "“Because I planned it.”", "It was truly a Kim Hannah-like answer.", "“I’m kidding. The real answer is that it’s really not difficult to ruin a relationship. All you need to do is find out the background and situation that created the trust between them and destroy it.”", "“I guess you’re right.”", "Seol Jihu had read the report several times, so he quickly understood what Kim Hannah meant.", "Early this morning, Kim Hannah had changed the plan after much consideration.", "Their original plan was meant to be carried out over a long period of time. They planned to make Charlotte Aria doubt Jung Sua increasingly while making Seol Jihu approach her like an older brother so that he would remind her of Campbell Aria, slowly gaining her trust and reliance.", "But the queen was no longer a simple puppet. They now had something to expect out of her.", "Jung Sua wasn’t the problem. Once Charlotte Aria became humanity’s sole Sorcerer, there was a high probability that other organizations would see her potential and approach her.", "So it was much cleaner for Valhalla to establish its position before things got complicated.", "To put it bluntly, they could even try to strike up a deal with Jung Sua once she was driven to the corner.", "Of course, they could also delay Charlotte Aria’s meeting with Roselle, but they had to consider the time she needed to grow and develop.", "‘It will be worth it even if we have to take the second-best option.’", "Seol Jihu had no reason to reject the new plan of striking immediately.", "He already had a long way to go. He didn’t have any time to waste on a worthless Earthling who was too much into a stupid role-playing act.", "After organizing his thoughts, Seol Jihu put the pendant back around his neck.", "“Are you ready?”", "At this moment, a voice rang out.", "“Ah, I just finished.”", "“No, not that.”", "The corner of Kim Hannah’s mouth curled out.", "“I’m asking if you’re ready to ascend to the position of King.”", "Seol Jihu paused in the middle of putting the hairpin in his pocket.", "‘King, huh.’", "Soon, Seol Jihu would become King.", "It meant he would have the authority to control every Earthling inside the city of Eva. In terms of political position, he would be on the same level as Taciana Cinzia.", "He would become a publicly acknowledged titan who could exercise an immense influence over the world of Paradise.", "Who would have thought he would develop to this extent when he first entered Paradise?", "“…I’m not sure.”", "Seol Jihu shrugged his shoulders.", "“Let’s go.”", "Kim Hannah chortled before getting up.", "“Don’t be too nervous. You just have to set the scene. No, you just have to mention the topic. Sorg Kühne will take care of the rest.”", "“Got it. Don’t worry.”", "Seol Jihu chuckled before matching his steps with Kim Hannah’s.", "The scam couple was setting off.", "*", "After arriving at the palace, Seol Jihu and Kim Hannah entered the grand hall with Sorg Kühne guiding the way.", "Charlotte Aria was sitting on the throne waiting for them.", "Although this was their first official meeting, because they had met her before, they did not feel anything special.", "Compared to their first meeting, there were only two differences — the fact that they had to act with proper decorum unlike in Haramark, and the fact that a woman who was presumably Jung Sua was standing next to the queen.", "As these were nothing to be surprised about, Seol Jihu focused on playing his role.", "He got on one knee and made sure to put on a surprised face when the queen said, “Raise your head.”", "But in the next moment, Seol Jihu really became speechless.", "“Fufu, you have an interesting expression.”", "As if she took a liking to his reaction, Charlotte Aria smiled with satisfaction.", "“I could not hold back my curiosity because of the stories I heard about you countless times. Don’t think badly of me.”", "It wasn’t because of whatever the heck Charlotte Aria was babbling on about.", "Seol Jihu was shocked because he activated his Innate Ability the moment he raised his head.", "Charlotte Aria’s color was blue — Choice of Destiny.", "The holographic vision playing out in a window in front of him was just as he expected. As he indirectly found out from the vision Yun Seohui showed, she was suffering all kinds of humiliating acts by the Parasites.", "The Federation and mankind had fallen, and Charlotte Aria was being reared like livestock. This was the future destination that her current self was walking toward.", "That wasn’t all. The general information of Charlotte Aria that the Nine Eyes showed him surpassed his wildest imaginations.", "[Charlotte Aria’s Status Window]", "[1. General Information]Sex/Age: Female/22Height/Weight: 154.6cm/45.1kgCurrent Condition: Healthy", "[2. Traits]1. Temperament—Misfortune Paraphilia (Feeling sorrow by self-torment and then feeling joy by relying on others or gaining their sympathy)—Indecisive (Irresolute and unable to make an independent decision)—Infantile (Mentally immature and instinctively acting like a young child)2. Aptitude—Prodigy (A rare talent that is rarely seen in the world)—Concentration (The ability to focus on one’s surroundings or inner-self)", "[5. Level of Cognition]Pushover (A sucker who is easy to manipulate) / Nervous / Lethargic (Sluggish and apathetic; not having the energy to do anything)", "‘It’s like I thought…’", "There were more than a few things he found interesting. The level of cognition was one thing, but her temperament was almost funny.", "With a status like this, it was easy to determine that she was suffering from a severe mental illness.", "‘Can she really do it…?’", "Although such a thought crossed his mind—", "“Were you that surprised?”", "He snapped out of his daze.", "It wasn’t a question of whether she could. She had to do it.", "At the very least, he had to give it a try. Although people said, a leopard can’t change its spots, Seol Jihu didn’t think so.", "He believed people could change. Because otherwise, he would be denying his own existence.", "Moreover, if there was one thing he learned during the previous incident and the conversation with Roselle, it was that violence was not the solution to everything.", "Although it was often the easiest and most convenient of all solutions, it did not always bring about the best results.", "In other words, rather than deciding on his own and forcefully trying to balance her, trying to guide her to engineer a self-guided internal change might bring about a better result.", "Of course, the difficulty lied in distinguishing which solution was the best for a given situation.", "Seol Jihu certainly had his own standardized method in making his judgments — the Golden Commandment.", "But Charlotte Aria was a talent guaranteed by the Dreaming Witch, Roselle La Grazia, and his Nine Eyes were also telling him that she was a prodigy. Although she wasn’t a one-in-a-thousand-year genius, she certainly had a rare gift.", "So just this once, he decided to stray from the Golden Rule and believe purely in her ‘potential’.", "Whether he was making an excellent choice or an embarrassing loss was something only a ‘god’ would know.", "“…Excuse me.”", "Seol Jihu smiled.", "“I was surprised that this was not our first meeting, but more than anything, I must have lost my train of thought at Your Majesty’s beauty.”", "He spoke gently.", "“Do forgive this one for being entranced by the queen’s majesty and being silent for so long.”", "Then, he bowed respectfully.", "“H-Hmm?”", "Charlotte Aria flinched. She was acting calm on the outside but was feeling quite nervous internally. But after hearing something so unexpected, she blinked rapidly.", "“What are you saying all of a sudden…”", "Charlotte Aria shrunk back slightly before rubbing her nose.", "“H-How insolent!”", "And…", "[Huhu.]", "Gula, who was quietly watching this scene, smiled.", "Just now, yet another future had opened up."]}