{"cid": "120", "title": "Chapter 120. Result of Stage 1 (3)", "content": ["“What are they doing? They’re going up the stairs?” Snake Eyes’ voice went up. But unlike Archers, Warriors and Priests could not see the situation clearly. The scene only appeared as a speck of light.", "“Four people… Hm? They’re fighting a monster?”", "New information continued to pour in. What was going on? Was this Stage 2?", "While Seol Jihu was postulating several hypotheses, he caught sight of Straight Face, who was looking down silently.", "“There are stairs here as well.”", "Just as she said, the platform they were riding on also had stairs going up the mountain.", "‘It’s long.’", "Seeing the stairs stretch all the way to the foot of the mountain, Seol Jihu’s jaw dropped.", "‘Pillars?’", "One thing that caught his attention was the pillars. There were flat platforms periodically throughout the staircase, and each platform had a single pillar standing on it.", "“You,” Straight Face turned back. “You said four people were climbing up the stairs, right?”", "“Yeah.”", "“Where? Describe it relative to the mountain.”", "“About the middle.”", "“Do you see anyone else?”", "“Hold on.” Snake Eyes looked around. Then, she fixedly stared in the direction Lara was looking at, and frowned.", "“…You saw it?”", "“I, I did.”", "“It appeared suddenly, right?”", "“Y-Yes.” Lara nodded her head crazily.", "“It appeared suddenly? What’s ‘It’?”", "When Straight Face asked, Snake Eyes muttered back, “There’s only two over there… Fuck, what’s going on?”", "“Just describe exactly what you’re seeing.”", "Snake Eyes grit her teeth in bewilderment. “Over there. They only have two people. They’re near the foot of the mountain, but while they were climbing up, a monster suddenly popped out of nowhere. I’m not kidding. It really appeared out of thin air.”", "“How did the two react?”", "“They’re fighting.” Lara replied while still watching the far off mountain in a daze. Straight Face dropped her head in response. Seol Jihu also fell into deep thought.", "First, it was probably correct to assume that both the group of four and the group of two were participants of the Banquet.", "“…Maybe,” Straight Face spoke up. “This mountain is Stage 1.”", "“What do you mean? Didn’t Stage 1 end?”", "“The labyrinth might have been a sample, while this is the real thing.”", "“Wait, wait!” Snake Eyes pressed her temple as though her head was hurting. “I’m not following what you’re saying.”", "“You can’t understand even after looking at them yourself?”", "“Shut up. So… you’re saying that those idiots left the labyrinth before us and are continuing Stage 1?”", "“Exactly. It looks like they have to climb the stairs to the top. While killing the monsters that pop out, of course.”", "Straight Face’s analysis caused Snake Eyes to frown. “Fine. Let’s assume you’re right. Then why are we riding this?”", "Just as Snake Eyes said, they were comfortably climbing the mountain with a moving platform, while participants in other mountains were climbing the stairs and fighting for their lives.", "Straight Face revealed her teeth with a grin. “Who knows? If my conjecture is correct, we shouldn’t go all the way up to the peak of the mountain either.”", "“Why?”", "“We are passing through the sixth pillar right now. We should be stopping at the seventh pillar.” Straight Face leisurely looked around at the other party members and then pointed her finger at the pillar they just passed.", "Seol Jihu nodded his head in agreement. Having heard her conjecture, he guessed how the Golden Commandment came back.", "‘It’s not special treatment.’", "Most likely, every group had left the labyrinth through the moving platform at the center. Because, that was the correct way of leaving the building. But not every group would have stopped at the same spot. The more people a group had when leaving the labyrinth, the closer to the top the platform would travel.", "The pillars were there to serve as checkpoints.", "What would have happened if Seol Jihu left with just Maria?", "‘We would have been dropped off at the second pillar….’", "And forced to climb the stairs just as painfully as the others.", "Seol Jihu glanced at the white-headband girl. She was making a suggestive smile.", "“It’s a bit of a shame but… it shouldn’t take long to reach the peak from the seventh pillar.”", "Straight Face stretched her neck side-to-side and prepared to hop off the platform. However, her estimate was not entirely correct. Contrary to their expectations, the platform they were riding on passed through the seventh pillar as well.", "When Seol Jihu stared at her for an explanation, she scowled and burst out, “What? What are you looking at?”", "“It’s not our fault that that person died.” A hollow voice rang out. When the quiet girl opened her mouth, the nearby gazes naturally fell on her. “He was nearly dead when he entered. We couldn’t heal him either… so it seems the Banquet didn’t count him in.”", "The girl’s suggestion made Lara exclaim in disbelief, “No way, that means this place knows all about our situation!”", "The feeble girl shrugged as if to say that was outside of her understanding. Snake Eyes muttered in response, “You can talk? I for sure thought you were mute.”", "“That’s rude.”", "“Das roode~.” Snake Eyes imitated the girl in a mocking tone.", "“Well, we’ll find out.” Then, she lied down on the platform like she had given up worrying about the matter. But she had to get up soon enough, as they were closing in on the mountaintop. As expected, the eighth pillar was standing at the end of the staircase, or, in other words, the mountaintop.", "Soon, the platform stopped and descended until it touched the mountain.", "“Are we first?” Snake Eyes stepped on the ground joyously. How could she be anything but happy, when she almost ended up climbing the mountain from the beginning?", "But just like the saying, ‘even a jade has dirty spots’, there was a team that arrived at the mountaintop first. That group consisted of eight people. Clearly, everyone had survived.", "“Damn, we’re second.” Snake Eyes grumbled as if someone spoiled her fun, but in truth, the order of arrival didn’t matter. What mattered was that they got here. The team that arrived first also noticed them and slowly shortened the distance.", "Seol Jihu studied the group to see if there was anyone he knew. At that moment, he noticed someone walking toward him from the other group.", "“Eh? Is that who I think it is?” Maria noticed too. It was the High-Rank Priest that Kazuki invited.", "“Who the hell is that dressed in nothing but black?”", "Seol Jihu smiled bitterly at Snake Eyes’ mumbling. Just like before, the Priest was hard to miss with her head covered by a hood and her body covered by a gown.", "“Wow, wow! I’m jealous. One man and six women. You must have been one happy camper.” The man standing at the forefront of the group commented sarcastically.", "‘Happy? Happy my ass.’ Seol Jihu cursed inwardly, especially when he remembered how much energy was sucked out of him in the labyrinth.", "“But it’s interesting. You only have seven people, yet you flew all the way to the top….”", "“Ah, about that….”", "While the man and Lara exchanged information, Seol Jihu greeted the Priest with courtesy, “Hello.”", "“….”", "“When did you get here?”", "“….”", "But the Priest didn’t say a word no matter how many times he tried to talk to her.", "‘I don’t think she’s trying to ignore me, though.’", "From the way the Priest glanced at him from top to bottom, Seol Jihu guessed she was checking to see whether he was injured.", "Tap, Tap. She even straightened the wrinkles on his clothes.", "“It’s fine….” Seeing the Priest act like a mother duck that just found her lost duckling, Seol Jihu felt himself feeling a little strange.", "‘Now is not the time to be doing this.’", "The Banquet wasn’t over just because they reached the top. He couldn’t just sit around and wait leisurely when Chohong and Hugo could be fighting for their lives.", "‘If I can just find out which direction they’re coming up in…’", "“You can’t help them.” At that moment, just as Seol Jihu was about to move, Lara’s voice struck his ears.", "“Yes, the moment you step on the mountaintop, you are no longer allowed to interfere with anything happening on the stairs.” The man explained slowly.", "“We tried various methods. We couldn’t go down, support others with long-ranged attacks, or even communicate with them in any way. According to her, the world between the mountaintop and the stairway has been separated.” The man spoke as he looked at the Priest spinning around Seol Jihu.", "‘She talked?’", "When Seol Jihu turned and looked at the Priest, she stopped and stared out to the far distance.", "“Then… we’re stuck here?”", "“Pretty much. We have no choice but to wait, for now.” With the man’s explanation finished, Seol Jihu glanced at the Priest for confirmation. The Priest turned her head and nodded slowly. In the end, Seol Jihu had no choice but to put down his spear.", "Stage 1 had ended. Seol Jihu’s party naturally split up. Although he knew there was no reason for them to cooperate anymore, he was still left with a bitter taste in his mouth. Lara and Sophie expressed their gratitude, Snake Eyes left to take a look around the mountaintop, and the white-headband girl disappeared without a word.", "Maria sat down under a tree, saying she wanted to rest. As for Straight Face…", "“What’s your name?”", "…She struck up a conversation before leaving.", "“Seol.”", "“Seol, Seol… Seol?” After repeating the name a couple of times, Straight Face’s eyebrows went up. “From Haramark?”", "“Huh? Ah, yes.”", "It could have been a misunderstanding, but, for the first time, she genuinely seemed surprised.", "“Ah… so you’re that….” After nodding her head a couple of times, she smiled and put a cigarette in her mouth.", "“Is the Old Man doing well?”", "“Excuse me?”", "“No, it’s nothing. Anyways, you weren’t half-bad.”", "“?”", "“Well, I didn’t like that you dragged those useless bitches with us… but looking down at the rest of the contenders from here isn’t all that bad.”", "Straight Face’s snickering sent cold sweat down his back. Perhaps, this woman was a natural sadist. She was only missing a black leather suit and a whip.", "‘But her skills are top-notch.’", "Her quickdraw, which was invisible to the naked eye, was still etched in his mind. She certainly had skills befitting a High Ranker. Moreover, she was from the same Area and was colorless, unlike Snake Eyes. Getting to know her didn’t seem like such a terrible idea.", "“What’s your name?”", "“Hmm, don’t you know it’s rude to ask a lady her name so casually?” Straight Face showed her unique arrogant face. When Seol Jihu reacted with a shocked face, she shook her hands saying it was a joke.", "“It’s Rahee.”", "“Hee? That’s a pretty name.”", "He didn’t add the follow-up, ‘unlike how you act’ comment.", "Straight Face shook her head. “No. It’s Ra. Hee.” (Rahee)", "“…What about your last name?”", "“You didn’t say yours either.”", "Seol Jihu laughed. “You’re calculative in weird places.”", "“Oh, you’re already complaining?”", "Straight Face dropped the cigarette, pushed her bangs up, and spat on the ground graciously.", "“Getting my phone number is going to be harder.”", "With that, she turned around and left with a final comment, “Good luck finding out.”", "‘But I already know.’", "As he watched the woman, ‘Oh’ Rahee, walk away, Seol Jihu stuck out his tongue.", "*", "There was nothing on the mountaintop. As Seol Jihu wandered until the end of Stage 1, praying for his teammates’ safe return, more and more teams began to reach the mountaintop. After watching quietly for a while, Seol Jihu noticed that no teams arrived with all eight members except the first. He saw one team reach the top with seven members, but most teams had only three to five members.", "Thankfully, Chohong and Hugo performed as expected. Chohong was the first to reach the top, and her team consisted of five members. Apparently, their team had six members when they left the labyrinth, but one had died during the climb.", "“Are you okay?” Seol Jihu asked as he watched the exhausted Chohong.", "“I thought I’d die. Really.” Chohong heaved out heavy breaths and plopped down on the ground. She didn’t have any serious injuries, but her mace was stained with blood and her hair was dyed silver. Since she was forced to use Manifestation, Seol Jihu could guess how difficult her journey must have been.", "“But you look fine. Why are you brimming with energy?”", "“…I had good luck with the team,” Seol Jihu lied.", "“Fuck, I’m jealous. I met complete shitstains….” Chohong growled and glared to the side, and her teammates instantly flinched.", "“Idiots who are all talk with no skills… You don’t know how many times I held myself back from killing them.” Chohong’s chilling tone showed how much stress she had to endure. On the other hand, Seol Jihu guessed that every team had similar problems as one man from Chohong’s team was glaring at her with resentment, even though he couldn’t say a word in front of her.", "Hugo wasn’t looking any better either. He arrived with two others. Apparently, he left the labyrinth with four others, with two dying in the process.", "Listening to Chohong and Hugo’s stories, Seol Jihu felt like he was listening to a fairytale. It was only now that he understood how great of a reward it was to pass the stairs automatically. Although he wanted to listen to Hugo’s story in more detail, Hugo had incurred heavy injuries, so they had to go look for Maria immediately. Thankfully, they found a Priest nearby healing injured Earthlings.", "With that, members of the Carpe Diem had all passed the first stage. But not all of their companions were present. Seeing people climbing the stairs intermittently, Seol Jihu finally sat his butt on the ground.", "Several hours had passed since Seol Jihu first reached the mountaintop, but Stage 1 was showing no signs of an end. Just when Seol Jihu thought it was over, two or three people would show up at the mountaintop.", "The only difference was that none of the latecomers had more than three members. Since Seol Jihu couldn’t just wait day and night, he took the time for a brief self-reflection.", "‘50 points.’", "That was the score he gave himself for Stage 1. He couldn’t be more generous than that. The result was good; there was no doubt about it. But the process was worth zero points.", "Not once had the seven of them worked together. Of course, one could argue that taking turns to open the door was more efficient, but that was just pure coincidence. Seol Jihu could only patch the twisted relationships, not mend them.", "To be honest, Seol Jihu thought he was more of a mediator than a leader. He appeased his teammates with words and kept them together, but could he honestly say he ‘led’ them?", "“Here you are.”", "Seol Jihu was smoking to alleviate the stifling feeling in his heart when a shadow approached him with a familiar voice.", "“Mister Kazuki?”", "“Mn.”", "“When did you get here?”", "“An hour ago. Can you give me one too?”", "Kazuki sat down next to him. Seol Jihu was surprised Kazuki was here as he handed him a cigarette.", "“I didn’t know.”", "“I was busy trying to find out something.” Kazuki pointed at the cigarette in his mouth. When Seol Jihu lit it for him, Kazuki took a deep breath and exhaled just as deeply.", "“I didn’t know you were a smoker.”", "“Only when shitty things happen.”", "It was the first time Seol Jihu saw Kazuki use coarse language. Examining him more closely, he could see that Kazuki looked exhausted.", "“It must have been hard.”", "“It felt like the limits of my patience were being tested.” With that, Kazuki smoked the cigarette silently. He seemed to be venting his anger, so Seol Jihu sensibly didn’t dig into it.", "“Seol,” It wasn’t until the cigarette burned to the filter that Kazuki opened his mouth again. “There’s something I want to say.”", "He sounded quite serious."]}