{"cid": "459", "title": "Chapter 459. Preparation for the End (1)", "content": ["The moment they crossed each other, Little Chick bounced back from the impact and rolled on the ground. However, Little Chick did not give up. It kicked off the ground right away and violently pecked toward Seol Jihu, who was reaching out.", "A large hand flew across the sky like an arrow, and a sharp beak cut through the air.", "A fierce fight broke out. They sweated blood while exchanging several moves. They crushed the garden weeds as they rolled around, and small craters appeared in the dirt.", "A great war between a man and a bird sent the garden shaking. Though it seemed like there would be no end to it, the victor was decided in a split second.", "“Ah!”", "The large hand succeeded in snatching the bird’s body. Inside the devastated garden, the sweet taste of victory was handed to the human.", "“Keuk! If only I had enough energy…!”", "Little Chick’s beak shook in anger. Seol Jihu grinned and brought Little Chick up to his eye level.", "“You lost, right? Now, hand it over.”", "Little Chick stopped glaring and blinked.", "“What are you on about? Did something happen to your brain when you revived?”", "“What about you? Why did you attack me?”", "“No reason. Looking at you just made me angry.”", "“…You little bastard.”", "Seol Jihu was about to squeeze his left hand but instead, put his right hand in front of Little Chick.", "“Anyway, hand it over. You said you would.”", "“?”", "“Don’t think I forgot. I distinctly heard before I lost consciousness.”", "Little Chick still seemed to be doubting whether Seol Jihu was out of his mind. However, after a moment of staring dazedly, it dropped its lower beak in a fluster.", "“T-That’s….”", "“That’s?”", "“Well….”", "“Well?”", "Seol Jihu grinned with his mouth, protruding out like a monkey. Little Chick grunted, annoyed with Seol Jihu. It squirmed out of his hand, then shouted.", "“When did I say that!?”", "“What, you’re going back on your words now?”", "Hearing this, Little Chick boldly put out its leg. This time, it was Seol Jihu’s turn to be speechless.", "“Hmph, you took the fourth and fifth stage practically for free, and now you want the sixth and seventh stage too? Where’d you drop your conscience?”", "“You said you’d unlock them!”", "“If you go back alive! Did you go back alive? Huh!? You couldn’t even climb a measly, little hill and collapsed…!”", "Seol Jihu fell silent. Now that he thought about it, Little Chick was right.", "“But the final battle is going to happen soon. I figured training with the sixth and seventh stages would help if I’m going to fight the Parasite Queen….”", "Seol Jihu suddenly turned sad. Little Chick flinched…", "“Can’t you see this? Hmm?”", "Then he yelled while pointing at its forehead with its tiny wing.", "“Shouldn’t you help me reach adulthood before asking me for this? How can I unlock anything when I don’t have the means!?”", "That was right as well. Seol Jihu’s eyes rolled.", "“The contribution points I have might be a little tight… I do think it will be enough, though….”", "“…You just revived. You should take care of yourself and rest a little more. Why are you already cooking something up?”", "“What good would it do to wait? If we have to fight anyway, it’s better to do it as soon as possible.”", "“Hmm, that means the Parasites lost and retreated again…. Well, given the nature of parasites, I guess it makes sense not to give them too much time….”", "On a side note, Phi Sora was hiding behind a tree, sneaking glances and eavesdropping in on their conversation.", "‘…What the hell are those guys doing?’", "She had a dumbfounded expression. At first, the two of them were fighting like they wanted to kill each other. Now, they were having a serious conversation with grave looks.", "“I don’t know the details since I just woke up, but I can imagine what happened…. Anyway, the sixth and seventh stages aren’t so easy to master.”", "“I know.”", "“What do you know? Starting from the sixth stage, you can’t use the Authority you’re granted off the bat. For the seventh stage, you have to be mindful of your physical state too….”", "Little Chick furrowed its brows in the middle of talking. It was only then that it felt the divinity flowing out of Seol Jihu’s body.", "“You… A-Anyway, you need time to get used to them!”", "“Don’t worry.”", "Seol Jihu grinned.", "“I’ll have more than enough time.”", "“Didn’t you say the battle’s right around the corner?”", "“You just have to make time then.”", "Seol Jihu winked.", "“Do you want to come too?”", "Hearing Seol Jihu’s vague question, Little Chick tilted its head.", "*", "Seol Jihu spent the rest of the day peacefully in Seo Yuhui’s arms and held a meeting the next morning. Before getting to the main agenda, there were a few things he needed to take care of.", "“How’s Sinyoung doing?”", "“Extremely busy. Representative Yun Seora is running around day in and day out, taking care of matters on Earth and in Paradise…. She has her work cut out for her.”", "This wasn’t surprising since every executive was executed.", "“I was wondering why she wasn’t picking up…. I guess it will be hard to see her for a while then.”", "“Representative Yun Seora, you mean? Why?”", "“I wanted to thank her. It was Miss Yun Seora who acquired a Royal Oath, right?”", "Kim Hannah nodded.", "“Since both sides are busy right now, maybe you can express your gratitude by sending the Federation’s promised aid to Scheherazade first. That should be more than enough.”", "“Aren’t other organizations working with them?”", "“They were before the war. Now it’s a total mess. Eva is the only city that isn’t in total ruins.”", "Seol Jihu smacked his lips.", "“…I guess it can’t be helped then. Do that. I’d still like to meet her later, though.”", "“I’ll try to leave her a note. By the way, what about the Triads?”", "“I talked with Mister Hao Win on the phone for a bit on Earth. He said he’s busy at the moment but would be down to grab drinks once the Parasite Queen’s defeated.”", "Kim Hannah chuckled.", "“So, you’re finally learning the ropes, calling them first and all.”", "“Of course. If it weren’t for the Triads helping me, I wouldn’t be here right now.”", "“It’s good that you know. They stopped you from jumping out of the window as soon as you revived. Of course you should pay them back.”", "Seol Jihu glared at Kim Hannah. She put on an air of innocence and began to jot something down on a piece of paper, humming.", "‘It’s not my fault you kicked Master…’", "Judging by the subtle jabs she was making, she must still be angry about what happened a few days ago.", "“Oh yeah, is your T doing well?”", "“Yes, she got a little dirty, so I made her take a bath, and now she’s sleeping under the sun.”", "“What a shame. I wanted to see her again too.”", "“It might be a little difficult right now. I do have Black Lace with me here. Do you want to see her instead?”", "“No, it’s fine. I can just see T tomorrow.”", "“Oh my, but tomorrow is going to be Fish Net’s day.”", "Kim Hannah played along without batting an eye. It seemed she had gotten used to Seol Jihu’s antics.", "Seol Jihu scratched his head awkwardly.", "‘Anyway, I’ll leave the rest to Kim Hannah….’", "Seol Jihu swept his bangs up, then blinked. He called everyone to the office, but…", "“?”", "For some reason, everyone was staring fixedly at him or laughing. For example, Chohong was grinning with her back against the wall, Phi Sora was chuckling in front of the desk, and Eun Yuri was giving him a piercing look.", "Seol Jihu felt like he was missing something. Beside Seo Yuhui, who was hugging his head from behind his chair with her head on top of his, Teresa was sitting crossed-legged at the edge of his desk, sending him seductive looks, and a small weight could be felt on his left leg since a while ago.", "“What are you doing here, Your Majesty?”", "“…Hmm?”", "Charlotte Aria tilted her head up. She was leaning on Seol Jihu’s leg, reading a book.", "Seol Jihu wasn’t the only one who was taken aback. Baek Haeju was the same. She looked like someone who only expected to see one thieving cat but saw six predators eyeing the same prey.", "Of course, the prey himself was oblivious to all this. He was rummaging through his pocket, trying to bring up the main topic.", "“As you all know, we will join hands with the Federation and launch an attack into the Parasite’s territory.”", "This would be the first time in history that the humans and the foreign races invade the Empire’s territory.", "“There’s still some time before then… but we can’t say that we’re necessarily in an advantageous position. Although now only half of the Army Commanders remain, the Parasites can’t be considered gravely hurt as long as the Parasite Queen is alive and well.”", "Seol Jihu spoke about this heavy topic in a light tone before taking out the item he prepared.", "“Since our next battle will be in the Empire’s territory, the Parasite Queen is sure to appear in full force. This will be the final battle that decides the fate of the three forces, so….”", "Tak, tak, tak! He shook a pouch, and three faintly shining orbs fell to the table.", "“We should boost our strength in preparation for that battle.”", "Diligence, Charity, and Temperance. Everyone’s eyes widened as they stared at these three divinities.", "Seol Jihu’s plan was simple. It was to offer the divinities in exchange for contribution points and using Divine Wishes to help accelerate his teammates’ growth.", "Divine Wishes were only omnipotent when it came to things that the Seven Sins could grant, but there was a clear limit. If the maximum power of a wish were equivalent to ten points, then the cost to revive an Earthling would also be ten points. In this case, a single Divine Wish would only be able to revive one person.", "But by the same logic, one would be able to ask for multiple wishes using a single Divine Wish. For example, one could ask for a weapon and an armor, each costing five points.", "And so, the first thing Seol Jihu checked was how close everyone was to being promoted. As they fought against the Parasites for a month since the second Imperial Oath Expedition, he expected them to have amassed a decent amount of experience and contribution points.", "Even in reality, Yi Sungjin was promoted to Level 4, and Yi Seol-Ah was promoted to a High Ranker. Not only that, Eun Yuri, who made significant contributions in the war, skipped two levels to become Level 6.", "Unfortunately, there wasn’t anyone who was promoted to a Unique Ranker. Valhalla had several Level 6s, but most lacked contribution points needed for the promotion. Apparently, a few only fell short by a few points…", "‘It doesn’t matter.’", "Seol Jihu didn’t care. Helping people level up when they were at 70 to 80 percent contribution point status would be a lot different than someone at zero percent status. Not to mention, most of them didn’t need to go through promotion exams.", "And so, Seol Jihu planned to separate his comrades into three groups and fill up the contribution points they lacked for promotions using a wish.", "To be more precise, Baek Haeju and Seo Yuhui were in the first group. As they already amassed a lot of contribution points, Kazuki was just barely able to fit in as well.", "The second group consisted of Chung Chohong, Teresa, and Phi Sora. As they missed out on their promotions just barely, the Divine Wish still had some wish power left, so Marcel Ghionea and Hugo could be included as well.", "The third group consisted of Eun Yuri, Yi Seol-Ah, and Yi Sungjin.", "These were the groups Seol Jihu came up with after much deliberation. It was a shame he had to leave Hoshino Urara out, but there was nowhere to fit her into even if he took out Marcel Ghionea and Hugo.", "He also debated heavily between Yi Seol-Ah and Oh Rahee, but in the end, he decided on the former. It would have been great if they both could level up, but it just wasn’t possible both ways.", "After hearing his explanation, Valhalla’s members showed dumbstruck faces.", "Seol Jihu tilted his head.", "“What’s wrong? I thought you guys would be happy.”", "Eun Yuri stared at the divinities before looking up at Seol Jihu.", "“Daddy?”", "“…What do you mean?”", "“I mean…”", "Phi Sora stepped up.", "“Obviously, that’s good for us…. I’m sure everyone understands what you’re saying…. It’s just…. You know….”", "“What do you mean?”", "“Do I really need to spell it out for you!? You’re the one who obtained those divinities, but rather than spending them for yourself, you’re saying you’d take care of us….”", "Phi Sora bit her lip.", "“Don’t you want to be promoted to Level 10?”", "“Level 10? Why would I?”", "Seol Jihu snorted.", "“It’s not like leveling up will change anything for me.”", "“It’s not going to change anything?”", "“Nope. Not besides my class name.”", "Seol Jihu spoke firmly.", "“Leveling up will get me 10 ability points. Even if I add the points I have now, it will only be enough to raise my Luck stat. What’s the point in a Warrior having high Luck stat?”", "Phi Sora blinked. As she believed Pinnacle was the highest rank a physical stat could reach, she did not understand what Seol Jihu was talking about.", "“You might not know this, Miss Phi Sora, but purely in terms of the physical level, I can easily surpass a Level 10.”", "“W-What?”", "“I saved the Divine Elixirs until the end. And after I revived, I realized my Endurance, Agility, and Mana stat increased again…. I can’t really quantify it, but I should be around Level 14 or 15 range.”", "Seol Jihu then added, “Purely in terms of physical level.”", "Maria also murmured, “I knew sitting on it was the right move….”", "Seol Jihu ignored her and continued.", "“I judged that it would be better if you all use the points instead of me. That’s all.”", "He emphasized the last point as if he would not accept any objections. Of course, he didn’t mention the real reason, which was unnecessarily risking danger when he was satisfied with his current class name.", "“We have no reason to refuse if that’s the case, but…”", "Chohong, who was leaning on the wall with her arms crossed, spoke.", "“But it’s hard to be comfortable with it. You’re saying I will become a Level 7, right?”", "“Yep.”", "“Then I won’t have any contribution points left after becoming a Unique Ranker. Even if I gain ability points to raise my physical level, I won’t be able to learn any skills.”", "She was saying that rather than spreading thin, he should focus on a few elites.", "She wasn’t necessarily wrong either.", "“You can learn the skills on your own.”", "“What?”", "Chohong furrowed her brows.", "“What are you talking about? There are only two months before the date of the march, so how would we….”", "“Don’t worry. I’ll show you a way to turn 60 days into 600 days.”", "Hearing this, Chohong became speechless.", "“How?”", "Teresa asked, leaning closer to Seol Jihu.", "“Well, let me just say this is another use of the Divine Wish.”", "“Oh, my. You have even more Divine Wishes?”", "“They’ll be with my own contribution points. I had some left over after leveling up, and I even killed two Army Commanders after that.”", "Teresa did a double-take. Now that she thought about it, it was Seol Jihu who killed Sung Shihyun and stopped Abhorrent Charity’s self-destruction.", "“Alright, that’s all I wanted to tell everyone. I’ll explain the rest later.”", "Seol Jihu smiled and got up.", "“I gotta go somewhere.”", "*", "After the meeting, Seol Jihu loitered around Valhalla’s building.", "[Stop~]", "“Kking!”", "[Stop right there~!]", "“Kking! Kking!”", "He found Flone playing tag with the little fuzzballs and brought her to a quiet place to talk.", "“Flone, do you remember the Pagoda of Dreams Expedition?”", "[Yeah! Why do you ask?]", "Flone looked confused.", "“Think about it. Who would have thought that the Stele of Evaluation we found would help protect the World Tree?”", "Before going back home after the expedition, Seol Jihu had activated his Nine Eyes. Back then, the forest had been a mix of yellow and blue.", "“Roselle’s fate changed because we accepted her request. If not for us, she might have been trapped inside that forest forever.”", "He didn’t know why the forest had glowed blue back then, but he finally understood after the Tigol Fortress War. What was important was that Seol Jihu knew of another place that was a mix of yellow and blue.", "“This means that our choices can change the fate of others. Not only that of the living but also that of the dead.”", "[O-Okay…]", "Flone seemed focused but completely confused.", "“Do you remember the ancient emperor’s villa?”", "[Of course.]", "“I thought about how to utilize that place, and I think I finally got it. You know how I became the Apostle of Gluttony, right?”", "[W-Wait.]", "Flone raised her hands in a hurry.", "[Sorry, I’m not really sure what you mean by fate, villa, gluttony, and all that…. What are you trying to say?]", "Seol Jihu smiled, finding the pouting Flone cute.", "“…Flone.”", "It seemed he had to get to the main point before explaining the rest.", "“Won’t you become my Servant?”", "Flone’s eyes widened."]}