{"cid": "331", "title": "Chapter 331. Promise (1)", "content": ["Ping!", "The arrow left.", "From the loading to the firing, only a short moment went by.", "The arrow, which Marcel Ghionea poured out his heart and soul into firing, cut through the air with a firm, steel-like will to reach its destination.", "It went without saying that an arrow could not change its course once it was released and in the air. It would be a different story for someone like the Star of Pride, whose arrows were tied with a chain or Ayase Kazuki, who had the ‘Swallow Arrow’ skill that let him redirect his air-borne arrows. But at the very least, the Archer that just shot this arrow did not have such an ability.", "However, Marcel Ghionea believed in himself.", "His ‘Archer of Steel’ title was not just for a show. Ever since he entered Paradise, save for unavoidable circumstances like expeditions, he shot thousands of arrows every day to train his abilities. He did not skip even a single day.", "Moreover, he felt it when the arrow left the string. A near-absolute confidence, even when considering the irregular movements of the Nests and the Spirits.", "All he had to do now was wait for the result.", "And so, the arrow finally entered the Nests’ range of attack. To a bystander unfamiliar with the circumstances, this might have happened in an instant. But for Marcel Ghionea, who was still maintaining his hyper-focus, everything was in slow-motion.", "The sharp arrowhead tearing through the air and the seed and the sedges tightly tied to the arrow shaft were all clearly visible.", "Dozens of tentacles flurrying every which way brushed past the arrow shaft by a narrow margin on multiple occasions. The spider web-like net, created by the tentacles as they moved to kill the desperately attacking Spirits, obstructed the arrow naturally.", "However, even the most closely-stitched spiderweb has a gap. The arrow, flying in an arc, shockingly flew into this tiny hole and disappeared.", "As the tentacles loosened up and separated, Marcel Ghionea clearly caught sight of an arrow brushing past a young Spirit and continuing onward without reserve.", "Right, the steel arrow was still marching forward, unhindered.", "“…”", "Marcel Ghionea’s tightly-shut left eye opened. His widened eyes then stared fixedly at the arrow. At this moment, his sense of time was at a complete stop.", "He felt like his heart would explode from the tense nervousness, and his stomach roiled.", "The timing was perfect. No, it wasn’t just the timing. The speed, the direction, and every element affecting the arrow were all shouting that it would hit its mark just a second later.", "Now that the arrow had overcome the mountain of tentacles, which was expected to be the biggest impasse, the chance of success had gone up significantly.", "Because at this point, the Nests would not be able to deal with the arrow even if they noticed it. By the time they moved their tentacles to stop it, the arrow would have already hit its mark.", "Right, that had to be the case given the speed of the arrow and its distance to the target and the tentacles.", "…And indeed, Marcel Ghionea’s calculations weren’t wrong. Except, that was only if he accounted for the tentacles that were already out in the open.", "Another second went by. As Marcel Ghionea clenched his sweaty hands, he witnessed an unexpected change.", "The husk of the dead tree cracked up, and a branch-like tentacle came flying out through the bulging shell.", "Then, it shot toward the arrow right away.", "Tak!", "In a split second, the arrowhead shook like a fishtail.", "Not forward, but downward.", "“Ah…!”", "Marcel Ghionea’s pupils shook.", "A Nest had used the dead World Tree to ward off the arrow! Who would have guessed that a tentacle would shoot out of the dead tree?", "No, it was a well-known fact that the World Tree had been contaminated. This was a miscalculation on Marcel Ghionea’s part. The urgency of the situation had made him focus only on the Nests.", "The deflected arrow helplessly rose to the sky. As Marcel Ghionea stared at the lifeless arrow, his eyes died together with it.", "The treasures that Seol Jihu went through all kinds of hardships to get were on the brink of returning to nothingness.", "‘If Mister Kazuki was here and not me…’", "If he could, he would not hesitate to grab the arrow and hurl it down. Unfortunately, he was only given a single chance, and there was no way to alter the target of an already-fired arrow.", "The result of being unable to overcome this final hurdle was… failure.", "As this word popped up inside his head, Marcel Ghionea’s expression paled with shame.", "It was the same for the Spirits.", "A lowest-ranked Spirit that was blindly charging forward was coincidentally near the trajectory of the arrow. Although it had tilted its head at first, when it saw the seed and the sedges tied to the arrow, it immediately did a double-take.", "[That’s…!]", "As a Spirit born and raised in the Spirit Realm, there was simply no way it would not recognize these items.", "However, the face of the lowest-ranked Spirit immediately stained with regret. It realized what Little Chick was aiming for the instant it saw the arrow, but the arrow was currently swimming in the air helplessly.", "[Ah! Aaaaah!]", "It stretched out its arm with a yearning heart, but its efforts were in vain. It wanted to fly and grab the arrow, but a sudden gale blew against it.", "It didn’t have to see to know.", "A tentacle was flying toward it.", "[Aaaah…]", "With a low groan, the expression of the lowest-ranked Spirit paled. Marcel Ghionea clenched his fists and dropped his head, and Little Chick also shut both its eyes.", "It was then. Just as the tentacle was about to strike the young Spirit—", "[Iyaaaaa!]", "A low-ranked Spirit suddenly flew in between them. It immediately grabbed the lowest-ranked Spirit’s shoulders and turned back.", "Clap! The tentacle whipped the low-ranked Spirit’s back, which promptly bent in a frightening way.", "[Uuuuuugh!]", "The low-ranked Spirit clenched its teeth. Then, using the propulsive force of the blow, it pushed the lowest-ranked Spirit far away!", "[Please…!]", "The voice of the low-ranked Spirit quickly grew faint. The lowest-ranked Spirit stood in a daze as its body was pushed up. But its confusion only lasted a moment. As soon as something touched its fingertip—", "[!]", "The lowest-ranked Spirit immediately realized what it had to do.", "A soccer game didn’t end the first time a shooter failed to score. If the ball did not leave the field, the shooter’s teammates would still have a chance.", "The Spirit clenched the object that fell in its hand.", "It had no time to rest or to even turn.", "The World Tree was humungous. The arrow would surely reach it as long as it was traveling in its general direction.", "[Goooooo!]", "As such, the lowest-ranked Spirit shut its eyes, accelerating in the direction it was already going in. Meanwhile, it gave its all in stretching out the arm holding the arrow.", "Just like seizing a ball rebounding off the goal post and striking it down, the Spirit pushed the arrow to its intended destination.", "In that instant, the tentacle was a little slow to react. Perhaps the Nest had not expected this development, or perhaps everything had simply happened too quickly.", "Regardless—", "Pak!", "What mattered was that the arrow, pushed forward with the power of the Spirit’s life, reached the husk of the World Tree at last.", "Half a second later, at the same time that the pursuing tentacle whipped the young Spirit’s back, its baby-like hands pushed the arrow inside. The erupting stem of the dead tree was pushed back inside, and the arrow finally dug into the husk!", "This whole thing happened in less than a second.", "[Heeeeeu!]", "The lowest-ranked Spirit writhed in pain after being flung to the ground. It narrowly opened its eyes as it felt the last of its energy leave its body.", "Moments later, as the young Spirit scattered into particles of water droplets, a faint smile emerged on its face.", "Because it saw. It saw the arrow buried inside the upper area of the World Tree, only leaving the fletching visible.", "This wasn’t just some optical illusion. The entirety of the dead tree beginning to quiver like a leaf proved that it had succeeded.", "Right, the dead tree was reacting!", "[Wo…!]", "As a Spirit, it knew better than anyone else. The aura of death filling up the dead tree combusted into oblivion at a terrifying rate. And a fresh, pure aura, newly coming into being, filled the disappearing aura’s spot.", "Pang!", "An enormous aura unwittingly burst out from the World Tree.", "Facing this pressure, the hundreds of tentacles instantly stopped moving.", "Next.", "Sssss, sssss….", "Small sparks of light glowing like fireflies flowed out of the World Tree and danced.", "The World Tree was showing signs of reviving.", "[World Tree-nim…!]", "The young Spirit muttered in a crying voice. Although its voice soon turned into an empty ringing, it was not meaningless.", "The branches that had been drooping down responded to the cry of a young Spirit and began to slowly rise to the sky, extending out infinitely.", "Guooooooooo—", "At the same time, an inestimable pulsation echoed out, almost to the point of reaching outer space.", "This was the so-called Yggdrasil Roar, the sign of the birth of a new World Tree.", "Successfully reviving after a desperately dangerous situation, the World Tree bloomed at last.", "**", "Kwang!", "Seol Jihu was slammed down on the ground with a boom. Immediately afterward, a longsword soaked in blood struck down with a force capable of splitting the earth.", "With a gasp, Seol Jihu somersaulted up. As he got out of the way by a narrow margin, a chilling sound cutting through the air tickled his back.", "That wasn’t the end.", "“——!”", "Twisted Kindness’ roar burst out.", "Rumble!", "The earth seemed to roll as long, oddly-shaped rocks shot up to the sky. Earth dragons made of rocks ascended into being and shot toward the expedition team.", "Their speed was enough to instill terror in even the most courageous heroes, but Seol Jihu’s mind was as placid as a tranquil lake.", "Staring at the dragon-shaped amalgamation of rocks, Seol Jihu pumped up his mana and swung the Spear of Purity in a wide arc.", "Dozens of golden sword qi immediately shot out, destroying the earth dragon charging toward him.", "Seol Jihu inwardly marveled at the power-up that surpassed his wildest imaginations.", "‘This much…!’", "He remembered what Jang Maldong said. That once he became a ‘true’ High Ranker, it would not be an exaggeration to be called the strongest Earthling under Level 7.", "He was not lying.", "Ever since he awakened the realm of One With the Spear, he had been living in a new world.", "Seol Jihu’s biggest weakness had been the disharmony of his mind, technique, and body. But thanks to One With the Spear, his technique had caught up to his body completely.", "Of course, Phi Sora was similarly the master of One With the Sword, but she had different hardware than Seol Jihu. With different hardware, a different output was only natural.", "Only, Seol Jihu was displaying such a significant difference just by balancing two elements of the mind, technique, and body.", "It was the same now. From the remnants of the shattered earth dragon, Twisted Kindness emerged like a ray of light.", "“You’re finally mine!”", "Clang! As her longsword clashed with the Spear of Purity, Seol Jihu was quickly pushed back. At the same time, a terrifying energy flooded into him through the Spear of Purity. The foreign energy was very clearly intending to invade his body and blow it up from the inside.", "However, Seol Jihu did not panic. After becoming one with his weapon, things he couldn’t even dream of in the past naturally came to him.", "And, his body learned them.", "The tremendous energy was difficult to resist, but he didn’t have to.", "If he couldn’t take it, he simply had to return it.", "‘Right.’", "Recalling the first time he created sword qi, Seol Jihu immediately came up with a solution.", "He guided the flowing energy into his body. Circulating it through his Circuit as if he was training his mana, he guided all of the energy to his right hand and sent it to the sword grinding against his Spear of Purity.", "Once he released it from his body—", "[Ability, Floral Substitution (Intermediate), has been created.]", "“Keuk!”", "Along with an alert, a second longsword that was striking down at him like lightning was abruptly pushed back.", "Having most of the energy she released returned back to her, Twisted Kindness’ eyes widened in shock.", "‘What’s this…?’", "Of course, Seol Jihu wasn’t unharmed. Due to enduring such powerful energy, his Circuit was burning in pain.", "To cool off his Circuit, he leaped back and distanced himself. Of course, Twisted Kindness chased after him immediately.", "She would normally catch up to him in an instant, but the expedition team members, who managed to defeat the earth dragons, charged at her from all sides.", "Baek Haeju’s Tathagata Spear came piercing in like a comet, Agnes’ threads imbued with holy power spread out in the surroundings, and Phi Sora’s longsword flew in drawing a fiery path.", "However, the Seventh Army Commander was still the Seventh Army Commander.", "“Pesky punks!”", "As she swung her twin swords in a rage, the attacks flying in from all directions were completely stopped in their tracks. And when she emitted her divinity, the Warriors were knocked down like flies.", "With such a show of force, she was truly worthy of being called the strongest Army Commander.", "‘This won’t do.’", "Changing her mind, Twisted Kindness turned around. She planned to deal with the others first rather than Seol Jihu, who continuously grew during the battle. Eliminating Seol Jihu, only after all the other hindrances were taken care of, seemed to be the best course of action.", "And so, she charged toward Phi Sora, who looked comparatively weaker than the rest.", "However, at that moment, Seol Jihu’s spear rushed in like a storm, crackling with electricity.", "Twisted Kindness did not stop. She had confidence in being able to avoid it without looking back.", "But as the speartip was about to reach her head—", "‘What!?’", "The shocked Twisted Kindness hurriedly turned her body.", "She didn’t have any other choice. Because just as she was about to tilt her head in a simple manner, she felt a destructive mana fiercely cutting toward her from the opposite side.", "She had sent the pesky Warriors flying by emitting her energy just now, so Seol Jihu should be the only one near her.", "Feeling a sense of urgency, Twisted Kindness gave up on Phi Sora and turned around.", "Swish!", "As a horrifying sensation narrowly brushed past her forehead, she saw a spinning Seol Jihu tightly clutching onto his spear shaft.", "The spear had flown past her on the left. Twisted Kindness turned her head matching that direction. But in the next moment, her mouth gaped open at the scorching pain scratching her opposite cheek.", "“…!”", "Although she did not scream, she couldn’t hide her shock.", "Flying back first, Twisted Kindness quickly touched her right cheek.", "Blood came off on her hand. Seol Jihu seemed to have halted the thrust of his spear, attacking with the crescent blade on the side of the spear blade.", "Of course, such a minor injury quickly clotted and disappeared, but that wasn’t the problem.", "Setting aside the fact that Seol Jihu suddenly began to utilize the crescent blade, Twisted Kindness should not have been hit by the previous attack.", "However, the spear that was on her left side suddenly attacked from the right. It wasn’t as if the spear moved.", "The cause of this was the Crescent Blade Spear Technique’s Third Ultimate Art, Formless Spear.", "‘Again…’", "Twisted Kindness’ expression slowly contorted.", "At first, she thought Seol Jihu gained the ability to maneuver better and move his spear on its own. But now, he was returning her energy and even displaying the realm of using an invisible spear.", "Simply put, he was gaining more resources as the fight dragged on.", "This was the reason Twisted Kindness’ calculations continued to be off. Although she could still handle him, what hidden card would he reveal next caused her to hesitate.", "And soon, her worry turned into reality.", "Guoooo—", "‘!’", "Suddenly, a pulsation from afar swept past her body.", "She did not need to go look, to know.", "It was because the presence of the five Nests that the Unicorn had brought along disappeared all of a sudden.", "‘Don’t tell me.’", "This was, without a doubt, the sign of the World Tree’s revival.", "Although she couldn’t figure out what happened, her head reeled at a rapid rate.", "The ash tree rivaling a god was reviving at the current moment? If that really happened, the outcome of this battle would no longer be within her control.", "Thinking so, Twisted Kindness cried out angrily.", "“Raging Temperance!”", "“…I know. I felt it as well.”", "“If you know, why are you just sitting there?”", "“The injuries I got from those insects healed to a certain extent.”", "A sarcastic reply came back.", "“But a certain being comparable to a god hit me twice, and I haven’t recovered from those injuries yet.”", "“You…!”", "Twisted Kindness turned away.", "The Unicorn looked nervous as well, and it didn’t seem to be lying as it was still fettered with scars.", "“Hmph, don’t worry. I’ll get moving soon.”", "“…I strongly recommend that you do. If this plan goes awry…”", "Twisted Kindness growled before clashing with the enemy once again.", "*", "On the other hand.", "“Damn it…”", "Kazuki was biting his lip, watching the battle unfold. He couldn’t help but marvel at Seol Jihu, who was cooperating with Baek Haeju to fight to resist the formidable Seventh Army Commander.", "He couldn’t believe his eyes even though he was seeing it directly.", "However…", "“….”", "That was it.", "Strictly speaking, they were still in a perilous situation. Besides Baek Haeju and Seol Jihu, Seo Yuhui, Agnes, Phi Sora, Hoshino Urara, and the others were tenaciously popping in and out of battle, but all they could do was hang onto their lives.", "Having started to use her full strength, Twisted Kindness was still full of energy.", "If they made so much as a single mistake, the situation could tip over to the enemy’s side in an instant.", "The expedition team would undoubtedly fall into a greater disadvantage as time went on.", "That wasn’t all.", "Raging Temperance joining the battle would also turn the tide of battle. The expedition team simply could not handle both Army Commanders simultaneously.", "‘Marcel Ghionea…’", "They had to come up with a solution to escape this inevitable fate, and Kazuki knew that was why Marcel Ghionea left the battlefield with Little Chick.", "‘But…’", "Even if they succeeded, would the expedition team be able to last until then?", "Thinking about it rationally, Kazuki was skeptical.", "Although he didn’t know what Little Chick was aiming to do, it would most likely need a long time to achieve its goal and return. Considering the obstacles that must be blocking its path and the time needed to get through them…", "‘…Damn it.’", "Kazuki couldn’t help but come to the conclusion that the expedition team would be wiped out.", "And so, Kazuki felt the need to buy time.", "He had already given up on attacking Twisted Kindness. Though he had been shooting arrows at her continuously, she had never paid any attention to them.", "Kazuki felt there was no place for him in the battle of monsters. All he could do was trust in his teammates to hold Twisted Kindness back.", "The best he could do at the moment was to stop the Fourth Army Commander from rejoining the battle.", "‘But how…?’", "What could he do in this spot as someone who was specialized for investigating rather than fighting?", "“Hmm.”", "It was then.", "“Good, good…”", "The Unicorn cracked its head left and right. The way it pawed at the ground, it looked ready to start fighting again.", "“Let’s get going!”", "It was just as Kazuki expected. A faint haze began to come out of the Unicorn’s body.", "At that moment—", "‘Wait.’", "For some unknown reason.", "[You…]", "Suddenly.", "[It doesn’t look like you have the slightest clue why the Queen threw you in here.]", "Seeing the nightshades hovering around the Unicorn.", "[How ridiculous! You actually have the galls to say that in your sorry state? Your actions are riddled with self-righteousness and egotism, so how can you shamelessly call yourself an ally?]", "[The Queen is keeping you by her side only because she thinks highly of your experimental mind. Otherwise, she would have replaced you long ago. Have some shame.]", "Kazuki remembered what Twisted Kindness mockingly said to the Unicorn…", "[Hmph. It doesn’t matter. Even if I can’t do anything about the Authority, I can just recover the divinity I’ve lost.]", "And also the Unicorn’s past actions, which did not seem strange back then.", "[If you’d acknowledged your limits and formed a proper army as the Queen suggested, I would have acknowledged you as an ally. But—]", "[You tried to imitate me and ended up ripping your crotch. That is why you are in such a pathetic state.]", "[With such an obvious weakness, don’t you feel ashamed calling yourself an Army Commander?]", "As the final piece of the puzzle fell into place, a conjecture popped up in Kazuki’s head.", "“Weakness…”", "A possibility for delaying time.", "“…I found it.”", "Kazuki’s eyes lit up as they glared at Raging Temperance."]}