{"cid": "315", "title": "Chapter 315. The Eve (4)", "content": ["Meeting her eyes, Seol Jihu was reminded of a female expert from a martial arts novel.", "Her hair flowed down like a current of deep-blue river water, and not a hint of disorderliness could be seen in her tall standing posture. Underneath her thick eyelashes were melancholic eyes that gave off an almost transcendent chilliness.", "She had a cool, dream-like aura around her like she would disappear if Seol Jihu took his eyes off of her for even one second.", "What Seol Jihu knew for certain was that this beauty was an expert.", "From her tall nose bridge, clear tender lips, and other parts of her body, a suppressed aura flowed out. The mysterious woman exuded an inexplicable charisma.", "However, Seol Jihu also felt like she was glaring at him. It was then that he snapped out of his daze and took a step back from Seo Yuhui’s embrace.", "“Noona, this is…”", "“Yep. She’s the one you’ve been wanting so much.”", "Hearing the words ‘so much’, the woman glanced at Seo Yuhui before turning back to Seol Jihu.", "“Ah, welcome. Um…”", "Seol Jihu was at a loss for what to do. Then, realizing he was abashed, he blinked rapidly.", "‘What’s wrong with me?’", "He had no problem talking with Philip Muller, who was an Executor. But when he was facing this woman, his body was reacting on its own like Pavlov’s dog.", "Seol Jihu calmed his pounding heart before speaking up.", "“Hello, I’m Valhalla’s representative, Seol Jihu.”", "The woman— no, the Sacred Empress, Baek Haeju, did not reply. She only stared at him fixedly.", "Seol Jihu didn’t mind it all that much. He simply thought, ‘She must have a quiet personality.’", "“Thank you for helping me in the valley war. You saved my life.”", "“….”", "“Err…. And thank you for coming this time. My strength is lacking compared to what I want to accomplish, so I had no choice but to shamelessly ask for your help.”", "Seol Jihu talked more politely than usual as a result of choosing his words carefully. It was to the point that someone muttered, “Is he on a blind date or something?”", "Seol Jihu felt his face heat up.", "‘I don’t get what’s wrong with me either!’", "At that moment, Baek Haeju spoke up.", "“I heard about your circumstances from Miss Seo Yuhui.”", "Seol Jihu’s eyes widened.", "“Saving the Spirit Realm, that is certainly a necessity at the present. Looking at this from Paradise’s perspective, that is. That is why I came.”", "She spoke plainly, not being too polite or too casual. But setting this aside, the way she was talking emphasized, ‘I’m here for the future of Paradise, not to fulfill your request.’", "“But I haven’t decided to follow you yet. After all, acknowledging a necessity is different than carrying it out.”", "Baek Haeju fixed her grip on her spear.", "“So there is something I’d like to ask you.”", "Suddenly raising her hand, she pointed the jade spear tip at Seol Jihu.", "Seol Jihu’s eyebrows twitched.", "It was strange. The more he looked at her, the more he felt something was out of place. On the other hand, he also felt an inexplicable sense of déjà vu.", "Even now when she was pointing her spear at him, he didn’t feel even the tiniest bit of hostility or intent to harm.", "But it didn’t feel like she was testing his determination either.", "“If I tell you to give up on saving the Spirit Realm, what would you do?”", "She suddenly asked an out of the blue question.", "“Huh? N-No, I have no intention of giving up.”", "“Then—”", "Baek Haeju continued right away as if she had expected this response.", "“What if I continue on with your plan to rescue the Spirit Realm even if you suspend it?”", "Now, what did this mean?", "Just as Seol Jihu was about to ask—", "“Miss Baek Haeju?”", "A sharp voice blurted out.", "Seo Yuhui was scowling at Baek Haeju.", "“Please stop.”", "“I am not asking Miss Seo Yuhui.”", "“I realize that, but did I not tell you that you do not need to come if you are going to say that?”", "They started bickering. The way they retorted back and forth without losing an inch, it was as if they were having a tacit battle of nerves.", "“Hold on a second.”", "Seol Jihu quickly cut in.", "“Why did you ask me that all of a sudden?”", "Baek Haeju’s expression turned complicated. Although her lips were tightly shut, Seol Jihu could hear her taking a deep breath through her nose.", "Soon, a suppressed voice leaked out.", "“…Because saving the Spirit Realm has good intent, but is extremely dangerous.”", "It sounded like she had a lot to say but was holding herself back.", "The dazed Seol Jihu shook his head.", "“Regardless, I can’t do that. I appreciate the thought, but my request was for you to help, not for you to do this for me.”", "Baek Haeju sighed lightly. Nibbling on her lip, she suddenly raised her eyebrow.", "“I have one condition.”", "“Go ahead.”", "“Since this expedition was planned by Representative Seol, I will agree on you being the leader. But I would like you to give me the authority to decide when to retreat.”", "“The authority to decide when to retreat?”", "“There are many scenarios to consider. Even with an expedition team of such a scale, the Parasite Queen’s forces are strong beyond your imagination. It might be possible for half of the seven Army Commanders to be waiting for us in the Spirit Realm. Surely you wouldn’t force the expedition if that is the case.”", "Even though the revival of the World Tree was important, Seol Jihu would have to reconsider if something like that happened. It might just be better to join the Tigol Fortress battle too. There was no reason to drag his precious comrades to a battle where death was such an obvious outcome.", "It was just that he didn’t understand why she would set a condition with something like this in mind.", "“Depending on the situation, taking a step back might be a better decision.”", "Feeling that Baek Haeju was trying very hard to convince him, Seol Jihu agreed for now.", "“Is that why you’re asking for the authority to decide when to retreat?”", "“I have more experience fighting against the Parasites than anyone else here. That includes the Star of Lust.”", "“Mm….”", "“I’m not expecting sole authority. But if more than half of the expedition members agree with my view, I would like Representative Seol to concede without arguing.”", "Simply put, she was asking for the authority of the header.", "He couldn’t really argue with her. A veteran Earthling who was as experienced as the Sacred Empress should know best how to react to unforeseen situations without panicking.", "However, Seol Jihu tilted his head.", "She could have just said this from the beginning, but because she started by asking him to give up on the Spirit Realm expedition, it was hard for him to understand her intentions.", "‘Maybe she doesn’t want to die because she’s been active for so long…’", "No, it was hard to say this was the case.", "If she prioritized her life above all, she would have asked for the authority to quit and return alone. However, what the Sacred Empress asked for was the authority to decide when to retreat for the entire expedition team.", "No matter how Seol Jihu thought about it, there were things that were hard to accept.", "And so, he decided to ask.", "“Let’s suppose I accept that condition. What would you do when you decide we should retreat and I refuse?”", "“It doesn’t matter.”", "The Sacred Empress replied monotonously.", "“As long as you accept my condition, I will have no reason to hesitate. I will forcefully take you back with me even if I have to knock you out.”", "‘Even if I have to knock you out.’ Seol Jihu could feel a powerful will from this statement.", "“Hnng.”", "Then suddenly, a nasal sound cut in between them.", "Oh Rahee, who was fiddling with her hair, made an amused expression as she looked at Baek Haeju.", "“I was surprised you even showed up— but now, I’m even more surprised.”", "Seol Jihu glanced at Oh Rahee. It sounded like she was acquainted with Baek Haeju.", "Come to think of it, didn’t she refer to Baek Haeju as ‘Baek bitch’?", "“I’ll go on a dangerous expedition for you. If not, I will make sure you return alive… Am I mistaken in thinking that’s what I heard?”", "When Baek Haeju remained silent, Oh Rahee must have thought she ignored her as her mouth twisted up.", "“What’s gotten into a bitch like you, hmm?”", "“….”", "“Wow, I guess you live and learn~”", "Baek Haeju didn’t even glance at Oh Rahee. She kept her eyes fixed on Seol Jihu, only her grip on her spear strengthened by a bit.", "“This is my only condition.”", "“….”", "“Considering the power of the expedition team and the future of Paradise, you must accept this condition. If not, I will not join this expedition.”", "Now, she gave an ultimatum. It didn’t look like she would lower her spear until she heard the word ‘yes’.", "Although Oh Rahee cut in just now, their surroundings were dead silent. Given a certain someone’s personality, it wouldn’t be strange for the words, ‘Who the hell are you to ask for this?’, to come out. However, no one dared to speak up.", "The reason was simple.", "Because this was the Sacred Empress.", "If someone asked, ‘Who the hell are you?’, then this legend would have all kinds of ways to retort.", "At the end of the day, the decision lied with the representative.", "Seol Jihu nibbled on his lip and spoke after thinking over it a moment.", "“You wouldn’t mention retreating while we still have a chance, would you?”", "“That will be up to the expedition members to decide.”", "Baek Haeju replied firmly.", "Seol Jihu had nothing to say. Not that he had something like dignity, to begin with, but rather than pointlessly being proud, it seemed better to give in to the Sacred Empress’ request and obtain her cooperation.", "“Alright.”", "Seol Jihu gave a definite answer.", "“I will give you the authority of the header.”", "“…You promised.”", "The spear finally dropped.", "Now that things were decided, Seol Jihu wanted to wrap up the first meeting nicely.", "“Please take good care of me. And thank you once again.”", "Baek Haeju was about to say something but shut her mouth instead. Closing her eyes, she let loose a long sigh.", "“Hah, for the future of Paradise? Since when did you care about Paradise so much?”", "Oh Rahee’s snide remark rang out.", "“….”", "But just like before, Baek Haeju did not say anything.", "*", "A meeting was called.", "A heavy air filled the grand conference room. As Seol Jihu periodically shared the progress of his plan with Kim Hannah, everyone had a good guess about the content of the meeting. As a result, the meeting became more of a simple briefing.", "As Agnes said, men were molded by their position.", "Standing in front of everyone as a representative, pointing at a huge map on the desk with the Spear of Purity and explaining the plan, Seol Jihu looked completely different than in the past.", "“We set off tomorrow.”", "Seol Jihu spoke strongly as he gripped the Spear of Purity.", "“Though some of you might think it is a bit early, we already spent too much time preparing. We can’t afford any more delays. The Spirit Realm might be in a desperate battle even as we speak, hoping for salvation they know will not come.”", "Since everyone should have come prepared, there shouldn’t be any problem setting off so soon.", "‘There’s just one person I’m not sure about.’", "Seol Jihu turned his gaze.", "Baek Haeju was sitting upright, staring at him with a renewed look. Next to her, Seo Yuhui was looking at him with a warm smile. The way she occasionally looked askance at the Sacred Empress, it was as if she was showing off.", "Seol Jihu tilted his head and asked.", "“Is that okay with you, Sacred Empress-nim? If you need more time to prepare—”", "Baek Haeju quietly shook her head. She was saying it didn’t matter.", "Seol Jihu nodded in acknowledgment.", "“Then everyone, please finish preparing until tonight at the latest.”", "Tang. After turning the Spear of Purity halfway and making it stand on its shaft, he faced the entire meeting room and spoke.", "“That is all. I will see everyone tomorrow morning.”", "*", "That night, Seol Jihu visited the palace.", "It was to give a final report on the progress of the plan and to see Charlotte Aria’s face.", "“Do not worry about Eva.”", "Sorg Kühne’s face was full of enthusiasm.", "“Thanks to everything you have done, our army is coming together nicely, and the Magician’s Guild has settled safely as well. If the Federation requests reinforcements, Eva swears to become the bridge that connects the two forces.”", "The royal administrator told Seol Jihu not to worry and focus solely on the expedition. As a result, Seol Jihu was able to breathe a sigh of relief.", "“By the way, where is the Queen?”", "“Mm, about that…”", "Sorg Kühne’s complexion darkened. Apparently, Charlotte Aria had stayed cooped up in her room for the past few days without granting anyone’s audience.", "“Is she anxious because of the war?”", "“I am not sure, but it did look like she had a lot on her mind…”", "Sorg Kühne sighed.", "“Since she entrusted me with government affairs, there won’t be any problems. But now she is refusing to see even me… This is a first for me as well.”", "With Sorg Kühne, who had forcefully pushed her on in the past, being careful, Seol Jihu got worried as well.", "‘I wanted to see her before leaving…’", "But with Roselle and Eun Yuri, there shouldn’t be any huge problem.", "‘For now, let’s focus on the matter at hand.’", "Seol Jihu relieved the royal administrator by saying he’d put in a word to Eun Yuri, then returned home.", "*", "The night passed by, and morning finally dawned.", "The sky was clear and quiet, but Valhalla was bustling from the early morning.", "After waking up, Seol Jihu quietly got ready. With a refreshing shower, he put on his clothes and draped over the coat gifted by the Federation.", "“….”", "As his reflection in the crystal looked unfamiliar, he stood still for a long time. He suddenly developed an urge to activate the Nine Eyes and check his color in the mirror, but in the next moment, he shook the thought off.", "‘…Let’s win.’", "After slapping his cheeks loud enough to cause a clap, he turned back.", "‘We have to win.’", "Reaffirming his determination, he grabbed the Spear of Purity and headed out.", "Once he left the building, a strong gale blew. Seol Jihu scrunched his face and stopped.", "In the distance, he saw the members participating in the expedition:", "Baek Haeju, sweeping her hair back with her eyes closed, her white traditional robe fluttering in the wind.", "Seo Yuhui, gently stroking Little Chick on her palm.", "Philip Muller, sitting near the garden’s pond, indulged in reading a thick book.", "Agnes, standing tall with her hands cupped in front of her.", "Hoshino Urara, warming up while doing stretches.", "And finally, the Halep siblings and the remaining members of Valhalla standing quietly behind Ayase Kazuki.", "The moment Seol Jihu walked out of the building, everyone turned to face him as if they made a promise beforehand. As they slowly began to walk toward him, Seol Jihu felt his heart swell up.", "Among them were two Level 8s, one Level 7, and two Level 6s.", "With a crew like this, High Rankers were looking rather poor.", "‘Will I have a chance to lead an expedition team of this scale ever again?’", "This thought suddenly crossed his mind. Seol Jihu collected his mind, then looked at the eyes of each of the people gathered around him.", "He then spoke while cutting through them.", "“Let’s go.”", "Thus, the curtain was raised for the decisive war that would determine both the Spirit Realm and the Federation’s fate.", "The eve had passed, and the stage that would decide the history of Paradise announced the prelude."]}