{"cid": "178", "title": "Chapter 178. Deceit (2)", "content": ["Undying Diligence’s eyes widened.", "He knew that the two insects were emitting anti-evil energy to prevent the Nosferatus from approaching them. But with the leader of their kind being pushed back to this degree, it was normal that they risk their lives to aid him.", "Undying Diligence glanced around to see why they were simply watching and saw that the Nosferatus’ feet were tied up.", "To be more precise, each of them was trapped in a cage of light that surrounded them like a prison cell.", "Some must have struggled to escape as only piles of ashes remained in a few of the cages. They would get incinerated if they made even the slightest contact with the brilliant light making up the cage, so it was only natural that they couldn’t help Undying Diligence.", "‘Just when?’", "The number of times Undying Diligence had seen such sophisticated use of holy energy could be counted on his fingers. Naturally, he turned his gaze to search for its source.", "Far beyond Vulgar Chastity, who was quickly flying over, he could see the shining Dawn Peak.", "“…What happened?”", "Vulgar Chastity arrived at the perfect timing and asked in confusion when she saw the cages of light covering the field.", "She had left her army behind. She didn’t think they could win since she wasn’t there, but she believed they were more than enough to buy them some time.", "But the fact that the Star of Lust could pay attention to what was going on here proved that she now had a little more leisure.", "This was a blunder on Vulgar Chastity’s part. During the march, she had received information of the Star of Lust reaching Level 8, but she had no way of finding out that the new Level 8 Priest was equipped with two new sacred treasure-level artifacts.", "Soon, Unsightly Humility arrived on his spectral horse. Vulgar Chastity’s charming eyes became distorted.", "“What, you’re here too?”", "“…I didn’t have any other option.”", "A hint of reluctance could be felt from Unsightly Humility’s calm reply. There were two Executors and over ten Servants remaining. They weren’t enemies that could be defeated by the Death Knights and the others.", "It would be a completely different story if he personally led the army, but since he decided to come to this place, that was now a meaningless speculation.", "“It’s as clear as day that we’ll lose most of the army we’re leaving behind. It is a shame that we will be troubling the Queen with a matter as trivial as this.”", "Unsightly Humility lamented. Never in a thousand years would he have believed that they would have such difficulty conquering a fortress that seemed to be a 5-minute job. He knew he couldn’t ignore Undying Diligence’s peril, but he had a strong hunch that they made the wrong move.", "Regardless, when the two Army Commanders arrived without their armies, Seol Jihu blew a whistle.", "“Aigooo~ Who is this?”", "When he pretended to be friendly while controlling his energy, the duo’s gaze fell on him.", "“Blackie, my buddy…”", "Unsightly Humility clattered his teeth.", "“And even Miss Prostitute is here?”", "And Vulgar Chastity’s eyes slanted upwards.", "“What’s up? What brings you dirty bastards to such a beautiful place? Hm?”", "The corner of Seol Jihu’s mouth curled up as he stood with his spear resting on his shoulder.", "Just as the dumbfounded Vulgar Chastity opened her mouth to speak— she discovered Undying Diligence panting on his knees and swallowed her words.", "She had expected as much, but Undying Diligence really was in a perilous state. It wasn’t an exaggeration to say that he had nearly been beaten to death.", "His chest was sunken in for some reason, and every vital point on his body was punctured. His reddened flesh must have blistered and burst as thick blood mixed with pus was constantly flowing down his body.", "It was only because he was ‘Undying’ Diligence that he was able to hang on with just a single knee down.", "Thinking about it this way, the spear-carrying young man gave off a completely different aura of threat, and Vulgar Chastity had no choice but to look at him with wariness.", "The young man’s lips were curled up into a smile, but his eyes weren’t smiling even a tiny bit. His bloodshot eyes were revealing a tacit, blind hostility.", "Chwak!", "Vulgar Chastity’s hair extended out and slammed the ground violently.", "“That kid. He’s provoking my desire to collect. I like the way he talks.”", "“I’ll handle the Sacred Empress then.”", "Unsightly Humility pulled on the spectral horse’s rein and changed his direction. Seol Jihu and the Sacred Empress also aimed their spears and took their stance. Soon, with Unsightly Humility kicking the spectral horse’s belly as the signal, the second round of the battle began.", "Vulgar Chastity pursed her lips.", "“Huu—”", "And when she blew out the air through her pursed lips, a thick violet gas escaped from her mouth and formed a cumulus cloud. It then followed the current of air and pounced on Seol Jihu.", "“Hm?”", "Vulgar Chastity raised her eyebrow. She had expected him to block or dodge it, but he had run straight into it.", "Her puzzled look was immediately followed by a look of shock. As the fog gradually scattered, she could see Seol Jihu standing inside it unfazed.", "The gas contained a deadly poison. Since he was covered by it, he should have been reduced to just bones, so how?", "Looking at the young man closely, Vulgar Chastity saw a blinding luster covering his body. It was obvious who was behind this protective spell.", "‘The Star of Lust!’", "Grit. When the sound of her gritting her teeth rang out, Seol Jihu snickered and pinched his nose.", "“Ah, your sewer breath.”", "“…What?”", "“I said your breath reeks. How can you be loved by your customers with such a foul breath? Don’t you have any sense of professionalism?”", "Vulgar Chastity’s hair flew up before shooting back down.", "“That damned mouth of yours.”", "Her eyes slanted up, and she smiled seductively with a coquettish voice.", "“It really makes me want to kiss it.”", "Vulgar Chastity’s eyes slit horizontally. When they met Seol Jihu’s eyes, they emitted a wicked light.", "In the next moment, Seol Jihu’s vision suddenly changed. The battlefield that was filled with an acrid smoke turned hazy, and beautiful light of all sorts of colors filled the empty space.", "This hard-to-describe world was tempting him to come closer, and Seol Jihu’s dazed eyes quickly turned foggy.", "Next, when he took a staggering step forward, the panting Undying Diligence raised his blood-covered face.", "“So he was weak to mental attacks…. Good job.”", "Revealing his reddened fangs, he shot towards the tottering Seol Jihu like a bolt of lightning.", "“You’re dead!”", "“Wait! He’s going in my collec—?”", "Vulgar Chastity furrowed her brows and paused. It was because Seol Jihu had suddenly stopped. Moreover, his mouth was still smiling.", "“Wait—!”", "Then, the target moved like a slippery loach, causing Undying Diligence’s claws to shred the empty air. Seol Jihu thrust his spear at the back of the enemy who was brushing past him after losing balance.", "The spear stabbed Undying Diligence’s back and once again pierced through his heart. This was the fourth fatal attack he suffered today.", "“Kuhuk!”", "Realizing then that everything had been an act, Undying Diligence’s legs kicked the ground purely out of instinct. The moment he felt the spear leave his body, he became furious that he had been tricked.", "“You son of a bitch.”", "But what he saw the moment he turned around was Seol Jihu gifting him with dozens of golden sword qi waves. Carpet bombed by the explosive attacks, Undying Diligence let out a sorrowful yelp.", "“…You’re quite the joker, aren’t you?”", "Vulgar Chastity, who dazedly watched the entire scene play out, spread her bat wings and flew up into the air.", "“How did you do it? Putting your mental strength aside— unless you’ve experienced a life of long-suffering or despair on par with death, it should be impossible to resist my charm.”", "She sounded a bit indignant. She was clearly annoyed because Seol Jihu toyed with her in the initial probing attack that was meant to be fun. Noticing this, Seol Jihu spun his spear and looked up.", "Vulgar Chastity’s eyes narrowed.", "“Shouldn’t a gentleman answer when a lady asks a question?”", "“I’m no gentleman.”", "Seol Jihu tilted his head.", "“And you’re no lady either.”", "“?”", "“Lady, my ass. You’re just a whore.”", "Vulgar Chastity’s expression turned venomous. Each strand of her hair shot up and danced in the air.", "“You keep calling me that…!”", "As she muttered with a curdling voice, thousands of strands of hair pricked up in all directions. Next, they extended out like a taffy stick before simultaneously bending and hurling towards Seol Jihu.", "“Tsk.”", "Clicking his tongue, Seol Jihu began to slice the air repeatedly. His spear immediately picked up momentum and began to create a howling wind.", "‘What?’", "The wind swallowed up the sharp ends of Vulgar Chastity’s hair and tore them to shreds. But that was only the beginning.", "Soon, the howling blades of wind formed a protective barrier around Seol Jihu. The whip-like strands of hair charging toward Seol Jihu were all blown back or cut down.", "‘Impossible.’", "At first glance, it looked like a simple barrier, but that could not be further from the truth.", "Brandishing a spear to create artificial blades of wind and imbuing each with anti-evil energy— not even Vulgar Chastity could estimate how much energy one would need to expend to form thousands of such blades.", "She really didn’t want to admit it, but she couldn’t deny having thought that this hateful human’s strength was on par with that of an Army Commander.", "As a matter of fact, the reason he could do this wasn’t just because his Mana stat had reached High (High).", "The precious food and medicine Seo Yuhui fed him at Huge Stone Rocky Mountain were now fully displaying their effects.", "The vast, undigested energy slumbering in his muscles and veins had responded to the realm brought forth by Future Vision and was now fully supporting him.", "As a result, every time he used mana, medicinal energy surged up and amplified his mana’s output. Currently, his body was being dominated by a sensation so hot that he felt like he was being cooked alive.", "But that was only in terms of readily available energy. His physical body, which was what utilized this energy, was the same as before.", "Blood spurted out from his nose a few times, but Seol Jihu didn’t mind. The moment he put all of his Ability Points into Mana, he had abandoned the thought of his body being unscathed.", "Vulgar Chastity stopped attacking and retracted her hair. Seol Jihu was still brandishing his spear.", "With this, Seol Jihu now had the initiative. He slowly raised his hand as if he was going to shoot the wind blades forward.", "Being bombarded by those gale-like blades of wind? Vulgar Chastity shuddered just thinking about it. In the end, she flapped her wings and flew up higher… and even higher. It was then.", "“KUAAAAAAAA!”", "A splitting shriek struck her ears. Vulgar Chastity looked down in a startle.", "Undying Diligence was being ripped to shreds inside the storm of wind. Furthermore, Seol Jihu had turned his back on Vulgar Chastity before she noticed and was heading towards Undying Diligence.", "She had been tricked yet again. A fire blazed inside Vulgar Chastity’s eyes.", "On the other hand, Undying Diligence was truly on the verge of going crazy. His heart had been pierced through and destroyed once again, and now his body was being cut apart when he was already suffering from the golden sword qi stuck on his body.", "He had to treat the fatal injury he suffered from the lightning and the holy water anti-evil energies, so he couldn’t help but feel infuriated when he wasn’t given even the slightest moment to recover.", "And the most infuriating thing was that Seol Jihu only aimed at his vital points! The spear-wielding young man was truly a vicious demon!", "Stab!", "Seol Jihu’s spear stabbed Undying Diligence’s heart once again. This time, he was even twisting his spear left and right and emitting lightning energy. An electrifying sensation swept through his body.", "Seol Jihu sneered coldly at Undying Diligence, who was skewered to his spear and convulsing violently. Such a sight would normally be impossible to come by, so he had gotten lucky today.", "Undying Diligence had survived over a hundred special Thunders detonated over two instances. The Dwarves had specially crafted these Thunders to possess amplified firepower, and Undying Diligence was even caged by all sorts of barriers and magic at the time.", "Even the Parasite Queen clicked her tongue at his bottomless vitality and bestowed him with the title ‘Undying’.", "Seol Jihu had not expected to injure him to this degree either. However, he had been able to deal a fatal blow thanks to the Sacred Empress’s clever maneuvers.", "After that, he had deceived and used Vulgar Chastity to tenaciously go after Undying Diligence.", "While this may have worked the first couple of times, unless the enemies were complete retards, he knew that the same method would not work a third time.", "But he had another card up his sleeve. This battle was not really a 2 on 1, but was actually a 2 on 2. And Lust was the perfect match for Chastity.", "Suddenly, a highly concentrated fragrance crept up behind him. Just as something soft and squishy clung to his back, a slender arm and leg crossed over his body like shackles.", "“Don’t go too far.”", "After whispering into Seol Jihu’s ears with a venomous voice, Vulgar Chastity’s hair moved quickly. In the blink of an eye, the strands of hair coiled around Seol Jihu’s arms and legs. And when she pulled her hair back, so did the spear piercing Undying Diligence.", "When Seol Jihu emitted his lightning energy, Vulgar Chastity countered it with her violet energy. Next, she placed her chin on his shoulder just like he had done before, and sensually rubbed her hand over his chest. Eventually, she rested her palm above his heart.", "In the next moment, Seol Jihu abruptly turned his face back.", "“Otherwise, I—”", "Vulgar Chastity couldn’t finish her sentence. Seol Jihu had opened his mouth like a beast and pounced like a tiger.", "Crack!", "Along with the sound of flesh being bitten…", "“Kyaaaak!”", "The suddenly attacked Vulgar Chastity let out a high-pitched shriek. She tilted her head up and felt that something was missing on her face.", "Vulgar Chastity widened her eyes and looked down. There, she saw that Seol Jihu had in fact, bitten off her nose.", "“You…!”", "By now, Vulgar Chastity had abandoned all thoughts of adding the young man to her collection. When she strengthened her hair with the intention of severing his limbs, a brilliant white light suddenly erupted from Seol Jihu’s body and completely scorched her hair.", "Vulgar Chastity backed off in fright, and a ray of light shone down from the sky. Hundreds of stars shot down just as she went ‘Ah’.", "Requiem of Stars. There was significance to the fact that Seo Yuhui used an area of effect skill while maintaining the cages of light. It meant that she was now focusing her attention on supporting Seol Jihu.", "As this meant that most of her army had been wiped out, Vulgar Chastity erupted in fury.", "“You motherfucking biiiiiitch!”", "The earth split and lava burst out from the cracks.", "As the heaven and earth rumbled, Seol Jihu spat out the nose he was chewing on. Grabbing the spear that dropped down, he kicked off the ground. Not toward Vulgar Chastity, but in the opposite direction.", "When Seol Jihu ran forward in a hurry while avoiding the pillars of lava erupting from all over the ground, Undying Diligence dropped his jaw.", "“Why? Why me!?”", "In that instant, he gave up on defending. When he gathered up the energy he was using to treat his injuries, a blood-colored energy spread out like a fog.", "Seol Jihu smirked. He knew he shouldn’t let his guard down against a famed Army Commander, but he knew just how badly injured Undying Diligence was.", "“Just why!?”", "Undying Diligence swung his blood-soaked arm, but that was when Seol Jihu suddenly scattered like mist. When he tilted his head up to see the enemy who reappeared in the air after disappearing right in front of his eyes—", "“!”", "Undying Diligence flinched. He struck his elbow backward without even looking.", "Thwack! He felt something. Seol Jihu must have used Ethereal Shift consecutively as he was already behind Undying Diligence. Clearly struck by Undying Diligence’s elbow, Seol Jihu’s head was turned 90 degrees to the side.", "“Oww, my head.”", "However, he immediately straightened his neck and swung his spear.", "“You disgusting son of a bitch.”", "“You’re the one to talk!”", "The frustrated Undying Diligence grabbed the descending spear shaft, threw it to the side, and charged forward. The entangled human and vampire rolled on the ground.", "As soon as they stopped, Seol Jihu swung his two fists, but Undying Diligence quickly reached out and grabbed his hands.", "A battle of strength started once again. The interlocked hands trembled violently and two opposing energies intertwined like a dragon and a tiger. It was a true dogfight.", "But rather than being flustered, Seol Jihu seemed to welcome this instead. After all, such fights were his specialty.", "He had fought like a dog and rolled in mud or piles of shit if he needed to. That was how he had survived in Paradise and eventually reached its final battle!", "“Just why!?”", "Undying Diligence glared at Seol Jihu hatefully while lying down on the ground.", "“What enmity do you have with me that you’re going so far!?”", "His roar was full of resentment.", "“Pft.”", "Seol Jihu burst out laughing. That surely wasn’t something an Army Commander should say, especially Undying Diligence. That just showed how cornered he currently felt.", "“Do I look like a fool?”", "Seol Jihu revealed his teeth dripping with blood.", "“Why? What, so you can eat the corpses lying around here while I fight Vulgar Chastity and come back reinvigorated? You want me to watch that happen?”", "When his intentions were exposed, even more resentment stained Undying Diligence’s face. He suddenly opened his mouth, and his tongue shot out like a thorn and aimed for the young man’s neck.", "Tang! Before the tongue could pierce the neck, a white disc formed in front of it and blocked the attack.", "“You done?”", "After a smirk, Seol Jihu headbutted him with all his strength. As soon as his forehead struck Undying Diligence’s eyes, the latter’s vision turned dark.", "As a result, he couldn’t see the elbow dropping down on his face as soon as the forehead came off.", "Crack!", "“Kuheuk!”", "Undying Diligence’s eyes rolled backward at the pain of having all of his teeth fall out.", "No, they didn’t have time to even roll backward, because he felt two hands forcefully enter his mouth in the next moment. Undying Diligence shuddered as he felt the hands pulling his mouth in opposite directions.", "Meanwhile, Seol Jihu spread his arms out with force.", "“Kuhuaaaaak!”", "Along with the sound of flesh being torn, Undying Diligence’s cries rang out desperately.", "Dusting off the rag-like flesh his hands were clutching onto, Seol Jihu interlocked his fingers. Gathering his energy in his hands, he raised his arms up high.", "Immediately after his fists shot up to pierce through the sky, he scrounged every ounce of strength he had left and slammed down at the enemy’s chest.", "Craaaack! His hands smashed Undying Diligence’s bones, breaking through his spines and slamming down on the ground.", "BOOM!", "As the earth rumbled, Undying Diligence’s body also bounced up."]}