{"cid": "231", "title": "Chapter 231. Internal Crackdown (2)", "content": ["The group arrived at Haramark. They didn’t go to Carpe Diem’s office right away, but instead went to the temple.", "Kim Hannah, who requested to see the soon-to-be organization’s storage box, dropped her jaw at the mountain of wealth.", "“This… is just a part of it? Not all of it?”", "[No!]", "Flone suddenly popped out.", "Kim Hannah flinched, but she wasn’t all that surprised. It was because Seol Jihu had already introduced Flone to her on the carriage ride back.", "Kim Hannah was shocked at first to see a ghost as a comrade, but she quickly got used to it, saying it probably wasn’t all that abnormal in Paradise.", "[Do you think the Rothschear House was only living off a few hundred gold coins? At our prime, we made transactions worth tens of thousands of gold coins!]", "But when Kim Hannah still looked doubtful, Seol Jihu opened his mouth.", "“We’ll have to go there to know for sure, but I think the chances are high. If this information was false, we wouldn’t have found the inheritance we already did.”", "“…Right.”", "Kim Hannah agreed, then took out a small notebook and a pen from her upper shirt pocket. Opening the bags one by one, she hummed joyfully while moving her hand quickly.", "“What are you doing?”", "“Doing my job as the property book officer.”", "Kim Hannah spoke while continually taking notes.", "“We have to organize them now. It’ll be more difficult if we do it later when there are more things to organize.”", "“Didn’t I show you the list Mister Kazuki came up with?”", "Seol Jihu took out a paper and flapped it in front of Kim Hannah, but she shook her head.", "“I trust his work, but that list doesn’t include your previous wealth. He didn’t convert items below number 4 either.”", "When Kim Hannah started nitpicking, Seol Jihu quietly put the paper away.", "“But there’s so much…”", "“Don’t worry, I’m almost done.”", "Kim Hannah spoke as if it wasn’t a big deal. This time, a look of doubt flashed across Seol Jihu’s face.", "“You got 1,200 gems from the last expedition… that’s really a lot. Their quality and size is uniform, so that should be…”", "Stealthily approaching Kim Hannah and peeking at her notes over her shoulder, he really saw most of the items written down.", "Her calculation speed was truly monstrous.", "“What are you going to do about the gems?”", "Kim Hannah turned around and asked.", "“Even though you have a lot, it won’t be difficult to find a buyer if you want.”", "“Oh? Where?”", "“Anywhere that has Magicians. You can just bring them to the Magician’s Guild and they’ll give you a good price.”", "“Are gems in high demand to Magicians?”", "Hearing this, Kim Hannah made a dumbfounded face.", "“Of course. Paradise’s gems carry mana. On top of being an important medium in alchemy, they’re needed for the other six, no three systems.”", "“Systems?”", "“You… In Paradise, magic is categorized into seven systems, depending on their application method and discipline — soul manifestation, anti-evil, summoning, alchemy, elemental, white magic, and black magic. Among these, white magic and black magic were lost along with the Empire’s collapse. The heritage of anti-evil magic apparently disappeared a long time ago after being defeated by followers of black magic.”", "Kim Hannah gave a clear explanation.", "Seol Jihu scratched his head and spoke.", "“Oh, so they’ll be perfect for recruiting Magicians and supporting them.”", "Kim Hannah smiled bitterly.", "In Paradise, Magicians were like the stars in the night sky. Just running into one was hard enough. There was no need to even mention recruiting them.", "What Seol Jihu just said was counting his chickens before they hatched, but she didn’t dare to call it absurd.", "Because if it was him, she really thought he would achieve it.", "*", "After the calculations ended, Seol Jihu held Kim Hannah’s hand and headed to Carpe Diem’s office.", "“Come in. It’s a shabby place though.”", "“…It really is.”", "Kim Hannah gave her honest opinion without holding back. This reaction was expected as she had been living in a grand luxury mall and was now moving to a dilapidated building.", "“This will be your room from now on. Even if you’re a little uncomfortable, just be patient until we move.”", "Seol Jihu smirked after guiding Kim Hannah to her room. For some reason, seeing Kim Hannah unpack her bag made him laugh.", "Next, Seol Jihu moved busily.", "The moment he had been waiting for was finally here.", "Now that he had an administrative professional, no one could stop him.", "“…What are you doing?”", "Kim Hannah asked seeing Seol Jihu pack up his belongings one by one.", "“Oh, I’m going to Huge Stone Rocky Mountain.”", "“Huge Stone Rocky Mountain? Why are you going there?”", "“Isn’t it obvious? To train!”", "“Traaaain?”", "Kim Hannah trailed the end of her speech.", "Her eyebrows also perked up, but Seol Jihu was too busy packing to notice.", "“Yep. I became a High Ranker, but my Status Window is the same as when I was a Level 4. Not being able to train was driving me crazy.”", "Seol Jihu spoke with a bright smile.", "After packing up his bag, he placed his hand on Kim Hannah’s shoulder and shouted, “Take care! Let me know if anything happens!”", "Kim Hannah was about to pass out from the absurdity of Seol Jihu’s statement, but Seol Jihu turned around with a cheerful smile.", "Of course, Kim Hannah grabbed the nape of his neck before he could take a single step.", "“What?”", "“What? You said, what!?”", "Kim Hannah’s hot-temper was ticked on.", "“Hey, are you cra—”", "Gulp.", "But suddenly, her throat drew a huge gulp. Her face was shaking in anger, but she forced herself to smile.", "She opened her mouth with a face that clearly said ‘I’m really angry, but I’ll let it go for now.’", "“Jihu.”", "“Yeah.”", "“You said you’re going to make an organization. That’s why you brought me in.”", "“Yeah!”", "“And I just came. This is my first day here.”", "“Yeah?”", "Seol Jihu sure knew how to answer.", "But his face seemed to say, ‘So what?’", "“Then shouldn’t you at least— keuk!”", "Kim Hannah groaned before finishing her sentence. The veins on her forehead popped.", "I followed you and came all the way to Haramark…", "Mumbling grumpily, she began to boil with anger.", "“Listen, you twat.”", "In the end, she threw off her nice-girl mask and grabbed Seol Jihu by his collar.", "“Uek—”", "“Are you mad? What? Train?? Call your common sense and tell it to come home this instant!”", "“W-What’s up with you all of a sudden—”", "“This is my first day here. You call yourself a leader and you don’t even know how to weigh the importance of a matter? Why isn’t formally introducing me to the team, telling me about Carpe Diem, and talking about how to make an organization the first thing on your mind?? Hmm? Hmm?”", "Kim Hannah shook him angrily, unable to rein in her pent-up anger.", "“Is talking the only thing you know how to do? What? You’ll make me happy? Tough words for someone who’s mistreating me before it’s even my first night!”", "“Uuuuuek—”", "Seol Jihu’s head flopped back and forth…", "[Mueeeeeee—]", "And so did his pendant.", "*", "In the end, Seol Jihu was forced to unpack his bag and explain every single thing about his plan and Carpe Diem to Kim Hannah.", "‘She could have just found out slowly…’", "Why does she have so many questions?", "Kim Hannah nitpicked every single thing he said, and it wasn’t until the next morning that he was set free.", "On the other hand, he was a bit worried.", "When he finished his long story, Kim Hannah twinkled her eyes saying, ‘Iya~ So we have more places to extort money from. Great, let’s secure our funding first.’", "Seol Jihu didn’t understand just who she planned to extort from, but decided to simply watch over her.", "That morning, Seol Jihu summoned everyone to the office.", "It was to officially introduce the new member of the team.", "“I’m Kim Hannah. Team Leader Seol Jihu offered me a chance to join the team. Please take care of me from now on.”", "Dressed formally as always, Kim Hannah gave a short introduction.", "Everyone reacted pretty much the same way.", "With a look that said, ‘Why did she come?’", "Having heard the story yesterday, Jang Maldong opened his mouth calmly.", "“Nice to meet you. I didn’t expect Sinyoung’s famous scout to come, so I’m a little taken aback.”", "“To be honest, I feel the same way. It’s an honor to meet you, Master Jang.”", "“Since I’ve already seen you a couple of times, I’ll save the long greeting. Do you mind explaining what happened…?”", "“As I said before, I simply accepted Seol Jihu’s offer. Of course, there is an inside story, but it’s a private matter. I hope you can understand…”", "“Mm, excuse me.”", "Jang Maldong nodded his head and didn’t dig into it any deeper.", "“I’m sure you all are wondering why I am here.”", "Kim Hannah cleared her throat and addressed the room.", "“It’s simple. Team Leader Seol Jihu wants to develop Carpe Diem into an organization and has asked me for help.”", "No one reacted strongly. Seol Jihu had already explained during the carriage ride, and they had let the Yi siblings know about it too.", "Jang Maldong knew beforehand as well.", "“So, while helping Carpe Diem register as an organization…”", "Kim Hannah enunciated each word clearly, like someone giving a presentation to board members.", "“I plan to handle Carpe Diem’s future administrative duties. From little things to acting as the proxy leader when he is missing.”", "She drew the line from the get-go.", "Proxy leader. It went without saying that this was not a position that was given to just anyone.", "“Does anyone have any questions?”", "She called it a question, but she was really asking whether anyone had any objections.", "The teammates all had complex expressions.", "Given Chohong’s personality, she would surely raise her fist first if someone walked in and talked so arrogantly.", "But the woman talking was Miss Foxy, Kim Hannah.", "She was a publicly recognized master of administrative work.", "Chohong had no choice but to change her mind. Frankly, given Carpe Diem’s current situation, she should be moved to tears and say, ‘Aigo~ welcome, welcome. Thank you for coming.’", "And so, Chohong lightly clasped her hands.", "Chak, chak, chak, chak…", "As she started giving short, intermittent claps, the other team members also started to clap one by one.", "Kim Hannah bowed with a smile.", "Chohong scratched her head.", "“I have a ton of questions, but it’s a bit hard to ask them since you said it’s a private matter. Anyway, Seol coaxed you and you’re staying with us from now on.”", "“That’s right. As a member of Carpe Diem.”", "Most people would flinch when they met Chohong’s uniquely bleak eyes, but Kim Hannah replied without batting an eye.", "“Welp, I don’t know what happened…”", "Chohong let out a sigh.", "“But I trust Seol. I’m sure he brought you in because he trusts in you too.”", "She crossed her arms and pointed at the door with her chin.", "“Wanna go for a drink at the pub? As a welcoming party.”", "This was Chohong’s way of welcoming her.", "Seol Jihu glanced at Kim Hannah. He was curious about how she would react.", "“I’d be happy to.”", "Kim Hannah unexpectedly replied with a smile.", "But that only lasted a moment.", "“But there are a few things we need to take care of before then. The welcoming party can wait, right?”", "“A few things to take care of? Now?”", "“Yes, everyone is here, so it’s perfect. First, can you take a look at this?”", "She put on her business face and took out several pieces of paper before handing one to each person.", "“…A contract?”", "Chohong furrowed her brows after taking the paper.", "“You want us to sign a new contract?”", "“Every organization needs to have formal contracts in order. Especially for when they hire new recruits.”", "Kim Hannah continued with a monotonous voice.", "“But, since you all are considered founding members, it is my opinion that you don’t need to write a contract.”", "Permanent affiliation. It was a special right that only the founding members of an organization could enjoy.", "In other words, they were being recognized for their work in founding the organization and being guaranteed a place.", "“Right.”", "Chohong nodded.", "But here, Kim Hannah added a twist.", "“So isn’t it reasonable that you all contribute to creating the organization?”", "Hearing this, a few faces went stiff. They had understood what she was getting at.", "“…You want us to pay.”", "Chohong laughed bitterly.", "“It’s an investment. Carpe Diem has an infinite potential for growth even in my eyes.”", "Kim Hannah retorted eloquently.", "“Come to think of it, you all received a hefty sum from the recent expedition…”", "She licked her lips like a hawk eyeing its prey.", "“I’m not expecting much. Including the land purchase expense, construction expense, and initial maintenance expense… you just have to invest 20 percent of what you received from the Pagoda of Dreams expedition.”", "Bitter groans rang out from each corner of the room. But it was also true that they couldn’t complain.", "Kim Hannah’s request was completely reasonable, and it was clear that Seol Jihu would be paying for most of the expenses. Compared to him, paying only 20 percent was both sensible and reasonable.", "“That, um… do I have to pay?”", "Hugo asked carefully.", "“No, you aren’t forced to.”", "Hugo’s eyes flickered at Kim Hannah’s answer. Then…", "“But, you’ll have to sign the new contract I will draft.”", "He quickly became sullen again.", "What Kim Hannah was saying was simple—", "Carpe Diem will eventually develop into a colossal organization, so give a helping hand if you want to receive proper treatment as its founding member. If you don’t want to, then fine. But don’t even dream about asserting any rights when Carpe Diem flourishes.", "He who does not work shall not eat.", "No one could argue against this perfect capitalistic logic.", "Of course, they would be able to receive a sign-on bonus if they signed the contract, but that would be it.", "They would be temporary employees, strictly speaking. There was no guarantee what would happen to them once the contract expired.", "At least, as long as Kim Hannah was here.", "“Well, I see your point…”", "Chohong smacked her lips and asked.", "“But even 20 percent is a lot if you get it from everyone. How do we know you’ll use it properly?”", "“Don’t worry. The leader will be in charge of managing the funds, and I will go through proper procedures to request for funding.”", "Since she was going this far, there really wasn’t anything more they could say.", "Chohong let out an empty chuckle.", "“I understand there’s nothing we can do for founding expenses. But do we also need to pay a cut of our future profits and contribution points?”", "“Of course.”", "Kim Hannah admitted without batting an eye.", "“But, it’s too early to discuss that specific issue. Since you all are helping out, the organization will also need to prepare a system to repay your commitment to it. This issue can be discussed then.”", "“Chet, then I got nothing more to say.”", "Chohong put her hands in the air while shaking her head.", "Seol Jihu couldn’t hide his shock. Kim Hannah had acquired and secured a large amount of funding in just a few minutes.", "Since she was justified, no one raised any objection, though they might feel a little bitter inside.", "“Okay, next.”", "Flip. Kim Hannah turned to the next page of her notebook and turned her attention elsewhere.", "“Miss Phi Sora?”", "“…Me?”", "Phi Sora, who was listening quietly, widened her eyes.", "“Longsword, shield, armor… the equipment you have right now. They’re all borrowed, correct?”", "Phi Sora subconsciously looked down at her body.", "“I’ve been told you borrowed them for the war.”", "“These are mine.”", "Phi Sora spoke up, not wanting to return the equipment so easily.", "Kim Hannah tilted her head.", "“They’re yours?”", "“Yes, he said they were mine…”", "The two women’s gazes turned to the same place.", "Seol Jihu shook his head firmly.", "Kim Hannah faced Phi Sora with sharp eyes.", "“I believe the equipment you’re wearing right now are items Seol Jihu obtained from the Banquet. I would like to know why you claim them to be yours.”", "Phi Sora clenched her lips before dropping her head.", "‘Because Seol Jihu made fun of me’ sounded too dumb, even in her ears.", "“I did him a favor last time, and he promised to extend the rental period…”", "“Yes, yes, I heard. But the important thing is that the exact duration hasn’t been clarified.”", "Kim Hannah snorted quietly.", "“You and I can discuss this matter separately. Ah, the same goes for you, Mister Marcel Ghionea.”", "“I have a request.”", "Marcel Ghionea spoke up as though he had been waiting for his name to get called.", "“Is it possible to buy equipment? I’m very fond of this crossbow.”", "Kim Hannah smiled.", "“You will have to negotiate with its rightful owner. With me, you will only be setting the exact rental period.”", "Marcel Ghionea nodded.", "Kim Hannah flipped her notebook page again.", "“Finally… Miss Yi Seol-Ah and Mister Yi Sungjin.”", "“Y-Yes?”", "Shrinking because of the heavy atmosphere, Yi Seol-Ah asked in a startle.", "“The two of you need to have a talk with me as well.”", "Yi Seol-Ah seemingly had no clue why Kim Hannah wanted to talk to her. On the other hand, Yi Sungjin seemed to have an idea as he nodded his head silently.", "“That is all.”", "Tak. Kim Hannah closed her notebook and smiled cheerfully.", "“First, Miss Phi Sora and Mister Marcel Ghionea. Shall we go talk somewhere private?”", "With that, she turned to the sleeping quarters.", "Clack, clack. The sound of high-heels grew farther away.", "Marcel Ghionea stood up and calmly followed her, while Phi Sora hurriedly chased after them after brooding over the matter.", "Seol Jihu couldn’t hide his astonishment as this was the first time he was seeing Phi Sora not saying anything like an obedient lamb.", "To be honest, he wasn’t sure if this was a dream or reality.", "‘Wow…’", "Kim Hannah had completely whipped Carpe Diem into shape from day one.", "She made such a strong first impression that he was worried someone would rise up in defiance.", "In any case, what was important was that the wind of change finally began to blow in Carpe Diem.", "Although it was a stormy wind and not a gentle breeze, everyone had their choice whether to stand firm or be blown away.", "‘Whew…’", "Seol Jihu sighed inwardly before widening his eyes. While everyone was maintaining an awkward silence…", "“….”", "Only Jang Maldong was wearing a faint smile."]}