{"cid": "376", "title": "Chapter 376. Sentiment Du Fer (2)", "content": ["‘It’s over.’", "The pair thought as they looked up at the slope.", "It was obvious what would happen next.", "He would fall, be crushed, and be trampled to death.", "And then what? What would happen to Seol Jihu once he revived at the starting point?", "Just as their thoughts reached this point, the pair set out in opposite directions. Black Seol Jihu headed for the peak, while Baek Haeju ran towards the starting point at the bottom of the slope.", "However.", "‘…’", "Seol Jihu’s face remained calm throughout. With his eyes half-closed, he seemed surprisingly serene for a bomb that was about to explode.", "It was because he was used to this.", "It didn’t hurt. He still felt pain, but the pain was so familiar that he didn’t feel the need to squirm.", "Death didn’t scare him. He had already died many times, and there was no reason this one would be any different.", "His head was empty, devoid of any thought, as though everything had been scooped out.", "Nonetheless, Seol Jihu knew— no, he sensed that the boulder had just hit his temple, that his palms had slipped, and that he was in the process of falling.", "Right, this time wasn’t any different. He would die just like he’d done thousands of times before.", "But even if he inevitably died, there was something he wanted to do.", "Let’s go. Let’s go.", "Let’s just take one more step.", "Let’s advance further even if it’s only by a single step.", "From his body that was devoid of all else, only his will remained, screaming at the top of its lungs.", "He wasn’t seeing. He wasn’t thinking. Now, he wasn’t even perceiving.", "And the moment he let himself go to the last bit of consciousness that remained in his body, Seol Jihu forgot about himself.", "He had fallen into a trance.", "And so, the will to climb led Seol Jihu to move forward.", "It wasn’t anything difficult. After all, he had repeated this motion hundreds of thousands or even millions of times.", "Going beyond the level of instinct and habit, he was guided by movements that were instilled into his body through machine-like repetitions.", "“!”", "Black Seol Jihu, who was rushing up the slope like a storm, widened his eyes.", "Seol Jihu’s head, which was tilted back, leaned forward again. His half-raised feet stomped down on the slope again. His helplessly bending knees stopped. His legs and waist trembled, and his tottering legs slowly began to straighten.", "Black Seol Jihu subconsciously stopped rushing forward. He stared in front of him fixedly.", "He thought that this would be the end, but Seol Jihu stopped mid-collapse and was bouncing back up like a roly-poly toy.", "He had succeeded in standing back up in the last of the last moment.", "Seol Jihu had clearly lost all senses. His body had lost balance and was shaking like a reed.", "Even so, his arms were creaking up like a broken machine.", "‘Don’t tell me.’", "Black Seol Jihu took a deep breath.", "Due to his heightened focus, he could see every minute movement that Seol Jihu was making, but it didn’t take long for the situation to take a turn.", "Three seconds? Four seconds?", "‘It must be.’", "Perfect Harmony — the state of one’s will and actions becoming whole without the slightest difference.", "“Don’t think!”", "Black Seol Jihu burst out.", "“That’s it! Accept that state and let your body do as it wants!”", "He knew that Seol Jihu couldn’t hear him with his shattered eardrums.", "He just couldn’t help it.", "Then, as if to respond, Seol Jihu’s upper body leaned forward, and his arms stretched out.", "In that instant, Black Seol Jihu could very clearly see.", "Kwang!", "Sparks flaring up from the bomb — at least, that was what it seemed like to Black Seol Jihu.", "There was one thing he could be sure of.", "And it was that Seol Jihu was standing firm, holding up the boulder.", "Going beyond just standing, he was raising his leg.", "“Right, just one more time…!”", "Eventually, as other boulders rolled down from the crossroads, Seol Jihu pushed the boulder in his hands and took a step forward.", "Black Seol Jihu clenched his fists.", "At the same time—", "Kwang, kwang, kwang, kwang, kwang!!", "The bomb finally exploded.", "It was an intense, radiant firework even in Black Seol Jihu’s eyes.", "*", "Seol Jihu raised his index and middle finger the moment he revived at the starting point.", "However, he paused before he stabbed his eyes like a machine.", "‘…Huh?’", "Messages had popped up before he noticed. Not just one, but several.", "[Temperament, ‘Tenacity’, evolves to ‘Superhuman’.]", "[Temperament, ‘Short-tempered’, is expunged.]", "[Aptitude, ‘Heart and Soul as One‘, is created.]", "[Class Ability, ‘Perfect Harmony’, is created.]", "[Miscellaneous Ability, ‘Intuition (High)’, evolves to ‘Intuition (Pinnacle)’.]", "[Please check your Status Window.]", "Seol Jihu blinked rapidly.", "His arm slowly fell.", "[Your Status Window]", "[2. Traits]1. Temperament—Self-command (Suppresses emotions, greed, and impulses with the rational will)—Competitive (A desire to win)—Superhuman (Unbelievably exceptional in enduring pain and hardship when compared to an average human being)", "2. Aptitude—Effort (Endeavors with both body and mind to achieve a goal)—Heart and Soul as One (Unfaltering and unwavering when concentrating on one thing)—Average (Normal in every way; possesses no particular talent)", "[4. Abilities]2. Class Abilities (6)—Perfect Harmony (Lowest)", "3. Other Abilities (3)—Intuition (Pinnacle)", "Seol Jihu’s pupils livened up as he stared at his status window.", "‘I…’", "To be honest, he wasn’t sure what he was doing a moment ago.", "He could only vaguely recall one thing. Thinking over and over again— Climb up.", "“…Ah, damn it.”", "He felt like he sensed something. Even now, the sensation from when he stretched out his arms seemed to be lingering around his body. He just didn’t know what to call this sensation.", "Seol Jihu plopped down on the ground and sat cross-legged. Feeling the need to recall and analyze the sensation he just felt, he calmly meditated on his previous state.", "How much time went by?", "Seol Jihu opened his eyes by the time his heated body cooled down to a degree.", "‘This is driving me nuts.’", "As he was tilting his head, he suddenly caught sight of someone.", "Black Seol Jihu was leaning on the boulder, looking at him.", "When their eyes met, Black Seol Jihu grinned.", "“When are you vomiting blood?”", "“…Huh?”", "“You know, it happens. A cross-legged martial artist meditating on an insight he just gained, spurting out blood reeking with a foul stench, and then becoming enlightened.”", "Seol Jihu laughed blandly. He didn’t feel like what just happened was worth being called enlightenment.", "“My temperament and aptitude changed.”", "“It’s about ti… What? Your aptitude changed too?”", "Black Seol Jihu’s eyes widened.", "“Your talent aptitude? It’s not Average anymore?”", "“No, my talent is still the same. I got something called Heart and Soul as One.”", "“Ah…”", "When Seol Jihu shook his head, Black Seol Jihu looked a little regretful.", "“I guess my aptitude only changed when I got Seamless Sublimity. But Heart and Soul as One isn’t bad either. It has wide-ranging applications, including battles, training, and intercourse.”", "“Oh, that’s good to h… Huh? In what?”", "“Intercourse. I’m talking about sex, you dolt.”", "“What does Heart and Soul as One have to do with sex?”", "“You’ll know once you try. Girls will love it too.”", "Seol Jihu was taken aback.", "Black Seol Jihu asked again, simpering.", "“Anyways, and?”", "“Intuition ranked up to Pinnacle.”", "Chak! Black Seol Jihu clapped. He murmured, “Nice.”", "He then gestured with his chin, telling Seol Jihu to go on.", "“I got a Class Ability called Perfect Harmony…”", "Seol Jihu smacked his lips.", "“But I don’t know. I’m not sure what state I was just in. Do you know what this is?”", "“Isn’t it obvious? That’s what you call a realm.”", "“?”", "“A domain where your will and actions become one without the slightest difference. It looks like it’s the stage before reaching the balance of mind, technique, and body. Trinity Harmony, if you will… Well, you probably won’t understand if I explain it like this, so just think of it as something that’s slightly better than One With the Spear.”", "“Realms also have ranks?”", "“Why wouldn’t they? With my Seamless Sublimity realm, I beat the hell out of Sung Shihyun, who was boasting about his One With Nature realm.”[1]", "Seol Jihu scratched his head.", "He thought he would finally grasp what realms really were, but they were vaguer than he thought.", "“It’s like that at first. To someone who’s lived as an ordinary person for over twenty years, it makes sense that it would seem strange. You’ll slowly get used to it.”", "Black Seol Jihu took his back off of the boulder and approached Seol Jihu. He stopped right in front of him and then spoke with a gentle expression.", "“And also…”", "It was then.", "Seol Jihu, who was curiously waiting for Black Seol Jihu’s following words, sharply widened his eyes and instantly turned away.", "A middle and index finger brushed past his eyes by a hair’s breadth.", "“….”", "When Seol Jihu glanced to the side, he saw a grinning Black Seol Jihu.", "“Your reaction speed really has improved. Compared to three years ago, that is.”", "“?”", "“Back then, you only winced and weren’t able to dodge.”", "Seol Jihu finally did a double-take. Though he had not seen Black Seol Jihu’s movement, he had felt it instinctively and moved accordingly.", "It seemed to be the result of Intuition and Perfect Harmony working in unison.", "Because of this, he felt like he now had a better understanding of his new realm.", "“If you want to learn from experience…”", "Black Seol Jihu stretched out his arm.", "The Spear of Purity drew an arc in the air and flew into his hand, which he then handed over to Seol Jihu.", "“Reinforced sword qi might be a bit difficult, so try using sword qi.”", "“Sword qi?”", "“Go to the first peak and try moving your mana.”", "Black Seol Jihu raised his spear.", "Woong, woong! And for some reason, the Spear of Purity was buzzing as well.", "Grabbing the Spear of Purity, Seol Jihu ran to the first peak. After confirming the message of the restriction on the use of mana being lifted, he collected his breath and moved his internal energy. In that instant—", "“Ah.”", "Finally. He finally felt the change.", "The flow of mana had slightly changed.", "In the past, he would have to think about using a skill before guiding his energy and materializing it. But now, his mana was moving fluidly along with his will.", "Though the difference was small, to him, it felt completely different.", "It was as if he became one with his energy, so much so that he thought his mana was somehow reading his mind.", "It was like he was in a whole new world.", "“Do you finally understand why I said High Rankers’ sword qi is only an imitation?”", "Black Seol Jihu’s voice rang out from the back.", "Seol Jihu nodded his head unwittingly. He really did understand what Black Seol Jihu meant by that.", "Seol Jihu tightened his grip on the Spear of Purity. He no longer had to go through the process of connecting his internal circuit and carefully sending his energy through it.", "Because he was one with mana.", "And it was the same with the Spear of Purity.", "In an instant, energy that carried his will seized the Spear of Purity.", "Wooooong!", "The moment he felt a sense of unity with the entirety of the spear, the Spear of Purity let out a silvery ringing and sharply shot out the energy it carried.", "Not only was the speed of materialization incomparable to before, its cutting power and destructive power seemed to have doubled at the very least.", "But that was only the beginning. The sword qi continued to grow bigger, shooting up above his head before settling back down. It shortened and elongated at will, kind of like Sun Wukong’s magical staff.[2]", "That wasn’t all. When Seol Jihu swung the spear in a wide motion, sword qi shot out from the spear blade and flew far into the distance. It could be shot out in a spear-shape or a crescent-shape.", "‘So this is what it was!’", "Seol Jihu recalled the time Baek Haeju attacked Black Seol Jihu by forming a net from her sword qi.", "He was impressed when he saw her destroying the rolling boulders by firing dozens of sword qi simultaneously, but now he thought he could do the same with a little bit of practice.", "And this hunch soon became a reality.", "Ding!", "[Class Ability, ‘Sword Qi (Intermediate)’, evolves to ‘Secret Art: Sword Qi Wave (Lowest)’.]", "A pleasant alarm rang out.", "Seol Jihu was struck speechless.", "He had instantly learned a Secret Art, which could not be learned even with contribution points and was regarded as the highest-ranked Level 7 skill. Meaning, learning skills that were below Level 7 would not be so difficult either.", "As always, the bitterness of hardship and the sweetness of success were comparable.", "The fruit of his labor was just too sweet. It was more than enough to quench the thirst that was burning his throat.", "“How is it?”", "Black Seol Jihu asked while Seol Jihu excitedly sent one flying sword qi after the other.", "“Doesn’t the second trial seem like a child’s play now?”", "Seol Jihu turned around in a hurry and nodded with a cheerful smile.", "All he had done was enter a so-called realm, but the world looked different in his eyes.", "“Huuuuu.”", "Black Seol Jihu suddenly let out a deep sigh. He crouched down and then smiled bitterly.", "“Aigoo, it’s been a long time since my heart pounded this badly. You succeeded just when I was about to give up… Whatever, it’s good that you succeeded. Pinnacle-rank Intuition and Perfect Harmony are enough. All that’s left to do is leap up.”", "Jang Maldong had called Intuition a stepping stone. Since he had reinforced his stepping stone and attached a powerful spring below it called Perfect Harmony, all he needed to do now was use it to soar to the sky.", "“I want to start right away, but… why don’t we get rid of that first? It will be a nice change of pace.”", "Turning to the place where Black Seol Jihu was pointing, Seol Jihu’s eyes widened. He saw three or four shopping bags with bento boxes spilling out. He even saw a thermos.", "“What are they?”", "“I don’t know. Haeju brought it. I even specifically told her she didn’t need to…”", "Seol Jihu looked around reflexively. However, Baek Haeju was nowhere to be seen.", "“I don’t see her…”", "“She either left or she’s hiding somewhere watching. Anyway, let’s eat.”", "Black Seol Jihu picked up a bento box and opened it. Seol Jihu also joined in.", "“Oooh…”", "Seol Jihu exclaimed each time he opened a bento box. White rice, radish namul[3], vegetable pancakes, marsh snails… there was soybean soup as well. They were all Seol Jihu’s favorite food.", "Though he didn’t know why she was treating him so well, he inwardly gave his sincerest thanks.", "Soon, the two men began to eat while sitting across from each other.", "Putting marsh snails into the soybean soup as a garnish and then taking a spoonful, a wonderful flavor burst inside Seol Jihu’s mouth. As he tasted the chewy texture of the marsh snails and the delicate warmth of soybean soup, a smile bloomed on his face.", "It was so delicious that he wanted to lie down and just loaf around.", "“Good, isn’t it?”", "Black Seol Jihu sniggered, seeing Seol Jihu with bulged cheeks.", "“They say hunger is the best sauce, but it really can’t beat the circumstances. Eat to your heart’s content. Even if you eat the same food next time, it will be difficult to taste the same flavor.”", "Seol Jihu immediately understood what he meant.", "While the food was good, it wasn’t to the point of dropping everything and loafing around. The reason the food tasted so good must be because he was drunk on a sense of accomplishment.", "He wanted to taste this flavor again.", "“Alright, once we’re done with this, let’s start with Thousand-Ton-Pushing Strength.”", "Black Seol Jihu spoke as he mixed white rice, sesame oil, and radish namul.", "“Thousand-Ton-Pushing Strength? Isn’t that the martial arts technique where you use the strength of a finger to move a thousand ton?”[4]", "“Good, so you know. Simply put, it’s just a skill that uses little strength to wield great strength.”", "Seol Jihu frowned while stuffing his mouth with rice. It sounded like an amazing skill, but he couldn’t help but think of the boulder.", "“You should have taught that to me earlier then…”", "“You think I didn’t want to?”", "Black Seol Jihu snorted. He licked the spoon that was ridden with sesame oil and then asked.", "“72 times 24 divided by 12. Give me the answer.”", "“One hundred and forty-four.”", "Seol Jihu answered right away, though he wasn’t sure what for.", "Black Seol Jihu, who asked apathetically, flinched and furrowed his brows.", "“Oh yeah, I was good at mental math back then. Alright, then try 81,922,757 times 22,233,847, then divide that by 421,242.”", "“….”", "“Try answering that.”", "“I’m not a calculator, you know.”", "“You can’t, right?”", "Black Seol Jihu snorted again.", "“It might be difficult to do it mentally, but if you had a pen and a piece of paper, would you be able to calculate the answer?”", "“I guess so… It would take a while though.”", "“That’s it.”", "Black Seol Jihu chewed on the radish namul bibimbap.", "“You only now learned how to divide and multiply. How was I supposed to teach someone who only knew how to add and subtract?”", "“I kind of get what you’re saying…”", "“Good, because I’m dumbing it down for you. Perfect Harmony is at the post-grad level. You know, something you’d learn while working on your PhD.”", "Seol Jihu nodded. Then, he grabbed a vegetable pancake with his hand and chomped down on it.", "It was just so, damn delicious.", "*", "On the other hand.", "“But why are we starting with Thousand-Ton-Pushing Strength?”", "“Because it’s the most important skill. You already learned Floral Substitution. Though, it seems you don’t know how to use it properly because you picked it up in the confusion of the moment while fighting that dragon bitch.”", "“Yes.”", "“You can combine that skill with Thousand-Ton-Pushing Strength. If you can bring both of them up to High-rank, they’ll evolve to Grand Cosmic Shift. That’s the skill I used at the second peak.”", "“Oho!”", "“If nothing else, you need to learn Grand Cosmic Shift. You need it if you’re going to fight the Parasite Queen.”", "Just as Black Seol Jihu expected, Baek Haeju was watching the two Seol Jihus talk from a far off distance.", "“Grabbing the sky and the earth and shifting them in a big motion… Ah.”", "One was white.", "“Yep. You remember how she flipped the sky and the earth over in Tigol Fortress, right? If you had this skill, you would have been able to stand still, and the outcome might have been different.”", "One was black.", "The way the two Seol Jihus were sitting face to face, nibbling on vegetable pancakes…", "“…So cute.”", "It was like seeing twin rabbits merrily munching on grass.", "1. One With Nature means the harmony between oneself and an external object, objectivity and subjectivity, or mental realm and material realm. ", "2. The Monkey King’s staff. More info can be found on Wikipedia. ", "3. A type of salad. ", "4. The actual technique uses an old Korean unit of weight; the literal meaning is ‘using four nyang to wield the strength of a thousand kun.’ "]}