{"cid": "224", "title": "Chapter 224. Teresa’s Tears (2)", "content": ["It wasn’t until a fairly long moment of silence…", "“…Ah.”", "That Teresa finally reacted.", "“Ah, ah…”", "Her fair lips eked out meaningless sounds at a loss for words.", "Teresa smoothed her face down in a daze. She was belatedly doing her best to act fine, but a look of confusion spread across her face like a plague.", "“E-Excuse me?”", "In the end, she asked back pointlessly.", "There was no way she wouldn’t have understood the first time, yet she acted like she didn’t hear anything, just like Seol Jihu often did.", "Seol Jihu shoved his hands into his pockets. He had mixed feelings about this as well.", "After the air between them cooled down a bit, an indescribable emotion flowed into him. He didn’t know what to say as Teresa’s reaction had surpassed his expectations.", "It wasn’t a long period of silence that Teresa finally rekindled the conversation.", "“You’re lying… right?”", "“No.”", "Seol Jihu instinctively shut his mouth the moment he gave his answer. Teresa’s burning gaze had forced him to go silent.", "Her gaze wasn’t blaming or condemning him. It wasn’t a glaring look of betrayal either.", "Even so, Seol Jihu couldn’t open his mouth easily. In fact, he didn’t want to face Teresa, who had unknowingly straightened herself up and was staring at him fixedly.", "Eventually, Teresa’s tightly shut mouth slowly opened.", "“Why?”", "And the words she had been suppressing burst out.", "“Why? Why are you leaving all of a sudden? There has to be a reason, right?”", "Seol Jihu still didn’t answer. His desire to speak had vanished completely at the same time that his body seemed to sink down.", "With Seol Jihu maintaining his silence, Teresa looked like she was about to die of frustration; however, she soon feigned a smile and spoke gently.", "“I get it. You’re disappointed with the Haramark Royal Family. Right, I get it.”", "“No—”", "“Ei, it’s fine. I understand. I would be disappointed too. We haven’t treated Haramark’s War Hero properly—”", "“Princess.”", "Seol Jihu couldn’t bear to hear her anymore and stared at her straight on.", "“That’s not it at all.”", "He spoke firmly with a deep voice.", "Teresa paused. She took in a deep breath, her chest puffing out, and still maintained a smile on her face.", "“Ah, then is it about that? Is that why you came to hate Haramark?”", "She must be talking about the ‘Hero Besmirching’ incident. Seol Jihu shook his head.", "“It’s not that either.”", "Teresa spat out a sigh, then pushed her hair up.", "“If it’s not this and if it’s not that… then what is it?”", "“Let me be clear about this. It’s not that I’m dissatisfied with the Royal Family or that I hate Haramark.”", "“Then what is it!?”", "Teresa raised her voice in an instant. She quickly went “Ah” afterward. Her eyes widened and even her mouth opened wide as if she made a mistake.", "But now that her fuse had been lit, she kept going.", "“What is it? What’s the reason you’re leaving? Say something, please!”", "Seol Jihu quietly closed his eyes.", "“It’s because of Paradise.”", "“Paradise…?”", "“I have goals I want to achieve. Three of them, in fact.”", "He took a brief pause before continuing.", "“I’m leaving to achieve these goals. That’s it.”", "“Can’t you achieve them in Haramark?”", "“I can’t.”", "Seol Jihu said flatly.", "“Strictly speaking, these three goals are only intermediate steps to a final goal. They’re stepping stones to achieve what I really want to accomplish. Without even a single one of them, I won’t be able to reach my ultimate goal.”", "“….”", "“The important thing is that one of the three goals cannot be achieved in Haramark. That’s why I’m going to Eva.”", "“…And what’s that goal?”", "Teresa spoke with a feeble voice.", "“Maybe I can help you with that.”", "Her voice had subsided, but she was just as forceful as before.", "Seol Jihu sighed. This wasn’t something to be dragged on and on.", "“Okay.”", "So, he decided to ask straightforwardly.", "“Then do you have the confidence to become Sicilia’s enemy, Princess?”", "Teresa’s eyes widened. Seol Jihu continued without stopping.", "“I’m not saying this just to push you away. But if you help me, your relationship with Sicilia will worsen without a doubt. You might be friendly with them now, but Taciana Cinzia is not the type of person to condone anyone who will challenge her authority. This, I can promise.”", "Teresa was stunned. She was at a loss for words because she finally understood what it was that the young man wanted.", "This wasn’t a question she could answer easily. In the southern region, which included Haramark, even children knew of Sicilia’s name.", "And after the war, with Taciana Cinzia revealed to be the Executor of Sloth, Sicilia’s position in Haramark became indomitable like an impregnable fortress.", "It was just as Seol Jihu said. Carpe Diem raising an organization in Haramark with the Royal Family’s backing? Aiming for the partner position of the Royal Family?", "Sicilia would most certainly react to it negatively. In the worst-case scenario, there might be another repeat of Haramark’s past internal conflict.", "Teresa stuttered.", "“But, uh… do we need to become Sicilia’s enemy? It’s not like your relationship with them is bad either. Maybe it will work out…”", "Right, it could.", "Given Seol Jihu’s current relationship with Sicilia, Cinzia might allow his organization to prosper to a certain degree. But that would only be as long as Seol Jihu didn’t interfere with their current exercise of authority.", "But that wasn’t what Seol Jihu wanted.", "A single ship could never have two captains. Plus, Seol Jihu wanted to rise to a one and only throne.", "Interpreting Seol Jihu’s silence as a denial, Teresa clenched her teeth.", "“Seol… you are Haramark’s war hero.”", "A trembling voice flowed out.", "“To Earthlings, it might be different. But to the citizens of Haramark, you are their hero and hope. To the residents of Ramman Village, to the soldiers protecting the city, and to me…”", "“….”", "“But if you leave…”", "Teresa blurred the end of her speech, but Seol Jihu knew what she meant to say without having to hear it. Teresa appealed to sympathy, but Seol Jihu had already made up his mind.", "“…Even if I leave, I won’t ignore Haramark when it’s in danger.”", "Teresa shut her eyes. She had realized that nothing she could say would change Seol Jihu’s mind.", "Her tightly shut eyes waned.", "Her throat clogged up, and words no longer came out.", "In the end, she covered her face with her hands and dropped her head. Her rose-gold hair fell down like a waterfall.", "“How embarrassing…”", "A slightly tearful voice flowed out.", "“I.. I thought you’d develop an organization in Haramark… haha, I got excited all by myself…”", "Muttering to herself, she took her hands off her face.", "Her arms slumped down, her head still facing the ground.", "Seol Jihu lowered his head slightly in an attempt to look at Teresa’s face, then froze in place.", "She was crying.", "Tears had welled up around her beautiful eyes, and nudging her just a little bit would likely make them fall.", "“I had things I wanted to do… once this expedition ended…”", "“….”", "“If I knew this was a farewell expedition… I wouldn’t have accepted the offer…”", "Teresa tilted her head up. Blinking her eyes, she sniffled and looked up at the night sky.", "A gulp rang out, and Seol Jihu heard her turn around.", "“Sorry!”", "“Princess.”", "“I’ll go cool off a bit.”", "Teresa left those words behind and disappeared as if to run away.", "Seol Jihu spat out the breath he had been holding in all this while.", "He had expected to hear things he might not necessarily want to hear. But he had not expected Teresa to react so emotionally.", "He was flustered and at a loss for what to do as this was the first time he had seen Teresa cry.", "‘Princess…’", "Just where did she go in the middle of the night?", "Of course, he knew how strong Teresa was, and it was unlikely that any monster would be of any threat given their proximity to Haramark.", "He knew this, yet he looked around the area feeling restless.", "However…", "“….”", "Teresa did not return until it was time for the night watch shift to change.", "When he woke up the next morning, he saw Teresa curled up in a ball in a corner of the tent. Seeing as she was tossing and turning slightly, she must have stayed up all night.", "Seol Jihu thought about calling her, but decided against it and left the tent to make breakfast.", "On their way back to Haramark, the carriage was just as rowdy as before.", "Teresa also participated in the conversation excitedly. But while her mouth was smiling, her eyes weren’t smiling at all.", "Both Seol Jihu and Teresa knew not to ruin the atmosphere of a massively successful expedition.", "Seol Jihu replied appropriately, then looked out of the carriage window, using feeling ill as an excuse.", "A green scenery quickly flashed by.", "After staring blankly for dozens of minutes…", "“Oh? Looks like we’re almost there.”", "He caught a glimpse of a familiar city.", "*", "The expedition team safely arrived at Haramark. With this, the expedition had officially ended in success.", "Each team member hugged their share of the loot and chatted.", "Maria and Hugo raced to the temple after saying half-hearted goodbyes.", "But no one blamed them. Everyone wanted to hurry up and store their fortune in safekeeping. As such, the group decided to go to the temple together.", "Except Teresa.", "She had no reason to go to the temple as the palace warehouse served as excellent storage.", "Before separating, Teresa approached Seol Jihu.", "A look of determination could be seen on her face.", "“Thank you for taking me on this expedition.”", "“No problem. I should be thanking you for participating.”", "“I will be sure to repay this favor soon.”", "Teresa put her hand out after speaking indifferently. Seol Jihu stared at her fixedly before gently taking her hand.", "While they were feeling each other’s warmth, Teresa suddenly tightened her grip.", "As if she didn’t want to let go, as if she couldn’t let go.", "And Seol Jihu…", "“I’ll visit you soon.”", "“….”", "“I’ll convince you. I promise.”", "Gently twisted his hand and pulled it out.", "Carefully, so that it wouldn’t displease her.", "Teresa’s hand followed Seol Jihu’s hand up, then eventually lost its grasp.", "Teresa pouted.", "“I won’t be convinced.”", "“We’ll see about that.”", "Seol Jihu replied with a smile.", "“Have a safe trip back.”", "Teresa sighed lightly and put her arm down. Then, she turned around and started walking away.", "Seol Jihu watched her trudge farther away before turning around. Then, he began to walk toward Gula’s temple.", "But before he even took ten steps, he felt a gaze fall on his back.", "However, he did not look back again.", "*", "There were two reasons Earthlings paid monthly fees to use the temple’s storage.", "The first was safety, and the second was utility.", "It didn’t matter which temple they stored their goods at as long as they did so in a city. For example, they could find their items in the temple of Gula, even though they stored them in the temple of Luxuria.", "“Whew.”", "Seol Jihu smiled brightly after putting his bag in the storage box. Just looking at the bag filled him with joy.", "He didn’t leave the temple right away and, instead, headed deeper inside. He then lowered his head in front of the stone statue.", "It was all to hatch the egg.", "However, Gula gave a piece of unexpected advice.", "[Wait a few days before seeing Luxuria.]", "‘Excuse me?’", "[Luxuria is the twin sister goddess of Castitas. She will be able to give you more accurate information.]", "‘Can’t I go right now?’", "Seol Jihu asked all heated up.", "[Luxuria is in the middle of a large-scale ritual ceremony. I’m sure you can wait a few days.]", "Gula pacified him calmly.", "[If it’s the Spear of Purity… we have to talk about it amongst ourselves first. Fufufufu.]", "She gave a profound laugh.", "How could Seol Jihu not wait a few days when he just met with someone who had waited hundreds of years?", "He said yes and then turned around.", "[Also.]", "Gula’s voice held him back.", "[Please try to resolve it well. Console her, or put her at ease by stamping your seal on it.]", "‘?’", "[Didn’t I tell you before? That the future began to change.]", "Seol Jihu did remember. But…", "[With you wrenching the future, a new future has opened up for that child.]", "[If that man is the shield that will block the swarming darkness, then that child might become your precious left arm in the future.]", "Setting aside who this man was, Seol Jihu felt like he knew who this child referred to.", "[It’s good to have a clear sense of purpose. It’s not bad at all. After all, you’re still in the process of tempering your shield.]", "[I’m just saying you shouldn’t be too cold.]", "Seol Jihu smiled bitterly at Gula’s advice.", "*", "Members of the expedition team, excluding Maria, Teresa, and Hugo, were waiting outside. For some reason, Chohong and Phi Sora looked a little impatient.", "“Hey, um, I’m gonna go look at it again.”", "“Me too.”", "The two women raced to the temple, where the storage was.", "Seol Jihu chortled.", "That was just how human psychology was. When they suddenly had a lot of money, reality would feel like a dream. It was the same logic as constantly checking your bank account after hitting the lottery jackpot.", "“Didn’t you put everything in storage?”", "Kazuki asked while pointing at the bag on Seol Jihu’s back.", "Seol Jihu explained while laughing.", "“They’re offerings. I plan on going right away.”", "Remembering why Seol Jihu put in the additional condition regarding offerings, Kazuki understood what he meant immediately.", "“Don’t you think it’s a shame? Selling those will give you more than a few gold coins.”", "“I didn’t know you knew how to make jokes. Not that it was funny.”", "“I’m just saying.”", "Kazuki laughed, noticing thorns in Seol Jihu’s words. He then asked to accompany him, saying he wanted to say hello.", "Seol Jihu readily agreed as that wasn’t really a problem.", "They waited until Chohong and Phi Sora came out before heading back in the direction of Carpe Diem’s office.", "No, that’s what they tried to do.", "“Agh, it’s driving me insane. Let me go take a look just one more time.”", "“Me too!”", "Just when they reached the bottom of the stairway, Phi Sora and Chohong quickly ran back up to the temple.", "“Me too.”", "Even Marcel Ghionea joined in.", "“Oh, come on!”", "Seol Jihu yelled.", "*", "Chohong and Phi Sora checked the storage six more times before they were finally relieved.", "Seol Jihu arrived at the building on the opposite side of Carpe Diem’s office…", "“Noona! Yuhui Noona!”", "And he knocked on the door with a drum beat.", "Crash, crash! Seo Yuhui hurried out and displayed a dumbfounded face seeing Seol Jihu’s beaming smile.", "“Jeez… you surprised me.”", "She pinched his cheeks lightly for pulling a prank after not having seen each other for a while. Then, she guided him inside.", "After sitting down, Seol Jihu took out the offerings he’d desperately been waiting to show off.", "A hint of surprise flashed across Seo Yuhui’s face as soon as she saw the contents of the bag.", "“These…”", "The quality of the offerings was one thing, but the divine power they carried was something else. They would at least restore her strength to Level 3 or even the early stages of Level 4.", "In fact, she would be hard-pressed to find offerings of such quality even if she searched the entire city.", "‘Where did he get so many high-quality offerings…?’", "Seo Yuhui stared at Seol Jihu with a renewed gaze.", "“They’re… too expensive.”", "“Ah, don’t feel pressured. They’re all yours.”", "When Seo Yuhui sounded a bit uncomfortable taking all these offerings, Phi Sora shouted in high spirits while tapping on Seol Jihu’s shoulder.", "“We struck it rich this expedition, so this much is nothing!”", "“Yeah! It’s all thanks to him! Auuu, you cutie!”", "Chohong also laughed like an idiot and ruffled Seol Jihu’s hair until it got disheveled.", "The two women treated Seol Jihu like a baby, while Seo Yuhui’s expression turned strange as she stared at him blankly.", "“Hnng~”", "She spoke while letting out a strange hum.", "“Thanks. It must have been hard.”", "“No, not at all…”", "Seol Jihu scratched his head awkwardly.", "Seo Yuhui shook her head.", "“It was hard, right?”", "She spoke gently while spreading her arms out. Seol Jihu’s eyes opened wide.", "‘Wait! That motion!’", "He was convinced.", "She was inviting him into her arms.She was trying to embrace him as a reward for working hard.", "His body threw a fit for a moment. Seol Jihu became reluctant.", "Even he knew shame. It would be a different story if he was asleep.Embracing her with everyone looking was a bit…", "At that moment, Seo Yuhui opened her mouth with a sweet smile.", "“Squish.”", "“!?”", "Seol Jihu was astonished.", "‘H-How?’", "Seol Jihu hesitated. However, he soon fell into a difficult situation as Seo Yuhui asked in response to his indecision.", "“Jihu?”", "He could tell just by her expression.", "Didn’t you have no qualms about embracing me in the past?Are you trying to save face now that you grew up a little?", "“Jihu….”", "Seo Yuhui blurred the end of her speech pitifully.", "Seol Jihu didn’t know what to do as she sounded more and more hurt and saddened.", "Seo Yuhui tilted her head.", "“Is the side-effect okay?”", "Oh right, there was that convenient excuse.", "“Y-You’re right. I’ve actually been feeling a bit tired…”", "Seol Jihu responded quickly and toddled towards her with a cough. He didn’t pay attention to the gazes behind him. After all, this was something out of his control.", "‘Squish.’", "The important thing was that Seo Yuhui’s embrace was the coziest place in the world. His restless body seemed to calm itself down.", "This was really a paradise in Paradise.", "‘Ah… amazing.’", "Now I feel alive.", "Seo Yuhui smiled brightly as she patted the rabbit snuggling in her arm.", "With a beaming face, she sent a hard-to-understand smile at the two women staring at them dumbfoundedly.", "*", "Thanks to recharging the Seo Yuhui Energy, Seol Jihu was able to return to the office in delight.", "He didn’t see Jang Maldong and the Yi siblings. They must still be at Huge Stone Rocky Mountain, training.", "Jang Maldong picked up as soon as he contacted them via a communication crystal.", "—You must have arrived just now.", "“Yes, I called to let you know we’re back.”", "—So, was the expedition fruitful?", "“I have more than a few things to discuss with you.”", "Seol Jihu twiddled his fingers.", "“When will you be back?”", "—We’ll be back soon. We actually went back once and returned to the mountain.", "“Huh? Why?”", "—Because of Sungjin.", "Jang Maldong smiled bitterly.", "—He got severely hurt during training, so we went back to Haramark after some emergency treatment. I planned to let him rest, but he insisted on going back.", "Jang Maldong clicked his tongue.", "—That brat’s got the stubbornness of a bull. Even a bull’s tendon won’t be as tough as him.", "Jang Maldong shook his head.", "Seol Jihu asked with worry.", "“Is his injury serious? How is his body?”", "—It’s gotten a lot better. Sungjin is training as much as you did.", "“I hope he doesn’t push himself too much… He needs to think about his body.”", "—You’re the one to say.", "Jang Maldong nodded his head with a peal of uncontrollable laughter.", "—Well, we’ll be back in a few days. We can talk about the details then.", "“Got it.”", "—Oh, yes.", "Jang Maldong stopped Seol Jihu just as he was about to hang up.", "—It’s about that lady friend of yours, Kim Hannah. She’s your Inviter, right?", "Seol Jihu’s eyes widened at the unexpected mention.", "“Yes. What about Kim Hannah?”", "—She called when we returned to Haramark.", "Jang Maldong continued calmly.", "—I didn’t plan on picking up at first, but she was calling every time I checked the communication crystal. Once, twice, thrice… it just kept going.", "‘What?’", "Seol Jihu’s eyes narrowed.", "“Did you pick up?”", "—Mm, it seemed urgent, so I did. Sorry.", "“No, no, it’s fine. So what happened? Why did she—”", "He swallowed his words rather than asking, ‘Why did she not pick up all this time?’", "—I’m not sure. She was looking for you, but when I said you were on an expedition, she said okay and that was it.", "After saying that, Jang Maldong furrowed his brows and smacked his lips.", "—But… her complexion was a bit…", "“Excuse me?”", "—No, it’s nothing. I can’t decide just by looking at her once.", "Jang Maldong shook his head.", "—Anyway, try giving her a call. Now, if possible.", "“Got it.”", "—Alright, I’ll see you later.", "With that, the call ended.", "Seol Jihu smacked his lips.", "Kim Hannah had called at a point he was ready to develop a fully-fledged organization.", "‘You never know your luck.’", "If I knew, I would have asked her to participate in the expedition.", "Murmuring inwardly, Seol Jihu rummaged through the desk drawer and took out the appropriate communication crystal. Then, he placed his hand on the faded crystal orb."]}