{"cid": "426", "title": "Chapter 426. Variable, and Variable (4)", "content": ["The view of the territory that the Parasite Queen had settled in was similar to what he had seen in the Delphinion Duchy.", "But there was a difference.", "How should he put it? Seol Jihu felt the urge to get out of here as soon as possible.", "It began the moment he first set foot on the rotting soil.", "He could feel his energy drain and his strength weaken when all he did was stand there. His headache worsened and his physical condition deteriorated with every breath. On top of that, the world looked dark and dreary, even though the sun was clearly out and shining.", "This seemed to be the case for the rest of the team as well, as looks of discomfort crossed their faces.", "The surrounding landscape flashed past them.", "It would take them at least six hours to reach their destination on foot, but fortunately, they had the means to fly.", "The expedition team was able to arrive near its destination about 40 minutes after leaving their hideout.", "“Over there.”", "The team had entered a vast mountain terrain, where the ground had risen to an altitude of more than 2000 meters above sea level, forming a series of steep slopes.", "In the direction that Baek Haeju pointed stood a faded building that almost seemed glued to the mountain range.", "Standing alone at this high altitude, the building almost seemed to be out of touch with the world.", "[It’s the Castitas Monastery!]", "Flone, who was flying after the phoenix carrying Seol Jihu in her arms, gave a small exclamation.", "“Monastery?”", "[Yeah. It’s where the priests who served the Goddess of Chastity practiced their faith, away from the rest of the world.]", "Flone quickly explained and tilted her head.", "[But… that’s strange. That monastery doesn’t have any secret hiding place as far as I know. Of course, it’s considered sacred, but I don’t think the Gorgonu would have cared about that….]", "She was right. It was hard to imagine anyone would hide anything in a place as wide open as that monastery building.", "[But I was never the family head, so I don’t know of every family secret, but…. Ah!]", "Flone quickly descended behind the phoenix, who suddenly changed his altitude after passing by the monastery.", "The phoenix did not stop flapping his wings for a long time even after it began to fly low.", "‘Further, further….’ Baek Haeju kept muttering and stopped only after they had passed a dozen mountains.", "“Stop. Please descend here.”", "The phoenix and Flone landed almost simultaneously.", "Baek Haeju jumped off the phoenix and began climbing the rugged slope.", "She took the lead and escorted the team to a place where the blankets of clouds were unusually thick, to the point they couldn’t even see an inch in front of them.", "“From this point onward, we’ll walk in a single file. Follow me, and don’t stray from the path, or else you might fall.”", "The expedition team quickly changed its formation and began the march.", "They picked their way through the clouds, taking each step with caution. Then, all of a sudden, the clouds lifted, the view widened and their vision became crystal clear.", "The next thing they saw was a steep cliff. Enthralled by the beauty of the landscape, Seol Jihu realized a moment later that a cave was hidden behind the cliff.", "When he came to his senses, Baek Haeju was already entering the cave.", "The team hurried after her, but all they could see inside was darkness.", "Only after Philip Muller recited the illumination spell were they able to see the seemingly endless flight of stone steps leading down to the area below.", "“I have a bad feeling about this. Are you sure there are no traps?”", "Phi Sora asked in a wary voice as she marched down the uneven stairs.", "“I took care of them the last time I was here.”", "Baek Haeju, who had already descended the stairs, replied while pushing the iron gate at the end of the stairs.", "As they had been warned, the inside was deep and complex.", "The slope wasn’t steep but it was long and the road kept branching off into more paths, much like a maze.", "In spite of everything, however, Baek Haeju continued down the road without any hesitation, perhaps because she had been here once before.", "She walked straight ahead for a while before entering the gate at the far left end, at a spot where the road branched in seven directions.", "Then, at the next crossroads, she turned right.", "Baek Haeju continued to move in a clockwise direction and stopped after seven full circles.", "The space where the expedition team arrived was a void with nothing but a tunnel, the size of which an adult could barely pass through.", "“This room is the deepest part of the catacombs.”", "Baek Haeju took out the Rothschear’s insignia from her Dimensional Pocket and looked back at Seol Jihu.", "“I’ll go alone from here. Only those permitted by the guardian can find the right path.”", "“How long will it take?”", "“Not long, since all I’ll be doing is bringing it with me. I’ll be out in three minutes at the earliest, five minutes at the latest.”", "Seol Jihu nodded.", "He, too, had Rothschear’s insignia and wondered which world the tunnel was connected to, but he held back his curiosity.", "The insignia was no guarantee that he was qualified, and this was no time to put his personal desires before their goal.", "“We’re counting on you.”", "“I’ll try to be as quick as possible.”", "Baek Haeju turned towards the tunnel with the insignia in her hand.", "Her body faded as soon as she stepped inside the tunnel where the strange mana danced.", "It was like watching someone use the warp gate’s portal.", "With Baek Haeju gone, an awkward silence filled the air.", "“I’m glad we made it here in one piece.”", "Disconcerted by the heavy silence, Phi Sora said in a cheerful voice.", "“…News just came in.”", "At that moment, White Tiger, holding a communication crystal in his hand, announced in a low voice.", "“The Parasite Queen and Unsightly Humility’s army have withdrawn from the Hiral Mountain Range.”", "“Eek—”", "Phi Sora yelped.", "“Looks like they left in a hurry as if they were being chased by something. Like that time they lost in Tigol Fortress and ran away without looking back.”", "White Tiger flashed his fangs in a smile.", "“Of course.”", "Seol Jihu replied calmly.", "It wasn't good news, but it was the way things should be.", "The Parasite Queen wouldn’t sit idly while her enemies roamed freely in her domain.", "As the entire imperial territory was under her surveillance, he would have been more suspicious if she hadn’t left.", "So this move of hers was within his expectations, but nevertheless he couldn’t help feeling pressured.", "“We should contact the hideout and see how they’re doing.”", "“I already did.”", "Said Philip Muller when he saw Seol Jihu pull out a communication crystal.", "“When?”", "“Before we discovered the mountain range. They said nothing’s out of the ordinary.”", "That was good news if it was true.", "Seol Jihu glanced at the tunnel, wondering how much longer it would take.", "It was then.", "Suddenly, an eerie aura filled the tunnel and a woman dressed in white traditional robe rushed out.", "It was Baek Haeju.", "“I got it.”", "She held out her hand, covered in green mana.", "In her grasp was the stele surrounded in black smoke.", "“Hurry….”", "Judging by her heavy breathing, she seemed to have run as fast as she could.", "Seol Jihu’s face trembled as he stared at the stele.", "He’d never felt such boundless, purely evil energy before.", "But there wasn’t much time for an examination.", "Seo Yuhui wrapped the stele in several layers of blessed cloth soaked in holy water, which she had prepared beforehand.", "The unsettling energy began to fade before disappearing completely.", "“It should be alright for now. The effect will last for a few days….”", "At last, they succeeded in securing the stele.", "They had no more business here.", "“Let’s go.”", "The expedition team quickly escaped the catacombs and went back the way it had come.", "*", "30 minutes ago.", "Sung Shihyun sat on the parapet of the castle, watching the city below.", "Every day, a new Sinyoung executive was brought here and forced to apologize, and this made for a quite entertaining show.", "These men had to apologize with action, not with words.", "In other words, they were forced to undergo the same humiliation that Roe Scheherazade had suffered at their hands.", "For example, they had to dance naked, crawl on their knees with leashes around their necks, stand still for days without access to the bathroom, or even be raped in front of a crowd.", "“I didn’t think you would really do it….”", "Sung Shihyun mumbled as he watched one of the former executives howl in despair.", "“This is fun.”", "As Roe Scheherazade giggled with joy, Sung Shihyun threw a sideways glance in her direction.", "“You won't change your mind now, will you?”", "“I don’t know….”", "Roe Scheherazade’s eyes curved in a smile.", "“Even if I do change my mind, I thought my part was already over?”", "“No, we may have to use you again to locate another stele.”", "Sung Shihyun smirked.", "“I’m sure the other Army Commanders will be delighted if we can take out the stele from Gorad Boga, but… I won’t allow that.”", "“Oh my. How come?”", "\"So that everyone can focus on the task at hand. This mission has only one goal.”", "Sung Shihyun continued.", "“I don’t need the stele or anything else. That bastard, he’s all I’m after.”", "Roe Scheherazade looked at him with a renewed expression.", "Because even though his voice sounded calm, his eyes were filled with obsession and madness.", "At that moment, a succubus rushed in and whispered something in Sung Shihyun’s ear.", "“…Really?”", "“Yes, just now….”", "“Hmph. It’s still a bit early, but I guess l have to go.”", "Sung Shihyun rose from his seat, turned and headed down the ramp.", "Roe Scheherazade tilted her head and followed him with a gentle gait.", "The place where Sung Shihyun headed to, was a room inside Gorad Boga where pieces of the stele were stored.", "The other four Army Commanders had already arrived before him.", "“The Queen called?”", "—You’re here.", "As soon as Sung Shihyun asked, a grand voice resounded throughout the room.", "Twisted Kindness handed him the communication crystal in her hand.", "Sung Shihyun took it and smirked.", "“Communication crystals aren't too bad, huh? Your Majesty.”", "—It’s primitive but somehow convenient. It’s not bad.", "“So the reason for your call is….”", "—The location of the Brightest Star has been identified.", "Sung Shihyun blinked once.", "“Already? But—”", "—I was surprised, too. The Brightest Star has already infiltrated my territory, and he’s on the verge of obtaining the last piece of the Imperial Oath. It’s as the saying goes, it’s darkest below the lamp.", "For a moment, Sung Shihyun doubted his ears.", "Even his eyelashes trembled.", "But he quickly regained his composure and feigned calm.", "“Well, then that means it’s time for us to make a decision…. How would you like to proceed from here?”", "With a grin, he asked the queen on the other side of the crystal.", "“Are you going to be greedy again and try to catch two rabbits at once, only to miss both of them and regret it, then say something like, ‘Ah~ I should have gotten rid of the Brightest Star earlier~’ Or—”", "—You never change.", "The Parasite Queen gave a light chuckle.", "—Didn’t I tell you? For this mission alone, you’re granted the same authority as me. Do as you please.", "“Heh. I appreciate your generosity, Your Majesty. I will endeavor to meet your expectations.”", "Sung Shihyun grinned.", "—Abhorrent Charity.", "The Parasite Queen called the Third Army Commander.", "Abhorrent Charity bowed his head.", "“Yes, Your Majesty.”", "—Do you remember what I told you?", "“Of course.”", "How could he forget?", "[Now then, I will tell you the starting location, the destination, and when to launch the surprise attack.]", "At the time, the Parasite Queen told him that the starting location would be Scheherazade, not the Empire, and that later she would let him know the destination and when to activate the magic circle.", "—I will be waiting for you at the destination.", "“It’s an honor.”", "—Well then.", "The Parasite Queen raised her head from the other side of the crystal.", "—This is the time we all have been waiting for. Sung Shihyun and the other Army Commanders….", "—Begin the surprise attack on Via Lactea!", "The Parasites had been saving their trump card for this moment.", "Their true purpose, which remained hidden even as they invaded Nur and Scheherazade, was now clear.", "—Keep in mind, we don’t need anything else. Our goal this time is to kill the Brightest Star no matter what!", "The Parasite Queen emphasized again, and the light of the crystal dimmed.", "“…He’s a monster, seriously.”", "When the communication ended, Sung Shihyun chuckled with a look of disbelief.", "“Did you hear that? He’s about to obtain the last piece of the stele.”", "He knew Seol Jihu would be up to something because he hadn’t seen him in the last couple of days.", "“Via Lactea is right at the center of the Empire. How could he have moved so fast…?”", "But the speed at which Seol Jihu moved far exceeded Sung Shihyun’s expectations.", "As much as Sung Shihyun didn’t want to admit it, the enemy almost fooled him again.", "“I mean, look at the lengths we’ve gone for him. Instead of showing appreciation for our efforts, he’s trying to crush us again…. What a cold-blooded bastard.”", "Sung Shihyun turned to Roe Scheherazade with a small sigh.", "“Looks like I have to leave now. Do you want to come, too?”", "“I won’t go far.”", "Roe Scheherazade waved both of her hands with a bright smile.", "“Do as you like.”", "Sung Shihyun chuckled and turned around.", "He couldn’t care less about the Royal Oath at this point in time.", "There was a much more pressing matter at hand.", "“Shit. We would’ve been fucked if we had let our guard down. I’m getting goosebumps.”", "Fortunately, the Parasites had finished the preparations for the surprise attack in advance.", "Sung Shihyun headed for the gigantic magic circle drawn around the city square.", "The first thing they did after occupying the city and activating Gorad Boga?", "The only thing they did that had anything to do with the stele was to break Seo Yuhui’s barrier, and that was to trick the enemy into thinking they were after the stele.", "Sung Shihyun then ordered the rest to not even look in the direction of the stele, and focus solely on preparing the magic circle.", "His efforts were finally paying off in the face of a variable beyond their imagination.", "“Come on, let’s go. If you don’t release your divinity~ We can’t launch the attack~ Ah~ Slowpoke Charity~”", "“I get it, so shut it already.”", "Abhorrent Charity, standing at the center of the magic circle, retorted curtly.", "Not long after, the five Army Commanders and their armies gathered around the magic circle.", "Abhorrent Charity chanted a spell without hesitation, and at the same time a flash of light burst out of his body.", "Long tentacles began to stretch out of his sleeves.", "He was releasing his divinity.", "—HAAAAAAAA!", "The benevolent energy exploded and swallowed everything in its vicinity, causing the nearby buildings and the ground to shake violently.", "The next moment, Abhorrent Charity’s billowing robe swelled like a balloon, and….", "FLASH!", "The light from the magic circle enveloped the five Parasite armies.", "*", "“…Hmm?”", "Back at the base camp, Cinzia shifted her gaze to Scheherazade.", "A swarm of lights flashed in the distance.", "Divinity’s energy appeared and then immediately disappeared.", "Cinzia’s eyes narrowed as she stared in the direction of Scheherazade.", "“…Weird.”", "She muttered and took out a communication crystal from her pocket.", "*", "The expedition team successfully exited the cave and was returning to its hideout.", "Everything was going smoothly, so far.", "With only 10 minutes to his destination, Seol Jihu finally saw a glimpse of success and hope.", "The rest wasn’t difficult. Now all they had to do was go back to their hideout, travel to the Delphinion Duchy Laboratory, and then finally return to Haramark.", "Once in Hararmark, he would be able to concentrate on the war from a much more advantageous position.", "‘I wonder if the hideout is alright.’", "Philip Muller had already checked, but Seol Jihu wanted to be sure.", "While flying across the sky, he placed a hand on the communication crystal and infused his mana into it.", "“…”", "He was anxious to hear his comrades report that there was nothing wrong.", "However—", "No one was answering, even though he waited a long time.", "Seol Jihu’s face hardened slightly.", "He had asked them persistently to stand by in case something happened.", "‘What’s going on?’", "But when they didn’t answer three times in a row, an ominous premonition began to take shape in his mind.", "‘Could it be…?’", "It was then.", "[W-What’s he doing?]", "Suddenly, Flone muttered in confusion.", "Seol Jihu turned his gaze and saw the phoenix change his course.", "He was flying low as if he were preparing to land.", "“But this isn’t the direction to the hideout!”", "“Bastard! Are you a traitor!?”", "Hoshino Urara started jumping up and down in anger, but the phoenix didn’t even bat an eye.", "“Why did you change course? What’s going on?”", "Seol Jihu flew to him and asked, but there was still no answer.", "The phoenix looked nervous and on edge.", "Already anxious from the earlier incident with the communication crystal, Seol Jihu quickly glanced down.", "It didn’t take long for him to realize why the phoenix suddenly changed course.", "He saw a group of people running in the distance.", "They were his comrades whom he had left behind at the hideout.", "Seol Jihu began to blink rapidly.", "Those running seemed to have discovered the phoenix, for they stopped and looked up at the sky.", "The phoenix and Flone didn’t have the slightest idea what was going on, but both rushed down.", "“Seol…!”", "Chohong was close to tears when she saw Seol Jihu land.", "Fortunately, everyone was here.", "But all were seriously injured.", "The worst of them was Eun Yuri, who was passed out on Hugo’s back, blood dripping from a corner of her mouth.", "“I-I’m sorry…!”", "Chohong’s face contorted as if she was about to cry.", "“We tried to defend it, but…!”", "“What…. What happened? Why did—”", "“Stop whining and move over. I’ll do the talking.”", "A cold voice rang out.", "With a sigh, Oh Rahee stepped forward, rumpling her hair with her fingers.", "“Miss Oh Rahee.”", "“I don’t know what happened, but I’ll tell you everything that we’ve seen and experienced. So listen carefully.”", "Oh Rahee’s face was pale, but her voice didn’t tremble.", "“Twenty minutes ago, we were guarding the hideout as you told us to do. Then, right after we felt the energy of the Army Commanders, a huge magic circle appeared in the sky. Before we could do anything, the Army Commanders and their armies stormed out of the magic circle.”", "Oh Rahee spoke quickly.", "“We tried to stop them, but we were no match against them. Twisted Kindness blew up the whole place right after she came out. If it wasn’t for that kid over there, we’d all be dead. She used the teleport magic to get us out of there.”", "For a moment, Seol Jihu had trouble understanding Oh Rahee’s words.", "Because they didn’t make any sense.", "“…What?”", "When he first arrived at the Empire, he confirmed that the Five Armies were in Scheherazade.", "“…I don’t know!”", "Oh Rahee bit her lower lip in confusion.", "“I told you, I don’t know! They should be in Scheherazade, so why…!?”", "She raised her voice to hide her fear, but her voice trembled.", "At that moment, the communication crystal in Seol Jihu’s pocket began to emit bright light.", "—Is everything alright there?", "It was Cinzia.", "—Representative, something’s wrong with Scheherazade. I saw a bright light burst out and then felt the release of divinity, but it disappeared immediately.", "Seol Jihu held his breath.", "—The Army Commanders may have released their divinity to break through Gorad Boga, but I couldn’t confirm. The barrier around the city is still active, so I can’t enter.", "A strange incident occurred in Scheherazade.", "And the members who were guarding the hideout retreated under the attack from the Five Army Commanders and their armies.", "He was now beginning to understand why he had felt so anxious earlier.", "—There’s more. The enemy movements are strange.", "Cinzia continued in an urgent voice, which was rare for her.", "—The Parasite Queen and Unsightly Humility’s army has withdrawn from the Hiral Mountain Range….", "Her voice continued, but Seol Jihu wasn’t listening. He couldn’t.", "There was one thing that he was sure of.", "Five Army Commanders had captured their hideout and destroyed the magic circle….", "—Even the armies deployed near the borders….", "And the entire force of the Parasites, which had moved to the border between the Federation and humanity….", "—I’ve confirmed they’re heading back to the Empire. Hurry up and get out of there!", "…had formed a siege that completely blocked the retreat of the expedition team that infiltrated the Empire."]}