{"cid": "256", "title": "Chapter 256. Fox, O Fox (2)", "content": ["Recently, the Carpe Diem building had been seeing a constant stream of visitors. The reason was simple. With free money and food being handed out, how could Paradisians not make their daily trips here?", "“Line up! Line up! We have enough food for everyone, so don’t worry!”", "A young lady wearing a spotless Priest’s robe shouted at the crowd gathered in front of the building.", "Kim Hannah requested Seo Yuhui to take on this job, and she was displaying skills that went above and beyond Kim Hannah’s expectations.", "As expected of someone who was experienced in volunteer work, she acquired food supply in bulk at a cheap price and visited Eva’s temple to supplement their lack of personnel.", "Thanks to her, the area in front of the building was only loud, but well-organized.", "“As expected of Haramark’s war hero! He’s really different than the rest!”", "One man smiled as he held up a box of food supplies.", "“They say he killed that frightening First Army Commander! You can’t compare him to those ordinary Earthlings!”", "A woman who brought her kids along jumped into the conversation with a smile.", "Seol Jihu and Carpe Diem’s value was exponentially increasing with this act of charity. Not only did they give out food and living expenses, but they also paid for people’s debts as well.", "Although the debt wasn’t completely gone, Carpe Diem’s generous 10-year loan replacement with an interest rate of 9.63% was definitely worth the praise.", "“Well, Viva La Carpe Diem! I wish their leader would become the king.”", "“Hey, what if people hear you?”", "“So what!? He’s a million times better than the queen who doesn’t show up even at times like this!”", "“I guess even if he’s an Earthling…”", "The woman and man each with a box in their arms walked away as they continued their conversation.", "Seol Jihu was watching all of this from a distance with a satisfied face. He just felt good. His bothered state after seeing Eva’s nightlife and the VIP auction house had relaxed a bit now.", "Although the expenses of having hundreds of visitors every day were not insignificant, it was not a big concern as they had far more money than what was being spent.", "Kim Hannah said that the deposit paid last time was more than enough, but even if they ran out, they could just use the money in the storage.", "Weirdly enough, none of this felt like a waste.", "Whether it was because they were now rich or because of the remaining Rothschear inheritances, Seol Jihu felt like he had plenty. Back when he was addicted to gambling, even losing a penny felt like a waste.", "He thought to himself and grinned. Then, he saw a familiar face and moved towards the person.", "“You were watching too?”", "He stood next to her and asked, but no reply came back. Kim Hannah simply stood there, speechlessly watching the scene of charity. Seol Jihu shrugged his shoulders and asked.", "“By the way, we still haven’t registered as an organization, have we?”", "“…I was going to mention that soon.”", "Kim Hannah finally started conversing.", "“I think it would be better if we didn’t register for a while, what do you think?”", "Seol Jihu blinked his eyes in surprise.", "“Why?”", "“We can get on their nerves even more, that way.”", "Kim Hannah continued without shifting her line of sight.", "“As long as an organization isn’t officially listed, it won’t be recognized as one. Meaning, Carpe Diem is still a team.”", "“Okay.”", "“Think about it, an official organization, not just one or two, but a grand alliance of seven is helplessly wrecked by a small team of ten. How ridiculous would it look? They must be fuming.”", "While seeming convinced, Seol Jihu carefully mulled over Kim Hannah’s words.", "If it was in the past, he would have simply agreed, saying, ‘I see.’ But having observed the situation for the past few days, he had something on his mind, though it was merely a conjecture…", "“I was reading the Eva code of law for the past few days.”", "Kim Hannah gave a sideways look, hearing the law being mentioned again.", "“There were quite a few laws regarding Earthlings. One of them bans violence or use of force in the city.”", "“It’s a law in name only.”", "Kim Hannah scoffed.", "“Fights break out several times a day, from both Paradisians and Earthlings side.”", "“Right, but I’m not talking about simple fistfights that result from insignificant conflicts.”", "“What is it then?”", "“The important thing is that this law has an exception clause, the same one that restricts the use of excessive force in the Federation border region.”", "Kim Hannah lifted her chin slightly before slowly turning her face to look at him with a renewed expression.", "“…I get what you’re trying to say.”", "Then, she let out a laugh of ridicule.", "“But even if we do this, they still won’t do anything for a while.”", "“They’re not going to do anything again?”", "“Probably.”", "Seol Jihu’s eyes narrowed.", "“Why do you think that?”", "“Because of you.”", "Kim Hannah pointed at Seol Jihu with her finger.", "“And me.”", "Then, she pointed at herself.", "“Why me? I’m only a High Ranker.”", "“Not just a High Ranker.”", "Kim Hannah crossed her arms as she spoke.", "“There aren’t even ten Unique Rankers in Paradise. If you exclude the Executors or the so-called apostles of gods, the number is even less. But even these Executors only have a chance to win when they fight against the Parasites’ Army Commanders. Their victory isn’t even guaranteed.”", "“….”", "“But wait, there’s a High Ranker in front of me who’s killed a Parasite Army Commander, something that not even Executors could do before!”", "Having experienced the war before, Seol Jihu had to accept that Kim Hannah’s words were true.", "“They must be thinking, ‘Huh? What’s up with these guys? Why are they acting up so much? Are they insane? No, wait, they’re asking for a fight, plain and simple. But that’s impossible unless that Fox has actually gone crazy. Wait—’”", "Stopping there, Kim Hannah gestured at Seol Jihu with her chin.", "“…They’re laying low because they’re afraid of me?”", "“You said you relied on several Awakening Skills to kill Undying Diligence, but you never made an official clarification. Most people don’t know the truth. That’s why the organizations are gritting their teeth and still biding their time. Because with one wrong move, they would have to face the spear of the mysterious Earthling who killed the Parasite’s First Army Commander.”", "This all made sense, but Seol Jihu was left with more questions. It was then.", "“Jihu.”", "Kim Hannah’s voice suddenly got lower. She turned and stared outside the window again.", "“Do you know what the most important thing is when a scammer is preparing to strike?”", "Seol Jihu raised one of his eyebrows. Kim Hannah continued without batting an eye.", "“It’s simple — to make sure the person getting scammed doesn’t know he’s getting scammed.”", "“….”", "“Only when the scam is successful would they realize, ‘Ah, that was a scam.’ By then, it would be too late to do anything about it.", "Seol Jihu understood what she was trying to say.", "“I get it. The scammers at gambling houses don’t win a large amount of money immediately. They wait, losing a good chunk of their own money, before reversing everything.”", "“What?”", "“I heard they slowly bide their time, waiting for the opportunity to strike back big. Apparently, it’s important to make the victim follow on his own initiative.”", "Kim Hannah’s eyes widened, seemingly in great surprise. But soon, she regained her composure and smiled faintly. The way she tilted her head down with her mouth closed tight, she looked like she was trying hard to hold back her laughter.", "“What? What’s so funny?”", "“No—”", "When Seol Jihu asked nonchalantly, Kim Hannah giggled and covered her mouth.", "“I was just surprised. That was the perfect comparison.”", "“I don’t think that’s why you laughed though.”", "“You’re right. I just found it funny hearing a former gambling addict say it.”", "Kim Hannah smirked before turning back.", "“Where are you going?”", "Seol Jihu asked sullenly.", "“I have someone to meet~”", "Kim Hannah waved her hand as she happily walked away. Seeing her slowly grow farther away, Seol Jihu mumbled inwardly, ‘I wish she’d just tell me outright.’", "She wasn’t hiding everything, but the way she skillfully dodged the main point, Seol Jihu really felt like he was bewitched by a fox.", "‘Just what is she thinking?’", "Seol Jihu sighed, shaking his head side to side.", "*", "Ochoa Cartel’s leader, Omar Garcia, was in a foul mood. Not only did he lose one of his main businesses, but when he tried to make up for his losses by taking over Royal Pattaya’s adult entertainment business, Carpe Diem had flipped the table on him as if they had been waiting.", "His savings were disappearing by the second.", "‘These fuckers…’", "Although he was acting calm on the outside, he was on the verge of exploding on the inside.", "‘Damn it, and I was trying to be nice too… You really want to do this?’", "It was obvious that Kim Hannah was behind all this. That was the problem.", "Omar Garcia was a true Paradise veteran. Naturally, he had heard of Miss Foxy’s notoriety.", "He couldn’t call himself a righteous person by any means, but Omar Garcia truly thought his evildoings were a drop in the bucket compared to Kim Hannah.", "According to the rumors, even Haramark’s famous internal strife was her handy work.", "A ruthless demoness who did not hesitate to employ the most devious means for benefits. That was who Kim Hannah was as an Earthling.", "And that was why Omar Garcia was so doubtful. Unless that Fox had gone mad, there was no way she would do something like this without a plan.", "Judging by her recent actions, she was clearly looking to fight the organizations. No matter how hard he thought, he couldn’t figure out what gave her the confidence to be so bold.", "‘Is it Sinyoung? No, they kicked her out, like euthanizing a hunting dog that bit its own master’s hand. Then why did she come to Eva…?’", "The relationship between Paradise’s organizations was quite complex.", "Sicilia called themselves the conqueror of the south, but put in a different way, one could say they were forced out to Haramark. Because the agreement they made at the end of Haramark’s conflict prevented them from influencing other cities, Omar Garcia did not have to worry about Carpe Diem having Sicilia to protect them.", "If they went against this agreement, Paradise’s number one organization, situated in its capital, would definitely not ignore the matter, stepping in to help.", "Thus, Omar Garcia could rule out this possibility with near 100 percent certainty. But it was also hard to believe that Haramark Royal Family was behind this.", "As he was brooding over the problem for a long time, a crystal next to him suddenly shone.", "Omar Garcia looked up. It was the call he had been waiting for.", "“Yes, it’s me. Yes, yes, how…”", "He immediately placed his hand on the crystal and strained his ears.", "“…Come again?”", "After listening for a while, he furrowed his brows. But even that only lasted a moment as he dropped his jaw, replying.", "“Ah, yes… Is that true?”", "The corner of his mouth curled up.", "“Yes, yes, of course. We’ll stay put, so no worries. We won’t lay our hands on the Federation’s members, especially at a time like this.”", "—Don’t say I didn’t warn you.", "“Of course, of course, I understand. Thank you for your hard work.”", "—I don’t know what you’re thanking me for, but anyway, reflect on this carefully.", "With that, the call ended. Seeing the light on the communication crystal flicker off, Omar Garcia burst into laughter.", "“Hah, this manipulative woman. She’s really the scariest one.”", "Mumbling to himself, he clasped his hands together and rubbed his thumbs.", "“I see, so that’s how it is… In that case…”", "After taking a moment to organize his thoughts, he called someone. A man and a woman soon walked in.", "“Did you call us, sir?”", "“I’m here~”", "The man with well-defined facial features wore a heavy fullmetal armor, while the ivory-haired woman wore a light chainmail armor.", "Oliver Rogers and Noah Freya. They were both High Ranker Warriors and aces of the Ochoa Cartel. At the very least, they could both defeat Jirayu Matthew with ease.", "“It’s really been a while since you called both of us together.”", "The woman flaunting a seductive peach blossom skin asked with an enchanting smile. Omar Garcia explained immediately.", "“I have a question I want to ask both of you.”", "“What is it?”", "“It’s about Carpe Diem.”", "“Well… I expected as much.”", "Noah Freya placed her hand on the slender waist above her perky butt, tilting her head curiously.", "“But if it’s about Carpe Diem…”", "“Have you heard of the Earthling, Phi Sora?”", "“Ah, of course, we would be fools if we haven’t.”", "Noah Freya replied right away. Omar Garcia turned to the man maintaining his silence.", "“What about you?”", "“I’ve heard a little.”", "It was a vague answer, but regardless, it seemed they both knew her.", "“Do you know how strong she is? For example, if you fight her one-on-one…”", "“I’ll lose.”", "“Not a chance.”", "Oliver Rogers and Noah Freya answered instantly.", "“Just so you know, even if Rogers and I fight together, we won’t last more than a few moves before we get beheaded.”", "With Noah Freya delivering a sure-kill blow, Omar Garcia became dazed.", "“She’s that strong?”", "“Just because you’re a High Ranker, it doesn’t mean you’re the same Level 5. How should I say this… mm, she’s on a different league than us.”", "“I always considered you two to be first-rate among High Rankers.”", "Oliver Rogers revealed a hint of dissatisfaction, but Noah Freya shrugged her shoulders nonchalantly.", "“If we’re first-rate, then that Phi Sora woman is transcendental. She’d have to thank Thousand Sword for advancing to Level 6… but she’s a master of the quickdraw and among the Level 5s, she’s definitely in the top 10. You can tell just by how easily she beats up that Oh Rahee.”", "“…Then what about Chung Chohong?”", "“Hmm, I’d have to fight her to know for sure, but I wouldn’t say I’m all that confident…”", "Omar Garcia’s jaw dropped. He had expected as much, but Carpe Diem’s High Rankers seemed to be true monsters.", "“Did you call us just to ask that?”", "Oliver Rogers asked curtly. Omar Garcia shook his head with a displeased face.", "“…I also wanted to ask about Seol Jihu. To assess our strength.”", "“Seol Jihu… You must mean Carpe Diem’s leader.”", "Noah Freya rubbed her chin.", "“I have no clue. Everything about that person is shrouded in a veil of mystery…”", "“I think the rumors about him are grossly exaggerated, no?”", "“Not exactly.”", "Oliver Rogers chimed in.", "“Although there are some ridiculous tales going around, it is true that Seol Jihu killed Undying Diligence. There are countless witnesses who can attest to this.”", "Omar Garcia frowned.", "“But how is that possible!? If the First Army Commander invades Eva, the city will be destroyed that very day!”", "“I don’t disagree. After all, Eva doesn’t have an Executor. Ah, I guess the Daughter of Luxuria is here now.”", "“I know. But what I really want to know is whether Seol Jihu is above Undying Diligence.”", "“Ah, then that’s a definite no.”", "Oliver Rogers’ assurance made Omar Garcia’s eyes flicker with light.", "“I was interested in that war, so I did my own research. Seol Jihu apparently dominated that battlefield like a demon, but they say he received many Executors’ help.”", "“Oh yeah?”", "“Pride, Sloth, Lust, Wrath, Avarice… There were five Executors there. And though she isn’t an Executor, the Sacred Empress participated as well.”", "“So there were six Executor-level Earthlings.”", "“Yes. And reports say that the Daughter of Luxuria and the Sacred Empress helped Seol Jihu wholeheartedly. That was why he could kill Undying Diligence. Some of the rumors that say he single-handedly overwhelmed three Army Commanders is false.”", "“Right, that makes sense.”", "“He was also in a coma for several weeks following the war, and considering that the Federation came to heal him, it’s highly likely that he used abilities that took a heavy toll on his body.”", "“Great!”", "Omar Garcia hit the table like he finally heard what he wanted to hear.", "“You’re sure about that, right?”", "“?”", "“What I mean is, the reason Carpe Diem is acting out so much is because they’re confident in their team’s and Seol Jihu’s strength.”", "“Most likely. They’ve been playing with the Parasites. How can we enter their eyes?”", "Oliver Rogers replied calmly before putting on a doubtful expression.", "“If you still have doubts, sir, you can always look into this yourself… But why are you asking us this?”", "Omar Garcia smiled.", "“Because it’s a very important matter.”", "“?”", "“In the worst-case scenario, we may have to face Carpe Diem’s main force. If they’re truly above the level of a Parasite Army Commander, it won’t matter even if the seven organizations unite and fight.”", "“That’s true… But they’re still human. Against an overwhelming number, they can only lose.”", "Noah Freya nodded too in agreement.", "“Now if we can mobilize the kingdom’s army on top of that, they really won’t have a choice, right?”", "“Obviously. But can you mobilize them?”", "“I’ll pull some strings and make sure I can. But before that—”", "Omar Garcia got up from his seat.", "“I’ll have to give the Triads a visit.”", "“The Triads?”", "“Ah, it’s nothing much. You know, to confirm what you just said…”", "He trailed off as the corner of his mouth curled up.", "“And to ask what their intentions are.”", "*", "Same time.", "A party was underway in a room tucked away inside Carpe Diem’s building."]}