{"cid": "465", "title": "Chapter 465. Two Cards (1)", "content": ["The allied force started the attack.", "The curtain of the final act was finally lifted.", "The cavalry unit led by Teresa charged forward like a raging bull, causing the battlefield to rumble. Behind them was the infantry of the six kingdoms, following wholeheartedly with their spears and shields raised into the air.", "“Charge! Do not fear death!”", "Teresa raised her silver longsword high and shouted.", "“Your parents, your brothers and sisters, everyone in Paradise is praying! The day they have been waiting for is here!”", "Lowering her sword, she pointed the blade toward the Parasites.", "“This war shall be remembered for generations to come! Today will be the day of a glorious victory, the day we regain our home, Paradise! The world shall remember that we were the vanguard of this great war!”", "Teresa shouted at the top of her lungs. The soldiers cheered back, boosting the morale of the troop, and the Horuses also neighed strongly.", "The Parasite Queen’s eyes narrowed. She did not like what she was seeing. The insects that were openly showing exhaustion, the worthless humans falling into despair from her presence, were now charging toward her with their lives on the line. Their action strongly offended her honor and put her in a foul mood.", "[What are you doing?]", "The Parasite Queen waved her hand roughly, her voice openly revealing her displeasure.", "[Fire!]", "The squadron of Evil Phantoms aimed their arms at the incoming cavalry.", "Tatatatatang!", "Several gunshots rang out.", "Screams erupted from multiple places. Flagbearers flew back with holes in their chests, and the Horuses fell and rolled on the ground causing a chain reaction of the Horuses in the back to trip over them and fall.", "The cavalry unit charged forward without minding their comrades’ sacrifices, but the Evil Phantoms continued to shoot endlessly as well. Their bullets pierced through the layers of barriers cast by Priests, sending the cavalry into disarray, and this naturally slowed down the infantry following behind them.", "There was still some distance to go. The troop’s charging speed decreased faster than she anticipated, but Teresa clenched her teeth. This was only the start of the battle, and she knew there was no way the allied force would just watch them be decimated.", "“What are you doing!?”", "At that moment, Vidalif’s voice resounded behind the central troops.", "“Are you going to let them die? Hurry!”", "He raised his voice and personally placed a blue rock into a cannon. Once the Dwarves standing beside the cannon hurriedly aimed the muzzle, the Sky Fairies behind them instantly chanted a spell.", "“Fire until the muzzle turns red!!”", "Pang, pang! Pang, pang, pang! The cannon aiming at the Parasites belched out a raging flame. Next, the Sky Fairies aimed their cupped hands toward the flying Thunders.", "“El Jin Acceleratio!”", "A fierce wind stormed forth.", "Chweeeek!", "The Thunders, accelerating with the power of Wind Spirits, swept toward the Parasites.", "Flash!", "Blue flashes erupted everywhere, obliterating everything they touched.", "Not only that…", "“Maintain this altitude! Turn 30 degrees to the left! Fire!”", "Hundreds of ballistas fired boomerang blades one by one…", "“FIRE! Do not hold back and use everything!”", "And Spirit Arrows shining in colorful lights rained down from the sky.", "The Parasite Queen grunted quietly. The allied force seemed to have scouted their formation in advance as more than half of the Evil Phantom squadron had been eliminated.", "Furthermore, the boomerang blades were sweeping through the Parasite ranks, and arrows were raining down as well. This naturally slowed down the Evil Phantoms’ firing speed.", "Teresa’s complexion brightened. The soldiers beside her supported each other and rushed forward.", "[...Second Army!]", "Kkaduk! The Parasite Queen gritted her teeth.", "[Crush them!]", "Unsightly Humility swung his sword as soon as the Queen gave her order.", "—Krrrrr!", "The spectral horse raised its front legs threateningly and then stomped down.", "Uwooooooooh!", "Unsightly Humility’s undead army charged forward. They had no intention of clashing with the enemy army. In the next moment, the bodies of the undead army turned translucent.", "Fluidization.", "The barrage of boomerang blades and arrows all phased through the undead army. Fluidization allowed them to gain immunity to both physical and magical attacks.", "As long as the opponent had no way to attack the bodies that were moved to the spectral realm, there was no way to do any damage to them. Even if a few were capable of using soul manifestation-type magic, there wouldn’t be enough of them to affect the entire army.", "And so, they would destroy the humans and foreign races from within and reach their main camp in an instant. That would be the start of an indiscriminate massacre, just like they had always done.", "“CHARGE!”", "Unsightly Humility charged forward without doubting what would happen from now on. However, his enemies also charged in unperturbed without slowing down.", "‘Hm?’", "Seeing the calvary racing in, a hint of doubt flashed on his face. He expected them to split to the side to avoid clashing head-on, but Haramark’s princess was speeding so fast that the pendant on her necklace was fluttering.", "“Flone!”", "Teresa shouted when the distance between the two armies shortened to about a couple hundred meters.", "[Un!]", "A voice rang out from the pendant she got from Seol Jihu.", "[Let’s go, guys!]", "Flone flew out of the pendant with a puff of black smoke.", "“?”", "Unsightly Humility’s hollow eyes flashed in confusion. A strange smoke cloud had shot up in the air, and it was now expanding tens, no, hundreds of times in size.", "[Kiaaaaaa…!]", "[Kiiiiiiiiiiiiiiiii…!]", "A chilling cry that seemed to originate from the depths of the abyss resounded out. Indescribable despair filled the battlefield in an instant.", "The vengeful spirit unit.", "The first card that Seol Jihu prepared was revealed.", "“That’s…!”", "Unsightly Humility could not hide his shock. He had not seen it wrong. As the king of the undead, he could feel what kind of existences these vengeful spirits were.", "He was faced with an unprecedented situation. Unsightly Humility pulled on the reins and commanded his spectral horse to stop.", "However, the group of vengeful spirits, led by Flone, were flashing their bloodshot eyes and pouncing on the undead army.", "[Kkikkikki, kkikkikki!]", "One vengeful spirit clung onto a ghoul. Then, something surprising happened. The translucent ghoul stumbled to the ground. It resisted the vengeful spirit fiercely, but the ghoul’s arm phased through the spirit’s body.", "Unhindered, the vengeful spirit’s mouth split open to the ends of its ears, and it swallowed the ghoul’s head whole. The ghoul’s body went limp, quickly regaining its original color.", "Similar scenes were happening all over the place. Ghouls, dullahans, skeletons… Some undead species like the wraiths fought back, but most of them were falling without being able to lift a finger.", "After devouring a victim, the vengeful spirits flew off in search of new prey, and the cavalry unit stomped past the twitching bodies of the ghouls.", "A scene that was the complete opposite of Unsightly Humility’s imagination broke out.", "‘No way…!’", "He had to admit reluctantly that fluidization had been broken. The Second Army, which had always stood at the forefront of the battles, was now being beaten back helplessly.", "Unsightly Humility quickly shook off his stupor and faced the cavalry unit crossing through the undead army. He never thought that the allied force would have developed a vengeful spirit unit to counter his immortal army.", "‘If only Abhorrent Charity were here…!’", "He couldn’t help but regret the death of the Third Army Commander, who was a skilled necromancer.", "Death knights, wraiths, and a couple of other species were able to fight back, but the situation wasn’t in their favor. He just witnessed a particular vengeful spirit that was dozens of times larger than the others, sending a death knight flying with a punch.", "Unsightly Humility could no longer sit still. It was because a vengeful spirit, much bigger than the previous giant one, was coming for him.", "Just as he fell back to avoid the charging black smoke…", "Kwang!", "An intense shockwave shook the spot he was just standing on.", "“Haha!”", "The Star of Wrath, Wu Lei, burst into laughter with his greatsword stabbing into the ground. An Executor had appeared.", "His spectral horse cleverly leaped away and escaped the range of the shockwave. However, a purple magic circle appeared in the air, summoning a group of fully-armored battle maidens.", "Unsightly Humility swung his sword in a wide arc, pushing aside the attacking Valkyries. But because of the Valkyries, he failed to see thin threads creeping forward at breakneck speed and tying the spectral horse’s legs.", "After coiling around unnoticeably, the threads then became tight.", "—Prrrr!", "“Shoot!”", "By the time Unsightly Humility noticed, the spectral horse was already being dragged to the ground.", "The problem was that this was only the beginning. Unsightly Humility turned around abruptly to save his steed, and the black smoke that was hurling in toward him grazed past him.", "Crack!", "His left shoulder was torn off with a bone-crushing sound. Unsightly Humility landed on the ground after barely picking himself back up, then tilted his head.", "[Mm… you’re not very tasty.]", "A terrifying ghost with hundreds of years of vengeance was munching on the left arm of Unsightly Humility.", "[But well, an Army Commander is an Army Commander. I’ll eat it since it’s good for my body.]", "Judging by how her energy was increasing with each bite, she seemed to be a Servant of Gluttony. Although Unsightly Humility lost his arm from a moment of carelessness, he quickly assessed the situation and made a judgment.", "‘I can only feel half of the energy of gluttony…. There must be another one.’", "Knowing that the Authority of Gluttony was distributed evenly among Servants, Unsightly Humility stood on guard and clenched his teeth. Having lost an arm, he no longer dared to be careless.", "It was certainly a mistake on his part, but he never imagined that such a threatening attack would fly at him in all directions.", "“You said one Executor and at least four Servants were needed to buy time against you… do you remember that?”", "Cinzia stepped up to the front, guarded by an entourage of Valkyries.", "“Well, what do you think?”", "Seeing Unsightly Humility, who was stiff like a stone statue, she spread her arms out.", "“I didn’t know what you’d like, so I prepared all sorts of things.”", "Looking around at the group, Unsightly Humility clattered his teeth. There were two… no, three Executors of the Seven Sins. Agnes, who was once the Servant of Sloth, had become the Star of Pride.", "There were at least a dozen Servants following the three Executors, the Servant of Gluttony whom he had to be extra careful about, and a powerful evil spirit that was continually getting bigger.", "Unsightly Humility became lost for words for a second.", "“...What an honor.”", "Then, he fixed his grip on his sword and grinned.", "“This is more like it. I appreciate the treatment worthy of my status.”", "“Appropriate? You don’t think we’re overdoing it?”", "“That remains to be seen.”", "Unsightly Humility began to emanate a fierce energy.", "“I have no intention of falling easily. Well, I will admit that I was a little surprised. To think you would invest so many resources into stopping me.”", "He seemed to be asking what they planned to do about other Army Commanders.", "“Who knows? Why don’t you find out?”", "Cinzia spoke leisurely and shrugged.", "“Don’t think stalling for time is all you need to do.”", "Flashing a beast-like pair of eyes, she grinned.", "“We have enough in reserve to last in the other three places while we take care of you.”", "Unsightly Humility’s eyes flashed deeper. The allied force had just revealed that he was their first target.", "“And what does that…”", "[Hey, what are you trying to pull?]", "At that moment, Flone’s voice cut off Unsightly Humility.", "[You’re trying to buy time, aren’t you? Do you think we’ll fall for it?]", "Unsightly Humility flinched. Flone was right on the mark.", "[No can do!]", "Flone pointed at him and shouted.", "[Gorgonu! Sic him!]", "The large vengeful spirit from the ancient emperor’s villa pounced on Unsightly Humility.", "*", "Same time.", "The Parasites fell into disarray as the two armies clashed. The Second Army was broken through for the first time after having boasted an undefeated record.", "Seeing that it wasn’t looking good for Unsightly Humility, Exploding Patience, who was in charge of the left-wing, could not stand still any longer.", "To prevent the Second Army from being decimated, the Fifth Army’s troops were needed. After all, banshees were also cursed souls like vengeful spirits.", "Since the allied force invested such a huge task force in dealing with Unsightly Humility, there shouldn’t be anyone capable of simultaneously standing their ground on the left and right-wing.", "‘But would he stay still…?’", "She was worried about Seol Jihu but immediately shook off the thought.", "One had to look at the grand scheme of things in a war. Someone of Seol Jihu’s caliber taking his time to deal with her would be more than worth it for her allies. She fully believed that the Parasite Queen would not miss this opportunity.", "Having organized her thoughts, Exploding Patience left behind the parasite and corpse army and only went with her Fifth Army to reinforce Unsightly Humility.", "Rather, she tried to. She came to a sudden stop just as she was flying toward the center.", "“...What?”", "Seeing the allied force, the Banshee Queen’s eyes widened in shock."]}