{"cid": "217", "title": "Chapter 217. Unfulfillable Wish (1)", "content": ["Seol Jihu was extremely curious about Teresa’s dream, but decided to focus on the immediate task at hand.", "'I was too cautious.'", "He now understood. He had tried not to take rash actions thinking that he lacked information, but as Flone had suggested, he should have smashed the damn stone into pieces the moment he saw it.", "While he couldn’t be sure whether that was the correct answer or not, they would have at least not fallen into their current situation.", "The problem was that the mistake had already been made.", "There were two choices that Seol Jihu could take now.", "[Continue the rescue operation.][Try breaking the stone.]", "After a brief moment of contemplation, Seol Jihu chose the first option.", "It was because there was no guarantee that breaking the stone would wake his comrades from their dreams.", "Of course, there was still an option to carry out both of the choices simultaneously, but he had to keep in mind the possibility of escalating the situation.", "To draw an analogy, the five were in virtual reality with a bunch of cords connecting them to the VR machine. Seol Jihu, Teresa, and Phi Sora were already outside the machine, so unplugging the cords didn’t matter to them.", "But what if the cords had been unplugged while they were still stuck in the virtual world?", "Just the thought alone made him shiver. Waking his comrades came first.", "And so, Seol Jihu briefly explained the situation.", "Things would have been hopeless if he was by himself, but due to Teresa waking up on her own, he became much more confident.", "At last, the rescue operation commenced with Seol Jihu and Phi Sora in charge of Maria, and Teresa in charge of Hugo.", "Seol Jihu suggested working together under the protection of the pendant, but Teresa argued that they had to split up to rescue them faster.", "Thinking that her suggestion was also reasonable, Seol Jihu decided to trust her since she had managed to wake up from her dream by herself.", "Everyone took different amounts of time to wake up.", "Perhaps it was due to their different personalities.", "In Maria’s case, for instance, while it wasn’t as long as it took him to wake Phi Sora, it still took a long time to wake her up.", "Maria had become an absolute wreck in her dream. To be more precise, she was pitifully begging on the roadside, rejoicing over even a slice of half-eaten bread.", "It wasn’t hard to find her, but the problem was that she had howled the moment she saw him before violently charging at him.", "'You worthless little shit! Because of you! Because of you, I!’", "Seol Jihu had to soothe the enraged Maria and convince her that everything was a dream for a very long time before she managed to wake up.", "On the other hand, when Kazuki, who had been having nightmares about his sister, saw Seol Jihu appear, he immediately realized that he was in a dream and woke up.", "When Seol Jihu woke up again after rescuing the two of them, he saw Teresa and Hugo lying on both sides of Chohong, firmly holding her hands.", "From the looks of it, Teresa had successfully awakened Hugo and was now trying to rescue Chohong together with him.", "The unexpected turn of events happened when he woke up after rescuing the last member, Marcel Ghionea.", "He had taken a lot of time waking the Archer of Steel up from his dream about his fiancé, but Teresa and Hugo were still asleep.", "At first glance, the trio’s complexions were not good, and all three of them were drenched in sweat.", "Panicking, Seol Jihu hastily decided to help them, but thankfully, the three woke up before he tried anything.", "Teresa started to pant heavily immediately after waking up.", "\"Phew! I’m alive.\"", "\"Ehew.\"", "Hugo shook his head.", "Seol Jihu was finally relieved after seeing the bewildered Chohong.", "And with this, the whole expedition team was successfully saved.", "*", "After the rescue, the expedition team gathered together and sat down far away from the dolmen.", "It wasn’t to exchange opinions, but rather to rest and organize their thoughts.", "It was only right for them to do so. While only 10 minutes had passed in reality, each of them had experienced at least a few days to a couple of months in their dreams. Furthermore, because the dreams were actually nightmares, they were all unsettled.", "\"Is everyone okay?\"", "Seol Jihu looked at each of the members, who were all sitting with their backs to the stone, and asked.", "\"I’m sorry. I made the wrong decision. I should have done something before we saw the stone…”", "\"It’s not your fault.\"", "Kakuzi said in a subdued voice.", "\"Nobody knew what that stone was in the first place. We couldn’t have done anything anyway since it instantly exploded with light the moment we saw it… Rather, we should thank you for rescuing us.”", "And he grit his teeth with a lonely expression.", "\"It was a really shitty dream…”", "\"Kehe!\"", "A strange sound was suddenly heard.It sounded like someone was forcefully holding back their laughter.", "Seol Jihu and Kazuki stopped talking and turned their eyes to find Hugo trembling with a scrunched up face.", "Even Teresa was seen hanging her head with both hands clamped over her mouth and her shoulders visibly shaking.", "\"Ah-! Don’t lau-hahehehe!”", "\"Pffftt-!”", "While Hugo made a strange noise, Chohong, who had been blankly sitting there, suddenly had her neck flush red like the color of the setting sun. She fidgeted, not knowing what to do with herself before sneaking a glance at Seol Jihu. Then she stared daggers at Hugo with killing intent.", "\"What are you laughing about? Are you retarded?\"", "\"Pffuhe!\"", "\"Hey! That’s enough. This fucking bastard doesn’t even know other people’s feelings…”", "\"Pffuhehehe!”", "\"This little son of a bitch.”", "Chohong stood up, huffing.", "She searched the ground, looking for her Thorn of Steel before suddenly scrunching her eyebrows.", "\"Huh? Something’s strange.\"", "Hugo snickered.", "\"Look at her changing the subject out of embarrassment!”", "\"That’s not itttt!\"", "Chohong yelled.", "\"Look at the ground! It’s flashing!”", "Kazuki’s eyes widened at those words. Kazuki immediately stood up after staring back and forth at the flowing mist and the ground.", "\"It’s true.\"", "It was normal for the light to be dimmer the further they were away. However, the light was extremely clear, and it was blinking on and off, like a light bulb at the end of its lifespan,", "\"Hiiiik! W-We have to run!”", "Maria, who had been suffering from the aftereffects of her nightmare, started to convulse.", "They had been resting in the forest, completely exhausted, but they all had the same thought. It was hundreds and thousands of times better to just give up than to have to experience such nightmares again.", "It was then.", "Wiiing—!", "All of a sudden, a disturbing noise that sounded like the whirring of a circular saw rang throughout the quiet forest.", "—Checking the last period of activation.", "—…Complete. 586 years 274 days 3 hours 26 minutes 47 seconds ago. 'Stele of Evaluation' has been successfully activated.", "Without waiting for them to respond, a monotonous mechanical voice rang out.", "'Huh?'", "Seol Jihu doubted his ears at the sudden resounding voice. But regardless of what he thought, the mechanical voice steadily continued.", "—Eight intruders… Correction. Eight humans and one soul detected. The evaluation will now commence.", "At the same time, a blue light swept through the expedition team like an ocean wave.", "—Complete. Passing of the ‘Trial of Nightmares’ confirmed. Evaluation changed from ‘Rude Intruders’ to ‘Unexpected Intruders.’ Preparing Stage 2 alert status.", "—Correction. Soul from the House of Rothschear and ‘Promise of Temperance’ confirmed. Evaluation changed from ‘Unexpected Intruders’ to ‘Legitimate Visitors.’ Stage 2 alert status will be canceled.", "—Additional correction. Two individuals, who passed the trial on their own, identified. The qualification of ‘Awaited Expert’ is granted on top of ‘Legitimate Visitors.’", "The mechanical voice dizzily rang in their ears.", "Maria stumbled.", "\"W-What is it saying?”", "\"I, I don’t know. Visitor? Expert?”", "Chohong also had a dumbfounded face. However, the quick-witted Seol Jihu immediately grasped the situation.", "‘Could it be?'", "Kazuki opened his mouth.", "\"How this voice deals with people probably depends on the identity of the intruders and how they woke up from the nightmares.”", "Seol Jihu thought the same.", "\"You’ve got to be kidding me. You’re saying there is an AI that advanced?”", "\"…Chohong.\"", "Kazuki let out a deep sigh.", "\"Don’t underestimate Paradise’s magic. Several centuries ago, when the Empire enjoyed its golden age and achieved the pinnacle of magic engineering, the quality of life might have been similar to or even beyond that on Earth.”", "\"But still….\"", "Kazuki turned his gaze away as Chohong trailed off mid-sentence.", "\"Anyways, the two individuals that passed the trials on their own would be…”", "He glanced at Seol Jihu and Teresa.", "'But I didn’t.'", "Seol Jihu tilted his head. He was only able to wake up from the nightmare thanks to the pendant.", "The Stele of Evaluation or whatever it was called probably passed anyone who didn’t receive direct external help as successful.", "—Master offers ‘Legitimate Visitors’ and ‘Awaited Experts’ an invitation.", "—If your purpose is only to retrieve the inheritance of the House of Rothschear, please remain standing where you are. If you wish to accept the invitation, please have an ‘Awaited Expert’ place a hand on the Stele of Evaluation.", "The mechanical voice had unknowingly become extremely polite. Like Kazuki had said, it was likely that its attitude changed according to their qualifications.", "\"It doesn’t seem like a bad idea… What will you do?”", "Hearing Kazuki’s question, Seol Jihu glanced at Teresa.", "Teresa also turned to look at Seol Jihu.", "—After 1 minute, the invitation will be determined as rejected and the returning of the House of Rothschear’s inheritance will commence. 59 seconds, 58 seconds….", "There was nothing to think about.", "Seol Jihu quickly dashed forwards.", "Towards the Stele of Evaluation.", "\"Huh? Hey, hey!”", "Seol Jihu heard Chohong calling out, but he didn’t stop.", "Because he had already checked the color with his Nine Eyes.", "The yellow color had receded from the entire area. And in its place, a golden color was shining.", "Not mentioning the Golden Commandment, he reasoned that the disappearance of the color of the left direction meant that the source of danger was gone along with it.", "The Stele of Evaluation was shining in a blue light like before. If there was a difference, it would be that instead of exploding with bright flashes, it was now emitting a soft light.", "Seol Jihu arrived at the stele first, and the rest of the expedition quickly followed. Maria tripped over a rock as she ran with both hands covering her eyes.", "—12 seconds, 11 seconds, 10 seconds, 9 seconds….", "'What an impatient thing.'", "There was no time, even if he wanted to discuss it a bit more.", "\"I’ll go.\"", "Seol Jihu placed his palm on the Stele of Evaluation as he spoke.", "At that moment…", "Wooong!", "A deep sound resounded from the Stele of Evaluation.", "His hand felt hot for an instant.", "A brilliant light rippled out in a circle around the monument, shaking the entire world.", "\"Ahh! Aaaack! I told you! Seol Jihu, you bastard!\"", "Thinking that an earthquake was happening, Maria stomped her feet in frustration and cried out. But excluding Maria, the rest of the expedition team looked around themselves with speechless faces.", "\"The world is….\"", "It was dissolving.", "There was no other way to put it.", "Someone exclaimed.", "\"Unbelievable….\"", "It was most definitely an unbelievable sight. Every time the world shook, the leaves would fall off trees and the clouds in the sky would disappear.", "It was as if someone splashed an undried-painting with water.", "The scene in front of the expedition team disappeared like a lie, one element at a time. And following that, a world that was hiding beneath it began to peek out.", "The unveiled scenery was a world that was beautiful enough to make one’s jaw drop. The area boasted a spectacular view that made the Haramark Palace insignificant in comparison.", "Well-maintained roads, bright trees and plants that received plentiful sunshine planted neatly along the sides of the roads, and the petals that drifted in the wind, glittering with light…", "Soft fragrance entered their nose as they breathed in the air.", "A grand golden palace stood in the center of the dazzling garden. In this indescribably marvelous landscape, the palace covered in gold in all its entirety was truly an awe-inspiring spectacle.", "\"Wow….\"", "Instead of being just ‘grand,’ it was almost dream-like.", "—Welcome to the main pagoda of ancient sorcery, the Pagoda of Dreams.", "The dull mechanical voice rang out again.", "—My Master, the ‘Dreaming Witch’, ‘Roselle La Grazia’ is waiting for you.", "—This way, please.", "The central road leading to the palace lit up in a soft light as soon as the voice finished.", "Seol Jihu stepped forwards as if entranced, and the rest of the expedition team gradually followed after him.", "No one ran.", "Rather, everyone seemed to want to walk a bit slowly.", "\"It’s really beautiful… almost bewitching, even.”", "Teresa couldn’t stop marveling at the sight around her with a dreamy face.", "Seol Jihu agreed.", "Walking along the polished, almost mirror-like road and enjoying the feeling of flower petals tickling his face felt blissful.", "It felt as if he was receiving the worship of all people.", "He felt a strange disappointment when he arrived at the end of the royal road.", "Then again, he couldn’t live here forever.", "Wiiiiing—!", "Collecting his composure, Seol Jihu intently observed the gates that were automatically opening left and right the moment he arrived.", "A short while later, just as Seol Jihu took a step inside after the large gates were completely opened—", "\"I welcome you.\"", "A clear, bright voice, like the sound of a jade marble rolling on a silver plate, entered his ears."]}