{"cid": "299", "title": "Chapter 299. Sweeping Everything Clean (1)", "content": ["Seol Jihu trained until late at night like usual but flinched when he got to the head manager’s room. A neatly folded note was stuck in the door.", "—Are you just going to train until the Neutral Zone is over? Come talk to me!", "The name ‘Miss Foxy’ was signed at the bottom of the note in classy handwriting.", "Seol Jihu broke out into laughter as he opened the door. Now that he thought about it, he hadn’t paid attention to anything that was going on in the Neutral Zone since he started his personal training.", "Over ten weeks had gone by since the start of the Neutral Zone, so there were less than two weeks remaining. With the end in sight, there must be things Kim Hannah needed to discuss with him.", "And so, Seol Jihu got a good night’s sleep for the first time in a while and left his room rather late next morning. His plan for the day was to talk to Kim Hannah and have a look around the Neutral Zone. After all, he was the representative of the managing organization.", "The Neutral Zone was bustling like usual. Due to the high number of entrants, most of the stores were booming. Among them, the regular store was the most eye-catching as many people were gathered there in particular.", "‘Seol-Ah and Sungjin are in charge of the regular store…’", "As Seol Jihu broke through the crowd making a circle around the store…", "“Live~ Live! Ah, live, live, live!”", "He could hear a cheerful singing that sounded like the humming of a skylark.", "“Welcome everyone to the Brother and Sister Store~”", "Seol Jihu almost burst into laughter. Yi Seol-Ah was standing in front of the store, touting for business with a lively dance.", "“Hello~ Nice to meet you~ This is the Neutral Zone’s second floor! I am Sungjin’s Noona~ Yi Seol-Ah!”", "Hopping around left and right, she repeatedly raised and lowered her arms while rattling her hands.", "“Live~ Live! Live with potions! Live with healing water!”", "Looking closely, she had a bottle in each hand. Every time she waved her hands, Seol Jihu could hear the water churn.", "The way Yi Seol-Ah eagerly danced to the rhythm must have come off as cute, as laughter flew out from the crowd. Next, as one of the spectators clapped lightly, the rest started clapping as well.", "“Thank you! Thank you, everyone! I love you!”", "Yi Seol-Ah spread her arms out with a beaming smile.", "“Don’t forget to use our Brother and Sister Store a lot~!”", "Of course, she didn’t forget to advertise. Soon, a good chunk of the crowd entered the store and began to look around. The items on display were needed anyway for the missions, and seeing the lively Yi Seol-Ah made them want to buy more to help support the cute younger sister-like girl.", "Seol Jihu had to admit. He was impressed.", "‘Who would have thought she was good at something like this?’", "His eyes met Yi Seol-Ah’s as she was wiping off the sweat on her forehead. She grinned from ear to ear and waved her hand.", "“Hello~ Hello~”", "“Wow, how do you know that song?”[1]", "“My respected Orabeo-nim~ Hello~”", "“Haha, alright, calm down. Sungjin is about to die from embarrassment.”", "“Let’s go, Yi Seol-Ah~! Dance with your shoulders~ We’re a family~ Paradise and Valhalla~!”", "Now she was singing a military song. Even Seol Jihu was starting to get embarrassed.", "“Okay, okay, you can stop now.”", "But ignoring what he said…", "“Why can’t you~ understand my heart~?”", "Yi Seol-Ah closed her eyes and sang with her hands on top of her heart.", "“…Whew….”", "Yi Sungjin sighed as he watched his older sister, who was too immersed in her role-playing. Yi Seol-Ah was the one singing, but it was Yi Sungjin who was embarrassed for her sake.", "‘Well, at least their business is doing fantastic.’", "Seol Jihu smiled bitterly, vowing to never let Yi Seol-Ah enter the Banquet. He had a feeling she would get too absorbed in Stage 1.", "Going back to the main topic, Kim Hannah was in charge of the weapon store right next to the regular store. She was sitting with her legs crossed when she saw Seol Jihu coming in and got up.", "“Representative Seol! You’re here!”", "She used polite speech, perhaps judging that this was in public. Seol Jihu spoke as he looked around the dozen or so people checking out the store’s weapons.", "“Should I have come later?”", "“No, it’s fine, we have a lot of part-time workers.”", "Now that she mentioned it, the weapon store had a good number of instructors in it.", "“With so many of them here, you can’t be getting that many Survival Points, right?”", "“Fufu, that’s not true.”", "Kim Hannah put her hand over her waist and smiled.", "“Any points used by the customers who come here on their own belong to me. The instructors only get a share when a customer they bring buys something.”", "“…Are you running a pyramid scheme?”", "“Of course, not. It’s purely performance-based.”", "Kim Hannah said firmly before sighing.", "“Anyway, it’s good to finally see your face. It’s great that you’re focused on training, but please show your face every once in a while.”", "The head manager of the Neutral Zone had little duties. It wasn’t that they had nothing to do, but Seol Jihu had already delegated those tasks to Kim Hannah.", "‘If she’s saying this despite that…’", "It didn’t look like she was complaining about the work being difficult, so there must be a matter she needed the representative’s approval on.", "“Alright, tell me. What’s up?”", "“You see, I wanted to ask if you had any thoughts of recruiting additional members. Of course, among the Neutral Zone’s newbies.”", "Seol Jihu’s eyes widened.", "“I thought none of the Contracted or Invited are from us besides Miss Eun Yuri.”", "“That’s right. But it isn’t as if someone has to be our Contracted or Invited for us to recruit them.”", "Seol Jihu stared at Kim Hannah for a while as he thought of a past experience.", "‘Someone from a cartel… and Oh Minyoung, was it?’", "Looking back, there were definitely people who could not form contracts with organizations after the Neutral Zone. Although he was too busy at that time from Sinyoung pressuring him to really notice, what mattered was that a contract could be transferred if both organizations agreed.", "“Why do you ask? Did you find a second Eun Yuri?”", "“…No.”", "Kim Hannah smiled bitterly.", "“I apologize, but it isn’t so common for Irregulars to appear. Survivors like Representative and Miss Eun Yuri might not even appear in a hundred Neutral Zone openings.”", "Hearing this, Seol Jihu asked without feeling a bit uncomfortable.", "“Then?”", "“To be straightforward with you, I am looking to recruit Mister Park Woori and Mister Yoo Yeolmu.”", "Seol Jihu was surprised hearing the two names.", "“You know them?”", "“Is that not obvious? While Representative was focused on Miss Eun Yuri, I was focused on observing those two.”", "Kim Hannah cleared her throat.", "“First, Mister Park Woori is someone I would like to personally recruit. His abilities are nothing special, but his wits are excellent. He is nimble and has good situational judgment. I’d like to try raising him.”", "She was saying she wanted to reinforce the intelligence team.", "Seol Jihu whistled. To be noticed by the picky Kim Hannah… He began to see Park Woori differently.", "‘He was quite daring unlike how he looked.’", "Kim Hannah must be holding him in high regard for noticing the conditions of Homunculus’ attack and delivering the bag to Seol Jihu at the end of the Tutorial’s second stage.", "“As for Mister Yoo Yeolmu— Valhalla’s members gave him favorable evaluations.”", "“Oh, they did?”", "“Yes. They’ve been praising him as a natural Warrior for having a simple personality and withstanding Master Jang Maldong’s training without complaints. Miss Chung Chohong and Mister Richard Hugo have been especially vocal in praising him.”", "“Mister Park Woori and Mister Yoo Yeolmu, huh. Would the organizations they’re contracted to hand them over so easily?”", "“There is no way to be sure, but I believe there is a good chance. You see, forces that can afford to buy stamps don’t get hung up on Archers and Warriors.”", "Indeed, the two men weren’t anything special just based on their classes. From an organization’s perspective, rather than investing time into a resource that they were already abundant in, it might be better to trade them off for stamps and a suitable amount of money and aim for the next opportunity.", "Seol Jihu didn’t think for long. It would be great if it worked but would be fine even if it didn’t.", "He nodded his head in agreement.", "“Alright, let’s do it.”", "“Yes, thank you.”", "Kim Hannah replied knowing that she was the only one suitable for this job. Valhalla indeed had a small staffing problem.", "“Oh yes, Representative, what happened with that?”", "“That?”", "“Our final goal at the Neutral Zone. Well, I’m sure Miss Eun Yuri will take care of it, but I just wanted to confirm. The Neutral Zone is about to end, after all.”", "“Ah.”", "Seol Jihu licked his lips.", "‘Now that I think about it…’", "It was about time to get started.", "*", "The twelfth and final week of the Neutral Zone started.", "A team of six, including Eun Yuri, was in the middle of a Very Hard difficulty mission. It was to secure a bridgehead occupied by Sprites. The core of this mission lied in how fast they could break through the structures interspersed on the bridge while minimizing loss. This was because Sprites were strong in long-ranged attacks but unusually weak in close-ranged combat.", "However, the six people did not cross the bridge.", "Because they had a Magician.", "In truth, they have been doing all missions in pretty much the same way. They would wait until Eun Yuri completed her spell and attacked first, then the other five members would take care of the remaining monsters.", "This also meant that Eun Yuri was a far superior Magician than Odelette Delphine, albeit limited to the Neutral Zone. In fact, the density and range of mana that Eun Yuri could currently command far surpassed what Odelette Delphine could do when she was in the Neutral Zone with Seol Jihu.", "Park Woori stood guard against the Sprites that were starting to get noisy and glanced at Eun Yuri, who was moving her mouth and hands at the same time.", "‘Twice… no, four times?’", "If this scene was from a video, the speed at which Eun Yuri’s mouth was moving made it seem like only her lips were moving at increased speed.", "“——. ———. ——. ————.”", "She seemed to be chanting a spell the way she was murmuring quickly, but Park Woori couldn’t hear a single word no matter how hard he focused.", "He had a feeling that this had something to do with one of her skills. After all, the speed at which Eun Yuri completed spells improved drastically on the seventh-week mark.", "@&[email protected]!&$&.", "As Eun Yuri got closer to completing her spell, the opposite end of the bridge got louder. As Sprites could use minor magic, they were reacting sensitively to the flow of mana they could feel from the other side of the bridge.", "They must have judged that they could not leave it be as over half of the Sprites flew up.", "“They’re coming!”", "Yoo Yeolmu, who was standing at the head of the group shouted as he held up his large shield.", "At the same time, Eun Yuri’s spell halted. She had finished her high-speed chanting. Eun Yuri’s closed eyes slowly headed to the sky. She must have been concentrating hard as droplets of sweat rolled down her cheeks and dropped from her chin.", "Soon, Eun Yuri shot her eyes open and opened her mouth wide.", "“F R E E Z E—!”", "Woong!! A voice imbued with virile mana burst out. She had used one of Roselle’s signature ultimate moves — Final Solo — which amplified the power of the user’s spell by imbuing it with the user’s will when they shouted a keyword.", "As Eun Yuri’s chant echoed out, so did her mana-imbued voice. The Sprites preparing to attack from the sky trembled. However, it was far too late. The wave of cold energy spreading through the voice had already gone past them and was resounding far and wide.", "The Sprites that were hit by the wave got covered with white frost and began to ‘freeze’ quite literally. The team cheered as they saw the Sprites fall to the ground after having their wings frozen.", "This wasn’t the end. When Eun Yuri reached out with her left hand, a sharp gust of wind stormed forth, shredding the bodies of the falling Sprites.", "“Great!”", "The female Priest who took on the role of the leader shouted.", "“Let’s go! We can’t miss this opportunity—”", "The moment she gave out a command to charge forward— Pzzt! Pzzzzt! A terrifying electric discharge suddenly surged out from the lake underneath the bridge.", "The Sprites that fell into the lake screamed, and the Priest flinched and looked behind her.", "“Haa… haa….”", "Eun Yuri held her right hand forward as she drew heavy pants. She was glaring at the lake, looking very angry for some reason.", "“…L-Let’s wait a bit before going. It might be dangerous…”", "Shortly afterward, the group of five excluding Eun Yuri began to cross the bridge. As most of the Sprites struck by the wave froze and fell to helpless states, the group wasn’t bothered by any attacks coming their way.", "The ones that fell into the lake had already died. The five people only had to take care of the other unmoving targets.", "While finishing off the Sprites one by one, Park Woori tilted his head.", "‘Strange.’", "The usual Eun Yuri would have saved a spell for an emergency. But for some reason, she went all out today without holding back. It was as if she was venting her frustration at the Sprites.", "Park Woori turned back curiously, then made a surprised face. Eun Yuri, who was slowly walking over the bridge, found a Sprite and ran up to it. Although the Sprite was already dead, she nudged it a couple of times before kicking it like a soccer ball with a frustrated face.", "Seeing the Sprite’s head fly into the distance, Park Woori suddenly felt pity for the poor creature.", "Soon, the scene warped. They had returned to the Neutral Zone after completing the mission.", "“Great! We’re finally done!”", "The Priest clenched her fist after confirming the paper hanging on the second row of the mission board vanish. With this, they had completed all the missions they could do.", "The only one that was left was the Impossible difficulty mission. Although they normally wouldn’t even dream about completing it, the Priest stared at Eun Yuri with a hopeful gaze. It wasn’t only her. The other four members also had looks of expectation.", "“Yuri Unni?”", "As the Priest struck up a chummy conversation, Eun Yuri, who was dazedly staring in the empty air looked back.", "“When are you planning on doing the Impossible difficulty mission…?”", "“…If you want, we can do it today. Right now, in fact.”", "Eun Yuri spoke in a quiet voice.", "“But, there is something we need to do before that.”", "“Ah, the conditions, right? I remember them, don’t worry.”", "“I’m sorry, but I don’t trust in verbal promises.”", "The Priest, who replied with a smile, blinked rapidly. Was she mistaken in thinking that Eun Yuri had an unusually sharp tone today?", "Eun Yuri continued, “So I’d like you to sign a contract.”", "“A contract?”", "The Priest rolled her eyes.", "“Um… Unni, I thought contracts didn’t exist in the Neutral Zone.”", "“I can just make one.”", "“No, I mean the contracts imbued with the gods’ oath. It’s not like the contract shows effect just by having us write it. Well, I’m a Priest, so I can swear upon my god’s name, but for the others—”", "“Miss Priest.”", "Eun Yuri cut her off.", "“I told you I can just make one.”", "The Priest became lost for words at her cold tone.", "“My name isn’t Priest….”", "She pouted while muttering in a crawling voice. But not fazed in the slightest, Eun Yuri took out a paper talisman from her pocket.", "She tore the talisman in half without a shred of hesitation, and a bright light burst out and formed a new paper. After reading the content of the paper with apathetic eyes, Eun Yuri handed it to the Priest.", "“Compulsory Performance Contract…?”", "The content of the contract was simple.", "—Eun Yuri (hereinafter referred to as “A”) and the five members who will carry out the Impossible difficulty mission in the Neutral Zone (hereinafter referred to as “B”) shall form this contract to be carried out immediately after the completion of the mission. A and B shall sign this contract as evidence of their agreement.", "—A must use a paper talisman to carry out the Neutral Zone’s Impossible difficulty mission.—A must use the paper talisman within six seconds of the start of the Neutral Zone’s Impossible difficulty mission.However, if an unforeseen event prevents the use of the paper talisman, the time taken to resolve this issue shall not be counted toward the six seconds, and the time frame shall be extended automatically.—When A and B complete the Impossible difficulty mission, B can receive the ‘172,800 Survival Points reward’, distributed according to the Neutral Zone’s rules.However, the ‘one-time use VIP store coupon’ given to B must be yielded to A, and this is to be done as soon as the mission is completed.", "The Priest’s eyebrows went up after checking the content of the contract. What was written on it was the same as what they talked about before. But what surprised her was that the magic contract suddenly appeared out of nowhere just by ripping a piece of paper.", "“I have a question.”", "Just as she was about to ask how Eun Yuri did it…", "“You don’t have to sign it if you don’t want to.”", "Eun Yuri replied sharply. The Priest blinked rapidly.", "“N-No, it’s not that I don’t want to.”", "How could she not want something that was essentially free 28,000 Survival Points?", "“It’s just that…”", "“I have no intention of changing the terms of this contract. There are other people who would be interested, so you don’t have to try to convince me.”", "The Priest’s complexion began to turn sour.", "“No, wait, when did I ever say I didn’t want to sign it?”", "“Then sign it.”", "“Excuse me, Unni, did I do something wrong?”", "The Priest’s voice went up slightly. They were comrades who had gone through life-or-death missions together. Although she understood that the contract was important, she was justifiably disappointed with Eun Yuri pressuring her so much.", "“Ehei, let’s not get too heated up.”", "As the perfectly fine team began to show signs of internal conflict, Park Woori, who had already been reading Eun Yuri’s mood, cut in.", "“Why are you like this all of a sudden? Do you hate me, Unni?”", "“Eii! She just wants to be sure. Isn’t that right, Missus?”", "Park Woori spoke eloquently. However…", "“I told you not to call me that.”", "Eun Yuri’s expression became even colder.", "“I’m an unmarried maiden. I don’t understand why you keep calling me Missus.”", "Park Woori shrunk back at her frosty voice.", "“So-sorry…”", "“See, see! She’s suddenly like this!”", "The Priest shouted again, and Park Woori went, “Ah.”", "“Now, now, Priest-nim, calm down a bit.”", "“Excuse me, why are you also calling me Priest? I have a name, you know?”", "“I understand, I understand. Leader, you’re too heated up right now.”", "“But come oooon! She’s not like this usually! Also, my name is…!”", "While the Priest blabbered on and Park Woori worked hard to settle the situation, Yoo Yeolmu stared at Eun Yuri, who was standing with her arms crossed.", "Even he thought she had gotten a bit cranky.", "It wasn’t that there were no omens. Eun Yuri became overly touchy a week or two ago, and ever since then, she had been in a downcast state.", "“Did something happen recently?”", "Once Yoo Yeolmu stealthily initiated a conversation, the calmly standing Eun Yuri glanced back at him. Then, after a moment of hesitation, she bit her lower lip.", "“…I have a question.”", "“Yes, go ahead.”", "“What does it mean when a guy gives a girl a ring?”", "“Mmm… it depends. It could be a normal gift, but at the very least, I’d say he sees her in a favorable way.”", "“Then—”", "Eun Yuri drew a breath.", "“What does it mean when a guy who has a girlfriend gives a ring to another girl?”", "“…Pardon?”", "“Ah, just for the record, this isn’t about me. I’m asking for a friend.”", "Yoo Yeolmu furrowed his brows. He sneaked a glance at Eun Yuri’s left hand, but he couldn’t see it because she had her arms crossed.", "Eun Yuri asked again, “And what does it mean when a guy who has a girlfriend puts a ring on a girl’s left ring finger while calling it a gift just for her?”", "“He’s flirting.”", "Yoo Yeolmu spoke firmly.", "“Putting a ring on a girl’s left ring finger is a well-known custom, both in the East and the West. It would be difficult to find someone who doesn’t know this.”", "“That’s what I thought.”", "Eun Yuri agreed with a complicated face. Yoo Yeolmu became curious and asked.", "“So, um, who is this about?”", "“….”", "Eun Yuri’s lovely lips became crooked.", "“I don’t know.”", "Eun Yuri hmphed and turned away.", "1. Yi Seol-Ah’s singing an old Korean song from 1991 (famous for being sung a lot in North Korean media). "]}