{"cid": "204", "title": "Chapter 204. Chohong’s Vow (2)", "content": ["The communication crystal glowed earlier than expected.", "Seol Jihu had expected it to take a minimum of a few weeks to a maximum of a few months, but he was contacted only after a few days.", "Needless to say, it was a call from Pavlovici’s crystal.", "Seol Jihu placed his hand on the crystal and let some mana flow into it.", "—It’s me.", "As soon as the crystal lit up, a familiar voice rang out.", "Because it was the middle of the night, the crystal was filled with darkness, but he could tell the caller was Phi Sora just from her voice.", "Phi Sora calling him from the crystal he had given to Pavlovici meant…", "\"There must have been an attack.\"", "—Yep. You should set up a tent and a crystal ball.", "Phi Sora giggled. Seeing as how she was laughing, she must have accomplished her mission without a hitch. Thinking so, Seol Jihu’s voice became lighter.", "\"I’m glad you’re okay.\"", "—Why? They weren’t even enough for a warmup. Well, they were more than enough to kill these four, but they were nothing in front of me.", "Phi Sora boasted proudly.", "\"What about Mister Marcel Ghionea?”", "—I think I heard him say he was going to catch the guys keeping watch… Ah, wait a moment. He’s coming over now.", "The dark environment displayed through the crystal slightly shifted.", "—Yes, leader.", "Marcel Ghionea’s voice was so calm that it was hard to believe he was in combat just a moment ago.", "—Reporting. 12 combat members and 4 sentries. A total of 16 men in the ambush squad. Of these, 10 people in the combat team were killed while the remaining 6 have been captured.", "\"You’ve killed quite a few.”", "Marcel Ghionea clicked his tongue.", "—There was no choice. Not only did Miss Phi Sora not restrain herself, one of the four men got hurt, raising a lot of commotion…", "—Why are you using me as an excuse?", "Phi Sora’s disgruntled voice rang out.", "Seol Jihu quickly opened his mouth.", "\"I’ll head over right now.”", "—I don’t think you need to come.", "\"Huh? Why?”", "—There was a face I recognized.", "Marcel Ghionea quietly continued.", "—I interrogated one of the sentries on my way back. They’re ruffians that wander around the backstreets of Haramark. They live by what they earn day by day.", "\"Then….\"", "—It’s the same method as before. They commissioned this work without revealing their identities, making it no risk even if they fail.", "—If I may speak my opinion, they may just be trying to test the waters…", "‘Were they suspicious that we let the four walk away alive?’", "Seol Jihu’s eyes narrowed.", "\"Can you show me the face of any one of them?”", "—Of course!", "Marcel Ghionea obediently complied to Seol Jihu’s troublesome request. After seeing the captured men for himself, Seol Jihu became certain.", "'It’s different.'", "The scene was different than what he had seen in the vision. And there weren’t just one or two differences.", "The assailants were all male. There wasn’t a single woman seen in the team. Also, a purple snake tattoo could not be found on any of their necks.", "—What should we do with them?", "\"Kill them all.\"", "Right after saying that, Seol Jihu was surprised at himself for having given such a command. Telling him to kill them came out too easily.", "He suddenly thought about whether to use the six captives like he did with Pavlovici.", "'…No.'", "But as soon as he asked himself, ‘What happens to them on Earth if I kill them in Paradise?’ he realized it was a silly compassion and decided to harden his heart.", "He had already murdered people. And above all, it was a dog-eat-dog world.", "Seol Jihu did not withdraw his command and asked to talk to Pavlovici instead.", "—…Yes.", "A low but clearly trembling voice rang out. It sounded like he was in a daze.", "\"I won’t speak long.\"", "Seol Jihu asked in a tone that told him he expected an immediate decision.", "\"What do you plan to do?\"", "A reply did not come right away.", "But as if he had somewhat come to his senses while Seol Jihu was talking with Phi Sora and Marcel Ghionea, Pavlovici replied quickly.", "—What… What do we need to do?", "Heavy breathing flowed out as if he had only started to breathe again now.", "Seol Jihu, who had been concentrating on the voice over the call, curled his lips up.", "Pavlovici was fear-stricken but Seol Jihu did not feel any distrust coming from him anymore. Then again, since Seol Jihu had accurately proven himself as if he knew both their past and future, Pavlovici would have had no choice but to believe.", "\"There’s nothing you need to do right now.”", "Seol Jihu opened his mouth.", "\"I will call later. But until then…”", "—You want us to stay low and hide ourselves.", "Survival instincts caused humans to overcome their limits. Pavlovici, who had immediately understood Seol Jihu’s intentions, continued with clenched teeth.", "—I know a hideout that only the four of us know. We will be hiding there for a while.", "\"Where is it?\"", "—…It’s the Eva Church. Its exact location is a bit hard to explain.", "Pavlovici hesitated, but he did not hide everything. Seol Jihu smiled, carefully observing the crystal.", "\"Okay then. I hope my call reaches you in the future.”", "After cheerfully bidding farewell, Seol Jihu ended the call.", "His smile receded the moment the light turned off, and he tilted his head back to look at the ceiling.", "'Testing the waters, huh….'", "The enemy was not stupid. Rather, they were a professional group with a lot of experience in these matters.", "Jang Maldong, Seo Yuhui, Agnes.", "The three people that had their own unique perspective of Paradise had all cautioned him to be wary of this enemy. As such, they shouldn’t be dumb enough to pounce on a bait he had thrown out just once.", "‘I shouldn’t rush in recklessly.’", "There was an old term called ‘Sun Run’ in the game of blackjack. Simply put, it was another word for a winning streak due to a continuous stream of good cards.", "It was a gambler’s rule of thumb to never leave the seat when they were on a Sun Run.", "On the other hand, there were also situations when they had to immediately get up and leave.", "Seol Jihu had felt the fire on the cards, that were the four men, weaken just a moment ago.", "His long experience in gambling told him.", "If he kept playing because he was winning, he would get swept into a ‘bad shoe’ (a situation where only bad cards come in), so he had to quickly fold.", "‘Slowly.’", "Either way, he had already succeeded in keeping the noose alive. The only thing left was to slowly tighten it without having the enemy notice. Then at some point in time, the rope would choke the enemy’s neck.", "\"Fuu….\"", "After organizing his thoughts, Seol Jihu let out a sigh. He still had some regrets. There must have been a better way of utilizing the four men. After all, he needed more information.", "He would feel reassured if he had an expert in these kind of things.", "The person that came to his mind was naturally Kim Hannah.", "He had an unfounded belief that as both Paradise’s greatest scout and its most infamous scammer, Kim Hannah would have screamed ‘Just which bastards dared to touch my contractee?’ before solving everything.", "It wasn’t that he didn’t try contacting her. He had actually tried calling her for advice, but the call didn’t go through. It had never happened before, so he couldn’t help but be worried.", "'I hope nothing happened to her….’", "Of course, he had to consider the possibility of her having gone back to Earth, but he still felt uncomfortable.", "'Do I have to visit Scheherazade…?’", "He finally knew why Kim Hannah had placed so much importance in keeping in contact. Just as he was about to call her again, just in case…", "\"Hey!\"", "Accompanied by the sound of the door slamming open, Chohong barged in the room. She must have just taken a shower as water dripped down the ends of her hair.", "\"Whacha doing? You look like you were trying to call someone.”", "\"Ah. I was just thinking about a few things.”", "\"Thinking? About what?\"", "\"I feel like we need more people.”", "When she heard that he was considering recruiting more people, Chohong stuck out her lower lip and nodded.", "\"Umm… Well, capable people would always be welcomed, but why? Are you going to recruit a Priest?”", "\"We definitely need a Priest, but I was also thinking of someone who could help me. A secretary if you will.”", "\"Do you have anyone in mind?”", "\"I do. Although it’s only a thought.”", "Chohong who had only asked casually suddenly became curious.", "\"Oh? Who is it? Tell me. I want to know.”", "\"Well. Yuhui Noona would be perfect as a Priest.”", "Chohong’s face hardened at that moment.", "\"And I was thinking Kim Hannah would be good as a secretary.”", "She knitted her eyebrows as if she was saying, ‘What kind of dog-eating-grass nonsense are you spouting?’", "\"Why are you staring at me like that?\"", "\"…Hey! You’re not serious, right? You’re just joking, right?”", "\"I’m serious. Why? Can’t I recruit them?”", "Seol Jihu asked her with a serious face.", "Chohong carefully stared at his face for a while before suddenly roaring with laughter.", "\"Puuhahahheheha!\"", "Seol Jihu dumbly looked at Chohong, who was grabbing her stomach, dying of laughter.", "\"Wow, just… Wow…”", "After a good laugh, Chohong took deep breaths while wiping off tears from her eyes.", "\"Ahh— I haven’t laughed like this in so long. They say that stupid people are the funniest when they’re serious.”", "\"I don’t understand why you’re laughing.”", "\"Well, would you look at yourself? Hey, being overly serious is an illness, you know? Or what, do you have narcissism?”", "“….”", "\"Look here. Even if we’re Haramark’s greatest team, those people are surrounded by High Rankers!”", "Again.", "\"Pffft!\"", "Chohong barely stifled her laughter and slapped Seol Jihu’s shoulders.", "\"I wasn’t going to laugh if it had been someone like Kazuki, but what? The Daughter of Luxuria would be perfect? Miss Foxy would be good? I can’t even, pffahahaha!”", "She couldn’t hold back anymore and laughed her head off.", "\"Those two have reached the pinnacle of their respective fields, but here you are trying to recruit them into our team. Go drink some cold water and come back to your senses, you bastard.”", "Seol Jihu got angry hearing Chohong repeatedly tell him to stop dreaming.", "\"Who says they won’t come?”", "\"Oooooh? Reallllyy? Well it’s good to dream big.”", "\"Chung Chohong…\"", "Seol Jihu’s eyes became serious.", "“Just what do you plan to do if I actually go and manage to recruit them?”", "\"Oh?\"", "Chohong made an expression that said ‘Will you look at this?’ and snickered.", "\"Hah! Hey, if you manage to bring in even one of those two, then I’ll serve you as my hyung for the rest of my life. No really. I’ll call you Hyung whenever I see you.”", "Seol Jihu clenched his teeth seeing Chohong act cheeky.", "\"I wouldn’t be your Hyung, but your Oppa.”", "\"Sure sure~ Whether it’s Hyung~ or Oppa~ I’ll be very~ polite and well-mannered. So go ahead and recruit them first.”", "Seol Jihu ground his teeth.", "\"You, don’t you dare forget what you said just now.\"", "Chohong raised both her hands and nodded her head.", "\"Yes, yes~ Although I currently serve Ira, as a former Priest, I vow upon my divine powers with Invidia as my witness. Are you happy now? Hmm?”", "A vow with divine power on the line. A glint flashed past Seol Jihu’s two eyes.", "\"…Good. Now let’s see how things turn out.”", "\"Ehew. You cute little punk. Still unable to come out of your rose-colored dream.”", "Lightly pinching Soel Jihu’s cheek, Chohong giggled before turning around. She plopped herself down on his bed and suddenly asked a question she had just thought of.", "\"Hey, assuming that you somehow manage to bring them, what are you planning on making me call you?”", "Seol Jihu, who had been grumbling to himself, placed a cigarette in his mouth before glancing sideways.", "And he replied.", "\"Hubby.\"", "Chohong’s face was replaced with a dumbfounded look.", "Seol Jihu smirked.", "\"You think that’s all? The next day will be ‘My love,’ the day after that will be ‘Dear,’ and the day after that will be ‘Darling’…”", "\"Uhuh. Keep dreaming. How dare you make this Chung Chohong-nim… Hmph. Why don’t you just go and make me call you ‘Dear Husband’, huh?”", "\"Ah. How about ‘Master’? Or…”", "Seol Jihu quickly ducked in the middle of speaking. It was because a pillow had come flying at him out of the blue, breaking the sound barrier.", "\"You sure dream big, huh? Ya bastard!”", "\"Dreams become reality, don’t you know?”", "In that deep night.", "\"Whatever, say that after you bring them!”", "\"Ah I will!”", "The voices of a man and a woman roaring at each other were heard in a room of the Carpe Diem office for a long time."]}