{"cid": "458", "title": "Chapter 458. Yoo Seonhwa", "content": ["“Call us often.”", "His father dropped Seol Jihu and Yoo Seonhwa in front of Seol Jihu’s apartment before driving off. Now left alone, an awkward air flowed between the two.", "“Uh… should we go in?”", "Seol Jihu broke the silence first. Yoo Seonhwa nodded. She put on an apron as soon as she walked in.", "“Let’s eat first. I’ll make you your favorite dish.”", "“But I just ate.”", "“You can eat more. You lost a lot of weight while you were at the hospital, you know.”", "That was true. Because he relied on medication without eating any food, he had lost close to five kilograms. When he revived in Paradise and opened his status window, his weight had been one of the things that shocked him.", "Tong, tong, tong…. Yoo Seonhwa calmly sliced green onions. She seemed to be in thought, or perhaps she was just concentrating.", "Seol Jihu stared at Yoo Seonhwa’s back as she prepared the ingredients. It almost felt like they returned to the past.", "‘Baek Haeju….’", "A gentle smile surfaced on Seol Jihu’s face as he thought about his first meeting with her in Paradise. Then he said in a soft voice.", "“Haeju.”", "Tang! The kitchen knife struck the cutting board. Ten seconds later, Seol Jihu realized he made a mistake. He had accidentally said Baek Haeju’s name because he was thinking about her.", "Yoo Seonhwa was frozen, not moving a single finger, with the kitchen knife in one hand.", "“Well, um…”", "When Seol Jihu shook his hands in a fluster, Yoo Seonhwa’s head turned to the side like a stringless puppet.", "“As I thought…”", "She looked at Seol Jihu with her eyebrow raised and smiled beamingly.", "“You knew…?”", "Seol Jihu was scared out of his mind. Yoo Seonhwa usually put up with his jokes, but she hated it when he joked around during serious times.", "Seol Jihu had to take some time to explain that it truly was a mistake. After the meal, Seol Jihu did the dishes, and Yoo Seonhwa prepared tea.", "Only when they came face to face with each other did the mood finally settle for talking.", "“I’ve been thinking about it a lot. I didn’t sleep a wink last night either….”", "Yoo Seonhwa started.", "“How to bring it up, where to begin… I decided to tell you who I was, but I didn’t expect it to be this way.”", "Baek Haeju was an Earthling who was active even before Seo Yuhui. Or at least, that was how it was known in Paradise. She must have been active in that world for at least ten years then.", "Seol Jihu, who was only now nearing his fourth year, already had so much to say, So he could not imagine how many stories Baek Haeju would have to tell.", "“So I’m hoping you’ll ask me what you want to know. I promise I’ll tell the truth.”", "What I want to know… Seol Jihu pondered before smiling blandly. He couldn’t think of anything. And so, he organized his thoughts and began with a simple question.", "“When did you first enter that place?”", "“In 2013. I’m a March graduate.”", "Seol Jihu’s eyes widened.", "“Wait, 2013…? You mean when you left for overseas study?”", "“Yep.”", "“If you’re a March graduate, that means you entered that world later than Yuhui!”", "“That’s right.”", "Yoo Seonhwa smiled.", "“Baek Haeju is a manufactured character. Someone who entered that world before Miss Seo Yuhui would have had to enter in August of 2012 at the latest. There is almost no record from that time left. There wasn’t a Tutorial like now either.”", "“August? Not March?”", "“Oh, you don’t know. In the beginning, Neutral Zones didn’t open in just March and September. They opened all the time, almost twice a month, and more than a few opened up each time too.”", "Seol Jihu did a double-take after remembering that several Neutral Zones opened up after the valley war.", "“The reason I lied about when I entered Paradise is… well, I’m sure you already know. You should know the concept of what happens in Vegas, stays in Vegas doesn’t apply to that world.”", "“Ah, so that’s why….”", "“Anyone who tried to investigate me, believing only in the rumors that I entered Paradise before Miss Seo Yuhui, wasted their time. Even now, no one’s found out about my identity on Earth.”", "“I’m surprised you hid it so well. I would think there must have been at least a few tenacious guys.”", "Seol Jihu marveled.", "“They might have realized that Baek Haeju is a fake name, but that’s probably as far as they got…”", "Yoo Seonhwa shrugged.", "“It wasn’t that hard. Of the people who entered before 2013, those that survived probably aren’t enough to be counted on one hand. In fact, Miss Seo Yuhui might be the only one alive.”", "“It’s that bad?”", "“It can’t be helped. People from Earth were cooperative in the beginning, but the situation was ironically the worst as well.”", "Yoo Seonhwa continued.", "“Everyone was low-leveled, there weren’t any standards in how teams and the general system operated, and countless people appeared and disappeared every month…. Until organizations appeared and Earthlings became established, it was a series of chaos.”", "Seol Jihu nodded. He could imagine how bad things must have been when Earthlings first entered Paradise.", "On the other hand, he felt a little regret.", "‘I should have done it like Seonhwa….’", "That way, his family wouldn’t have been in danger on Earth. Of course, not that it would have been easy to find a method to change appearances and also someone to help with fabricating a past.", "“Ah, about that….”", "Upon asking, Seol Jihu heard the full account of the Dragon’s Nest Expedition. He then looked at Yoo Seonhwa with a look of envy.", "An artifact that could change one’s appearance, an ancient weapon, riches, and even potions that accelerated one’s growth—Yoo Seonhwa obtained all of these at once.", "“Oh come on, it’s true that I obtained a lot of benefits there and soared in strength, but I still can’t hold a candle to you.”", "Yoo Seonhwa gave a sidelong glance. Indeed, Seol Jihu’s rate of growth wasn’t any less than Yoo Seonhwa’s.", "“You know… I always thought it was weird.”", "Seol Jihu scratched his head.", "“I know Yuhui is your friend, but you always came to help whenever something happened, unlike what the rumors said about you.”", "“....”", "“And you came to see me often when I was in the Path of the Soul…. I didn’t have time to pay attention to my surroundings back then, but in retrospect, there really wasn’t a reason for Baek Haeju to be so considerate of me.”", "Seol Jihu smiled bitterly.", "“Still, I never expected her to be you. You said you got a scholarship when you were studying overseas, so I always thought you were studying hard.”", "“I also prioritized that world more than Earth when I first entered.”", "Yoo Seonhwa paused for a moment before continuing.", "“There are plants and seeds there that don’t exist on Earth. Since the flow of time is different too, I also thought I would have more time to study.”", "She smacked her lips and then continued.", "“Then one day, the organization that invited me was wiped out in an expedition…. I planned to acquire enough materials and retire by 2015. That’s probably what would have happened if I didn’t retire in 2014 because of an unavoidable circumstance.”", "Yoo Seonhwa’s eyes narrowed. Seol Jihu’s face stiffened. Come to think of it, there was a time after Yoo Seonhwa came back to Korea that he clung onto her all the time.", "It lasted for about ten months. In Paradise’s time, that was about two years and six months.", "Seol Jihu dropped his head. Thinking about his behavior from back then, he was too ashamed even to speak.", "‘Come to think of it….’", "It was strange how Yoo Seonhwa gave out millions of won with ease whenever he went to ask her for money. Seol Jihu became even more ashamed, realizing that the money he received was the money that Yoo Seonhwa had slowly converted, not to have her identity exposed.", "“To be honest… I thought about ending it for real.”", "Yoo Seonhwa’s voice turned low.", "“Do you remember what you said to me when you came to see me last time for money?”", "A cold wind blew. Seol Jihu flinched.", "“...Were those Yankees really that good? is what you said…”", "Yoo Seonhwa’s voice turned icy. Her pupils dimmed as she stared straight at Seol Jihu.", "“Why did you say that…? How could you doubt me? I just couldn’t understand, no matter how many times I thought about it.”", "“S-Seonhwa…”", "“I never spent the money you gave me. I kept it safely. I even refused lunch and dinner offers from other guys and professors. I never gave anyone my number; I tore apart any party invitation letters. People even called me a nun because of it! Looking at your pictures and going to sleep was the sole comfort in my day!”", "Yoo Seonhwa murmured quickly as if she was talking to herself. But she must have had a lot of pent up feelings as tears welled up in her eyes.", "“No, that wasn’t the only time….”", "“....”", "“I’ve thought about it… many times before that….”", "“....”", "“Rather than living like this, maybe I should just kill myself…. Maybe you’ll come to your senses then…. Or maybe we should die together….”", "Seol Jihu remained silent. While he was looking for a hole to hide in, he scanned the room in case there was anything sharp—for example, a kitchen knife.", "“When I think about the time back then…”", "“Is that why you went back?”", "He hurriedly changed the subject. It was because he noticed Yoo Seonhwa entering a more and more dangerous state.", "“...Yeah.”", "Yoo Seonhwa collected her breath, trying to calm down.", "“Every time I wanted to kill myself, I kept seeing Seunghae, Uncle, Aunty, Wooseok Oppa, and Jinhee. I wanted to escape reality, so I naturally began to look for a place to run away. I also wanted to relieve some stress, and I figured maybe that world had something that could turn you back to normal….”", "Seol Jihu was touched, learning that she thought about him even in that state.", "“Anyway, I told myself I would end it hundreds of times… but you know.”", "Yoo Seonhwa’s voice came out trembling. Seol Jihu bit his lower lip. He remembered Yoo Seonhwa’s cold break-up words at least a few dozen times. But when he clung to her, she forgave him at the end, trusted him, and accepted him.", "“I thought for sure you were at it again when you came to my cafe….”", "“....”", "“But something felt off. You brought money for once, and….”", "Yoo Seonhwa glanced at Seol Jihu’s left hand.", "“...Ah, so that’s when you noticed.”", "“I was shocked, seeing a golden stamp shining on the back of your left hand.”", "Yoo Seonhwa heaved out a heavy sigh.", "“All sorts of thoughts swirled inside my head back then. I wanted to protect you somehow, but I knew I would only be putting you in danger if I approached you carelessly…”", "Seol Jihu was frightened as well. If she had really done that, Baek Haeju’s identity as Yoo Seonhwa really might have been found out. That naturally meant danger might have spread to his family as well.", "“So, I urgently asked Miss Seo Yuhui….”", "Yoo Seonhwa slicked her hair back and laughed.", "“But you went beyond my wildest imaginations.”", "“In what way?”", "“What do you think? You kept jumping into the most dangerous situations like you had a knack for smelling them out. Do you have any idea how worried Miss Seo Yuhui was?”", "“....”", "“What was funnier was that you succeeded each time. You came back alive even as a low-leveled newbie when even I would have had difficulty achieving success.”", "“....”", "“But I was still worried, so I tried to pull you out of that world after the first war, but I was rejected firmly. It was a strange feeling, really.”", "Yoo Seonhwa spoke half-jokingly, but Seol Jihu could not laugh at all. He thought he understood how Yoo Seonhwa must have felt back then.", "The quietly continuing conversation suddenly came to a halt.", "“...Aren’t you going to ask?”", "After a moment of silence, Yoo Seonhwa asked. Seol Jihu raised his head.", "“Why I didn’t tell you about my identity sooner… You’re not mad at me?”", "“No, why would I be? It’s not like I was any different.”", "Seol Jihu never felt angry or disappointed that Yoo Seonhwa did not tell him about her identity. After all, he had not told anyone on Earth about his identity either.", "Yoo Seonhwa gave him a meaningful look.", "“...I wanted to confirm.”", "Then, she spoke calmly.", "“You always apologized to me, and I always forgave you…. I had a feeling it would be different this time, but I didn’t think I would last if I were to get hurt again….”", "She spoke slowly and continued with difficulty.", "“So, I wanted to confirm with my own eyes. Whether you had really changed and were returning to your former self… or if you were pretending to have changed again….”", "So I could prepare myself for it. Yoo Seonhwa muttered quietly.", "Seol Jihu closed his eyes. His cheeks felt hot. He was at a loss for what to do.", "He was sorry… and grateful.", "He felt the same way when he was revived. His achievements in Paradise were not something he achieved alone. He was only able to come this far because of everyone who helped along the way.", "It was thanks to them that he was now only a step away from a future where everyone could smile.", "Of course, that didn’t mean the past disappeared. He could not forget either.", "He knew he had to apologize, but his mouth refused to open from the weight of guilt. It was then.", "“It’s fine.”", "A gentle voice flowed out.", "“The reason I revealed my identity to you is that I was convinced.”", "Seol Jihu widened his eyes and looked up.", "“You know, back then… I actually cried. When I heard Jinhee over the phone.”", "“Huh?”", "“I was worried, thinking that, after losing your memory, you would go back to the way you were in the past…”", "However, Seol Jihu did not do so. Despite struggling from the penalty of death, he did not fall from the edge and hung on.", "“I still remember what you said.”", "Yoo Seonhwa tilted her head as if to reminisce that day.", "“I can’t… I can’t... I absolutely can’t gamble…”", "She closed her eyes, speaking softly as if to savor these words.", "“So…”", "Then, Yoo Seonhwa opened her eyes and gazed at Seol Jihu...", "“It’s okay now.”", "She made a sweet, relieved smile that showed her satisfaction.", "Seol Jihu chatted with Yoo Seonhwa for a long time. Not only about matters of the past but also the future.", "Yoo Seonhwa decided to keep her identity as Baek Haeju for a while. Although she revealed her identity to Seol Jihu, there was no immediate reason to tell everyone else as well. Jang Maldong and a few others had already heard about it, but they were all tight-lipped and trustworthy people.", "Once they finished talking, they decided to go back to Paradise.", "“By the way, are you confident?”", "“Hmm?”", "“In defeating the alien queen, I mean.”", "Seol Jihu smiled unwittingly, finding Yoo Seonhwa’s description of the Parasite Queen rather adorable.", "“Not as I am now.”", "“Really?”", "Yoo Seonhwa asked in surprise.", "“Yep. Now that I’m in a new realm, I can feel just how strong she is. I know she’s bound by several restraints, but I’m still a little anxious.”", "“Then didn’t you set the march date too soon? The Federation said you guys were trying to hurry.”", "“I have a way of making it on time.”", "Seol Jihu spoke as he took out a piece of paper from his pocket.", "“What’s important is that everyone needs an upgrade right now.”", "Seol Jihu glanced at Yoo Seonhwa as he grabbed the piece of paper with both hands.", "“By the way… it feels kind of weird talking about this with you.”", "“Really? I think it’s nice.”", "Yoo Seonhwa grinned as she also held the paper.", "Then, just as the duo tore the paper in half…", "“Oh right, Jihu, there’s something I’m curious about.”", "Yoo Seonhwa suddenly asked.", "“How far did you go with Miss Seo Yuhui?”", "“?”", "“Did you do it?”", "Chwak!", "Seol Jihu finished tearing the paper at the same instant that he was struck speechless.", "Flash!", "The last thing Seol Jihu saw before a blinding light swallowed him was Yoo Seonhwa’s beaming smile.", "Seol Jihu did not go back to Valhalla after entering Paradise. He went to talk with Gula to prepare for the coming days.", "...In truth, he didn’t want to seek out Yoo Seonhwa so soon. She wasn’t with him, seemingly being summoned to another temple.", "In any case, after asking the questions he wanted to, Seol Jihu took the three divinities out of the temple storage and headed to Valhalla. He hummed happily, having received the answer he wanted.", "But when he arrived at Valhalla, there was another joyous news awaiting him.", "The garden was in a total mess.", "“Uaaaak! Someone save me!”", "“What!? Didn’t you lose your strength?”", "Phi Sora and Hugo were running for their lives with their arms up in the air…", "[You damned black sugar bastard!]", "[You stop too!!]", "And a giant monster bird was angrily chasing after Phi Sora.", "“Kyaaaak!”", "[Kuhahaha! Caught you, you little bugger… Hmm?]", "After finally succeeding in biting Phi Sora’s head, the monster bird, coincidentally, turned to the entrance while raising its long neck.", "[You….]", "The flailing Phi Sora fell from the phoenix’s mouth.", "“Yes! I’m alive!”", "Phi Sora stormed off as soon as she hit the ground. However, the phoenix paid no attention to her. It had discovered Seol Jihu staring dazedly at it.", "“You….”", "The corners of Seol Jihu’s mouth curled up.", "“You….”", "The phoenix also turned back to a little chick and chirped.", "Soon…", "“You bastard!”", "Seol Jihu and Little Chick shouted simultaneously and crashed into each other."]}