{"cid": "435", "title": "Chapter 435. Past, Present, and Future (4)", "content": ["The secret of the past was finally revealed.", "Seol Jihu’s face was full of confusion. He saw the vision and even her status window, but it was still hard to accept the truth.", "Like Black Seol Jihu, Seo Yuhui bargained with Gula to deliver her emotions to her past self at the end of her previous life, on a much larger scale than Seol Jihu.", "He recalled how on several occasions, he thought that her unconditional, almost unquestioning affection for him that began when they first met, was strange.", "But he never imagined Seo Yuhui was a returnee like himself. She even lied to him about her age. She was a year younger than him, not older.", "And to think Baek Haeju’s true identity was Yoo Seonhwa.", "Seol Jihu felt dizzy. He shut his eyes tight and dropped his head. His heart was racing and his body was burning like a volcano.", "It was fortunate that he had learned ‘Clear Mirror, Still Water,’ otherwise, he would have exploded here and now. He told himself over and over again to calm down and focus on the matter at hand.", "“Jihu….”", "Then he heard a choked whisper.", "“You also have it… right? Future Vision….”", "Seo Yuhui continued in a weak voice.", "“I didn’t mean to deceive you.”", "Seol Jihu barely opened his eyes and raised his head.", "“I was going to tell you.”", "Seo Yuhui’s lips were quivering and she looked like she was about to cry.", "“I was going to tell you everything when the day you and I have been waiting for comes….”", "“…”", "“It’s true….”", "Her earnest voice also sounded desperate as if begging him to believe in her.", "But Seol Jihu didn’t reply. He couldn’t.", "His eyes, which had momentarily gained light, dimmed again as he stared at Seo Yuhui.", "And then….", "FLASH!", "Another vision began to unfold.", "*", "The Parasite Queen was simply dumbfounded. The muscles of her face rippled every time a new report came in.", "—Unsightly Humility’s army is retreating!", "—The army stationed at the Hiral Mountain Range was annihilated…!", "—Vulgar Chastity lost, and Exploding Patience failed her mission…!", "—The Evil Phantom army was partially destroyed, and the entire Hydra army was wiped out…!", "—Twisted Kindness’ attack only damaged our own forces…!", "—The Star of Lust has chosen to participate in the war…!", "As she listened to the reports of losses coming in….", "[Enough. Enough!]", "…The Parasite Queen flew into a fit of rage.", "Although varying by the situation, the tactic most frequently used by the Parasites was to crush their enemy with absolute force. And this tactic had worked well for them so far because of their troops’ superiority to the enemy, both in terms of number and strength.", "But today, they lost in a fight of pure strength, which they took immense pride in. And that too, against only one person.", "She thought the fish was as good as caught, and the rest would be easy because they had cornered the prey.", "But the enemy was destroying the Parasites with even more overwhelming force. She had never felt more humiliated.", "The Parasite Queen tilted her head back and looked up at the sky.", "Rumble!", "There was a starquake. The tremors of stars accompanied by a massive explosion caused the sky to shake violently.", "At the center of the tremor, which was the center of the celestial sphere, was a star burning brighter than ever. Its light was so intense that it shone over the entire Paradise, dyeing everything in beautiful colors.", "[That bastard….]", "The Parasite Queen squinted her eyes. A small sigh escaped her lips.", "The stimulus called the Parasites seemed to have driven the star into a frenzy, and it was blazing furiously like there was no tomorrow.", "She knew well the nature of a supernova and expected something like this to happen, but even so, the intensity of his reaction was simply outrageous.", "[The First Army Commander was right….]", "It was fortunate that she listened to Sung Shihyun’s advice and didn’t hastily move her forces.", "The Parasite Queen fell into deep thought.", "To be honest, killing him wasn’t hard. Even the Brightest Star wouldn’t survive, for example, if she sent all the Army Commanders to him and ordered them to release their divinities at once.", "The problem was that killing him was not enough.", "Of course, there was no doubt that killing him even once would be a great accomplishment, but all would be pointless if he returned.", "Thus the Parasites had to first render his body unusable before killing him for good to take advantage of the Earthlings’ revival setting.", "Sung Shihyun was right. They should focus on one goal and pursue efficiency only for that goal.", "Twisted Kindness was also right. Rather than oppressing the enemy with pure force, they needed to rely on systematic planning.", "So clearly, the first thing they had to do at this point was to bring the enemy down a notch or two. The Parasite Queen concluded and took a deep breath with a clenched fist.", "[Listen!]", "The Parasite Queen’s determined voice traveled through the complex linkage system centered around her, reaching not only the Army Commanders but also regular parasites who were mere foot soldiers.", "[I hereby command all Nests to migrate near the enemy’s route of retreat and give birth to young ones.]", "[That includes Medusas, Temerators, and Reginas. Travel with the Nests and start the production process to form an impregnable net!]", "[In addition!]", "The dignified voice continued.", "[The First Army Commander and Seventh Army Commander shall stand by at the designated location.]", "[The Second, Fifth, and Sixth Army Commanders shall join forces with the remaining troops and lead the newborns…]", "The Parasite Queen extended her arm in Seol Jihu’s direction with a whoosh.", "[…And perform a piecemeal attack against the Brightest Star!]", "With that, the entire Parasites’ force began to rush toward one human.", "*", "When Seol Jihu activated Future-Gauging Nine Eyes, he noticed Seo Yuhui was shining in three different colors.", "Gold, Yellow, Blue.", "Similar to Yun Seohui, each of these colors showed a different vision.", "The vision that played out after the gold was the yellow one.", "‘Attention Required.’", "Seol Jihu’s face, which initially appeared dazed, soon turned pale with fright as he opened his eyes wide.", "“N-No way…. No…. How…?”", "Seol Jihu stammered in shock. Whatever it was that he saw in his vision, it must have been shocking. Even ‘Clear Mirror, Still Water’ couldn’t calm him down this time.", "Next was the blue.", "By the end of ‘Choice of Destiny’, Seol Jihu was finally able to calm himself down, albeit just a little.", "“J-Jihu.”", "Worried that she might be the reason why Seol Jihu’s expression kept changing, Seo Yuhui appeared restless. She was about to take a step toward him when suddenly all eyes turned to the left.", "An ominous energy was detected in the distance. They heard footsteps and thumping noises.", "—Kiaaaa…. Kiaaaa….", "Seo Yuhui’s ears caught the faint echo of a dreary cry, and she let out a groan.", "“Exploding Patience….”", "The Fifth Army Commander seemed to have finally found them.", "“Jihu.”", "Seo Yuhui said in a nervous voice.", "“I kept my promise. So… please?”", "After a moment of silence, Seol Jihu gave a deep sigh.", "“…Fine. Since we’ve come to this….”", "He still looked a little bitter, but nevertheless nodded.", "Seo Yuhui’s expression lit up.", "“Thank you.”", "“…”", "“I’ll tell you everything when we return. I’ll tell you, even if it takes days to do so. So let’s get out of here alive, together.”", "Seo Yuhui said with a determined expression on her face. Seol Jihu stared at her, or more precisely, at her status window.", "[5. Level of Cognition]—Tender (Sweet and gentle in character.)—Determined—Ambitious (Claims, enjoys, or covets things she feels she is missing.)", "‘Determined….’", "The second slot of ‘Level of Cognition’ represented her current emotion.", "[Yeah! I’ll try my best too!]", "“Alright, I’ve recovered some of my energy. I’ll be able to maintain the other form for a while.”", "Seol Jihu glanced at Flone and Little Chick, both full of enthusiasm.", "The sound was getting closer and closer.", "He tightened his grip around the Spear of Purity and turned toward the direction of the noise.", "Seo Yuhui, now with a much relaxed expression, stood next to Seol Jihu and prepared for the battle that was about to take place.", "Suddenly, Seol Jihu glanced at Seo Yuhui.", "“I didn’t know you were a year younger than me.”", "“Come on, is age really that important?”", "“Of course, it is.”", "“Really? Should I call you Oppa, then?”", "Seo Yuhui giggled and Seol Jihu smiled.", "“Ah, that’s right. Yuhui.”", "Seo Yuhui widened her eyes in surprise when Seol Jihu suddenly spoke casually to her.", "“Can you cover my right while I push forward from the center?”", "“Your right?”", "Seo Yuhui turned her head to the right.", "At that moment, a strange light flashed across Seol Jihu’s eyes.", "“But I don’t see anything.”", "She tilted her head as she turned back to Seol Jihu.", "“I’m sorry.”", "“Huh? What are you—”", "It was then that Seol Jihu’s hand moved like a lightning bolt.", "Tak!", "The edge of his hand struck the side of Seo Yuhui’s neck.", "“Ah….”", "Her eyes widened as they moved toward Seol Jihu. A look of disbelief crossed her face before her eyes closed completely.", "[Eh… Eh? Ehhhh?]", "“You…? What the hell are you doing?”", "Flone and Little Chick’s jaws dropped.", "Amidst their shock, Seol Jihu grabbed Seo Yuhui as she fell to the ground.", "He placed a hand on her soft back and bit his lower lip.", "“You idiot! Are you out of your mind!?”", "Little Chick yelled in anger. He couldn’t think of one reason that could justify Seol Jihu’s action. They still had a long way to go, and Seol Jihu just knocked out a Level 8 Priestess, a quarter of their party, seconds before a decisive battle.", "And she wasn’t just anyone. She came back just for him.", "“Are you crazy? Are you? You crazy bastard!”", "Little Chick screamed at the top of his lungs.", "“I had no choice.”", "Seol Jihu shook his head with a bitter expression.", "“Fuck you! What do you mean you had no choice?”", "“Yuhui’s future…. I saw it….”", "“Future? What nonsense are you talking about?”", "“…No. I won’t allow it.”", "Little Chick seemed speechless.", "Seol Jihu clenched his teeth.", "“I won’t allow that to happen to Yuhui.”", "‘Attention Required.’ The yellow vision showed an endless chain of horrific events that he dared not speak out loud.", "In it, Seo Yuhui didn’t die. Instead, she suffered horrible torture that made death look like a bliss.", "At the end of the vision, he saw that she had become a mother species that gave birth to gods, living a wretched life as a slave to the Parasites and not even permitted to die.", "When he saw Seo Yuhui’s body swelled like a Nest and her face barely recognizable over the bumpy surface of her skin while tears of agony trickled down her cheeks, the shock he experienced was like a punch in the gut.", "She would have lived if she ran away. But because she came back, a new future, that of ‘Attention Required’, was formed.", "And he couldn’t let that future happen. Not to Seo Yuhui. She had to live.", "Fortunately, he knew there was a future in which she survives. The blue vision that played after the yellow showed Seo Yuhui safely returning to the city.", "[Hmm… I suppose so. The other Army Commanders are chasing after them, but they’re only pretending so that they’d distance themselves from you.]", "[They should be able to return alive. As long as they don’t do anything stupid like purposely picking a fight with an Army Commander or coming back to help you.]", "Unsightly Humility had told the truth. The Parasites’ target wasn’t the stele. It was him all along.", "So there still was a way for her to survive. He just had to get Seo Yuhui to leave before it was too late.", "But he knew no matter how hard he tried, the odds of Seo Yuhui doing as he said were zero. She said so herself that she would die with him than leave him.", "When Seol Jihu saw the word ‘Determined’ under her ‘Level of Cognition’, he gave up trying to persuade her. There was no time to argue anyway.", "In the end, he was left with one choice: force Seo Yuhui to leave even if it went against her will.", "Thankfully Flone and Little Chick were here.", "“Little Chick, listen to me carefully. You too, Flone.”", "Seol Jihu looked down at Little Chick, who was still yelling at the top of his lungs.", "“Take Yuhui with you and get as far away from here as possible. If you run into any Parasites, just ignore them. Don’t pick a fight with them, thinking it’s for me.”", "“What?”", "“Flone. If anything unexpected happens, please protect Yuhui with Little Chick. Don’t let her come back to me even if she wakes up in the middle. You know what? Just knock her out again if she shows any signs of regaining consciousness. Do that until you arrive in the city.”", "Seol Jihu’s voice was low but sharp. His expression showed steely determination as if to leave no room for objection.", "[Then… then what about you?]", "Flone asked in a stutter.", "“I’ll take a different route than the three of you.”", "Seol Jihu continued with a sigh.", "“I understand this is confusing for you. But there’s no time for explanations. I’ll tell you everything when we meet again.”", "“Crazy bastard! The four of us have to combine our powers, and even then, that might not be enough to defeat them! Do you really think you can do this alone?”", "Little Chick burst out in rage in a hoarse voice.", "“Let the ghost over there take her! You need at least one ally! I’m your partner!”", "But Seol Jihu shook his head.", "In his vision, he saw both Flone and Little Chick around Seo Yuhui. With even one of them missing, the entire future could change.", "Most importantly, the fact that Sung Shihyun chose Seo Yuhui as his first harem member bothered him.", "“Can’t you fulfill your partner’s last wish?”", "Little Chick tried to shout something, then stopped. He realized through Seol Jihu’s choice of words that his partner was ready to risk even death.", "He had chosen Seo Yuhui over his life.", "At that moment, they heard the long cry of a Banshee.", "While they were arguing, the Parasites had come close enough to be seen.", "Their time was running out, and Little Chick had to make a choice: comply with the request or ignore it.", "“Keuaaaa! You damned fool! I’ve never met a partner like you!”", "Realizing it was too late to persuade Seol Jihu, Little Chick roared and then pulled out one red and one navy feather from his forehead and threw them at his partner.", "Woooong!", "The Spear of Purity absorbed the two feathers and began to shine brightly.", "[Crescent Blade Spear Technique, Fourth Ultimate Art — Mind Spear — has been awakened.]", "[Crescent Blade Spear Technique, Fifth Ultimate Art — Limitlessness — has been awakened.]", "In the face of a never-before-seen danger, the Spear of Purity was awakened to its fifth stage.", "Other than the first head of the House of the Rothschear, the first owner of the Spear of Purity, Seol Jihu was the first partner for whom the Arcus Spirit had unlocked the fifth stage of the spear.", "Seol Jihu looked at the Spear of Purity, surrounded in mystic energy, with a slightly surprised expression on his face before glancing down at Little Chick.", "“What about the Sixth and the Seventh?”", "“You ungrateful rascal! I can’t, even if I want to! You should’ve evolved me to the final stage before all this happened!”", "Little Chick shouted angrily and then clenched its beak.", "“You. Come back alive no matter what. What happened just now is a special treatment. I’ve allowed it because of the present circumstances, but that doesn’t mean you passed the test. Got it?”", "Seol Jihu smirked. Talking about passing the test when he had yet to take one was absurd, but he wasn’t dense enough to disregard Little Chick’s true feelings.", "“Alright. Thanks.”", "Seol Jihu winked at his partner and grabbed his spear.", "Little Chick glanced at Flone. She was still in the middle of a panic attack.", "“Damn it!”", "A bright light burst out from Little Chick’s body.", "Seol Jihu put the pendant around Seo Yuhui’s neck and laid her on top of Little Chick, now in the phoenix form.", "Guilt tugged at his heart as he looked down at her face, dark with worry even though she was unconscious.", "“I’m counting on you.”", "[…Damn it!]", "Little Chick cursed yet again, flapping his wings.", "Flap! The phoenix rose slowly into the air until he finally began to fly in a direction entirely different from Seol Jihu’s escape route.", "[I, I can’t….]", "But Flone hadn’t left yet. Her gaze wavered between Seol Jihu, who stood in front of her, and the phoenix, who was getting farther and farther away.", "She couldn’t bring herself to depart. Because if she did, then Seol Jihu would be all alone.", "[I, I want to stay here!]", "But she couldn’t. Flone was needed to make the blue vision become a reality. Also, Little Chick couldn’t retain the phoenix form for long. They had to take turns flying while protecting Seo Yuhui.", "[I’m gonna stay! I’m dead anyway! So it’s okay!]", "Flone began to beg a moment too late.", "But she was bound to her pendant.", "[No! You promised me we’d be together forever!]", "As the distance between her and the pendant grew, she was forcefully pulled toward her abode.", "[Meanie…!]", "Seol Jihu quietly waved his hand at Flone as she moved away, struggling.", "The two soon became mere dots in the sky.", "Only then did Seol Jihu turn his head forward and prepare for the battle.", "He was relieved of a big worry. All that was left now was….", "‘Let’s go.’", "The pair of eyes glaring at the army of the Parasites slowly began to turn crimson.", "After a brief pause, Seol Jihu kicked the ground with a great force and rushed toward the enemy with his mouth wide open.", "—Heuaaaaaaah!", "Berserk’s roar shook the air.", "—Kiaaaaaaaaaa!", "Exploding Patience’s shriek followed.", "FLASH!", "A giant light shone over everything in the vicinity. Screams erupted, lightning flashed, curses were chanted, and supernovas exploded, rocking the earth.", "Amidst the agony and thundering explosions….", "[Damn it!]", "The Arcus Spirit left everything behind and flapped his wings faster.", "[Damn it, damn it, damn it, damn it!]", "He yelled louder each time he heard an explosion to force himself to focus on flying and not turn back.", "Finally, when the noise subsided, the Arcus Spirit pulled out his long neck and glanced behind his shoulder. It was quieter now, but he could still sense a fight in the distance.", "[Damn… it….]", "Having sensed a brutal brawl, the Arcus Spirit’s face fell in sadness."]}