{"cid": "269", "title": "Chapter 269. The Beauty at the Opening Ceremony (6)", "content": ["Humanity perished.", "No, it was more accurate to say it was on the verge of extinction, but it practically had already perished.", "The Parasite Queen had turned her blade toward mankind as soon as the Federation collapsed.", "She had rarely touched humanity while Tigol Fortress was still standing, but the situation changed after the Federation fell apart.", "Once the Parasite army started their assault, they began to sweep through the entire continent with unstoppable momentum.", "Humanity had belatedly attempted to gather its forces and fight back, but they were beaten too easily, crumbling like a rotten tree with its insides hollowed out.", "Haramark, the city that had held the southern front, was utterly demolished under the invasion of the Parasites.", "Teresa Hussey had scraped together some troops that could barely be called troops and attempted to hold the city, but they were quickly forced to retreat, unable to endure the enemy’s unending waves.", "Eva was the same.", "Evangeline Rose and a few other individuals remained and desperately fought with their lives on the line, but the city was still captured in the end.", "And today. Humanity’s capital went up in flames.", "It was only natural.", "Scheherazade was no longer a safe city after Haramark fell. This was something that was foreseen ever since the Spirit Realm fell, causing Tigol Fortress to be razed to the ground along with the city of Eva in its aftermath.", "There still were cities standing, but it was all too clear that they, too, would soon become ashes.", "They had thought about it too easily.", "Who knew that the temples within the city would close and the portals would be destroyed as soon as the siege began?", "No one had imagined there would be that many traitors— they had just not taken action until now.", "Mankind noticed far too late that they were long since within the grasp of the Parasite Queen.", "And now, they were paying the price.", "*", "Dark smoke could be seen rising from the distance, in the direction of Scheherazade. There was no need to imagine what was taking place there. Living hell, too horrifying to put into words, must have descended.", "Yun Seohui had almost been dragged into that hell, too. If the man in front of her had not interfered and rescued her by carving a path of blood and nearly killing Vulgar Chastity, she would have surely been suffering the same terrible fate.", "Listlessly watching the ominous clouds of smoke rising from the city, Yun Seohui quietly spoke.", "\"Thanks.\"", "She continued in a tired voice.", "\"I lived thanks to you.”", "\"You talk too much...”", "A hoarse sound grated her ears. It was a voice that was as cold as ice.", "\"For a traitor.”", "Her tired pupils trembled. Yun Seohui lowered her gaze and sharply stared at the man in front of her.", "He was humanity’s sole adversary recognized by the Federation, a battle fiend feared even by the Parasite’s Army Commanders, and a man who had not been chosen by any of the gods despite his overwhelming strength.", "He was the Level 8 Spear Demon, Seol Jihu.", "\"You.\"", "Yun Seohui clenched her teeth.", "\"Shut up.\"", "However…", "\"Why did you not do as you were told?”", "…Her body flinched when she saw his empty eyes and his face that lacked something that a person should have.", "\"…I had no choice.\"", "\"…\"", "\"It’s not that I didn’t, but I couldn’t. I couldn’t create the situation you wanted nor did I have the power to do so.”", "\"That’s surprising. I didn’t think I asked for anything difficult.”", "\"Damn it! Our path of retreat vanished as soon as the siege started. What was I supposed to do when we were attacked from both the inside and outside?”", "\"Didn’t I warn you in advance?”", "\"I thought they were all wiped out. Who would have known that so many people would only be the tip of the iceberg?”", "\"You didn’t even bother listening when the former Star of Avarice yelled it at you, word by word. Serves you right.”", "Seol Jihu cackled.", "\"So, you’re telling me that you tried but failed because you were powerless?”", "\"….\"", "\"People sure are animals molded by the environment. When I was a slave somewhere, someone would always wave a contract and throw me out by force, even when I was hurt and felt like dying.”", "\"I—!\"", "\"Sure. Once you sign a contract, you have to properly carry it out, even if you die. You’re right.”", "Seol Jihu slowly shook his head and spoke.", "\"Like that Kim woman always said, disobeying the contract is an act of betraying faith and trust.”", "Yun Seohui bit her lower lip.", "\"But aren’t you just screwing with me if you work like this?”", "Yun Seohui’s face flushed with anger.", "\"Whatever the situation or reason may be, the results make you a traitor.”", "\"Then according to your words, aren’t you the traitor?”", "\"Enough bullshit. It’s you.”", "\"No. It’s you.\"", "It was a strange sight. The two were busy blaming each other when the real traitors were still out there.", "Yun Seohui retorted, clenching her teeth.", "\"Who knew that they would use humanity’s last resort as bait? I bet even the Parasites didn’t know.”", "\"Oh, please. As if you’ve ever cared about Paradise.”", "Seol Jihu snorted.", "\"And enough with the bullshit. We’re talking about our contract here.”", "Yun Seohui clenched her teeth. She felt so vexed that she felt suffocated. She felt she would explode if she didn’t say anything back.", "\"Now I know.\"", "\"?\"", "\"Now I know why none of the seven gods chose you. Just because of one woman… You didn’t hesitate even a little from dragging all of humanity into your gamble.”", "Yun Seohui couldn’t finish her words as the blade held around her neck pressed into her flesh. A line of blood gushed out and trailed around her neck to pool around her collarbone. She felt a stab of sharp pain, but Yun Seohui gritted her teeth and shouted.", "\"Fine! Kill me!\"", "\"…\"", "\"I said kill me!\"", "Silence fell after the shout.", "After the short silence, Seol Jihu quietly spoke.", "\"Go to Nur.\"", "\"What?\"", "\"Don’t make me speak twice. Eun Yuri and Odelette Delphine said they’ve finished preparing the final card. Survivors from the Federation are also gathering there, so you go as well. Go and prepare again. If it’s you, I’m sure you’ll be able to play a very important role.”", "\"Why should I? I’m already done.”", "\"Because our contract isn’t over.”", "Yun Seohui’s face sunk.", "\"You… Is that why you saved me?”", "\"There’s no other reason I’d save you.”", "She suddenly burst into laughter. Even Yun Seohui herself didn’t understand why she was laughing.", "\"Ahahaha…\"", "She continued laughing before suddenly stopping and asking with a serious face.", "\"What’s your reason?\"", "\"Reason?\"", "\"Why does our mighty Spear Demon— Why does he hate me so much?”", "\"What’s this bullshit?”", "Seol Jihu frowned.", "\"Bullshit? I know you have a grudge against Sinyoung. But didn’t I help you enough?”", "\"You did step up more than it was necessary.”", "Seol Jihu nodded, admitting her words.", "\"But they were all your independent actions. I don’t remember asking for help.”", "He slowly withdrew his spear as Yun Seohui speechlessly stared at him. He then turned around as if she wasn’t worth replying to anymore, having his business with her finished.", "\"Do you know how hard I tried for you!?”", "But Yun Seohui did not stop.", "\"It wasn’t me, but Kim Hannah! I chased her out for you! You know how hard I tried to ease your heart!”", "\"Are you fucking crazy?\"", "Seol Jihu asked seriously.", "\"I thought you were at least a bitch that knew how to separate work and private matters. Ah, is it because Sinyoung, for which you didn’t hesitate to kill even your kin, disappeared? Is that why your emotions erupted?”", "Yun Seohui’s face distorted hearing his mocking voice. Her breathing grew ragged as well.", "\"…How could you do this to me?”", "She yelled out in a crying voice.", "\"Hey. I’m not Sung Shihyun. I’m Seol Jihu, okay?”", "Seol Jihu looked like he had heard something completely ridiculous.", "\"And let’s get things straight. You didn't do anything for me. It was for Sinyoung. That’s why you threw away everything and desperately clung to me, no?”", "Yun Seohui’s eyes widened.", "\"Don’t get me wrong. I’m not saying it’s bad. You used my strength to protect your company, and I used you to achieve my goals. It was a decent deal, only that there was a problem with the execution.”", "Her lips that were as pale as her face trembled.", "\"Oh. Sung Shihyun told me you were a crazy bitch right before he died by my hands. He was right.”", "Seol Jihu clicked his tongue.", "\"Well, I guess it’s fine. Whether you go or not, do whatever you want.”", "\"Kill me. Just kill me instead!”", "Yun Seohui screamed defiantly.", "\"If you really want to die, then why don’t you kill yourself.”", "Seol Jihu spoke with his head half-turned.", "\"…Though, I don’t think there’s anything more pathetic than committing suicide after being cornered… But if you have even an inkling of conscience left, you’d go to Nur.”", "After saying that, Seol Jihu left without looking back.", "Yun Seohui, who was suddenly left all by herself, blankly sat down on the ground for a while.", "\"Haaah.\"", "Then she suddenly laughed.", "\"Haha… Ahahaha…”", "She laughed.", "\"Heuu— Heuuuu—”", "And cried.", "She alternated between laughing and crying like a person with a screw loose. And after an unknown amount of time passed…", "\"…Fine.\"", "Once her sporadic tears dried out…", "\"This is how you’re going to be until the very end, huh…”", "Yun Seohui rose up, full of indignance.", "\"I did nothing wrong.”", "After staring in the direction Seol Jihu left with eyes dripping with venom, she forcibly turned her body.", "\"It’s all your fault.”", "She began walking with faltering steps while muttering things to herself. It was as if she had lost her mind.", "As expected, there was a horrific scene, far too terrible to speak of, happening at Scheherazade.", "The fires turned into acrid smoke that pierced her nostrils, and monstrous roars, screams, and moans could be heard from all around.", "The Parasites that had been engrossed in looting the city initially just stared at the woman who was walking into the ruined city like it was her own house. They never imagined there would be someone who would walk in with their own feet.", "However, after that moment of hesitation, they quickly shot towards her and pinned her down to the ground. Yun Seohui did not resist and meekly kneeled on the ground.", "It was then.", "\"Oh my. What’s this?”", "A lilting voice was heard. Yun Seohui’s dead eyes slightly opened.", "\"Didn’t you run off with the Spear Demon?”", "The woman flying in the air, flapping her bat wings and wearing a vulgar outfit that practically revealed everything, was none other than Kim Hannah who had turned into a succubus.", "\"You came back? Are you really crazy?”", "\"Shouldn’t you be thankful?\"", "Yun Seohui smiled.", "\"Your target for revenge came back to you. Go ahead, thank me.”", "Bewildered, Kim Hannah carefully observed Yun Seohui. She didn’t seem sane no matter how she looked at her.", "While she could somewhat understand her feelings since Sinyoung had practically collapsed in a day, the situation was still too strange. Given the vengeful look in her eyes, Yun Seohui didn’t look like she had fallen in despair.", "Kim Hannah nodded once, indicating that she would listen to what she had to say first.", "\"Speak.\"", "\"Let me meet Vulgar Chastity.”", "\"Hell no. She’s on the verge of exploding in anger after having her horns crushed and her wings ripped out by the Spear Demon.”", "\"Then any Commander would do. I know you can do at least that much.”", "\"I get what you mean, so tell me the reason. Why?”", "\"I need to see.\"", "Kim Hannah raised one eyebrow.", "\"I don’t need anything anymore. I just need to see that merciless bastard’s face in despair. I need to see him kneel down in regret.”", "\"Ah.\"", "Kim Hannah finally understood the situation.", "\"You. You got discarded, didn’t you?”", "\"Huu.\"", "\"I was right. Too bad. I guess you couldn’t enter his fence~”", "She flew down to the ground and giggled while patting Yun Seohui’s head.", "\"What did I tell you? He's a fundamentally different guy from Sung Shihyun. I told you he was an uncontrollable lunatic, didn’t I?”", "\"…\"", "\"In any case, you want to, what, break it if you can’t have it? Is that it?”", "\"Are you going to accept it or not?”", "Yun Seohui spat through clenched teeth.", "\"Who knows~\"", "Kim Hannah suddenly assumed a haughty attitude and propped her chin with one hand.", "\"The fact that you didn’t go to Nur and came back here alone on your own is praiseworthy…”", "\"…\"", "\"And I just happened to come up with an interesting plan… Everything’s good, but…”", "Kim Hannah grinned.", "\"The humiliation that you guys made me suffer still won’t go away. What should I do?”", "Kim Hannah placed a hand on her chest and made a troubled expression. It was a fake face.", "\"What do I need to do?”", "\"Hmm.\"", "Kim Hannah wondered out loud before turning her head and looking behind her.", "There was a pole standing high in the sky off in the distance. At the end of it were two stark-naked bodies tied with ropes.", "Yun Seohui’s eyes quivered.", "Evangeline Rose, who once was respected as the guardian of Eva, and Queen Charlotte Aria, the ruler who had always hidden herself in the palace.", "She had heard rumors that they were taken as prisoners and used to taunt mankind. She finally confirmed it with her own eyes today.", "\"If you show me you can endure even half the humiliation and pain that I had to suffer… It might cheer me up enough to make me forget all the grudges I’ve held so far.”", "Kim Hannah licked her upper lip while glancing sideways at the two bodies hanging from the pole.", "Yun Seohui’s mouth twitched.", "\"Hah!\"", "She broke free from the grasp of the Parasite that was holding her arms and spoke with as much malice as possible.", "\"Fine. Do as you like.”", "She gripped her clothes and tore it down without hesitation.", "Rip!", "And as soon as her clothes ripped, the mob of Parasites jumped on her.", "A moment later, intense moaning along with Kim Hannah’s laughter rang throughout the city.", "*", "The day after the opening ceremony.", "Yun Seohui showed her face when morning came. She thanked them for their hospitality and bade them farewell, saying that she had to leave before she overstayed her welcome. She didn’t ask for anything or say anything out of the ordinary.", "She had simply left after congratulating them, leaving behind one sentence.", "\"Oh right. Jihu-ssi. It was fun yesterday.”", "\"Since when did you two start addressing each other as -ssi?”", "Kim Hannah asked suspiciously.", "\"I trust our Jihu.”", "Seo Yuhui also chimed in.", "Seol Jihu did not reply. He didn’t have the energy to do so. The vision he saw last night was so shocking that he couldn’t sleep at all.", "It couldn’t be helped.", "Seol Jihu had thought the fundamental reason that he had regretted and said, ‘I want to start again’, in the past was only because of Paradise’s fate. However, seeing the vision from yesterday overturned everything.", "He wasn’t sure, but he intuitively felt there was a far more complex reason behind it all, interwoven like a spider web.", "'I… What kind of an Earthling was I?”", "That wasn’t all.", "The vision seemed to have taken place right before the final war…", "'Why…’", "Even if he had spent a period of his time enslaved by Sinyoung, what kind of relationship did they have for Yun Seohui to react so intensely?", "Seol Jihu didn’t know Yun Seohui well, but judging by what he saw and heard so far, her actions in the vision were ‘absolutely’ inconceivable.", "Seol Jihu strongly shook his head as his thoughts became complicated again. He felt like he had woken up from a terrible dream, but it didn’t mean that he didn’t earn anything out of it.", "Seol Jihu began to slowly jot down some notes before he forgot.", "—Eun Yuri. Prepared a plan with Odelette Delphine in the final war. Not much was said about her but is presumed to be a Magician.", "\"What are you writing?\"", "Seol Jihu hurriedly closed his notebook as Kim Hannah sneaked up on him.", "\"Kim Hannah.\"", "And he spoke.", "\"How long did you say we had until the March Neutral Zone?”", "Kim Hannah’s eyes widened.", "*", "Eva’s Queen, Charlotte Aria recently started to have massive headaches. Asides from the royal family being noisy, it was because of none other than Sorg Kühne, who visited her everyday.", "\"Your Majesty.\"", "Sorg Kühne earnestly appealed with a firm face.", "\"Evangeline may have once been a reassuring ally of the royal family, but they are now only an organization full of ruffians, no different from the Federation. Why are you delaying the verdict even after all the details have come to light supported by numerous witnesses and evidence?”", "Charlotte Aria looked at the royal administrator with a face that said she was tired of him.", "She had been sure that he would stop coming if she ignored him like she had done up until now, but because of some unknown reason, he kept on persistently visiting to implore her.", "Charlotte Aria shut her eyes.", "\"Did they not say it was all a misunderstanding with each other?”", "\"What misunderstanding? They were lying through their teeth. Please do not be deceived by their sweet talk.”", "\"Enough.\"", "Charlotte Aria cut off his words, not able to bear listening to him, but Sorg Kühne didn’t back off.", "\"Your Majesty, are you truly trying to meet a disastrous end to the Parasites?”", "\"What?\"", "Charlotte Aria furrowed her long slender eyebrows. She was starting to get angry.", "\"Does Your Majesty think they will help us when Eva falls in danger? Please think about what happened with the recent draft call.”", "\"That is simply how Earthlings are. However, Evangeline… Jung Sua is different.”", "\"Representative Jung Sua did not answer the draft call either.”", "\"You are saying that because you do not know her.”", "Charlotte Aria clicked her tongue.", "\"She is like me, a girl who lost her parents when she was young. Did she not say she had to at least be with her little brother on his deathbed when he was wavering between life and death? I understand that feeling.”", "Charlotte Aria cleared her throat.", "\"And although she was a little late, did she not come back?”", "\"It was not ‘a little’. It was only after the Parasites retreated that she showed herself.”", "\"It seems to me like you are trying your hardest to find fault with Jung Sua.”", "\"I have only spoken the facts.”", "Sorg Kühne bowed as Charlotte Aria roared.", "\"Your Majesty.\"", "\"Enough! Did I not tell you to stop? I understand what you are trying to say.”", "Charlotte Aria waved her hand with a face that clearly said she found him tiresome.", "\"I will personally go meet Carpe Diem’s leader to resolve the misunderstanding. You may leave now.”", "Sorg Kühne shut his eyes.", "For her to say, ‘Carpe Diem’s leader’, even after he had submitted a report of them registering as an organization called Valhalla…", "It was proof of how much interest Charlotte Aria had about the city.", "It was to the point where he suspected that she was adopted when he recalled the late king, who had gained fame as the Thunder Monarch, and the two princes, who had respectively shown great talent in studies and in the sword.", "\"…This is our last chance.”", "Sorg Kühne couldn’t forget how the late king had saved him and showed him great kindness. This was why this upright man did not leave her.", "\"Eva has become rotten far more than Your Majesty can imagine. The military has disbanded, and the people are impoverished and in great distress. The city has become so devastated to the point that it is almost irrecoverable, so we must grasp whatever chance we have.”", "And so, the faithful old retainer…", "\"The last of the last hope has come down. He is someone that left Haramark to fulfill a great vision. We are in a position where it would not be enough even if we threw our entire bodies to beg him to help. So why are you not letting go of the rotten twig you have in your hand, not bothering to even look at him?”", "…did not give up and vehemently implored her.", "\"Your Majesty, it is your humble servant’s last request. Please open your eyes!”"]}