{"cid": "182", "title": "Chapter 182. The Full Account", "content": ["‘Huuuk.’", "The moment he opened his eyes, his breath paused in his throat.", "He wanted to exhale instinctively, but his mouth refused to open. The air wiggling around in his throat searched for another exit and left through his nostrils before exploding.", "Ssp— ssssp—", "When he repeated breathing in and out through his nose, his chest finally relaxed. Only then did the spinning world enter his sight.", "He wanted to shake his head from dizziness, but he gave up immediately feeling a head-splitting headache.", "With a headache of this magnitude, he felt like he would likely be shaking his brain if he shook his head.", "In the end, Seol Jihu closed his eyes that he worked so hard to open, as the world spinning in a circle was inducing even more dizziness and nausea.", "Only when the pain in his head disappeared and the churning in his stomach subsided, did he have the courage to open his eyes again.", "With the world no longer spinning, he saw an unfamiliar ceiling. His eyes started to focus, but it was hard to say that his vision was normal.", "Should he call it hazy?", "The ceiling was undulating gently, like he was looking up at the world from under the water.", "‘What… happened…?’", "He wanted to look around the room, but his head refused to budge an inch. When he began to roll his eyes without any other choice, he caught sight of a familiar person.", "It was Seo Yuhui.", "‘Noona…?’", "Seol Jihu slowly closed his eyes, then opened them back up.", "‘Did I… survive…?’", "His memory after activating Future Vision was hazy, but he thought he would die based on what he felt at the time.", "He still didn’t know exactly what happened.", "But feeling relieved that Seo Yuhui was in his sight, he called her. No, he tried to call her.", "‘….’", "His voice didn’t come out.", "‘What… why is my body…’", "Feeling impatient, Seol Jihu tried to signal her with his eyes, but Seo Yuhui wasn’t looking at him. Now that he got a closer look, she had an angry look and her mouth was moving rapidly. It seemed like she was arguing with someone.", "When he rolled his eyes as far as they could go, he caught sight of another person in the corner of his vision.", "It was a woman he hadn’t seen before, an Asian woman wearing a long, traditional jacket. Her mouth was also moving rapidly, with her eyebrows perked up.", "It was now clear that the two women were arguing.", "‘Why are they fighting…?’", "Seol Jihu examined the two women in a fluster.", "‘Please don’t fight….’", "Soon, the woman carrying a jade-colored spear stormed out of the door angrily.", "Seo Yuhui glared at the gradually closing door with a dissatisfied look before turning around. She then looked down with a worried look and carefully reached out.", "Seol Jihu’s eyes shook faintly. He could see Seo Yuhui’s palm caressing his cheek, but never mind a soft touch, he couldn’t feel a thing.", "It was then that Seol Jihu realized what state his body was in.", "After regaining consciousness, Seol Jihu focused on figuring out the current situation. And soon, he carefully arrived at the answer that he was ‘not dead’.", "Looking at the room, he seemed to be in the intensive care unit of the Temple of Luxuria. But it was hard to find out anything more than that.", "Because he couldn’t move his body ever since he woke up.", "‘No way.’", "No matter how hard he tried, his limbs refused to move an inch. Even opening and closing his mouth was difficult.", "He felt like his body was asleep with only his mind being awake. That wasn’t all. His uncontrollable body had lost all of its senses other than his sight.", "Seo Yuhui or other unfamiliar Priests would come see him from time to time, but he couldn’t hear a single thing they said. It was clear that they were talking from the way they moved their mouths, so his ears being unable to hear anything drove him crazy.", "It was a series of chaos at first. But when the chaos subsided, what came in its place was pain.", "‘Damn it.’", "It was unbearable, spending day after day, lying still like a vegetable, only being able to blink his eyes. And so, every time before he went to sleep, he prayed.", "‘Please let this be a dream.’", "But the ceiling above his head didn’t change no matter how many times he woke up from his sleep.", "And just like that, days of praying before sleeping and waking up in frustration continued.", "Seol Jihu despaired, knowing that he could do nothing about this godforsaken reality.", "**", "Though it might sound funny, there were five stages to accepting one’s death.", "The first was denial. In this stage, one would reject reality. But soon, this emotion would change into something else— anger.", "And when the situation wouldn’t change no matter how angry one became, they would begin to bargain.", "Some would search for a god, some would promise to give up everything— their life’s fortune, beliefs, and even freedom— if someone would let them live.", "By the time this futile hope disappeared, depression would sink in.", "Do I have to lie in this bed forever? Unable to return to Earth?", "The state of ‘being neither alive nor dead’ was the one thing every Earthling wanted to avoid like the plague. Now with this possibility hanging over his head, an unprecedented fear crept up within him.", "When time passed by and he got used to this fear, Seol Jihu arrived at the final stage— acceptance.", "But one consolation in this sadness was that he didn’t accept that he was dying, but that this was reality and that something would happen if he just waited.", "The reason his thoughts stopped here were the visitors he got during this time.", "While his eyes were open, Seol Jihu truly got to see many people: Jang Maldong and the members of Carpe Diem, Agnes, Oh Rahee, Teresa, Phi Sora, etc…", "Almost everyone he knew appeared before him unscathed.", "Cinzia and Hao Win also came, and even Kim Hannah and Yun Seora had come all the way from Scheherazade.", "Seol Jihu smiled bashfully seeing Yun Seora rub her nose with a flushed face. At the same time, he was thankful for her worry.", "He could also see Flone from time to time. She appeared only when no one else was around, and it was clear that she was in low spirits.", "He remembered being able to transmit his thoughts to her at the tomb. But no matter how hard he tried, he couldn’t get Flone to respond.", "She only floated around the bed with a slouched back before curling up next to Seol Jihu. He felt bad as she looked like a kitten waiting for her owner on a rainy day.", "Maria was alive too. The blonde girl came to visit him with a basket full of flowers. Then, after looking down at him with the eyes of a dead fish, she angrily threw the basket on the floor.", "Seol Jihu then saw her raising her hand and quickly moving her mouth in an impassioned way.", "‘Stocks? Her stocks?’", "Around the time Seol Jihu finished reading Maria’s mouth and guessed the words she was saying, she clutched her head and began to roll on the floor.", "Bead-like tears even fell from her eyes!", "To be honest, it didn’t look like she was crying from concern for his well-being. But her pantomiming antics still made Seol Jihu laugh.", "With the people he thought were dead coming to visit one by one, Seol Jihu couldn’t help but feel hope.", "The visits didn’t stop even after everyone he thought might come had visited. It was because of the repeat visitors. None of the visitors stopped at just one visit. They came twice, thrice… no, there were some who visited over twenty times.", "‘She’s here again.’", "The woman wearing the traditional jacket opened the door. Judging by the jade-colored spear in her hand, she was certainly the woman who argued with Seo Yuhui the first day he woke up.", "‘How many times has it been?’", "Seol Jihu felt strange every time he saw this mysterious woman, who gave off a dreamy aura. He didn’t know who she was, but it was already the tenth time that he was seeing her today.", "Seo Yuhui still held the first place spot by an overwhelming margin, but that was partly because the Temple of Luxuria was her home.", "This mysterious woman was doing pretty well, considering that she was a visitor. She came more often than Hugo and Chohong, and was almost even with Yi Seol-Ah and Yi Sungjin who came whenever they were free.", "What stood out even more was that she never said a word and only stared at him fixedly. Seol Jihu could see her sighing every once in a while, but that was it.", "But within her eyes was an undeniable emotion of worry.", "‘Just who could it be…?’", "Seol Jihu blinked his eyes as he watched the woman staring at him fixedly before going back.", "**", "How much time went by?", "Seol Jihu quit counting the number of days that went by, but he knew that it wasn’t a short period of time. The reason he did not lose his hope after so long was because of a small change to his body.", "—Hilarious, isn’t it?", "He began to hear voices.", "It wasn’t a clear voice but a ringing one, as if someone was talking into a mic— but how could he complain?", "Since he still couldn’t move his body, being able to hear again made his chest feel a hundred times lighter.", "Moreover, his hearing coming back had to mean that his body was getting better. Although he didn’t know how long he would have to wait, he knew now that his other senses could recover.", "Naturally, he grew more hopeful.", "—You know, Maria chanted a healing spell the moment she got up after being kicked. After stopping her bleeding, she crawled into a pile of corpses and kept her eyes shut. She says that’s how she managed to survive. That little brat.", "‘That’s just like Miss Maria.’", "Seol Jihu answered inwardly as he listened to Chohong’s explanation.", "—Ah, but don’t think too badly of her. Undying Diligence said he’d spare her if she spilled your identity, but I hear she kept her mouth shut and smacked him with Mjolnir.", "‘Really? I can’t believe it.’", "—Come to think of it, that Ghio bastard is funny too. I was wondering where this son of a bitch went. Turns out he was being held captive by the enemy.", "‘What?’", "—Vulgar Chastity apparently ordered her succubi to hold him prisoner. Hilarious!", "‘Um, I don’t think that’s something to laugh about.’", "Chohong cackled, then stretched in her seat.", "—Anyways~ The war is over, the people who are supposed to be alive are alive, the post-war problems are being wrapped up, and things are settling down… so why are you still lying there? Is it comfortable?", "‘Tell me about it.’", "—You son of a bitch, get up and pull a prank or something. Like that other time. I’ll let you off just once. Really.", "‘Nice. I know what I’m doing the moment I get up.’", "—You have no idea what’s going on in Paradise recently, right?", "‘Is that supposed to be a question?’", "Seol Jihu grumbled inwardly.", "—I’ve been annoyed out of my mind recently.", "‘She doesn’t even have time to be happy about the war?’", "—…I might be the weird one, but when I see the city in a festive mood with people blabbering on about this being humanity’s first victory or whatever… it makes my stomach churn.", "‘Why?’", "—Those pieces of shits. Who do they think put in the hard work for this victory? Being so happy by themselves…", "Chohong’s voice slowly got quieter. Then, her voice suddenly cut off.", "Seol Jihu, who was staring at the bright sunlight shining through the window, noticed the anomaly and searched for Chohong.", "When he glanced at her…", "—Did you know?", "She continued.", "—The Carpe Diem office has been like a Buddhist temple recently. I’ve never seen the old man in such low spirits.", "‘….’", "—Just how long do we have to wait?", "Before Seol Jihu noticed, Chohong, who was sitting at the corner of the bed, was standing right by his side, looking down at him.", "—When are you waking up?", "Seol Jihu couldn’t relax seeing the red tint around Chohong’s eyes.", "‘Why are you crying… again….’", "He wanted to tell her that he was fine, that he’d regained consciousness, that he was recovering slowly. At the very least, he wanted to tell her not to cry.", "But unable to do anything, Seol Jihu felt frustration for the first time in a while.", "‘…Should I give it a try?’", "He had long given up trying to move his body. Not only did it tire him out, but it would also intensify his depression.", "‘Still…’", "He wondered if he could finally speak. He was hoping to be able to say ‘Ah’ or ‘Uh’ at the very least.", "Soon, just as he took in a deep breath and attempted to spit out a sound…", "‘Huh?’", "His vision suddenly turned blurry. He couldn’t see anything as if he was walking in a fog.", "And he suddenly felt like his heavy body was floating up to the surface of the water.", "‘What—?’", "Feeling like a huge weight holding him down was lifted, he closed his eyes unknowingly.", "And the moment he opened his eyes, he could clearly see it.", "The ceiling, which had become far clearer.", "“Puhuuu!”", "Seol Jihu spat out a breath like he had just popped out after being underwater. Not just from his nose, but also his mouth.", "Focus returned to his eyes. The world no longer undulated and was more vivid than ever before.", "Seol Jihu turned his head in a daze. Although it felt a little stiff, his head creaked to the side.", "The room was dark. The lights were off, and jet-black darkness was blanketing the sky outside the window.", "Seol Jihu quickly blinked several times.", "Wasn’t I talking to Chohong just now?", "There was sunlight outside the window!", "Soon, he finally snapped out of his stupor and dazedly opened his mouth.", "“What… happened…?”", "His eyes widened.", "‘My voice…’", "He noticed that he could turn his head. His body felt hot, like he had just gotten out of the sauna. Of course, what was important was that his senses had returned.", "“Aaah.”", "Seol Jihu raised his hand to touch his face but ended up frowning immediately. He felt a stinging pain from his cheeks.", "But now, he even welcomed this pain.", "“What’s this…?”", "He found golden needles protruding out from the back of his hand. That wasn’t the only place.", "His forearm, chest, stomach, thighs, calves, and even his feet… hundreds of needles poking out of his body made him look like a hedgehog.", "He had only closed his eyes once and opened them, but so many things had changed since the last time he was awake.", "He wanted to jump out of bed and move his body, but Seol Jihu held on with superhuman patience. There had to be a reason why so many needles were in his body. If he touched them and something went wrong, he would have no one to blame but himself.", "And so, when he turned his head to the side, he found a sleeping girl with her face buried in the bed.", "It was Yi Seol-Ah.", "She must have fallen asleep in the middle of her night-time nursing duties.", "“Seol-Ah….”", "Seol Jihu quietly called Yi Seol-Ah. At the same time, he was surprised by how hoarse his voice was. He really did sound like a patient with a chronic illness.", "Was it because he was too quiet? Yi Seol-Ah showed no signs of waking up even after he called her several times.", "Seol Jihu thought about poking her with one of the needles that was poking out of him but dropped the idea quickly.", "“Doping is….”", "Flinch.", "Yi Seol-Ah’s tiny shoulders shrunk back.", "“Seol-Ah…!”", "When he called her again, she finally opened her eyes. When their gazes met, Yi Seol-Ah’s chin slowly went up.", "“Ora… Orabeo-nim?”", "She muttered in a daze, still drooling from her mouth. After staring at Seol Jihu for a good second, a look of shock spread on her face.", "“You… you woke up!?”", "Not only did she shout, but she also shot up in a hurry. She would clearly start screaming if left alone, so Seol Jihu quickly stopped her.", "“Wait, Seol-Ah. Hold on just a second.”", "Yi Seol-Ah, who was about to storm out of the door, turned back.", "“I understand your sentiment, but calm down a bit first.”", "A look of confusion spread across Yi Seol-Ah’s face. She was on the verge of passing out from shock, but the person in question couldn’t be calmer.", "It was only natural since she didn’t know that Seol Jihu woke up a long time ago.", "“First… can I take these needles out?”", "When Seol Jihu glanced at the golden needles and asked, Yi Seol-Ah shook her head.", "“I, I’m not sure. Grandpa should know… I’ll go get him!”", "“No, it’s okay. Wait.”", "Seol Jihu shook his head.", "He was already extremely dizzy, so he didn’t have the confidence to deal with many people rushing into the room.", "“Are you… really awake?”", "While Seol Jihu was organizing his thoughts, Yi Seol-Ah asked in a strange tone.", "“Yeah. Why?”", "“You’re too calm….”", "Seol Jihu smiled bitterly. Then, Yi Seol-Ah began to sniffle.", "“Can I cry?”", "“No, you can’t.”", "“Why not? My tears are coming out.”", "“You already cried a lot.”", "“N-no I didn’t!”", "Yi Seol-Ah jumped in fright.", "“Liar. You were the second biggest crybaby.”", "Hearing how confident Seol Jihu was in his words, Yi Seol-Ah put on a begrudging face. Meanwhile, she continued to toddle her feet.", "As Yi Seol-Ah clearly looked eager to share this news with everyone, Seol Jihu quickly asked.", "“I’m not dreaming, right?”", "“No, you’re not. I promise.”", "Seol Jihu said half-jokingly, but Yi Seol-Ah responded in a slightly tearful, but firm voice.", "“I’m glad. Really… so many people worked hard, but you didn’t show any sign of waking up….”", "“…Really?”", "“Yes. The Unni called the Daughter of Luxuria especially worked very hard. I heard she almost died from the treatment….”", "A lump went down her throat as if she was holding her tears back. At the same time, Seol Jihu furrowed his brows.", "“What?”", "“Ah, don’t worry. She made a full recovery before it was too late.”", "Yi Seol-Ah quickly waved her hands.", "However, Seol Jihu didn’t miss the difference in what he knew from when he was awake and what he just heard from Yi Seol-Ah.", "Though he couldn’t be sure how correct these memories were, Seo Yuhui had visited the most and had taken care of him the most. She didn’t seem sick in any way, so what happened?", "It was then that Seol Jihu realized he had yet to ask the most important question.", "“Seol-Ah, how long has it been since I lost consciousness?”", "“Um…”", "Yi Seol-Ah began to fold her fingers, carefully counting the days.", "“About 5 weeks…?”", "Five weeks. He had been out cold for over a month. As it somewhat aligned with his initial guess of 3 to 4 weeks, he wasn’t all that surprised.", "“In Earth days.”", "“Wh… what?”", "But when he heard Yi Seol-Ah’s follow-up, his eyes widened to a circle.", "“5 weeks on Earth? Then it’s been 15 weeks in Paradise?”", "“…Yes….”", "When Seol Jihu asked for a confirmation, Yi Seol-Ah carefully nodded her head.", "‘No way.’", "Three months and three weeks had passed in Paradise?", "Seol Jihu couldn’t hide his shock at the time gap that surpassed his wildest imaginations.", "“Can you tell me what happened? Like how I survived and why I was unconscious for so long.”", "Yi Seol-Ah looked at the door a bit longingly but soon turned back around. Then, she slowly began her explanation.", "“This is what happened….”"]}