{"cid": "337", "title": "Chapter 337. Freeze, World! (1)", "content": ["With Twisted Kindness escaping and the spatial rift closing up, the Spirit Realm regained its silence. The world-shattering rumbles that were resounding just a few minutes ago were gone as if they never existed.", "Although the battle was over, the members of the expedition team did not say anything. They only stared at the space where the Seventh Army Commander disappeared in with blank expressions.", "They just couldn’t believe it.", "They had half given up on the battle when Twisted Kindness appeared. Although everyone surpassed their limits and fought with everything they had, a part of them always believed that defeat was inevitable.", "The same went for Seol Jihu.", "Setting aside Raging Temperance, Twisted Kindness’ terrifying power was more than enough for him to learn why the Parasite Queen sent her here alone.", "It was a fight where he should have died at least a dozen times. If he fought normally, setting aside all the unexpected variables, he never would have defeated her.", "The awakening of the Spear of Purity, Marcel Ghionea and Little Chick’s successful revival of the World Tree, the Promise of Temperance forcing Raging Temperance to defect, and the evolution of the Arcus Spirit…", "With even a single one of these things missing, he would have met a terrible end in the Spirit Realm.", "But as the saying went, ‘Miracle sets a bridge of chance to those who try.’[1]", "What was important now was that the Parasites were defeated and that the side of humanity survived. Though it might be a miracle created by chance, what did not change was the fact that the expedition team was the final victor.", "Right, the expedition team had triumphed. They had met the first condition in saving Tigol Fortress from its doom.", "“Huaa—”", "Chohong heaved out the breath she had been holding back. She must have canceled her Battle Maiden Manifestation skill as her silver hair regained its original black color.", "Then, with Chohong falling on her butt with her knees bent, the rest of the expedition team loosened their tense nerves.", "“I thought I was gonna die…”", "Hugo laid down on his back and murmured with a soulless expression.", "“…You alive?”", "Oh Rahee muttered quietly as she rubbed her neck.", "Maria cried.", "“It’s over, right? Right? That bitch isn’t coming back, right?”", "With her eyes tinged red and mucus dripping down her nose, she grabbed the closest person and asked.", "However, there wasn’t a single person who blamed her. They were equally relieved and happy in having survived. The only difference was the way they expressed it.", "“Oh yeah.”", "At that moment, Audrey Basler spoke up in a feeble voice.", "“What was that thing? That Dragon was pretty desperate to get it.”", "Everyone’s gaze fell on Hoshino Urara at these words.", "“Hmm?”", "Hoshino Urara looked left and right with her round eyes and then clutched onto the shining object in her hand.", "“No! It’s mine!”", "“?”", "“It would have been stolen if it weren’t for me. Since I snatched it in the end, it belongs to me!”", "As everyone made a stunned expression at her shameless attitude…", "—Are you crazy?", "Little Chick, no, the Arcus Spirit in the form of a phoenix screamed.", "—Do you even know what that is!?", "“I don’t. Anyway, this is mine. Period.”", "—This punk…! Do you think this is funny?", "The phoenix snapped and moved right away. Chomping down on Hoshino Urara, who was standing tall with her hands over her waist, it raised its giraffe-like neck.", "“Ueeeeeh!”", "Gulped up by the phoenix, Hoshino Urara flailed her legs in the air like a fish.", "—I’ll eat you! I really will!", "“I’m sorry! I’m sorry!”", "—Hand it over this instant!", "“I will! It’s yours! Uaaang—!”", "It wasn’t until Hoshino Urara burst into tears that the phoenix spat her out.", "Falling to the ground with her hair drenched in saliva, Hoshino Urara gave up the divinity while crying.", "Seol Jihu ended up receiving it, and he looked down at the object shining in his hand.", "‘It feels weird…’", "He felt his hand being filled with warmth. It felt like he was holding onto a sensation rather than an object. On the other hand, he felt boundless energy coming from it.", "How should he put it… Though it might be paradoxical, he felt a vast universe from the small cluster of light as well as a cleanly tidied energy. It was a power that was beyond the understanding of humans.", "‘So this is a divinity…’", "“In a way… cough!”", "Philip Muller coughed while staring fixedly at the cluster of light. He continued after spitting out the blood clotting up his throat.", "“This could be the greatest achievement we made in the Spirit Realm…”", "“Greatest achievement?”", "“We might be able to call the Seven Armies as the Six Armies from now on, instead…”", "Seol Jihu glanced sideways. In truth, he was thinking the same thing as Philip Muller.", "“I didn’t see Undying Diligence’s divinity in the valley war… One of the other Army Commanders must have retrieved it…”", "In that case, Gabriel’s guess must be true. There was a good chance that the Parasite Queen birthed a new Diligence using the divinity retrieved by Unsightly Humility and Vulgar Chastity.", "But that would not be the case this time. The expedition team had succeeded in preventing Twisted Kindness from retrieving the divinity of Temperance.", "Without a divinity, it was impossible to birth a new Army Commander.", "In other words, the Parasites’ main force had just lost more than 15% of its total strength.", "“We’ll have to wait to know for sure, but I’d say this is most likely the case…”", "Philip Muller then changed the subject.", "“Anyway, divinity is divinity, and victory is victory. We’re not done yet.”", "Seol Jihu did a double-take and came to his senses. Using the Spear of Purity as a cane, he straightened his half-bent knee.", "In response, other members of the expedition team forced themselves up.", "They were in sorry states. The Warriors’ armors were torn to shreds, and the faces of the Magician and Priests were ashen. Most had dried up blood around their mouth, and it was hard to find anyone without a noticeable injury.", "Despite wanting to ask if they were okay and thank them for their hard work, Seol Jihu kept his mouth shut.", "Though the battle was over, the war was still going on.", "“…Let’s go.”", "Once he muttered this single phrase, the phoenix flew up as though it had been waiting for this moment. It must be telling them to follow its lead.", "Soon, the expedition team left the battlefield and marched onward.", "“Wow! Look at the sky!”", "Chohong exclaimed in awe in the middle of the fast march. Reflexively looking up, Seol Jihu’s eyes widened.", "“Are those fireflies?”", "As he said, there were scintillating, firefly-like lights fluttering in the sky. Amber lights that were the size of fingernails poured down like snow and illuminated the world.", "“….”", "Before they noticed, the blood-red sky of the Spirit Realm had turned blue.", "**", "Humanity’s cavalry began their march.", "Teresa led the way in descending the mountain ridge, and the cavalry standing in a line charged after her.", "Dududu! Dududu!", "The clattering of their mounts shook the earth and echoed out in the sky. As the Horuses galloped forward, stomping on the earth, large clouds of dust rose up.", "Due to the ferocity of the charge, the fierce rumbling of the atmosphere could be seen even from a far distance. The weapons reflecting the light of the sun and glittering like starlight poured into the flooding army of corpses like a billowing wave.", "The Parasites did not stay still. Cockroaches and all sorts of flying creatures glided up from their main camp and flew toward the cavalry.", "“Blade Ballistas! Load!”", "Arbor Muto, the village head of Ramman Village, shouted as he observed the enemy’s movement.", "“Maintain the current altitude! Turn 45 degrees portside!”", "Kiik, kiiiik!", "Soldiers cranked the handles of the ballistas and adjusted the angle.", "Among humanity’s seven cities, it would not be wrong to call Haramark, the city that was most prepared for the Parasites’ invasion.", "They did not get overconfident after their victory at the valley war and put in a great deal of effort to expand their military prowess. Whether it be expanding their military bases or increasing their arms, they made the expansion of their military their number one priority.", "As a result, the Blade Ballistas that only numbered several dozen during the valley war were now close to six hundred in count.", "“Fire!”", "Tong! With Arbor Muto’s command, hundreds of boomerangs shot out.", "Whirling through the sky, the boomerangs changed their course with sharp curves and pounced at the flying creatures aiming for the cavalry!", "Kagagagagagagak!", "Their hard carapaces were easily torn apart by the fiercely spinning blades, leaving their dismantled bodies to rain down from the sky.", "So many flying creatures exploding as if they entered through a pulverizer was truly a sight to see.", "That wasn’t the end. Some of the boomerangs continued to fly after eviscerating the flying creatures and rapidly shot down towards the corpse army.", "Soon, at the same time as the boomerang blades swept through the corpses, the cavalry that descended from the mountain ridge rushed at the corpse army like a huge wave.", "Boom! The hooves of the enraged Horuses stomped on the corpses while the spears and swords brandished by the cavalrymen cut through the enemy at will.", "As the corpses were already groaning from the boomerang blades, they cried out while being cut down helplessly.", "The screams of the dead, the cheers of the living, and the coarse bellows of the Horuses mixed together in a large symphony.", "Waaaaaaaah!", "Another cheer erupted from Tigol Fortress. Seeing the persistent corpse army falling into shambles had filled the onlookers with joy.", "On the other hand, not having expected humans — the weakest force — to fight so well, they were also filled with shock and admiration.", "“They sure are excited~”", "Vulgar Chastity sneered. She was overlooking the war with her arms crossed in boredom. She didn’t seem to mind the near decimation of the corpse army.", "Then again, the corpse army was a meat shield, nothing more and nothing less. Since the army was also easily supplemented, it made sense for her to not care.", "However, the appearance of humanity must have bothered her as she smacked her lips.", "“I’m surprised, though. Who would have thought those guys would show up? Do they have a death wi…”", "She shrugged and acted nonchalant, but could not finish her sentence. It was because she felt a terrifying rage suddenly piercing through her back.", "Looking back unwittingly, Vulgar Chastity was struck with fright.", "“M-My Queen!”", "The Parasite Queen was incensed. Although her true body was not here, Vulgar Chasity could tell just by looking at the holographic image in the sky.", "The image was distorting like a broken TV screen due to the energy she was emitting.", "[What are you doing?]", "A cold voice filled with rage rang out.", "[I asked, what are you doing!?]", "Hearing this, four Army Commanders, including Vulgar Chastity, prostrated at once.", "[Did I not order you to conquer Tigol Fortress? Why are you standing there spectating with your hands behind your back!?]", "“M-My apologies, Queen! We didn’t mean to spectate… It was just that humans suddenly appeared while we were forcing the enemy to use up their Thunders…”", "[Hah! Are you saying you are afraid of mere Thunders and humans? As beings bearing divinities?]", "“Of course not! We will set out right away! My army is all that is needed for mere hum…!”", "[Fool!]", "Vulgar Chastity winced at the Parasite Queen’s reproach.", "[You mean to lead your army to combat a group of trifling humans? Are the parasites and the corpse army not enough for that? Did I say I wanted to see you flaunt your strength?]", "“….”", "[I emphasized that this war will be a race against time… You all sat back and relaxed for such trivial reasons and caused this mess!?]", "At a loss for what to say, the Army Commanders lowered their heads even more.", "[This is not the time to be focusing on mere insects!]", "[The Army Commanders are to go to battle at Tigol Fortress this instant!]", "The Parasite Queen’s bellow resounded. Once her firm determination was transmitted, the entire Parasite army changed.", "The Nests focused every nerve in their body in infesting the land and the mother species sped up the rate at which they birthed parasites.", "Most importantly, the Army Commanders flew forward, leading their own armies.", "“The Queen seems to be in a rush…”", "Vulgar Chastity murmured in a low voice.", "Although the appearance of humanity delayed the fall of the fortress by a bit, it was not to the point that the Parasites should be worried so much.", "The conquest of Tigol Fortress was still well underway, so it was no wonder that Vulgar Chastity tilted her head from the Queen’s sudden outburst.", "“I am sure she has a reason behind it.”", "Exploding Patience retorted in an offhand manner, but Unsightly Humility shook his head.", "“That reason is what I am curious about.”", "Saying so, he continued worriedly.", "“Could something have happened in the Spirit Realm…?”", "“The Spirit Realm?”", "Exploding Patience widened her eyes before bursting into a thin laugh.", "“Ohohohoho! Don’t be ridiculous. It might be different with only Raging Temperance being there— but isn’t the Seventh Army Commander there as well?”", "“….”", "“Even if you and I joined hands, we would not be able to do anything against the Last Dragon. Do you mean to say she was defeated by humans? Don’t be such a worrywart.”", "Exploding Patience raised her voice and laughed again. She did not seem to even consider such an absurdity as Twisted Kindness losing.", "It wasn’t that Unsightly Humility did not know where she was coming from, but his thoughts were different.", "Because he had seen and experienced it for himself at Arden Valley. A man, one-sidedly driving Undying Diligence to a corner, rampaging like a demon.", "Exploding Patience stopped laughing and continued.", "“Anyway, even if that is the case, what we need to do does not change. We must follow the Queen’s command and conquer that fortress as quickly as possible.”", "Though his thoughts were complicated, Unsightly Humility wholeheartedly agreed with this statement.", "“I will take the lead. I will leave the rear area to you.”", "“The Death Knights will be leading the way? How reliable.”", "Exploding Patience chuckled elegantly.", "And so.", "Unsightly Humility — the King of Death Knights — stiffly staring at the battlefield.", "Exploding Patience — the Banshee Queen — smiling leisurely.", "Vulgar Chasity — the Succubus Queen — blazing with killing intent.", "“….”", "And Abhorrent Charity marching onward silently.", "The four Army Commanders representing the Parasites and the four armies considered the Parasites’ main force finally appeared on the battlefield.", "1. The original saying in Korean is \"Fate sets a bridge of chance to those who try.\" Except here, the author used Miracle instead of Fate. "]}