{"cid": "37", "title": "Chapter 37. To Paradise (3)", "content": ["'What's this?'", "Seol stared at the piece of paper that had fallen on the shelf.", "'Oh, that's right. I got that from one of the Necessary Boxes….'", "He remembered receiving it as one of his starting bonuses. Honestly, he had completely forgotten all about it. At that time, he was far too stunned by the revelation regarding his Nine Eyes, and afterwards, the food he pilfered from the convenience store hid this paper away from his view and it languished at the bottom of the bag.", "He couldn't help but feel a bit surprised by the fact that he had completely forgotten about it until now.", "“Hey, Sungjin?”", "“Yes?”", "Yi Sungjin raised his head and looked at Seol after he stopped emptying the contents of his bag to the ground.", "“What was your Mark's grade again?”", "“Bronze.”", "“That means, you got a Random Box, right? Back at the assembly hall.”", "“Yes.”", "“What came out from there?”", "“It was a paper talisman. Why? Is something the matter?”", "Yi Sungjin replied without hesitation.", "“I'm kinda curious, but uh, the magic spell you can use with a talisman, can it be anything you want?”", "“No, not really. Mine had 'Bind' written on it.”", "Seol looked back at the paper talisman resting on the shelf and began frowning slightly. This scrap of paper in front of his eyes was…. almost completely blank.", "“Is it possible for you to show me your talisman? If you still have it on you, that is.”", "“Oh, that. My bad, but I already used it up back in the Tutorial…. We ran into that Gaekgwi monster as soon as we came out of our hiding place.”", "Yi Sungjin scratched the back of his head apologetically.", "“Hmm… I wonder if there’s anyone who still has their talisman….”", "“I'm sure that everyone has used theirs up by now. I mean, the Neutral Zone's about to close anyways.”", "“Huh? What does that mean?”", "“Hm? Oh, well, they are starting bonuses, right?”", "“What do you mean?”", "When Seol asked back in surprise, Yi Sungjin showed how stunned he was as if the thought of Seol not knowing about it didn’t cross his mind.", "After all, it was common sense for every Invited. Well, not unless they didn’t pay attention to any of the explanations provided beforehand.", "“Uhm…. Yeah, think of it like our phones. You heard that we have to return them before leaving the Neutral Zone, right?”", "“Yeah.”", "“It's like that. Both the starting bonuses and the phones aren’t things we earned through our own efforts.”", "“Right.”", "“Things like that, either we return them before the Neutral Zone closes, or they automatically disappear when we leave. The Neutral Zone is a special area connected to the Tutorial, so items from there can be used here, but we can't take them with us to Paradise.”", "“But can’t we bring the armors and weapons with us? Heck, I was planning to take my spell balls with me, too.”", "“Armors and weapons are bought with your own points, so they are excluded. And you got those spell balls yourself after finding the right amount of coins in the treasure hunt, right? I mean, they are different from the starting bonuses given away without us actually having done anything yet.”", "This was the first time Seol heard about any of this. His expression became complicated as he took a look at the paper talisman on the shelf.", "“For instance, if you did something by using the starting bonus, that's acknowledged as you having achieved it yourself. But the bonuses themselves won't be counted.”", "What Yi Sungjin was saying was that Seol’s talisman would be useless come tomorrow.", "“Wait a minute. Does that mean this bag too….?”", "Yi Sungjin nodded his head as if it was obvious.", "'I nearly ended up making a huge mistake.'", "Seol hurriedly took out all the things he carefully stored in the bag.", "In the meantime, he was regretting the fact that he hadn't gotten the chance to use this talisman. And at the same time, he got curious as well.", "….[You've acquired a Paper Talisman]….", "The announcement message definitely said he acquired a “paper talisman”. But, unlike the spell balls, not a single piece of information was written on the talisman itself, not even what kind of spells it might be able to cast.", "He didn't think of this item as useless junk, though. After all, it was one of the Gold Mark's starting bonuses. At least, its worth should be incomparably higher than the bonuses of the Silver and Bronze Marks.", "'Wish I had a clue….'", "Seol slowly fell deeper into his thoughts.", "[Are you making fun of me? Was your experience during the Tutorial that unpleasant? Are you trying to completely rip it to shreds, is that it? Just how did you even know what that man would need in here…..?!]", "Then, he remembered Han growling in anger after seeing the Necessary Boxes back in the assembly hall. The Guide looked so relieved when Seol told him that his Status Windows got updated, instead.", "[Scanning for the most 'needed item' during the current situation…. Please wait.]", "Next, he remembered the message that came after opening the first Necessary Box….", "[But that guy, he didn't clear the mission in what you'd call a 'proper' fashion. He just got lucky, that's all.]", "….And, even Kim Hannah's advice, too.", "'Could it be….'", "As soon as that line of thought entered his head, Seol fell into a serious dilemma. He slowly fingered the nearly-blank paper talisman, his Adam's apple bobbing up and down.", "“Anyways… What did you get for your starting bonu…. Eh?”", "Yi Sungjin's words came to a halt, along with his hands that also stopped emptying his bag. Seol was nowhere to be seen anymore.", "“…..Hyung?”", "*", "[Siege (Remaining number of attempts: 1/1)]", "Within 48 hours, annihilate the race of Guardians protecting the “Sanctuary” and destroy this impenetrable fortress!", "Difficulty: ImpossibleWhen successful: +172,800 SP, a one-time use VIP store coupon (1 per person)When unsuccessful: Death*Cooperation possible: up to 6 people.", "Seol came down to the first floor, and he stared long and hard at the parchment stuck at the very top of the noticeboard. The usually-noisy plaza was empty and quiet today as if everyone else was too busy sorting out their luggage to loiter around here.", "'There's even a time limit, too….'", "Seol slowly swallowed his saliva, reached up, and carefully took the mission parchment off the board.", "Now, this parchment was no longer glowing in red like before. No, it was now in an orangey hue, which was one grade lower – 'Do Not Approach'.", "His uncertainty only lasted for a brief moment.", "The color of 'Immediate Retreat Recommended' was now no longer there and that gave Seol a sliver of confidence.", "'There's a chance I can survive this.'", "The high level of danger was still present, but still.", "Someone once said thus – there would be a time in one's life when he either had to take a step back or to take that challenge head-on.", "He squeezed his trembling eyes shut. Fingers gripping the mission parchments grasped it even tighter.", "Tzzzt", "Accompanied by the sound of the paper cleanly ripping in half, Seol disappeared from the plaza.", "*", "The location he teleported to was in the middle of a dense forest.", "'Where is this?'", "Seol hastily surveyed his surroundings, only to have his jaw nearly hit the ground in shock, instead.", "'S, shit!'", "His eyes took in the majestic sight of a magnificent yet absolutely huge mountain range. The cliffs seemed so precipitous and stiff as if they were expertly cut and shaped by a heavenly carving knife; the highest peak couldn't even be seen, as it was shrouded by thick clouds.", "Things got worse, though.", "He also could spot countless structures and defensive walls built in and around the mountainside, and they all seemed incredibly sturdy to him, making him truly appreciate the impossible nature of this mission.", "'How is anyone supposed to clear this mission?!'", "This was no longer a problem solvable by a measly group of six survivors – even a well-organized army would find it hard to conquer this place. Only now did Seol realize what Kim Hannah was trying to warn him about.", "Seol did his best to rein in his wildly pounding heart and cautiously began walking forward. The actual distance to his destination wasn't far, as it turned out. Since he had no idea what might happen, he thought it'd be for the best if he closed the distance as much as possible before trying out the paper talisman.", "But, when he got a bit closer than before, he had no choice but to come to a very sudden stop.", "He left 'Nine Eyes' on since the Neutral Zone's first floor.", "And thanks to that, he could see the of the mountain range change suddenly from its initial light red to….", "….Deep, deep red.", "And then….", "'W, what the hell?'", "….Finally, to jet black.", "The formless pressure those cliffsides gave out after they all suddenly changed to jet-black color was so overwhelming that, simply by looking at them, Seol instinctively took a step back in fear.", "Swish!", "It was then, a sharp whistling noise pierced past his ear. Seol had been taking several retreating steps but came to a halt when that happened. And when he carefully wiped his cheek, he found blood on his palm.", "[What an insolent little human you are! Ohohoho!]", "A high-pitched but rather alluring voice of a female suddenly rang around the air.", "Seol quickly looked around his surroundings as confusion dyed his expression. He couldn't see or sense anything around him, yet…. What just happened?", "No, this wasn't the right time to dwell on such matters. The black color signified that he should escape right away. One wrong move and he would be dead.", "He recovered his wits and hurriedly pulled the blank paper talisman out. And then….", "[I can't tell what foolish thoughts led you to this place, but!]", "….And then, without a shred of hesitation, he ripped it in half.", "[You've used the Necessary Talisman.]", "[…But! As a Guardian, I can not sit idly by and simply watch your insolence!]", "[Scanning for the most 'needed spell' for the current situation…. Please wait.]", "[The punishment for intruding upon this holy site is your dea…. What?]", "The voice and the message continuously rang around in his ears. But then, eventually….", "[The spell, Limited Area: Great Earthquake, has been activated.]", "[An earthquake measuring 12 in magnitude will commence within the designated area.]", "Woong, woong, woong, woong!!!", "A massive barrier suddenly formed between the spot Seol was standing on and the mountainside. Then, this barrier expanded even further and completely surrounded the entire mountain range in the blink of an eye, with a membrane much, much thicker than any barrier Seol had seen up until now.", "[W, what do you think you're doing, human?!]", "The voice became urgent as this unexpected event continued to unfold.", "Unfortunately for the owner of the voice, the actual spell hadn't even begun yet.", "Rumble!", "An indescribably terrifying roar attacked Seol's hearing. It was so loud that he lost all his hearing right away.", "It was as if tens of thousands of fault lines were colliding with one another. And subsequently, the earth split….", "The ground cracked apart like spider webs, and the whole mountain range began trembling.", "KWANG!", "The earth broke apart and exploded upwards.", "Seol could only describe what he saw like that.", "[Kyaaaaak!!]", "Almost at the same time, a figure of a woman swiftly emerged from one of the trees trapped behind the barrier as her hair whipped about.", "This was no longer on the level of a mountain slide or something similar – no, the entire mountain range itself was cracking apart and was collapsing from top to bottom while the ground exploded non-stop.", "As he stood outside the barrier in safety, Seol couldn't really tell whether it was his eyesight twisting around or the actual mountain was being shredded into pieces. That was how absurdly scary the destructive force of the spell was.", "[Uaaak! Uaaaaaaak!!!]", "The mountains and the ground undulated and broke apart over and over again, causing this figure of female to jump up and down like a madwoman. However, the quaking became even harsher, even more violent than before, and soon enough, even her screamings disappeared as well.", "Seol dazedly looked on, before powerlessly collapsing to the ground. Witnessing this spectacle unfold right before his eyes, a nearly insurmountable fear had taken hold of his mind. Him sitting there on his knees, looking on while completely unscathed, that felt like a lie.", "In the end, he squeezed his eyes shut and covered his ears.", "When a calamity of such an unprecedented, heaven-changing scale descended, it didn't take long for everything trapped within the barrier to be annihilated into oblivion.", "[You have successfully cleared the 'Impossible' difficulty mission.]", "[You have received one One-time use VIP coupon.]", "[172,800 Survival Points have been accredited to you.]", "[Current Survival Points: 477,997.]", "When the kneeling Seol opened his eyes after hearing those alerts resound in his ears, he was already back in the first-floor plaza.", "“Huaaaa….”", "Seol breathed out a sigh of relief as if he almost lost ten years of his life just now. His shocked heart was still pounding away madly. He remained on the ground, working hard to regulate his heavy and rough breathing.", "'It's just a mission. Yeah, it was nothing more than just a simple mission….'", "After managing to calm his fears, Seol finally noticed a small piece of paper resting on his chest. And it was the one-time use VIP store coupon. It was only then he realized that he had succeeded. The emotion of pure joy rushed in.", "Seol clenched his fist tightly. He was uncertain and hesitant even when he was about to rip the mission parchment in half, but now that he managed to clear it, he was being overwhelmed by this sense of unadulterated joy and satisfaction.", "After confirming the amount of SP he had, Seol got up to leave.", "His comrades constantly advised him to invest in new armor and stuff, but he doggedly saved all of his points. And since he had received the extra rewards, he just knew that he'd never be able to get a good night's rest from regret if he didn't spend a dime and ended up leaving the Neutral Zone tomorrow.", "While carefully carrying the coupon, Seol quickly ran up the stairs. He pushed the door to the eighth floor VIP store and entered, only to find that there was another customer here.", "“Uh? You also came?”", "It was none other than Odelette Delphine.", "“What did you come to buy? I want to get a Divine Elixir, but apparently there isn't one for mana anymore.”", "Seol half-listened to Odelette Delphine's complaints while hurriedly browsing the item list.", "5. Divine Elixirs: 30,000 SP each – Strength x1, Endurance x1, Agility x1, Stamina x2, Luck x2", "He was the one who bought all the available Mana Power Elixirs, but one bottle each of Agility and Luck Elixirs were gone as well. Seol's teammates had purchased them. They did invest in their armors and equipment, but that didn't mean that some of them lacked enough wiggle rooms to invest another 30,000 points on buying up the Elixirs.", "“Delphine, are you planning to buy one of these Divine Elixirs?”", "“Pardon? Oh, no, not really~. I'm not gonna buy them.”", "“I understand. Uhm, hey miss? Give me every single Divine Elixir left in your inventory, please!”", "“…Eh?”", "A stupid-sounding gasp escaped from Odelette Delphine's mouth after hearing Seol's bold purchasing decision. 210,000 points disappeared in one go, as seven vials of Divine Elixirs entered Seol's hands.", "“And then….”", "While he was saving his points, he had already made up his mind on what he wanted to buy. He only bought the Elixirs simply because he now had lots more points to burn all of a sudden.", "10. Psychi's Tears: 250,000 SP, x1", "“Give me the Psychi's Tears as well!”", "“Ehhhhh?!”", "With that, another 250,000 points were gone.", "Now, the real problem began. Well, he wasn't planning to earn that one-time use VIP store coupon, after all.", "3. Moirai's Souvenir: 600,000 SP, x14. Miyal's Branding Iron: 100,000 SP, x15. Divine Stigmata: 300,000 SP, x16. Seed of the World Tree: 400,000 SP, x17. Aphriso's Sedge: 150,000 SP each, x5", "Seol didn't even bother to look at the items cheaper than 100,000 points. His eyes remained fixed on these five items as he deliberated on his choice for a long time.", "'Heaven help me….'", "Every single one of them possessed heaven-defying effects. After some deliberation, he had to tearfully exclude Miyal's Branding Iron and Aphriso's Sedge from his choice and move on.", "'Let's see. Moirai's Souvenir, Divine Stigmata, and Seed of the World Tree…….'", "After thinking about it seemingly for an eternity, Seol finally made up his mind.", "“Give me…. the Divine Stigmata…”", "There was only one reason for his decision.", "Both the Moirai's Souvenir and the Seed of the World Tree possessed an overall effect that seemed to benefit a group of people more. Meanwhile, the Divine Stigmata seemed more geared towards helping out one individual rather than many.", "As soon as Seol presented the One-time use coupon, the eyes of the maid in charge of the VIP store and Odelette Delphine went extra round in shock.", "“O, oh my!”", "“Ueeeeh!”", "“Can I take it?”", "Seol's question caused the dumbfounded maid to nod her head.", "“Yes, yes, you can take anything you want with this…. B, bu, but, how?”", "“Wha, what is this? This, isn't this that?! Right? You, did you clear that mission?! But, but! How did you do that?!”", "Ignoring the two flustered females, Seol tightly grasped the marble that shone in a brilliant blue hue. Then, he turned around and quickly left the store. He ran to his next destination, the regular store that sold weapons. He feared that, if he remained in the VIP store for a second longer, he'd not be able to forget about the other two items.", "The points still remaining: 17,997.", "Seol could hear Odelette Delphine desperately calling out to him from behind, but he was unable to answer her, as his head was filled with a singular thought of getting rid of the remaining Survival Points as quickly as possible.", "He spotted a handful of survivors browsing through the wares in the weapons store. Discovering Aragaki Yuzuha not too far from him, Seol raised his hand high and called out to her.", "“Over here!”", "“Yes?”", "Yuzuha trotted over to his side unhurriedly.", "“How much is the most expensive spear in this store?”", "“The most expensive one? Then it's…. we have a spear that costs 22,500 points, but for you, it'll be 15,750. In any case, how can I help you?”", "Unless one was talking about armors or items designed for Magicians and Priests, one wouldn't find high-priced weapons reserved for Warriors costing more than what one might find in the VIP store.", "“Give it to me.”", "“….Eh?”", "“Give me that spear. I'm buying it.”", "“Oh, oh my!! You’re the best!”", "Since all sales commissions counted towards her achievements, there was no way Yuzuha would hesitate and waste time here. She rapidly brought out a spear that shone in the most arresting silver light one could imagine, and then, bent her waist 90 degrees in gratitude.", "And out of the remaining 2197 points, Seol spent them all, bar the 1000 he needed to leave the Zone. Only then, his shopping spree came to an end.", "“Euhehehehe….”", "Seol continuously giggled like a madman as he climbed up the stairs, before covering his mouth in a hurry. Even if he felt like he was on cloud nine, his laughter sounded way too stupid for his own liking.", "He decided to save the Divine Elixirs for a rainy day. He was thinking that he should use them only after he ran into some kind of a bottleneck when trying to get physically stronger. Since he had plenty more room to grow as he was, using these Elixirs now seemed like the height of stupidity, instead.", "'As for the Divine Stigmata, I can only use it when I get to a temple…'", "But, the remaining item could be used right away, no problem.", "What a nice timing, then, as the night had approached and it was now time to hit the sack, anyway.", "Seol returned to his quarters and finished packing things up. He switched off all the lights and headed to the bathroom. After chasing away Yun Seora who was hiding at the bottom of the bathtub, he lied down on the tub himself.", "He stared at the clear liquid swirling around inside the small vial for a little while, before pulling the stopper out to drink every last drop of it.", "As soon as the refreshing sensation of the liquid tickling his throat registered in his brain, he was hit by a powerful urge to sleep, perhaps to signal that the effects were already manifesting themselves.", "Seol's expression was one of pure happiness as his eyes slowly closed shut.", "He had no idea in his wildest dreams what might happen tomorrow morning."]}