{"cid": "220", "title": "Chapter 220. The Inheritance of Roselle La Grazia (2)", "content": ["", "Her request couldn’t possibly be more absurd than overthrowing the Empire. Thinking that it wouldn’t hurt to hear her out, Seol Jihu accepted.", "“Of course, any time.”", "“Thank you. Then…”", "Roselle expressed her gratitude, then slowly raised her hands.", "Seol Jihu opened his eyes and let out a small gasp. The palace’s beautiful interior was nowhere to be seen, and he could only see a destroyed ruin.", "White steam was rising from the debris, and it was obvious who the perpetrator was. After all, only Roselle and the expedition team were in this place.", "“Ah, I’m in the middle of remodeling the place.”", "Roselle quickly spoke up, noticing the flustered look on Seol Jihu’s face.", "“The shocking news made me want a change in my surroundings.”", "Covering her mouth and chortling, Roselle waved her hand and restored the broken golden palace.", "“This way, please.”", "Seol Jihu somehow came to tour the palace, staying tensed the whole time.", "He stared fixedly at Roselle, who was walking ahead. After about five minutes, she sparked the conversation.", "“Pitiful, aren’t I?”", "“?”", "“I ended up like this after talking so high and mighty….”", "Well, it was funny at first, but Seol Jihu didn’t mean to ridicule Roselle in any way.", "“Not at all.”", "After all, she had endlessly put in the effort to accomplish her goal.", "While dreaming for several hundred years, to boot.", "How clear must her sense of purpose have been to not be shaken for so long?", "If anything, her unwavering mental fortitude was something to respect and emulate.", "At that moment, Roselle opened her mouth.", "“Do you know what sorcery is?”", "It was a sudden, seemingly random question. But realizing that it had something to do with whatever she would bring up next, Seol Jihu listened carefully.", "Roselle must not have been expecting an answer as she continued calmly.", "“Magic refers to the act of using mana, a power unique to humans, to carry out incomprehensible feats. Witchcraft is the technique of manifesting all kinds of phenomena by borrowing the power of supernatural existences or other mystical powers.”", "She continued explaining clearly and concisely.", "“What I call sorcery is a new discipline that combines these two together.”", "She then turned her head and smiled at Seol Jihu.", "“It is also the reason I came to be called a witch.”", "Seol Jihu reflected on what she said before asking.", "“You mean… you, Lady Roselle, founded the discipline of sorcery?”", "“Yes. When I was alive, the Empire treated me as a heretic and a thorn on the side because of it.”", "Roselle spoke as if it wasn’t a big deal, and Seol Jihu had a puzzled expression.", "“Why? Isn’t witchcraft a discipline too?”", "“The Empire as a nation was built with magic as its foundation.”", "Roselle replied with an unprecedented stiffness.", "“A nation of magic, by magic, and for magic. They only allowed their people to walk the path of a Mage. All other disciplines were targets to be eliminated.”", "Roselle furtively bit her lip.", "“Witchcraft was especially persecuted. Not only did its practitioners not worship the Empire’s gods, but individual worship of idols was also regarded as sacrilege during that period…”", "Seol Jihu finally caught a glimpse of why Roselle resented the Empire so much. While he couldn’t be certain, it seemed Roselle suffered something similar to a witch hunt when she was alive.", "Wasn’t that why she wanted to uproot the Empire, whose foundations were based on magic?", "“Let me say this in case you are misunderstanding me. I do not hate magic. Whether it be magic or witchcraft, I believe that they are both fascinating disciplines. I simply hated the Empire’s sole emphasis on magic.”", "“Mm… then couldn’t you have just left the Empire and take asylum elsewhere?”", "“Where? The Empire’s influence was spread throughout the entire continent. What nation would have accepted me? My only choice would have been to live in exile in a hideout where no one could find me.”", "Roselle heaved out a small sigh.", "“As long as you are born a citizen of the Empire, you must follow its laws. Well, I don’t think that’s wrong. But, I absolutely could not abandon witchcraft. For one reason.”", "Roselle hesitated for a long time, then seemingly made up her mind and spoke.", "“You see, I am not a native inhabitant of this world.”", "“…Excuse me?”", "Seol Jihu was taken aback by her shocking confession.", "“Let me rephrase myself. I was certainly born and raised in Paradise, but the Grazia House’s ancestor is not from this world. She was an inhabitant of another world but was banished to Paradise after getting wrapped up in an incident.”", "Roselle shrugged.", "“Though it may be hard to believe, it is true. The records left behind by our ancestor clearly said so.”", "Seol Jihu realized that this wasn’t anything to be surprised about. Thinking about it now, he was in the same position.", "‘Still, another world….’", "Suddenly intrigued, Seol Jihu asked.", "“What is that world called?”", "“Mm— The records say it is called Hall Plane[1].”", "“Hall Plane… Then how did your ancestor end up getting banished to Paradise?”", "“My ancestor seemed to have been both the hero and saintess of that world. Joining hands with three comrades, she overcame all sorts of obstacles and hardships to save humanity. It is truly a fairytale-like story.”", "Roselle explained slowly as if she was telling a folktale to a child.", "“But the after story of the fairytale was awfully cruel.”", "“?”", "“Once everything ended, the Magician of the party revealed his lascivious desire for the Fairy Queen. Not only did he kidnap the Fairy Queen, but he also kidnapped the Hero, whom she was engaged to, and held them captive in his base.”", "Seol Jihu was taken aback. The story that was full of hopes and dreams suddenly turned into a tragedy.", "“Saintess Grazia, who later found out what happened, led her troops to the traitor’s base to rescue her two comrades. Unfortunately, the rescue ended in failure. Not only were her troops defeated in an overwhelming fashion, but dimensional travel was forcefully cast on the Saintess. In essence, she was banished from her world.”", "“Ah… I’m sorry.”", "Seol Jihu belatedly realized his mistake. He had ended up asking more than what was necessary because he was intrigued.", "Smiling bashfully, he spoke.", "“I’m sorry.”", "“No, this is one of the reasons I revolted against the Empire.”", "One of the reasons for revolting. As soon as Seol Jihu heard these words, he came up with a conjecture.", "“Lady Roselle… Did you want to return to Hall Plane?”", "“…You’re very perceptive.”", "Roselle smiled gently.", "“Yes, I did. But rather than yearning to go… I probably wanted to escape reality. I was also curious and didn’t really like this world.”", "“….”", "“But dimensional travel isn’t easy, you know? Rather, it’s something that mere mortals wouldn’t dare to dream about.”", "She was right. Earthlings were able to enter Paradise through the power of Paradise’s gods. In other words, one would have to have power on par with gods to be able to accomplish something similar.", "“I came to a conclusion after long deliberation. That if I couldn’t leave this unfair world, I would change it myself. For the sake of future generations, I would provide a climate where anyone can share their knowledge and understanding of any discipline. And to do that, the Empire, which built itself atop the path of magic, had to be destroyed.”", "Seol Jihu’s brows perked up.", "Changing the world.", "Those words continuously echoed in his ears.", "“That’s why I attempted to combine magic and witchcraft. Because at that moment, I wished for a new, formidable power that no one else had. Of course, other people told me I was crazy and did their best to stop me, but—”", "“That’s incredible!”", "Seol Jihu couldn’t hide his admiration. Roselle blinked blankly, pausing mid-sentence.", "“Excuse me?”", "“So you tried something no one else has ever done and succeeded in pioneering an independent field!”", "What Roselle said truly held great significance to Seol Jihu. He was struggling to become a True High Ranker, and he felt like he finally found a lead.", "That wasn’t all. The two of them were surprisingly similar in more ways than one.", "Seol Jihu also wanted to change Paradise, expelling the Parasites and a portion of humanity in the process.", "But seeing how flustered Roselle was, Seol Jihu scratched his head.", "“Ah, did I say something rude…?”", "“N-No… I… I just didn’t expect you to really think that… I’ve never seen such a reaction.”", "Roselle stuttered greatly.", "“…My apologies. In the past, everyone had the same reaction when I said this.”", "“What did they say?”", "“That I was full of myself.”", "“….”", "“I’ve also heard ‘crazy bitch’, ‘insane’, ‘screw off’, and ‘aigoo~ girl, you’re driving me crazy!’”", "Seol Jihu wasn’t sure about the others, but he felt like he knew who said the last line.", "“Erm… this is the first time I’ve been praised… W-What I’m saying is that it was pretty nice.”Roselle stole glances at Seol Jihu, then cleared her throat and put on airs.", "“Kuhum. Yes! It is indeed incredible! Miracle bestows the bridge known as chance to those who strive. With heaven’s providence, I was able to open up a new realm. You don’t understand how deeply moved I was when I first chanced upon the Origin….”", "“Origin?”", "“The Origin is…”", "Roselle quickly shut her mouth in the middle of her speech.", "“The Origin is…”", "She hesitated. It didn’t look like she was hesitant to tell him. Rather, the concept seemed too difficult and boundless for her to explain with simple words.", "After a long time…", "“The rising of the sun and the setting of the moon.”", "Roselle quietly opened her mouth.", "“When the moon rises, the sun sets. Water flows down from top to bottom. The fundamental principles and the causes of the natural phenomena of the world are known as the Origin.”", "She seemed more serious and careful than ever before.", "“In truth, even I don’t know much about the Origin. Of course, I am proud of my achievement in making contact with it as a mere mortal, but from the perspective of the entire universe, I had already set one foot in the door.”", "Seol Jihu was suddenly relieved to not have chosen the path of a Magician. It was because he didn’t understand a thing Roselle just said.", "“I only gained the most basic qualification to explore it…”", "Roselle suddenly stopped pacing around. Seol Jihu noticed that his surroundings had gotten dark. They must have arrived at a specific destination while absorbed in their conversation.", "“This is—”", "The place seemed to be a royal chamber of sorts, and Roselle was walking up a staircase leading to an altar.", "“The spring of bottomless wisdom and the proof that I touched the edge of the Origin.”", "A fist-sized orb was floating by itself on the square altar, radiating a delicate glow of a firefly.", "Roselle stood in front of the altar and caressed the glowing orb preciously. Next, she turned back to Seol Jihu and revealed the identity of the light with a flushed voice.", "“I call this the Eternal Light of Wisdom.”", "She then continued.", "“I’ve thought a lot about it, really.”", "“….”", "“I had only two wishes in my life— dimensional travel and the fall of the Empire. But I failed to achieve them both.”", "One was a wish that she could not fulfill, and the other was a wish that could not be fulfilled.", "Roselle tilted her head up and stared at the ceiling.", "“How should I say this… I haven’t felt such a sense of loss for a long time. I went so far as to employ an expedient to become an immortal existence, all to wait and wait again…”", "Roselle’s deeply-rooted hatred had served as a driving force that allowed her to persevere. But with Seol Jihu telling her the truth, her hatred now had nowhere to go.", "If she had a living body, the shock would have relegated her to the bed, sick.", "“The fall of the Empire is an undeniable truth. There is no longer a reason for me to exist. But…”", "Roselle stared blankly before opening her mouth.", "“I also hated the idea of simply disappearing in vain.”", "With a bitter expression, she stroked the Eternal Light of Wisdom.", "“I mean, wouldn’t you feel the same way? The Grazia bloodline ended in my generation. The name disappearing in both Paradise and Hall Plane without leaving behind a trace… that’s too sad and frustrating.”", "“….”", "“I devoted my life, sacrificing my mind and body to achieve what I did.”", "Afraid of losing the fruit of years of labor and effort. With that, Roselle closed her mouth.", "Seol Jihu maintained his silence as well. Not wanting to disappear into the mists of history. Seol Jihu could empathize with this.", "“So I decided. Now that things have come to this, I will at least leave behind proof that I, Roselle La Grazia, existed in this world. I will leave behind a trace of the House of Grazia.”", "After a long silence, Roselle stared at Seol Jihu.", "“So, I have just one request for you.”", "She finally got to the point.", "“Can you bring me someone with talent in this discipline?”", "Seol Jihu’s eyes widened at her unexpected request.", "“Discipline?”", "“Yes, someone who can accept the Eternal Light of Wisdom. Simply put, someone to become my successor.”", "Seol Jihu subconsciously stared at the orb of light. A powerful attraction seemed to suck him in, so he quickly averted his gaze.", "‘I don’t know….’", "Her request this time was a thousand times easier than something as absurd as asking to destroy the Empire, but just how many people would understand the value of this orb of light? After all, even he wasn’t so sure.", "“If someone accepts that light… mm, how should I say this… will that person become different from an ordinary Magician?”", "“Different?”", "Roselle’s voice went up at once. The way her cheeks turned red, it almost seemed like Seol Jihu just insulted her. But knowing that Seol Jihu didn’t mean any harm, she stopped at a simple snort.", "“It will be more correct to say they’re distinct.”", "She spoke firmly as if it wasn’t worth mentioning a second time.", "“Of course, I can’t say the realm I achieved is the best. But the Eye of Heaven, which can catch a glimpse of the Origin, is an innate power that only a few chosen are born with, and the Third Eye, which can even see through this heaven, is a heaven-beyond-heaven power. There is no need to even mention it. At least, when we’re talking about human capabilities.”", "It was yet another thing that didn’t make any sense. Seol Jihu blamed himself for asking something he shouldn’t have.", "“Since the Eternal Light of Wisdom is largely affected by one’s bloodline, their innate qualities greatly affect their affinity to it. But that doesn’t mean a random person can acquire this ability through effort. Even the few who have talent must endeavor for a lifetime just to have a chance of grasping it.”", "She babbled on, then glanced sideways.", "When Seol Jihu sang about how great she was, putting her on a pedestal, she hunched her shoulders and shook her head. Then, she strutted her chest out.", "“Going back to the main point, my successor would be in a different position. He or she would only need to take my mastery in sorcery in full. With my help, it shouldn’t be too difficult.”", "Just as Seol Jihu was about to ask, ‘What about me?’", "“Of course, I would be elated if he or she had a natural talent, but I would really love for this person to be hard-working and constantly striving to study this discipline.”", "But after hearing what she said next, he swallowed his words.", "There was a saying that having too much was as bad as having too little.", "He was struggling to reach the realm Jang Maldong told him about, so he had no confidence in being able to digest the Eternal Light of Wisdom.", "Most importantly, he wanted to pioneer a new realm, rather than following in the tracks of a realm that someone else created.", "‘Wait.’", "At that moment, Seol Jihu suddenly thought of something and flinched.", "‘Isn’t that coming up?’", "Soon, the March Neutral Zone, which currently held unprecedented attention of Paradise, would open.", "If Seol Jihu could recruit a talented Earthling, he would be able to have Paradise’s sole Sorcerer as his comrade.", "It was only then that Seol Jihu realized how great a fortune he had chanced upon.", "“It looks like our interests coincide.”", "Roselle smiled, having read Seol Jihu’s thoughts.", "“You’ll accept this young lady’s request, yes?”", "“Yes. But it may take a while.”", "“You can take your time.”", "Roselle replied with a bitter smile.", "“I have waited for hundreds of years already. Waiting a few dozen more won’t be a problem.”", "“No, you don’t have to wait that long. A few months at the earliest and a few years at the latest…”", "“It will be better for me the quicker you are. Anyway, I’m glad.”", "Roselle looked relieved.", "“So once I find the successor, I just have to bring them here?”", "“Yes, but—”", "Roselle stared at the pendant hanging on Seol Jihu’s neck.", "“Wouldn’t it be better for us to keep in touch?”", "“Is there a way we can do that?”", "“Of course!’", "Roselle shouted with a bright, cheerful expression.", "“Sorcery has the power of creation as its foundation. It can achieve all sorts of wondrous things!”", "Skipping toward Seol Jihu, she placed her hand on his Pendant before taking it off. Once a faint trace of light momentarily fogged up the jewel, she smiled furtively.", "‘What did she do?’", "“Don’t worry. I’m not so shameless as to force myself in when there’s already a lady of the house.”", "“Excuse me?”", "Seol Jihu asked back as always. Roselle chuckled, then looked down.", "“It looks like your comrades have finished packing up the inheritance.”", "“Already?”", "“Yes, they are grumbling about you not coming back. Some are also worried.”", "Right, since they got everything there was to get, it made sense that they would want to leave this place as soon as possible.", "“Will you go back now?”", "“Yes, please.”", "He got what he came here for, so Seol Jihu nodded his head. Roselle bowed politely.", "“Thank you for listening to my unreasonable request.”", "She then continued with smiling eyes.", "“Thanks to you, I spent a refreshing, cheerful time for the first time in a while.”", "“Not at all.”", "“No, really. I am not trying to flatter you. The taste of a heartfelt praise is really…”", "She trailed off, then asked with a beaming smile.", "“Ah, right. I gave up on the pendant, so please, do forgive me if I show up in your dreams every once in a while.”", "Now what did this mean?", "Seol Jihu raised a question, but Roselle didn’t answer. She simply put on a strange expression.", "“Fufu, your comrades are getting anxious.”", "Roselle slowly raised her arms.", "“Then, until the next time we meet, I pray for your well-being.”", "Her dreamy voice flowed out like music. And before Seol Jihu could say a thing—", "“I hope you had a great dream.”", "Roselle’s hands quickly came together.", "Chak!", "*", "Seol Jihu’s eyes flickered open.", "‘Huh…?’", "Things felt different than when he woke up from the nightmare. He felt refreshed like he just got a good night’s sleep. When his blurry vision came into focus, Seol Jihu gulped hard.", "The same sounds of surprise rang out around him.", "The expedition team was lying in the middle of the forest again. Seeing that the Stele of Evaluation had flickered off, he realized what must have happened.", "The expedition team had unknowingly fallen asleep and dreamed.", "Even Flone.", "He couldn’t tell whether what he saw was a dream or a reality.", "“Ah, shit.”", "Chohong, who was rubbing her forehead drowsily, hurriedly shot up. Seeing the bags sprawled around them, she glanced at them half in doubt.", "“Please… please…”", "Pleading earnestly, she untied the knot on a bag. A big grin immediately spread across her face. She grabbed a handful of gold and burst into laughter.", "“Look! It wasn’t a dream! It wasn’t a dream! Uhahahaha!”", "“Fuck, I thought I had another nightmare…”", "Maria breathed a huge sigh of relief and began to check the bags one by one.", "“Just where have you been?”", "Hugo nudged Seol Jihu, who was sitting in a daze, and asked.", "“Oh, it’s nothing. I just had a talk with her.”", "Seol Jihu finally got up and looked at Chohong and Maria, who were staring into the bags.", "“Everything good?”", "“Yeah! We made sure not a tiny speck of gold was left behind!”", "Hugo smacked his chest and answered. Seol Jihu had a feeling he could trust these words 100 percent.", "Hugo guffawed while massaging Seol Jihu’s shoulders.", "“Seol, I’ve never seen a fortune like this in my entire life! Telling you to join Carpe Diem back then was the best decision I ever made! Look at all this money!”", "Hugo’s excitement hadn’t subsided a bit.", "‘Money?’", "Seol Jihu grinned.", "Right, money wasn’t bad.", "But the real jackpot was elsewhere.", "Seol Jihu clutched the pendant tightly and looked around the forest. He might be mistaken, but the forest seemed to have gotten brighter.", "No, he was certain it did.", "The fog was gone, and so was the ghastly blue light. The area was no longer dark and damp, but cool and refreshing.", "Seol Jihu turned around. Facing the cool breeze that blew against his face, a cheerful smile spread across his face.", "“Let’s get out of this forest now.”", "The expedition team responded louder than ever before.", "1. Yet another MEMORIZE reference. "]}