{"cid": "451", "title": "Chapter 451. The Second Coming of Gluttony (1)", "content": ["After tearing the paper, Seol Jihu shut his eyes tightly. To be honest, as much as he knew how unreasonable it would be, he didn’t want to reopen them.", "Ever since he read the book and until he arrived home, he had been happy. If this was a dream, he didn’t want to wake up.", "What if the scenery didn’t change? What if, when he opened his eyes again, he was still standing in his room, and not in Paradise?", "“….”", "A smile spread across Seol Jihu’s lips. Just now, he thought ‘Paradise’ when originally he would have called it ‘Utopia’. Which meant….", "‘My memories are back.’", "That was when a faint noise reached his ears.", "Seol Jihu opened his eyes slowly and carefully.", "When he caught a glimpse of a familiar stone statue beyond the broadening view, his eyes shot open.", "The first thing he saw was Gula’s statue, and behind it, he saw the tall columns supporting the roof, and the majestic murals spread across the walls.", "It was no doubt the temple of Gula.", "He was back. He was finally back — in Paradise.", "Seol Jihu turned and looked around the temple. Everything that happened after he collapsed on the slope of the hill slowly passed through his mind. He shuddered at the thought of the time when he almost jumped from the rooftop.", "‘I’m lucky I’m not dead.’", "He thought he’d never be able to return. And he couldn’t have managed it, had he been alone. It was thanks to everyone’s dedication that he was able to resurrect.", "[Welcome back.]", "Just as tears were starting to well in his eyes, a gentle voice resounded throughout the temple.", "The voice finally convinced Seol Jihu that this was, in fact, reality and not a dream.", "[I’ve been waiting for you.]", "Seol Jihu’s gaze turned to the statue.", "“Gula-nim!”", "He was so happy that he forgot he could just think his thoughts instead of speaking them out loud.", "Silence descended upon the room. There was so much he wanted to say. So much that he didn’t know where to start.", "Gula, too, remained silent. She was reading Seol Jihu’s thoughts.", "“…What happened?”", "After a moment of silence, Seol Jihu decided to ask what he was most curious about.", "“How was I able to resurrect?”", "[The fact that you’re asking this, tells me you know your body was in no state to be perfectly resurrected with just one Divine Wish.]", "Seol Jihu nodded. He also wondered why he still had Black Seol Jihu’s memories even after Future Vision was activated. But right now, this was more important.", "[It’s true that none of your comrades had enough contribution points to exchange for a Divine Wish.]", "But wishes weren’t the only way for an Earthling to resurrect.", "[So instead, Teresa Hussey and Yun Seora each secured a Royal Oath to seek your resurrection.]", "Seol Jihu’s eyes widened. They still had not one, but two Royal Oaths left?", "[Prihi Hussey, the King of Haramark, transferred the ownership of his Royal Oath to Teresa Hussey….]", "Teresa, he could understand. But he had no idea from whom Yun Seora acquired her Royal Oath.", "It was then a bright light flashed before his eyes, and a piece of paper appeared in the air.", "Seol Jihu unwittingly grabbed it. There was only one sentence written on the paper.", "—I, Roe Scheherazade, would like to transfer the ownership of my Royal Oath to someone who is willing to use it for the resurrection of an Earthling by the name of Seol Jihu.", "Seol Jihu’s complexion waned.", "“Roe Scheherazade is…”", "[Dead.]", "Gula answered simply.", "[She took her own life shortly after writing her will. It seems she had a change of heart after talking to Yun Seora.]", "A change of heart. Seol Jihu glanced down at her will. Her failure to specify the name of the person to whom the ownership of her Royal Oath would be transferred indicated her intention too well.", "This came as a surprise. He never imagined that Roe Scheherazade would change her mind again at the last minute. For some reason, Seol Jihu felt bitter.", "[I know you must have a lot of questions….]", "Gula’s voice brought him back to his senses.", "[But I’m afraid you'll have to get started right away.]", "Seol Jihu flinched.", "“How long has it been since I died?”", "[It’s been exactly a month.]", "30 days. Only 10 days had passed on Earth, but time in Paradise was three times faster than on Earth. 30 days wasn't short. It was more than enough time for the Parasites to finish what they had started.", "‘Those damned bastards.’", "When he thought of the Parasites, Seol Jihu’s eyes began to glow ferociously.", "“The situation is….”", "[Not good.]", "Gula let out a sigh and began to explain.", "After the Parasites crossed the border and destroyed Grazia and Caligo, the Four Army Commanders advanced to Odor.", "Humanity united forces with the members of the Federation who had already moved to Odor prior to the war. The union lasted for a fairly long time against Vulgar Chastity, but could no longer hold out when Sung Shihyun and Exploding Patience arrived.", "It was around this time that the Federation’s main force arrived in Eva.", "However….", "[The Parasites did not allow the Federation and humanity to gather in one place.]", "As soon as the Parasites captured Odor, they divided their forces again in two. Meanwhile, Twisted Kindness occupied the road between Odor and Eva.", "This forced the Earthlings and the Federation in Odor to retreat to Haramark.", "[While Exploding Patience and Twisted Kindness delayed the advance of the auxiliary forces in Eva, Sung Shihyun and Vulgar Chastity destroyed Odor and pursued the retreating army all the way to Haramark.]", "To make matters worse, Unsightly Humility and his army invaded Arden Valley. When the Army Commander realized that the Federation’s main force could no longer invade the Parasite’s territory, he crossed the valley and headed straight to Haramark.", "“So right now, Haramark is….”", "[Barely holding out against four Army Commanders. It’s been three days already.]", "“Four? Don’t you mean three?”", "[Abhorrent Charity has also revealed himself, but he’s not taking part in the battle. This goes to show how confident he is about their victory.]", "He must have come out to watch the fall of the species he once belonged to.", "Seol Jihu clicked his tongue.", "He knew the Parasites wouldn’t sit idly by while he was away, but he didn’t think they’d go this far.", "[It is my assumption that the Parasite Queen wants to destroy the base you have built.]", "Gula’s voice continued.", "[Teresa Hussey must have thought the same. So instead of retreating to Eva, she volunteered to become the bait.]", "“Bait?”", "[She knew she would be doing exactly what the Parasites wanted, but if she stayed in Haramark, she could delay the attack on Eva as much as possible.]", "Eva’s fortification was already complete, and if the Federation’s main force combined with humanity, things would have gotten quite troublesome for the Parasites. So the Parasites schemed to fight them separately, and humanity complied.", "Seol Jihu’s eyes tensed.", "In short, Teresa chose to preserve the base where Seol Jihu would return over victory, during a war in which the fate of her species hung in the balance.", "She believed without a hint of doubt that he would return.", "[Her strategy was bold, but it presupposed more damage.]", "Gula spoke in a bitter voice.", "[Fortunately, the valley fortress managed to delay Unsightly Humility’s arrival… but that is already in the past. Unsightly Humility arrived in Haramark two days ago.]", "The valley fortress had fallen, and now Haramark was on the verge of defeat under the joint attack of the three Army Commanders.", "Seol Jihu’s ears picked up the faint sound of explosions in the distance. Only then did he realize where he was, and why Gula had resurrected him in Haramark. If he had come a little later, she would have resurrected him in Eva.", "This was no time to be idle. Seol Jihu quickly checked his body. Almost immediately, a bitter smile flashed across his face. Apparently, two Royal Oaths weren’t enough to restore his condition to normal.", "His right arm was back, but his circuits were all in a jumble due to the aftereffects of the reverse-flow mana. He also noticed the presence of the Parasite Queen’s divinity and Absolute Evil inside his body, albeit in small quantities.", "Seol Jihu opened his status window. As expected, his Current Condition and Physical Level were a mess.", "‘If I go out in this state… I’ll die before I even get to fight.’", "But this wasn’t an issue for him. Normally it would take at least a year or two to recover fully from an injury of this nature, but Seol Jihu had the means to shorten that period to a blink of an eye.", "“Gula-nim.”", "[Yes.]", "There was no reason to hesitate. Seol Jihu muttered a wish inside his head, and Gula responded immediately.", "FLASH!", "A bright light devoured Seol Jihu’s entire body. The wounds and the magic square inside his body were erased in a flash. His mana, twisted and entangled like a spider web, began to unravel like a thread, and the remnants of the two divinities slowly faded away.", "He felt his own energy return to his body, now cleansed of all the impurities. The sheer size of it made Seol Jihu shudder. A groan escaped his lips as the energy gushed out from his core.", "‘Thank you.’", "He didn’t forget to thank Blacky. It was all thanks to him that Seol Jihu could recover his energy with just one wish.", "[Your recovery is complete. How do you feel?]", "“Perfect. I feel great.”", "Seol Jihu replied, swinging his arms in circles.", "[And your head?]", "“Calm. I didn’t know having a coherent memory would feel this good.”", "Seol Jihu smirked.", "“Next up is advancement…. Ah, that wish just now didn’t use up all my contribution points, did it?”", "[Of course not.]", "Gula, too, smirked.", "[You can aim for Level 8 or higher if you want to, and you won’t need to take a promotion exam.]", "He played a major role in securing the Imperial Oath, defeated countless Parasites, and even damaged the Parasite Queen’s divinity.", "That was converted into contribution points and added to the amount he already had. So now he had more contribution points than he had ever had. There was enough left for him to obtain two more Divine Wishes even after spending the contribution points for one wish already.", "“I’d like to go as far as my contribution points allow.”", "Seol Jihu straightened his posture.", "[Request acknowledged.]", "Gula replied without delay.", "[Henceforth, Seol Jihu will go beyond the Level 8 Saint…]", "[…And be promoted to Level 9 Divine Spear.]", "[I expect great feats befitting your position as the spear of Gula and a being that has transcended humanity and seeks to reach godhood!]", "Just like that, he succeeded in advancing two levels at once for the second time.", "Finally, Paradise’s first Level 9 Earthling was born.", "[In addition.]", "But Gula was far from done.", "Seol Jihu’s eyes widened in surprise when the statue of the goddess suddenly began to shake as if it were alive.", "A thin, film-like form surrounding the statue glided toward him. It approached Seol Jihu with the swiftness of flowing water and slowly spread its arms.", "The black cloth loosely tied around a pair of slender arms flickered before his eyes. The fabric wrapped around the body and the legs also fluttered in the air.", "The figure looked all the more mysterious, as the black, translucent veil covering both her eyes and nose revealed only her pale-colored lips. Her long black hair was touching the floor.", "Seol Jihu finally realized who the woman—the goddess—was, surrounded by a strange darkness.", "Gula had physically manifested before him.", "[Come closer, my child.]", "Seol Jihu lowered his head quietly.", "[Humanity has changed.]", "Gula laid her hand on top of Seol Jihu’s head.", "[While you were escaping from the Parasites, they quickly formed an auxiliary force…]", "[And they joined forces with the Federation to resist against the Parasites after you disappeared.]", "[The oaths they took may have been the reason for their actions, but humanity no doubt responded to the trial I gave them through you.]", "[Roe Scheherazade, the greatest problem, changed her position at the last minute.]", "Which meant….", "[You have successfully brought about humanity’s complete change.]", "[The biggest problem plaguing humanity has been resolved, and the change is now complete.]", "[Because the change is complete, the trial I have set you has also been completed.]", "And so….", "[I hereby acknowledge the completion of the Executor's trial….]", "[…And I announce in the name of Gula that I have chosen Seol Jihu to be the Apostle and the Star of Gluttony!]", "The sound of notifications rang loudly in his ears. A dozen messages popped up before his eyes, informing him that he had obtained the right to exercise the Authority of Gluttony and appoint a Servant.", "[Go, my child.]", "Gula wrapped her arms around Seol Jihu as if to celebrate the birth of a new apostle.", "[Go to our enemies and show them who has returned!]", "[As the son and the spear of Gula, eliminate our enemies, and let the Goddess of Parasitism know that Gluttony has come to devour the Parasites!]", "*", "Seol Jihu stepped outside Gula’s temple.", "Above him, the overcast sky was dark and red.", "FLASH!", "Suddenly a blue light flashed across the sky.", "In the distance, he heard the sounds of something crumbling down, stomping footsteps, and the sound of endless explosions.", "The war was finally beginning to feel real.", "Seol Jihu hurried to the royal palace. Gula had informed him that Haramark’s royal family was keeping his equipment in their care.", "“…I knew you’d make it in time.”", "That was all Prihi said. Of course, he couldn’t fully erase the look of surprise from his face, but his voice remained calm nonetheless.", "“We’ll catch up later. Right now, we need your help.”", "Prihi brought the equipment and handed it over to Seol Jihu.", "Seol Jihu quickly equipped himself and then kicked toward the sky with the Spear of Purity in his hand.", "His body shot up into the air and quickly traversed midair.", "Level 9 Divine Spear, Class Ability — Aerial Movement.", "This was the first skill he gained by spending his contribution points after being promoted to Level 9.", "Seol Jihu pulled up his status window while flying through the air at the speed of light.", "[Your Status Window]", "[1. General Information]Summoned Date: 2017. 03. 16Marking Grade: GoldSex/Age: Male/27Height/Weight: 180.5cm/65.4kgCurrent Condition: HealthyClass: Lv 9. Divine SpearNationality: Korea (Area 1)Affiliation: Valhalla", "[3. Physical Level]Strength: EXEndurance: EXAgility: EXStamina: EXMana: Divine BeginningLuck: High (Intermediate)Remaining Ability Points: 4", "[4. Abilities]1. Authorities (3)—Servant (Grade Unknown)—Godslaying (Grade Unknown)—Gluttony (Grade Unknown)", "His endurance had risen to EX. According to Black Seol Jihu, this was because he continued to move his body for a long time after surpassing what was physically possible for humans.", "The same was true of his mana. During the process of neutralization, his body absorbed small portions of the Parasite Queen’s divinity and Absolute Evil, thus raising his mana to Divine Beginning.", "As for agility, he used the points he earned when he was promoted to Level 8 and Level 9 to increase its grade to EX.", "Seol Jihu clutched his spear tightly in his hand and turned the status window off.", "The sound of battle was getting louder with each step, and he could now hear screams.", "As Gula had said, the Federation and humanity were struggling against the Parasites. They were desperately trying to stop the enemy’s advance, but the battle was nearing its end.", "The mere thought of the past made Seol Jihu’s blood boil with rage.", "‘Sung Shihyun…. The Parasite Queen….’", "The Parasites achieved their goal.", "But he, too, succeeded in returning to Paradise.", "Last time the Parasites had treated him so well, it was now his turn to repay them.", "Seol Jihu had been determined to carry out the Golden Rule long before Gula urged him.", "He would show the Parasites that he was back on his feet, gained so much more because of them, and as a result, they would be paying a high price.", "The battlefield beyond the city wall quickly drew nearer.", "Seol Jihu’s eyes sharpened and began to emit golden light."]}