{"cid": "344", "title": "Chapter 344. Comeback (2)", "content": ["“…It’s been a while since I’ve met a guy who learned Intuition.”", "Sung Shihyun murmured in surprise.", "“Even Haeju couldn’t learn that skill…. Looks like yours is pretty high level too.”", "He also glanced at Philip Muller, whose eyes were split open in shock.", "After showing a faint hint of regret, he vanished like smoke before appearing next to Vulgar Chastity a second later.", "—You…", "“C’mon, your knight in shining armor is here to save you. You should be looking at me with dreamy eyes full of hearts.”", "Sung Shihyun sniggered.", "Vulgar Chastity’s tense shoulders relaxed, and she let out a sigh of relief.", "Sung Shihyun. Although he had trouble controlling his divinity at the moment, at a time when the Seventh Army Commander had likely been defeated, he was the Parasites’ strongest card.", "—T-Thanks. Let’s hurry.", "“Nah, wait a bit, girl. I haven’t seen them in a while. Let me at least say ‘hi’.”", "Sung Shihyun turned his gaze, snickering.", "Seol Jihu carefully observed the man who appeared out of nowhere. From the looks of it, he seemed to be on the Parasites’ side. But he was clearly a human being.", "Seol Jihu looked around just to be sure, and lo and behold, some of the others looked greatly shocked.", "Agnes and Philip Muller couldn’t close their dropped jaws. Baek Haeju and Seo Yuhui’s faces were especially a sight to behold.", "“Yo.”", "Sung Shihyun said with a beaming smile.", "“This is where everyone was? It’s been a whi—”", "He cut himself short in the middle of his sentence and swung his longsword to the left like a flash of lightning.", "Clang!", "The blade struck an ice spike that sprouted from the air and aimed for his head.", "As he tightened his grip on his sword, cracks appeared on the ice before it shattered into thousands of pieces.", "“Who did that? I bet you’re one of those people who attacks someone when they’re transforming.”", "Sung Shihyun then glanced at Eun Yuri, who was floating in the air like him.", "His scowling eyes widened to a circle.", "Being scanned from the face all the way down to the feet with such an obvious glance, both Roselle and Eun Yuri felt chills run down their backs.", "They had a peculiar feeling similar to a worm crawling on their skin.", "‘Iya~’", "Sung Shihyun couldn’t hide his shock.", "“So many that are my type… Alright, I’ve decided. I’ll let you be Fourth.”", "—Fourth?", "“You must have heard of the saying, a hero likes many women. For someone like me, having several concubines is a given.”", "—…So you’re saying.", "Roselle’s long, slender eyebrows furrowed to a scowl. She looked as though she had been greatly insulted.", "—I’ve been chosen to be your fourth concubine?", "“Oh! So you’re not just a pretty face. That’s right. You can think of it as me calling dibs. I like intelligent women.”", "Roselle looked dumbfounded, but Sung Shihyun blabbered on, not caring in the slightest.", "“You’re more than qualified to compete for the wife position. That’s why you’re Fourth. For the record, Third is Haramark’s princess. The two of you can have fun working this out.”", "Roselle stared at the babbling young man and asked.", "—I can curse you out, right?", "“Of course, go ahead. You’re more than welcome to. That makes me all the more passionate.”", "Sung Shihyun chattered on.", "—Even though you look totally normal… Sigh. This is our first meeting, but I can tell what kind of person you are, no, were.", "Roselle sighed quietly while looking at the young man speechlessly. She crossed her arms and gave him a pitying look.", "—A talented, competent man, who lacks character and feeds off of his own pride. I’ve seen many people like this, and their endings are often the same. They wander around unable to find a place for themselves, until being used as a rag and then ultimately being thrown away. Ah, what a pitiful, moronic life~", "“No, you’re wrong.”", "Sung Shihyun snickered.", "—Am I?", "“Yep. Because I wasn’t thrown away. I left on my own.”", "Sung Shihyun looked down.", "His gaze remained on Chung Chohong and Phi Sora for a moment, and then he turned to Seo Yuhui, Baek Haeju, and Agnes and smiled at them one by one.", "“Isn’t that right? First, Second, and… ah, I haven’t seen you in a while, Sixth.”", "Sung Shihyun waved his hand.", "‘…An irredeemable man.’", "Agnes gritted her teeth.", "The other two did not respond.", "Seo Yuhui looked stunned as if she received a great shock while Baek Haeju’s face flashed back and forth between red and purple, as though she was trying hard to rein in her anger.", "Sung Shihyun rejoiced as he saw them.", "“You guys miss me? I bet you did. But what a shame, I’ve already turned to the Parasites.”", "His beaming smile really provoked one’s urge to punch him.", "“See, you should’ve treated me better when you had the chance. What, you really thought I wouldn’t turn to the Parasites? Really?”", "Seol Jihu was taken aback as he saw the snickering young man.", "He seemed to be Sung Shihyun, one of the legendary Earthlings. Although Seol Jihu had heard of his name several times before, he was giving off a different vibe than what Seol Jihu anticipated.", "To put it into words, Seol Jihu felt like he was looking at a manchild who was begging for attention.", "“So, how does it feel?”", "Sung Shihyun asked with a flushed voice. The answer he was expecting seemed to be along the lines of, ‘Why are you doing this?’ or ‘We’re sorry! Please snap out of it and come back to us!’", "Baek Haeju’s throat drew a huge gulp. She took a deep breath, and her flushed complexion subsided quickly.", "Then, she glared at Sung Shihyun with her uniquely cold eyes.", "“Whatever.”", "“Whatever?”", "“That’s right. Whether you defect to the Parasites or not, what the hell does it have to do with me?”", "“Ooh~ What a strong move. But I can tell you’re mad from your voice.”", "“That’s just what you’re hoping for. But we’re talking about a guy who has nothing going for him other than his strength. I never expected anything from you, so I’ve got nothing to be disappointed or mad about.”", "“….”", "“This is perfect. I’ve wanted to kill you on more than a couple of occasions. Thank you for going to the Parasites. Now I can kill you proudly.”", "Sung Shihyun smacked his lips, perhaps because he got an answer he wasn’t expecting.", "“Your temper hasn’t gone anywhere, huh. Well, that’s what makes you charming.”", "He murmured quietly before glancing at Seo Yuhui, who he designated as First.", "“Do you think the same way, Yu…?”", "He made a bitter expression without finishing his question as Seo Yuhui was glaring at him with eyes filled with disgust and sympathy.", "She was clearly repulsed. She even covered her mouth with her hand and retched.", "“…Disgusting.”", "She wiped her mouth and finally spat out a word.", "Seol Jihu was speechless. This was the first time the kind Seo Yuhui was showing such disgust and revulsion.", "“…That’s harsh. I can’t do anything about it if that’s how you really feel…”", "It must have been a shock to Sung Shihyun as well since he scratched his head hard.", "“Well, too bad.”", "He shrugged as the corner of his mouth curled up.", "“No matter how much you all hate it— in the end, you’ll end up pregnant from this irredeemable, disgusting trash of a man. So be good and get along now, alright?”", "Killing intent soared up from Baek Haeju’s body. However, Sung Shihyun trembled as if just thinking about this pretend future made him elated.", "“Ah! The same goes for the pretty red-hair over there too!”", "The ‘pretty red-hair’, whom Sung Shihyun pointed at just now, raised her eyebrow.", "“You’re saying I’m Seventh?”", "“Bingo. I was debating between you and the chick with the mace, but you’re better in my eyes.”", "“Ah~ Is that so? At least you know who’s pretty… Unfortunately for you, I have high standards. And you’re lacking in qualification by a long shot.”", "“Don’t worry! A snobbish, lady-like maiden like you is exactly my type. Uhehehehe!”", "Sung Shihyun simpered.", "Phi Sora frowned and turned away after spitting on the ground.", "“Wow… I’ve heard the rumors, but this is the first time rumors were underexaggerating.”", "This summarized the thoughts of everyone observing Sung Shihyun.", "Baek Haeju was feigning being calm at a glance, but her throat was trembling noticeably.", "However, she held herself back one more time. She knew too well why Sung Shihyun was saying all this.", "Provoking the enemy was both his strong point and specialty. Being on the receiving end of it for once was aggravating, but reacting to it was the same as falling for his scheme.", "—Hold on, let me lower myself to the same level as that son of a bitch.", "‘Hmm?’", "Seol Jihu, who was looking for an opening to sneak attack, blinked in confusion. Baek Haeju’s voice had suddenly rung inside his head.", "Mental Transmission, was it?", "“I don’t give a shit about how you feel, but unfortunately for you…”", "Baek Haeju got closer to Seol Jihu before he could even finish his thought. Then, his eyes started blinking even more quickly. It was because Baek Haeju clung to him closely and locked her arm with his.", "“I already have a man.”", "Sung Shihyun’s laughter vanished, though he still maintained his smile.", "“Oh? When did my Second learn how to flirt? What, you want me to get jealous?”", "“No, I’m just telling you the truth.”", "“Hah, don’t go too far. How is he any better than me? If you want to fool me, you should at least bring a guy who’s in the same league as me.”", "Sung Shihyun mocked, but Baek Haeju didn’t bat an eye. Rather, the smile on her face only grew thicker.", "“I guess you’re right. He’s in a completely different league than you. I feel sorry even comparing the two of you.”", "“Hah!”", "“You know, my boyfriend entered Paradise far later than you. But he’s far~ more famous than you.”", "Sung Shihyun’s smile faded away. He remembered how the Parasite Queen constantly mentioned a certain Earthling after he switched sides.", "“He’s more capable than you, his personality is decent, he’s handsome, and his skill in bed is just… Ah, I guess I don’t know about the last one since I’ve never done it with you. Though, I doubt you’re anything special compared to him.”", "‘Was she normally like this?’", "Seol Jihu was a little surprised seeing the coldly sneering Baek Haeju.", "She was better at provoking people than he originally thought.", "Even the constantly smiling Sung Shihyun was staring with his eyes narrowed.", "“Oh yeah, do you want me to tell you something else? Even Yuhui, who you were infatuated with in the past, is head over heels for my boyfriend.”", "“…Hah!”", "Sung Shihyun burst into laughter.", "“I get that you’re trying to piss me off, but that’s just going too far. Skill in bed? Yuhui is head over heels for him? Both of you like the same guy? Puhahaha! If you’re going to make something up, at least make it…”", "However, he could not finish talking as Seo Yuhui smiled brightly and clung to Seol Jihu’s left arm. She gently leaned against his shoulder and gave a sweet smile.", "Then, she spoke.", "“She’s telling the truth.”", "Her expression was that of genuine happiness.", "The smile on Sung Shihyun’s face vanished without a trace.", "“You… Who the hell are you?”", "“Hmm? What do you mean?”", "“I didn’t know you were such a double-faced bitch. Weren’t you disgusted whenever you touched a man?”", "“Oh please. I was disgusted with you, but this man is my boyfriend. Of course, it’s okay.”", "“….”", "“Oh yeah, remember the Spirit Beasts and the precious medicine you gave me as gifts?”", "Seo Yuhui smiled with her eyes.", "“I didn’t have much use for them, so I kept them in my storage. But I ended up letting my boyfriend eat everything… That’s okay, right?”", "“…What?”", "“It shouldn’t matter, right? You gave it to me, after all.”", "Seol Jihu coughed.", "‘Was Noona normally like this too?’", "He didn’t know how much Seo Yuhui hated Sung Shihyun, but now that he looked at it, she didn’t lose to Baek Haeju.", "That wasn’t all.", "Roselle, who was quietly listening to this exchange, licked her lips. Soon, she descended from the sky, circled around Seol Jihu, and then softly wrapped Eun Yuri’s arms around Seol Jihu’s face.", "—Sorry, you’re free to have a crush on me, but I also have a partner I promised my future with~", "The beauty mark under her eye stood out as she smiled coquettishly.", "Phi Sora was sensible. With a grin, she spread her arms out and hugged Seol Jihu from behind.", "“Beeeeh~”", "She didn’t forget to stick out her tongue and make fun of Sung Shihyun.", "With no room to fit in, Agnes loitered around before coughing lightly and gently grabbing Seol Jihu’s sleeve.", "“Uh….”", "Surrounded by five women in an instant, Seol Jihu rolled his eyes blankly. He understood why they were doing this, but he couldn’t help himself from blushing.", "“….”", "On the other hand, Sung Shihyun’s face was a sight to behold. His face had stiffened so hard that it would shatter if anyone tapped on it lightly.", "Then again, the women that he designated as his harem members were all clinging to another man and taunting him. It made sense for him to react this way.", "Although this was only a figment of his imagination that had yet to be realized, Sung Shihyun was filled with the desire to achieve this dream in the near future.", "If Teresa, whom he designated as the third harem member, was here, that really would have put the nail in the coffin.", "“…Alright.”", "Sung Shihyun suddenly snapped out of his dazed state and muttered.", "“That pissed me off.”", "With a quiet murmur, he looked down at Seol Jihu with eyes full of killing intent. If looks could kill, his would have torn Seol Jihu to shreds thousand times over.", "“You all really are pushing it just because I joked around a bit…”", "A chilling voice flowed out.", "“I was going to leave in peace for old time’s sake… You brought this upon yourselves.”", "He fixed his grip on the sword while giving a menacing threat as if his pride was severely wounded.", "“Fine. Whether you’re telling the truth or lying, I’ll kill that little son of a bitch. Let’s see if you can laugh then.”", "In the next moment, Sung Shihyun cut down fiercely in surprise.", "From the sword path, a wavering, crescent-shaped sword qi shot out and fell sharply."]}