{"cid": "403", "title": "Chapter 403. For the End (1)", "content": ["A cold wind blew inside the office.", "A shiver went down the young man’s spine.", "He could tell that something wasn’t right.", "Yun Seohui, who was well known for her ever-smiling face and gentle manner of speech, was angry.", "Instinctively sensing danger, the young man replied without taking so much time as to think.", "“Ah, y-yes! I’ll contact them right away through the communication crystal.”", "Yun Seohui shut her eyes.", "Because the HR Director Jung Minjong was in disciplinary confinement, she had chosen a temporary secretary to fill his place.", "But to think he did not even know the difference between using a communication crystal and sending a messenger in Paradise…", "Or was he mistakenly thinking that Sinyoung’s position was still the same as in the past?", "“No, no, don’t call them. Write up an official document and respectfully deliver it through a messenger.”", "As Yun Seohui spoke coldly, the young man lowered his head in a fluster.", "“Y-Yes, Ma’am. Messenger. I understand.”", "“Where’s Director Jung?”", "“He’s staying at his mansion on Earth. We’re keeping a close eye on him.”", "“And what about Manager Yun Seora?”", "“Lady Yun Seora is…”", "The young man trailed off.", "Yun Seohui shook her head. Then, she shooed him away as if talking any longer would be a waste of time.", "The young man scurried out of the office.", "Tak. The door quietly closed behind him.", "Yun Seohui let out a deep sigh.", "‘What’s wrong with me?’", "She had failed to control her emotions and ended up lashing out. In the past, she did not show it outwardly no matter how angry she was on the inside. This just went to show how shaken she was.", "Yun Seohui sat dazedly for a long time before glancing down. She reached out and opened the lower drawer of her desk, which she did not open more than four times a year.", "After taking out a pack of cigarettes, she picked out a thin cigarette and bit down on it.", "Looking into the air with relaxed eyes, she lit the cigarette.", "“…Sure.”", "From her thin, pale lips…", "“I don’t see a reason not to bend down. For now.”", "Rather than a thin, long puff of smoke, a short and thick puff of smoke spread out.", "*", "Same time.", "The Parasites’ grand hall was filled with a bone-chilling tension.", "The six Army Commanders were bowing their heads in prostration.", "As always, the Parasite Queen was sitting on the Corrupted Throne where their admiration was directed, emanating more intense energy from her body than usual.", "[…What was that? That Seol Jihu said what?]", "A harsh voice shook the air.", "[To honor the memory of the Parasites’ Fourth Army Commander, Raging Temperance…?]", "As the Parasite Queen asked doubtfully, the Army Commanders bowed deeper in shame.", "Twisted Kindness glared at the ground with bloodshot eyes and clenched her fists hard.", "[Hah…!]", "The Parasite Queen burst out with empty laughter that was closer to a lamentation.", "After sensing the change in the celestial bodies, the Parasite Queen summoned the Army Commanders and heard what had happened while she was asleep.", "Realizing that the external state of affairs suddenly changed, she tasked them to find out the detailed reason.", "And once she heard Vulgar Chastity’s report, she felt her insides twist.", "Those worthless insects acting on their own was frustrating enough, but that damned human had even taunted the Parasites so openly.", "Honoring the memory of the deceased great general despite being enemies?", "[That damned brat…!]", "The Parasite Queen’s trembling voice echoed out.", "What vexed her more was the fact that there was nothing she could do about it at the moment.", "Neither she nor her six Army Commanders were in a condition to fight. They were only now approaching a full recovery.", "In truth, the Parasite Queen had expected some change to happen while she and her Army Commanders were immobilized.", "Since she lost a mutual, all-out war, she considered it as something that she had to bear.", "But this situation…", "[Whew….]", "The Parasite Queen barely calmed herself down and slowly closed her eyes.", "It was still too early to discuss victory and defeat.", "Though the situation had changed greatly, the scale was still tipped in their favor.", "The problem was that this scale started to move toward the other side, despite looking like it wouldn’t change for eternity.", "An even bigger problem was that the Parasites had lost when it was at a position of such an overwhelming advantage.", "Before the Tigol Fortress War, the Parasite Queen had an ominous sense of foreboding.", "That if they lost the war, they would only be left with two, no, just one chance.", "And her prediction had come true.", "Forcefully drawn by the attraction of the Brightest Star, humanity had begun to orbit a proper path. And to make matters worse, the Federation had appropriately joined their course.", "With this, the Parasites no longer had a place to fall back to.", "She felt like all bridges were burned.", "Meaning, if they lost another huge war… that would be the end.", "[The Brightest Star…]", "The Parasite Queen sighed as she slumped down on the throne.", "[I should have gotten rid of him in the valley war…]", "Hearing her monologue, the Army Commanders all looked grief-stricken. They had no words to say and no excuses to give.", "However, one person had an aloof expression from the beginning to end. As if he didn’t like this atmosphere, he slowly raised his head and looked up at the throne.", "“Your Majesty.”", "He slowly put his hand up and spoke.", "“There’s something I’m curious about.”", "[?]", "“You see, when I was a human, I just couldn’t wrap my head around why you left humanity alone despite having the power to raze them to the ground and why you were so hell-bent on taking down Tigol Fortress….”", "Sung Shihyun shrugged.", "“Of course, I know you must have had your reasons. You’re a god, after all. I’m sure there was something outside of my understanding or something specific you were aiming for. That aside…”", "Sung Shihyun paused briefly before continuing.", "“There is something that I haven’t been able to understand even after turning to the Parasites’ side.”", "[What is it?]", "“What is the Brightest Star?”", "Sung Shihyun asked.", "“Seol Jihu. Isn’t he just a human? What is so special about this Brightest Star that makes Your Majesty shudder like this?”", "The Army Commanders all turned to Sung Shihyun in shock.", "To dare to say their supreme queen would shudder…", "It was just too irreverent.", "The Parasite Queen didn’t reply right away.", "[…Hmm.]", "After a long silence, she said.", "[I suppose it is better to see once than to hear a hundred times. Come closer.]", "The Parasite Queen got up from the throne and beckoned Sung Shihyun.", "Sung Shihyun got up immediately and walked forward.", "Step by step, he approached the throne and climbed the stairs leading up to the queen.", "Then, at last, he arrived in front of her. It was then.", "“!”", "Sung Shihyun’s field of vision changed completely.", "No, in an instant, the space he was standing in warped.", "From the imperial palace’s grand hall to a starlight-embroidered galaxy.", "“Uwoah!”", "“How can stars… Aha, this large planet must be Paradise. It’s kind of amazing looking at it like this.”", "Sung Shihyun exclaimed in awe while looking down at his feet.", "“Why are you showing me outer space all of a sudden?”", "The Parasite Queen pointed in a direction instead of replying.", "When Sung Shihyun reflexively turned, his eyes lit up.", "He saw a blue dot that was shining brightly.", "It was then.", "“Is that…?”", "Sung Shihyun’s body shook violently as soon as he stared at it.", "His excitement and intrigue evaporated in an instant as his eyes widened in shock.", "“Ear…”", "He convulsed without being able to finish his sentence.", "“….”", "Eventually, he fell to his knees, gasping for breath.", "Was he swallowed by the terror of the universe? A few seconds was all it took for his arrogant face to turn pale in fear.", "[How is it? Can you see the… Oh?]", "The Parasite Queen exclaimed in admiration after seeing Sung Shihyun gasping for breath.", "What she had pointed to should not be visible to most high-ranked species, much less a human’s eyes.", "But Sung Shihyun’s reaction clearly showed that he had seen it.", "This could only be interpreted as one thing. Sung Shihyun had gone beyond fully absorbing Undying Diligence’s divinity and reached the point of having complete control over it.", "The sight should be visible to anyone with the rank of godhood, and that included demigods as well.", "[How surprising. How long has it been?]", "This time, it was Sung Shihyun who did not reply.", "No, he couldn’t.", "He was subconsciously flailing his legs to push himself back. He was in no state of mind to think about giving a reply.", "Then, as Sung Shihyun began to well up with tears…", "The Parasite Queen decided it was enough and lightly waved her hand.", "The world changed once again.", "The surrounding scenery returned to the grand hall from outer space.", "Despite this, Sung Shihyun still had not come to his senses.", "[Tell me what you saw.]", "At the Parasite Queen’s command, Sung Shihyun muttered with heavy breaths.", "“T-Two red giants… one white giant….”", "[And?]", "“And an even bigger red supergiant… one blue supergiant….”", "[And?]", "“And, and….”", "Sung Shihyun stammered, failing to speak clearly.", "“I don’t know….”", "As he narrowly spat out a breath, tears streamed down his face and dropped to the ground.", "“Half of it is light… but the other half is darkness akin to a black hole… they were mixed together and raging violently….”", "[….]", "“Then I felt like it suddenly looked at me… and laughed mockingly…!”", "Sung Shihyun bent over, unable to continue his description.", "“What? What is that…? Why does Earth have…!”", "The indescribable terror he felt could only be imagined by the way he buried his face on the ground, crying.", "The Parasite Queen didn’t blame him. It was normal for him to be shocked after seeing something that would make even the Sun pale in comparison.", "However, the Army Commanders, who weren’t privy to the details, could only make wry expressions.", "The proud, arrogant Sung Shihyun was crying. Just what the hell could he have seen?", "[Looks like you got a proper look.]", "The Parasite Queen placed her hand on his head. As she imbued her energy into him, his shaking subsided.", "[Supernova, a large nova that is millions or even billions of times brighter than an ordinary star.]", "[I call this nova, the Brightest Star.]", "Sung Shihyun, who had unknowingly stopped crying, looked up.", "[The Brightest Star… an infinite star with a growth speed and potential that not even a god can estimate.]", "[Can you guess what will happen if this star gets involved in a human’s fate?]", "Sung Shihyun shook his head with a dazed face.", "[I’m sure you can’t. I was the same.]", "[I encountered the star mixed with light and darkness long ago and suffered a humiliating defeat. I had courted disaster myself.]", "[But a few years ago, the same star as that star of chaos appeared in Paradise.]", "The Parasite Queen continued.", "[As I said before, the most frightening thing about that star is its limitless potential and frightening growth rate.]", "[Once it explodes with light, it expands in size while evolving at a terrifying speed.]", "[In the time you do a double-take, this star surpasses everyone’s expectations and shoots forward. By then, it would be too late to catch up to it.]", "[That is the reason I am so fearful and wary of the Brightest Star.]", "Sung Shihyun gulped.", "[Does this answer your question?]", "“…Yes.”", "Sung Shihyun wiped his teary eyes and staggered up.", "“I understand now. So…”", "He collected his breath and spoke.", "“We need to get rid of that star before it becomes unreachable.”", "[Exactly.]", "“The star that is in Paradise… It hasn’t evolved like that star I just saw, has it?”", "[Not yet.]", "“I see… I understand.”", "Sung Shihyun breathed out a long sigh.", "He calmed down a bit and spoke.", "“Please excuse me.”", "[Hmm?]", "“There was something I wanted to tell you… but my mind’s a mess after seeing what I just saw. It seems I will need to modify my plan completely.”", "[Your plan?]", "The Parasite Queen glanced up at the celestial bodies.", "She had shown it to him on a whim, but a rather interesting event was unfolding.", "Sung Shihyun’s star was billowing.", "He seemed to have realized something after seeing the Martial God’s true self.", "“I need some time to organize my thoughts and do research. I will request an audience later.”", "[…Alright.]", "The Parasite Queen nodded her head generously.", "[I will look forward to the plan you will bring to the table, First Army Commander, Sung Shihyun. Go ahead and rest. The rest of you may leave as well.]", "The eyes of the five Army Commanders widened.", "The Parasite Queen’s wrath suddenly subsiding was surprising enough. But she said she would be looking forward to his plan as well?", "Sung Shihyun bowed and walked out of the grand hall.", "His cold eyes were burning with unknown hostility.", "*", "It was a peaceful day in Eva today as always.", "After returning to the Temple of Luxuria, Seo Yuhui carried out an organizational reform, and when she came back to Eva, she was deeply moved.", "Only a month or two had passed since she left, but Eva had changed so much in the right direction.", "That wasn’t all. Valhalla’s building, which resembled a skyscraper, had transformed into a beautiful white palace, and there was an imposing statue at the entrance that was very obviously modeled after Seol Jihu.", "What caught Seo Yuhui’s attention the most was the group of fuzzballs running around joyously near the lush, green garden lake.", "As a lover of all things cute, there was simply no way Seo Yuhui would pass by them.", "She grabbed a yellow rice cake that was approaching her with curiosity and placed it down on her lap.", "When she stroked it gently, it closed its eyes, feeling good.", "It was cute, acting just like Seol Jihu.", "Speaking of the devil, she could see Seol Jihu walking down the stairs while rubbing his drowsy eyes.", "“Jihu!”", "Happy to see him, Seo Yuhui waved her hand.", "Seol Jihu opened his eyes.", "“I am back. Come here.”", "Seo Yuhui tapped her right thigh as if she had been dying to see him.", "Seol Jihu silently trudged over, still half-asleep.", "“….”", "Then, in a half-conscious state, he looked down at the yellow rice cake that was taking up half of his spot.", "He grabbed its wagging tail and pulled it to the side before falling flat on his face and taking over the entirety of Seo Yuhui’s lap.", "Seo Yuhui smiled bitterly.", "“Kkiing….”", "Yellow rice cake whimpered, having been chased out while it was enjoying a wonderful sleep.", "But after seeing Seol Jihu, it scurried up to him and dug into his embrace.", "“Oh my.”", "Seo Yuhui blinked.", "Seeing Seol Jihu and yellow rice cake sleeping in peace, a smile bloomed on her face.", "Things couldn’t be more peaceful.", "She stroked the two of them gently and prayed inwardly.", "I pray this happiness will continue forever….", "Of course, she knew it was only wishful thinking with the Parasites still existing.", "Coincidentally, a messenger arrived at that time.", "Sinyoung very politely wrote how much they wanted to meet with them and talk.", "Kim Hannah reported the matter to Seol Jihu immediately, and Seol Jihu shot up from Seo Yuhui’s lap.", "Sinyoung had finally raised the white flag.", "This was the moment he had been waiting for.", "With the end in sight, there was no reason to delay the matter any longer.", "The meeting place would be the Scheherazade Royal Palace.", "Seol Jihu immediately summoned Valhalla’s members, held a meeting, and ordered everyone to prepare to leave for Scheherazade.", "“Representative.”", "Before their departure, Kim Hannah asked for a private meeting with Seol Jihu.", "“If it is alright with you, I plan to install a safety net for Representative ahead of the meeting. Would that be okay?”", "“Safety net?”", "“Yes, it would include various things. Sinyoung sent their messenger because they are backed into a corner. There’s no telling what they will do.”", "“Well, if they don’t show propriety, we don’t have to either… But okay. There’s nothing wrong with being careful. Go ahead.”", "After Seol Jihu left, Kim Hannah immediately called another organization.", "—So you want us to protect Representative Seol’s family without them finding out?", "“Yes. I understand it’s difficult, but is that something you can do?”", "—Difficult? You call that difficult?", "A chuckle rang out from the communication crystal.", "—You’re underestimating us too much. Not that this is something to boast about, but you must know of our internal conflict while we were in Haramark, yes?", "“I’ve heard of it.”", "Though Kim Hannah said this, she knew about it very well.", "The most critical reason that the Triads were pushed out by Sicilia was their internal conflict. And during this period, their members were eager to kill each other, not just in Paradise, but also on Earth.", "—It wasn’t a particularly pleasant experience… but thanks to it, we’ve become quite accustomed to assassinating or protecting someone on Earth.", "“Then…”", "—Of course. Valhalla’s representative is a VVIP guest of the Triads. We will be sure to protect them well. I’ll bet my name on it.", "“Thank you. I have files from when I investigated Representative Seol’s background in the past. Just let me know if you need them. Just be mindful that they’re more than a year old. If you need updated information, I will get that ready as soon as possible.”", "—That would help us a lot. Anyway, we’ll send people over within four days, Earth time. They’ll all be experts in the field, so you won’t have to worry.", "“Got it.”", "The call ended.", "The Triads, which was Earth’s most influential underground force, promised their protection, but Kim Hannah was not satisfied.", "Just like Seol Jihu said, there was nothing wrong with being careful.", "Moreover, the Yun Seohui she knew was not someone who would back down so easily.", "Kim Hannah immediately took out another communication crystal.", "It was the direct line to Sicilia’s top brass."]}