{"cid": "230", "title": "Chapter 230. Internal Crackdown (1)", "content": ["Dazzling sunlight shone through the window.", "As the intense sunlight knocked on his face, Seol Jihu sluggishly opened his eyes and instinctively dug into a source of warmth.", "“Ah…”", "A quiet moan rang out in the half-awake Seol Jihu’s ears.", "“I gotta wake up and go to work… no… I can sleep more… but I automatically wake up around this time….”", "He tossed and turned while breathing hard.", "“Ugh, why won’t he get off?”", "Kim Hannah pushed Seol Jihu away, groaning.", "“Ung…”", "Of course, he crawled back to her right after.", "“Jesus.”", "“Seonhwa… Yuhui Noona… if you both do that… I can’t breathe…”", "“Christ.”", "Kim Hannah sighed.", "Just what was he dreaming about to make such a happy face?", "“This little rascal…”", "After shoving the sleep-talking Seol Jihu away, she got up from the bed and got to work.", "If you can’t ride a horse, ride a cow.", "Seol Jihu smacked his lips and rolled around. He buried his face in the warm sheets that still carried Kim Hannah’s bodily warmth.", "A delicate scent of makeup products and alcohol tickled the end of his nose.", "“I heated up some water for you.”", "“Thanks.”", "“What will you have for breakfast?”", "“Something good for a hangover. Two servings of it, please.”", "All kinds of sounds struck Seol Jihu’s ears as he slowly woke up. The sound of a door closing, the sound of water running, the sound of water boiling, etc…", "He even smelled a mouth-watering fragrance.", "Just as Seol Jihu flared his nostrils and swung his body up, a wet towel flew toward him and landed on his face.", "“…What was that for?”", "“I’m in the middle of changing.”", "A puzzled voice intersected an aloof voice. Sssk, sssk. Seol Jihu grumbled quietly as he heard the ruffling of clothes.", "“My eyes were closed.”", "“I actually threw it ‘cuz I was mad.”", "Seol Jihu tilted his head at Kim Hannah’s confession.", "“Mad? Why?”", "“Do you have any idea how hard it was for me to sleep because of you?”", "Seol Jihu flinched at her annoyed voice.", "“Does the word moderation not exist in your dictionary? Are you a 12-month-old baby? A grown-ass 26-year-old can’t see what’s in front of him just because I spoiled you a little…”", "“….”", "“What are you pretending to be asleep for? Come eat breakfast! I ordered hangover soup for your sorry ass!”", "In the end, Seol Jihu crawled out of the bed like a son being scolded after staying out all night and caught sneaking home in the morning.", "Once he put down the towel covering his eyes, he saw Kim Hannah sitting in front of the table, wearing just a white dress shirt.", "Seol Jihu blinked.", "He had always seen her hair in a clean ponytail, so seeing it untied and unkempt was a little refreshing.", "“Slurp… It has a very clean taste. Hey, come eat. The soup’s gonna go cold.”", "Seol Jihu sat down on the opposite side from her because of her continuous urging and took a spoonful of the hangover soup.", "It was still dawn, and the chilliness of the night had yet to leave the air. A pot of hot soup was the perfect dish to warm his frigid insides.", "As it had a very mild flavor, he had no trouble swallowing it down either.", "After focusing on getting over his hangover for some time, Seol Jihu glanced up at Kim Hannah.", "Did she remember their conversation from last night?", "The alcohol made her spit out whatever was on her mind, so he was worried she might have other ideas now that she was sober.", "All kinds of thoughts brushed past his mind.", "People were whimsical by nature. Today might be different than yesterday.", "Moreover, this was a pivotal decision that would alter Kim Hannah’s life in Paradise forever.", "“….”", "…In truth, Seol Jihu didn’t believe in himself more than anything else.", "Kim Hannah joining Carpe Diem. That was something he had never imagined before.", "“Keuheu~ Now this is what I call a soup.”", "Kim Hannah raised her head out of the stone pot. Wiping off the sweat from her nose and forehead, she spat out a breath.", "“That cleared up my stomach. Auu~ How refreshing. I finally feel alive.”", "She glanced at Seol Jihu in surprise.", "“What’s wrong? It’s not like you to finish later than me.”", "Seol Jihu subconsciously grabbed his spoon again.", "Kim Hannah got up with a refreshed face and began to put on her toner using a crystal mirror. Then, she put on her essence and lotion.", "“Anyway, why did you come to Scheherazade?”", "‘What?’", "Seol Jihu almost asked back.", "“You said you brought your teammates here too. I doubt you all came for me.”", "Until he heard these following words, he thought she wanted to pretend yesterday never happened.", "“Oh… it’s because of the auction house.”", "“The auction house? Oh, they’re here to spend money.”", "“A few of them are here just to have fun. But yeah, most are here to buy new equipment.”", "“New equipment…”", "Kim Hannah snorted while taking out her sunscreen.", "“I heard Scheherazade hasn’t been getting many good items recently. You didn’t buy things willy-nilly just because you have money, right?”", "“I just bought a cape worth 100 silver coins. I didn’t see anything else that caught my attention.”", "“So you just looked around. Good.”", "Kim Hannah praised Seol Jihu as she applied a moisturizing cream.", "Seol Jihu swirled his spoon inside the soup before suddenly asking out of curiosity.", "“Why? Am I not supposed to buy anything at the auction house right now?”", "“Not necessarily. Even if you have money, you have to spend it properly for it to equal its worth.”", "Kim Hannah spoke as she opened the lid of a jar of BB cream.", "“We’re talking about hundreds of gold coins here. You have to spend them in the right places. Of course, it’s true that Scheherazade has the biggest auction house, but that’s somewhere anyone can enter at any time.”", "“Does it matter whether an auction house is public or not?”", "“Of course, idiot. Auction houses are a business run by Earthlings.”", "Kim Hannah scolded him, then began to show off her skills while putting on foundation.", "“There is a separate auction house for VIPs. A private one that only big spenders know about. Good items are left out of public auctions to be sold there.”", "Seol Jihu’s eyes widened as this was the first time he was hearing about such a thing. This seemed to be why nothing caught his fancy at Scheherazade’s famous auction house.", "“In the end, all items going to the public auction are dregs that didn’t quite make the cut. Of course, those dregs aren’t half-bad, but they’re not something someone with hundreds of gold coins would be using. They’re good, but not something that could be shown to VIPs.”", "Kim Hannah smirked as she put on her concealer.", "“People who burn their energy at public auctions are true fools. They don’t even realize there are auction house employees there to jack up the price. They’re paying premium prices for clearance items!”", "Seol Jihu couldn’t help but think of Hugo, who was giggling about the items he bought yesterday.", "Seol Jihu also had experience buying advertised items and being disappointed afterwards, so he knew where Kim Hannah was coming from.", "‘Huh?’", "Seol Jihu blinked in the middle of his thoughts. He just saw her putting on her concealer, but now she was powdering her face.", "‘How?’", "“Oh yeah, when do you plan on going back?”", "“Huh? I’ve only been here for a day.”", "“Come on, didn’t I tell you? Are you going to buy dregs? You said you became a High Ranker, didn’t you? You have to buy good-quality equipment then. Especially if you’re a Warrior.”", "Seol Jihu went “Ah.”", "No, that wasn’t what was important.", "In the blink of an eye, Kim Hannah was applying a highlighter and a shader. The way she was moving her hand, Seol Jihu felt like he was watching a magic show.", "“It’s true that Sinyoung can’t touch you easily, but you can never be sure. Nothing good will come out of staying here for too long.”", "Kim Hannah studied herself in the mirror before nodding her head and getting up.", "Seol Jihu became speechless.", "‘They say that a woman’s transformation is innocent, but this…’", "Her facial features were now more clearly defined, and Seol Jihu couldn’t get accustomed to it. He even felt like her face was glowing radiantly.", "“Don’t be too aggrieved though. You avoid a pile of shit on the ground not because it’s scary, but because it’s dirty.”", "She tied her neatly combed hair into a ponytail, then finished her transformation into a professional woman by wearing her two-piece jacket, coffee-colored stockings, and work skirt.", "“I have to get going now. I’m going to work, so you wake up your teammates and grab a carriage. It’s better for both of us if you leave as soon as possible.”", "After tidying the hem of her shirt, Kim Hannah bent down to pick up her handbag.", "It was only then that Seol Jihu realized he failed to check something very important.", "“Y-You’re going to work?”", "“Hmm?”", "“Why?”", "“What do you mean, why? Because it’s my job?”", "When Kim Hannah retorted casually and grabbed the handle of her handbag, Seol Jihu asked again.", "“Do you have to go?”", "“What are you talking about all of a sudden?”", "“Yesterday you said—”", "“I’m going because I have to! Why are you asking this?”", "Seol Jihu became lost for words as Kim Hannah straightened her back and looked down at him with an annoyed face.", "“No… I’m just curious as to why you have to go…”", "Kim Hannah threw her handbag up and hung it on her shoulder. She looked apathetic, but she spoke with dignity.", "“I’m going to hand in my resignation letter.”", "*", "After Kim Hannah left for work, Seol Jihu ambushed the room next door. As expected, his teammates were sprawled around the same room, sleeping.", "He could only imagine how much they drank by the smell of alcohol overflowing from the place.", "Unsurprisingly, no one woke up even after he shook them strongly. In fact, they frowned and waved their hands in the air as if to shoo away a fly.", "The only solace in the situation was that Marcel Ghionea came to his senses instantly.", "Pondering what to do, Seol Jihu came up with a good idea.", "And that was to put his comrades’ faces as close as possible to Hugo’s armpits and crotch.", "The effect was instantaneous. Chohong, who was placed under Hugo’s left armpit, woke up in a few minutes screaming all kinds of swear words.", "It was the same for Phi Sora, who was placed on the other side.", "“Fuck!”", "She furrowed her brows and spat out a single powerful word the moment she woke up.", "Seol Jihu held his laughter back and approached her.", "“What’s wrong?”", "“I— I was sleeping well and suddenly… argh, damn it. I can still smell the putrid smell.”", "Phi Sora groaned and spat on the floor. She clearly looked disgusted.", "“Alright, alright, it’s time to get up. The sun’s in the middle of the sky.”", "“Huh? Why? I want to sleep for a little longer.”", "“I brought you some hot water. Wash up before it cools down.”", "Seol Jihu forced the grumbling Phi Sora into the bathroom.", "Maria held out well under Hugo’s crotch, but she soon reached her limit when Hugo farted.", "“Kuheu~ That felt nice.”", "It must have been quite the load as Hugo muttered in sleep.", "“!?”", "Of course, it was like a bolt of lightning to Maria, who started dry heaving after being forced up.", "“Uuuek! Uwwwueeek—!”", "She vomited while crying.", "“Fuck, you motherfucking piece of fucking shit!”", "She screamed with resentment and fury while shoving her crucifix artifact up Hugo’s butt.", "As a result, Hugo also woke up screaming.", "Marcel Ghionea, who dazedly watched the entire scene unfold, shook in fear as he saw Seol Jihu cackling to himself after such a cruel act.", "While a small ruckus broke out, the team members didn’t raise any strong objections against going back to Haramark.", "The main reason was the lack of good items at the auction house.", "Seol Jihu was happy he didn’t need to convince them, but he couldn’t help but wonder if their real goal had been to come to drink Scheherazade’s expensive liquor.", "In any case, good news was good news. Seol Jihu checked out of the inn and headed to the stable near the southern gate.", "“Huaaaam. You could have let us sleep more… it’s not like we’re in a hurry…”", "Phi Sora grumbled as she yawned big.", "Seol Jihu made a somewhat apologetic face.", "Maria was also suffering from an upset stomach.", "“So I’m the only one who benefited from this trip to the capital.”", "Hugo grinned proudly as he sat down in the carriage.", "Seol Jihu thought about telling Hugo what Kim Hannah told him earlier about auctions, but decided against it. There was no need to spoil his mood when he was personally satisfied.", "“Ah… did I drink too much? Why does my head ring so much…?”", "Seol Jihu couldn’t repress his laughter seeing Chohong moaning along with Maria.", "“You should have had some hangover soup. You had time.”", "“I was too lazy… anyway, let’s set out already. I’ll feel better once I sleep and wake up.”", "“Wait, we’re waiting on one more person.”", "“Hah? What do you mean? Everyone’s here.”", "“Well, you see… someone else will be joining us.”", "Chohong’s eyes widened.", "“Who? When is this person coming?”", "“Soon. Just sleep for now.”", "“I was going to sleep once the carriage started. If I sleep now, I’ll wake up when the carriage sets out. I’m already feeling like shit because of how I woke up earlier…”", "Chohong glared at the giggling Hugo.", "“…Right. Wait just a little longer.”", "Agreeing with her fully, Seol Jihu took out a communication crystal from his pocket. It was then.", "The carriage door shot open with a clunk, and a familiar woman appeared behind it.", "She looked just like when she left the inn except for the backpack she was wearing.", "Kim Hannah looked inside the carriage and nodded.", "“I’m right on time.”", "“Who the hell is…”", "Chohong paused before finishing her sentence.", "She recognized the new face. She had even seen her before.", "When Seol Jihu fell into a coma, Chohong ran into Kim Hannah a couple of times when she came to visit him.", "Seol Jihu opened his mouth.", "“You got here earlier than I thought.”", "“There wasn’t much to take care of. The transfer of duties ended recently, and I already had my belongings packed.”", "“And you made sure to throw your resignation letter at your boss’s face?”", "“Do you think I went to film a morning-time drama?”", "Chohong wasn’t the only one. Everyone in the carriage shut their mouths as if they had all promised beforehand and turned their attention to the woman talking to Seol Jihu.", "Miss Foxy, the spiteful bitch who made even war into a business, the woman Dylan feared making his enemy, ‘My god, this is three of the Six Crazies’, etc., etc…", "As various thoughts mingled, Seol Jihu smiled brightly and extended his hand.", "“Come in.”", "There was no need to look back on an already crossed line.", "Kim Hannah grabbed Seol Jihu’s hand without hesitation.", "*", "The carriage set out.", "No one muttered a peep during the entire drive. The team members were maintaining their silence, and Kim Hannah didn’t say anything either. She only kept an upright posture, staring outside.", "An invisible wall seemed to be standing between Kim Hannah and the rest of the team.", "This couldn’t be helped. Everyone had understood the situation when Seol Jihu mentioned the word ‘resignation letter’.", "Chohong had once mocked Seol Jihu, saying Kim Hannah and Seo Yuhui had reached the pinnacle of their respective fields and that she would serve him as her ‘hyung’ if he managed to recruit even one of them.", "Of course, strictly speaking, Kim Hannah couldn’t be placed at the same level as Seo Yuhui. But it was an undeniable truth that she was a well-respected Earthling in her field.", "Simply put, this was the same thing as a world-class athlete at the peak of their performance transferring over to a second division team that was just starting to make a name for itself.", "“Um…”", "In the end, Marcel Ghionea spoke up, unable to rein in his curiosity.", "“Leader, what is this about…?”", "“Ah, um… let’s see… where do I begin…”", "Seol Jihu crossed his arms and smacked his lips.", "“I was going to tell you guys once we arrive at Haramark, but I guess I’ll just say it now.”", "Seol Jihu gathered everyone’s attention.", "“Carpe Diem will soon develop into an organization. Officially.”", "“Hm?”", "“And we will leave Haramark and move to Eva.”", "It was quite a bombshell news like none others.", "“W-What?”", "Chohong spat out a question with a hoarse voice.", "“Hey… you… do you think forming an organization is easy?”", "“No, I know it’s hard.”", "Seol Jihu readily acknowledged the difficulty.", "“That’s why.”", "“?”", "“Who here knows how to register as an organization? In detail, I mean.”", "Seol Jihu looked back at everyone. As expected, no one raised their hand.", "Not even Phi Sora.", "She had been a part of an already-existing organization. She did not found White Rose itself.", "“No one knows, right? We needed an expert administrator to help us, and things just kind of fell in place and I recruited her.”", "“Wow, what an explanation.”", "Chohong let out an empty chuckle.", "It was easy to believe him since the proof was right in front of their eyes, but what everyone was wondering wasn’t why he recruited Kim Hannah.", "It was how he managed to coax the infamous Miss Foxy, who was affiliated with Sinyoung, Paradise’s greatest organization.", "“Oh yeah, don’t we need a Magician too? Why not bring Cinzia Noonim while you’re at it?”", "Seol Jihu shut his mouth and stared fixedly at the blabbering Chohong.", "“W-What? Why are you looking at me like that?”", "“….”", "“What…?”", "Chohong’s complexion suddenly paled in the middle of her speech. The more Seol Jihu looked at her, the more flustered she became.", "“Uh… mm….”", "She stammered and averted his gaze.", "“Ah, god damn it…”", "Trembling in trepidation, she didn’t know where to place her gaze, almost as if she was guilty of a crime.", "[What? The Daughter of Luxuria would be perfect? Miss Foxy would be good? I can’t even, pffahahaha!]", "[Those two have reached the pinnacle of their respective fields, but here you are trying to recruit them into our team. Go drink some cold water and come back to your senses, you bastard.]", "[Oooooh? Reallllyy? Well, it’s good to dream big.]", "[Hah! Hey, if you manage to bring in even one of those two…]", "[Whether it’s Hyung~ or Oppa~ I’ll be ve~ry polite and well-mannered.]", "[Yes, yes~ Although I currently serve Ira, as a former Priest, I vow upon my divine power with Invidia as my witness. Are you happy now? Hmm?]", "Seol Jihu grinned as he saw Chohong nibbling on her lips with tightly shut eyes."]}