{"cid": "394", "title": "Chapter 394. Intention (2)", "content": ["Seol Jihu kept true to his words.", "Though he may be a kind leader to those inside his fence, he showed no sympathy to those who crossed the line.", "As a result, Kishi Yukino and the other captives had to run all day while tied to the carriages. The one or two people who tripped and fell were forcefully dragged along the ground until the carriages stopped.", "The saving grace was that the ground was soft from the rain that had fallen this past couple of days, but that didn’t mean there was no force of friction or terrain features like the rocks and tree trunks.", "This naturally meant that the collapsed captives had to suffer through a burning pain while being dragged along the ground, screaming every time their skin scraped and tore.", "However, they became quiet once six or so days went by.", "The carriages came to a stop once the sun set on the seventh day.", "After eating dinner, the members of Valhalla discussed how to divide the stolen equipment under Seol Jihu’s permission before falling asleep.", "Seol Jihu also crawled into his sleeping bag but woke up after feeling someone shake his body.", "Eun Yuri was turning her body left and right while yawning widely.", "It was time to change the night watch.", "Seol Jihu checked on the captives as soon as he started his shift.", "Two of them were smeared in blood from head to toe. Seol Jihu wasn’t sure whether they had collapsed or died.", "The other three captives, who were covered in dust, looked fine in comparison, but they were still sprawled on the ground like dead frogs.", "While it seemed like he had nothing to worry about, Seol Jihu still checked their status windows with the Nine Eyes.", "Only after confirming that their ‘current condition’ was ‘heavily injured’ or ‘critically injured’ did he turn away.", "‘Hmm?’ Seol Jihu stopped before he could even walk a few steps.", "A night watch usually had two people standing watch.", "The woman keeping watch with him was sitting next to the campfire.", "‘Noona?’", "It was Seo Yuhui.", "Curled up with her arms around her knees and her half-buried face staring dazedly at the campfire, she looked a bit pitiful.", "What had been worrying Seol Jihu the most during this return trip back weren’t the captives or the future events, but Seo Yuhui.", "Though she tried hard to mask it, after finding out about Seo Yuhui’s circumstances, Seol Jihu started to notice Seo Yuhui repressing herself or being tired.", "Her chronic illness had reignited from the recent event, and it seemed she was still in shock from the whole thing.", "‘It looks like being an apostle isn’t so easy…’", "To be blunt, gluttony would only make one eat more. Sloth, avarice, and others didn’t prevent one from living a normal life either.", "But lust was different.", "It heightened one’s sexual drive, and the body would perceive intense gazes from one’s surroundings as pleasure.", "[I… I didn’t think it would be this bad either…]", "What Seo Yuhui said a week ago still lingered on his mind.", "She wasn’t normally like this, so Seol Jihu couldn’t imagine how uncomfortable she must have felt to suddenly change after becoming an Executor.", "At the same time, he developed a newfound admiration for her.", "It was said that the desires of the Seven Sins would grow stronger as they built up without being relieved. He could tell just how powerful Seo Yuhui’s willpower must have been to have held out without expressing the desire.", "Seol Jihu sighed. He didn’t feel good whenever he saw Seo Yuhui being in a daze.", "He wanted her to regain her smile.", "But words that were not followed by action were often meaningless.", "And so, he took out a pot and began to boil water. He cooked ramen with more care and attention than usual.", "Seo Yuhui, who was absorbed in thought, came to her senses when a tray was placed in front of her.", "A bowl of ramen, steaming deliciously and topped with a soft-boiled egg, a plate of well-aged kimchi, and a bowl of cold rice — namely, Seol Jihu’s Special Ramen Set — was ready.", "Her eyes widened. When she looked back with a surprised face, Seol Jihu smiled softly and gestured at the tray.", "“You surprised me…”", "Seo Yuhui seemed to be at a loss for what to do, looking a bit worried.", "“Jeez, I’m going to get fat if I eat this late…”", "“Eii, you can afford to gain some weight, Noona.”", "“No, it’s not that…. Whenever I eat, the fat all goes here….”", "Seo Yuhui mumbled while propping up her breasts slightly.", "‘I don’t mind,’ Seol Jihu swallowed these words before uttering them.", "After finding out about her secret, he was more careful with his words.", "It wasn’t as if he didn’t understand her concern.", "He could think of more than a few reasons on how having big breasts would be uncomfortable.", "Not only would they make one’s shoulders stiff, but he had also seen Yoo Seonhwa wanting to take a break after walking for a few hours from neck and back pain.", "And during that time of the month, they would grow bigger and demand a separate set of underwear, and tight clothes like button-ups would be too stifling to wear.", "Additionally, one would have to be mindful when they went down a staircase or eat something that could drip, sweat would pool under or between the breasts during summer, and one might wake up in the middle of the night from the pressure.", "As Seol Jihu once lived together with Yoo Seonhwa, he knew the pains of someone with big breasts.", "“If you’re that worried, I’ll just eat it.”", "“No, I didn’t mean I won’t eat. God, please forgive me for giving in to temptation.”", "Seo Yuhui quickly picked up the chopsticks.", "Slurp. A satisfied smile bloomed on her face as the noodles went into her mouth.", "“Mmn! It’s too good.”", "Seo Yuhui was absorbed in eating for a while before feeling an odd gaze.", "Glancing up, she saw Seol Jihu staring at her with worry and concern.", "She could easily guess why he prepared this ramen for her.", "“Sorry.”", "When their eyes met, Seol Jihu spoke calmly.", "“I didn’t think… they would go that far.”", "He was talking about how the giant tore up Seo Yuhui’s clothes at Kishi Yukino’s command.", "It was an unexpected situation for sure. The entire situation was being broadcasted to every city in Paradise, so it would be surprising if she was not shocked.", "Though he had no way of knowing for sure, given her personality, she must have felt greatly ashamed.", "“Mm. Are you worried about me?”", "Seo Yuhui made an odd expression.", "“What should I do? Thousands of people must have seen me… What if I can’t get married?”", "“You don’t have to worry about that.”", "“Are you saying that because it’s not your problem? Or are you going to take responsibility for this noona?”", "Realizing that Seol Jihu was worried about her, Seo Yuhui spoke jokingly.", "“Yes, I’ll take responsibility.”", "“Hnng, are you sure you’re not just saying that? Who knows if you’ll ignore me in the future?”", "“In the first place, I don’t think a little skin being exposed is going to make you stay single forever. If anything, you’ll have a lot more suitors.”", "As Seol Jihu replied in a joking manner as well, Seo Yuhui pouted slightly.", "Seol Jihu chuckled before clearing his throat.", "“Noona, there’s something I want to know.”", "This was a good opportunity. Seo Yuhui seemed to be in a better mood. It was finally time to ask what he had been wondering for a few days.", "Once Seo Yuhui tilted her head slightly and nodded, Seol Jihu carefully brought up the topic he had been meaning to for days.", "“To be honest… I didn’t think you’d be hiding such a secret.”", "“….”", "“But after thinking about it for a bit, I noticed something strange. You are the apostle of lust. I should have considered it at least once given my knowledge of Executors, so why didn’t I notice?”", "Seol Jihu continued.", "“It was probably because I didn’t feel anything of the sort from how you treat me. From the moment we met until now.”", "Indeed. Ever since she became an apostle, she had been extremely careful to the point of avoiding contact with others.", "With just one exception.", "For this person, she went as far as to move her place of residence to get closer, and she hugged him whenever she had the chance.", "Even when Seol Jihu snuck into her bed and buried himself in her chest, she would embrace him back and pat him rather than looking uncomfortable.", "Unless Seo Yuhui was faking it the whole time, he was clearly receiving special treatment.", "Feeling that Seo Yuhui must know what he was asking about, Seol Jihu patiently waited for her response.", "“Mmm….”", "Seo Yuhui put down the bowl of ramen and lowered her head.", "She looked to be deep in thought.", "Then, she exhaled lightly and looked straight at Seol Jihu.", "“You see, Jihu, I am curious about something too. Can I ask just one thing?”", "“Huh? Ah, yes.”", "“What’s the reason Luxuria-nim cherishes you so much?”", "Seol Jihu furrowed his brows.", "He didn’t expect her to suddenly bring up Luxuria’s name.", "“Of course, the Seven Gods can favor a particular Earthling. But they are generally not interested in Earthlings that serve another god because, in a way, that would be encroaching on another god’s territory.”", "Seo Yuhui spoke softly.", "“But Luxuria-nim… is very, very interested in you. Almost to the point of being excessive. She mentions you a lot when she talks to me too.”", "“Luxuria-nim talks about me?”", "“Yep. But what’s even more surprising is that Gula-nim doesn’t say anything. Though I can’t be sure, it’s like she understands why and glosses over it, even though it would make sense for her to be displeased.”", "“….”", "“So anyway, do you have any idea why Luxuria-nim adores you this much?”", "Seol Jihu was blinking in confusion for a while now. He looked completely lost.", "It was true that Luxuria doted on him, but as far as he was aware, she was like that to all Earthlings. Wasn’t that the reason Luxuria was so popular among Earthlings, even being known as the kindest god?", "For a moment, an awkward silence filled the air.", "Seeing Seol Jihu’s clueless face, Seo Yuhui smiled.", "“In case you’re wondering, I’m not saying that the answer to your question is because of Luxuria-nim. Of course, as her apostle, I can’t deny her influence, but I know my feelings better than anyone else.”", "Seo Yuhui placed her hand on her chest.", "“It doesn’t matter how people in Paradise see and think of me. But what matters is that I’m ultimately in the same position as they are. I’m someone from Earth who entered Paradise.”", "“Right.”", "“Exactly. So I’m not a saintess or an apostle. I’m just Seo Yuhui, a normal girl.”", "With that, Seo Yuhui cleared her throat.", "“I don’t think lust is a bad thing. If I felt an aversion toward sexual desire, I wouldn’t have accepted the position of an apostle in the first place.”", "Seol Jihu nodded his head and listened silently.", "“Of course, it’s hard and painful when my body reacts to people I don’t like, especially people I despise and am disgusted by. But…”", "Seo Yuhui trailed off as if she remembered someone. Then, she continued in a bright voice.", "“If I feel this way from a man I love, and if he and I can make love together, I think I couldn’t be happier.”", "Seo Yuhui put her hands together and spoke calmly.", "“If it isn’t from an artificial emotion that comes from me being an apostle… if it’s something that my heart genuinely wants… then just holding hands would make me happy.”", "She then looked at Seol Jihu and smiled sweetly.", "“No, it’s made me happy. Really.”", "Her manner of speech changed from a hypothetical to an actual.", "Meaning, she had already experienced it.", "Seol Jihu dazedly stared at Seo Yuhui before he noticed.", "What she said was simple. If it was someone she hated, she didn’t want to even look at them. But if it was someone she loved, even holding hands with him would make her heart flutter.", "And that must mean one thing.", "“You’re not going to say you don’t get it even after I said all this, right?”", "Seo Yuhui looked away and giggled.", "Seol Jihu’s face turned red.", "“Uh… There’s something I’ve been thinking about doing after going back to Eva.”", "After a brief silence, he spoke with a dry cough.", "“It’s recruiting.”", "“Recruiting?”", "“Yes. There’s someone who helped whole-heartedly so that everything would go smoothly.”", "“…I see.”", "Seo Yuhui’s eyes widened at Seol Jihu’s unexpected words. However, she smiled at the next moment.", "He had changed the subject naturally. But she had somewhat expected this to happen.", "Perhaps she should give him points for not saying ‘huh?’ and pretending not to have heard.", "“Yes. Without this person’s help, none of this would have been possible. We might have suffered a huge loss too.”", "“I see.”", "“The problem is that she made this happen by putting herself in danger. She even risked her life.”", "“…Hm?”", "However, Seo Yuhui soon realized that she was mistaken.", "Seol Jihu had not changed the subject or avoided giving an answer.", "“So I decided to recruit her once and for all. I’m going to place her into Valhalla’s main team and have her stay by my side.”", "“W-What… what for?”", "Seo Yuhui was leaning forward unknowingly.", "“To make sure she never does anything like that again.”", "“That’s it?”", "“No. A lot of people are aiming for her… so I need to protect her… and also…”", "“Also?”", "“Uh….”", "Seol Jihu smacked his lips at Seo Yuhui’s incessant questioning.", "He then spoke calmly.", "“If she wants…”", "“Yes?”", "“I can stay by her side forever and make her ramen whenever she wants….”", "Seo Yuhui’s mouth slowly widened.", "She was clearly taken aback.", "Bewitching face, glamorous figure. With her otherworldly appearance, Seo Yuhui had received countless confessions over her lifetime. It wouldn’t be an exaggeration to say she received hundreds.", "But to say, ‘I will keep you by my side and make ramen for you whenever you want.’", "She had not heard such a clumsy, uncool confession since the time her university junior had said, ‘Noona, do you want to come to my place and eat ramen?’", "When she heard these words for the first time, she ceased all contact with the junior completely. But for some reason…", "‘So, so powerful!’", "Even though what he said was no different than what that junior had said, the feeling she got from Seol Jihu’s words was far too different.", "Looking at the bowl of ramen she pushed off to the side, the corner of her mouth curled up continuously.", "In the end, Seo Yuhui couldn’t hold her laughter back and covered her mouth.", "Of course, she couldn’t do anything about the laughter leaking out.", "Seol Jihu stared at Seo Yuhui as she giggled crazily.", "He had mustered up his courage to say what he just did. Not knowing what was so funny, he waited for her answer nervously.", "“…Yeah.”", "Soon, Seo Yuhui stopped giggling and spoke with a beaming smile.", "“I think that’s a good idea too. If she’s as amazing as you say, then you need to hold onto her for sure.”", "As she emphasized the words ‘for sure’, her face flushed red like the setting sun being reflected on a river.", "“You think so?”", "“Un… And my guess is that she won’t say no.”", "Seo Yuhui smiled gently while twisting her body.", "Seol Jihu smiled brightly.", "“I’m relieved to hear you say that. I’ll let Miss Baek Haeju know as soon as I get back.”", "Seo Yuhui looked like she’d taken a blow.", "She glared at Seol Jihu, something she only did once in a blue moon.", "“I’m kidding, I’m kidding. You were laughing so much that I wanted to get back at you a bit, haha.”", "“Hmph. Meanie. What’s wrong with laughing from joy? You almost made me sad.”", "“It’s embarrassing.”", "“Ehew. You miser. Come here.”", "Seo Yuhui tapped her thighs.", "Seol Jihu dragged his butt over and gently placed his head down.", "Though he was relieved to see her stroking his hair with her usual gentle expression, he still asked just in case.", "“Are you okay?”", "“Yes, I’m fine.”", "“Even if I do this?”", "Seol Jihu dug his face deeper between her thighs and rubbed it in a slightly risque place.", "Seo Yuhui’s eyes narrowed.", "“It’s fine… but are you fine with it?”", "“?”", "“Can you handle it? You’ll take responsibility for this noona, right?”", "Saying so, Seo Yuhui stuck out her tongue and licked her upper lip.", "Seol Jihu winced. The pure saintess who served a god suddenly seemed like an enchantress whose peerless beauty was enough to cause the downfall of a country.", "“Fufu, if you keep joking around, don’t blame me for devouring you.”", "Seol Jihu thought for a moment before nodding his head.", "“Mn, being devoured by you doesn’t seem like a bad idea.”", "“Oh, is that what you’re into?”", "“I don’t have a preference. What about you?”", "“Hmm, if I had to say, I guess I’m more into being devoured? You’ll be surprised if you see my alias, traits, and level of cognition.”", "“Can you show them to me?”", "“No. It’s too embarrassing. I’m going to die of shame if I show them to you.”", "Seo Yuhui winked while smiling like a seductress.", "Seol Jihu immediately made a vow to pass Gula’s trial as soon as possible. Though his Nine Eyes couldn’t see through Seo Yuhui’s status window, there was a chance it might be able to once he became an Executor. After all, they would both be apostles then.", "“The moon is really pretty tonight, isn’t it?”", "Seo Yuhui regained her smile and looked up at the night sky with the dreamy eyes of a young maiden in love.", "Then, hearing the words, ‘You’re prettier, Noona…’, she lowered her head.", "“Oh, really?”", "Seol Jihu smiled bashfully.", "Seo Yuhui smiled beamingly as well.", "People often said that couples in their honeymoon period could spend all day just staring at each other. And exchanging silent looks was enough to make smiles bloom on their faces.", "“Aww.” Seo Yuhui shook her head and lightly slapped Seol Jihu’s cheeks in embarrassment.", "Seol Jihu grabbed her hand and carefully wrapped it around his face.", "Seo Yuhui lowered her upper body and quietly whispered something into his ears.", "“Noona… you’re too lewd.”", "“You don’t like it?”", "“No, I love it.”", "The two of them broke out into giggles once again.", "The giant, who woke up from the clamor, saw this scene and spat out blood. As his senses returned to his body, he grunted at the flooding pain.", "A hot, heartwarming air flowed on one side, and a cold air flowed on the other.", "It was an extremely contrasting sight to behold.", "*", "As expected, the carriage arrived at its destination four days later.", "A huge crowd was gathered at Eva’s gate.", "“They’re here! They’re here!”", "“Over here!”", "Seeing two carriages making their way toward the city, more and more people started to come together from all directions.", "Then, they screamed.", "It was because they saw the figures being dragged along by ropes tied to the carriages.", "Three were walking staggeringly as if to collapse at any moment. Two had already fallen and showed no signs of movement.", "As their blood made a long trail on the road, the crowd that was running up to the carriages came to a sudden stop.", "Using this opening, the carriages leisurely cut through the road.", "It wasn’t until the carriages arrived at Valhalla’s building that Seol Jihu showed himself.", "Once the carriage doors opened, people who followed them to the organization’s building crowded around them.", "After seeing Seol Jihu, they threw one question after the other.", "Their reaction was slightly different than when he made his triumphant return from the Tigol Fortress War.", "A crowd had gathered back then too, but it was to reaffirm the news of the victory with their own eyes and celebrate.", "But this time, it was for a different reason.", "The recent incident was directly aiming at humanity.", "It wasn’t that a huge result that would greatly influence humanity came out. Rather, it would be coming out soon.", "Because of one person.", "Though Seol Jihu was being bombarded with questions, he did not react strongly.", "“What happened? Were there really traitors that were secretly communicating with the Parasites?”", "“You’ve seen it with your own eyes. Is there a need to ask that question?”", "“Several organizations were behind the group that attacked Valhalla! What will you do about those organizations?”", "“What will we do? That’s something for those organizations to investigate and explain. I don’t believe it’s Valhalla’s turn to speak yet. Well, we have all the evidence in the world, so they better be prepared if they’re going to say we plotted all this.”", "Seol Jihu made his way through the crowd while replying calmly.", "It was then.", "“Why did you broadcast the incident to the whole world? What is your intention?”", "Hearing a certain question, he stopped before he entered the main gate.", "His intention for making the movie?", "Seol Jihu turned around.", "“I will say just one thing.”", "The crowd immediately turned silent. Those from intelligence organizations got ready to note his next sentence, word by word.", "“The reason I broadcasted the incident to the whole world… was to honor the memory of the deceased.”", "“To honor the memory of the deceased…?”", "The person who asked the question repeated Seol Jihu’s answer in a daze.", "“Yes. To honor the memory of Raging Temperance.”", "It wasn’t just him. The ones who were busily writing down Seol Jihu’s words also doubted their ears and paused.", "“What… what does that mean? Raging Temperance is—”", "“Our enemy. But he was an outstanding Army Commander who is deserving of my utmost respect. That’s right. This movie was made to honor the memory of the Parasites’ Fourth Army Commander, the Great General Raging Temperance!”", "Kazuki dropped his head.", "Seol Jihu grinned at the people staring at him dumbfoundedly.", "“Please include that in the news story so that the traitors can deliver it to the Parasites.”", "Seol Jihu then turned around and walked inside, all the while holding onto the quietly giggling Seo Yuhui’s hand.", "Each and every member of Valhalla followed after the young man with light, cheerful steps.", "*", "“You’re back?”", "Seol Jihu could see Kim Hannah waiting at the entrance once he opened the front door.", "“I see that you threw a real bombshell.”", "She looked at Seol Jihu and Seo Yuhui sticking together like pancakes and sent a subtle glance.", "“It looks like you made some progress.”", "“In what regard?”", "Kim Hannah shrugged and then grabbed the clipboard under her arm.", "“We can talk about Jinah later. Anyways, you came back at the perfect time. There are two things I need to report to you. One is about Scheherazade, and the other is about an important guest from Haramark.”", "“An important guest…? Oh, is Princess Teresa here?”", "Kim Hannah shook her head.", "“That too, but both reports are about something else.”", "She then started speaking.", "*", "Same time.", "The Parasite Queen, who had been slumbering for a long time on the Corrupted Throne, suddenly opened her eyes.", "She had not recovered yet.", "Despite being asleep for close to a year, the cost of ignoring the law of causality and forcefully descending on Tigol Fortress had simply been too terrifying.", "To return to her past condition, she would have to rest at least a few months more.", "There was one reason she opened her eyes.", "It was because she suddenly sensed a strange movement of the stars.", "In a half-conscious state, the Parasite Queen slowly opened her eyes and looked up.", "After observing the outer space with a calm gaze…", "[?]", "Her brows suddenly wriggled violently.", "[N-No—]", "She didn’t know exactly what happened during the time that she had been asleep.", "[Insanity!]", "But, her eyes shot open after confirming the movement of the celestial bodies."]}