{"cid": "373", "title": "Chapter 373. Penance (4)", "content": ["Unsurprisingly, Phi Sora received a positive reply from the Eva Royal Palace.", "The Federation would even come out to the border region to greet them.", "While forming a contract with a Spirit would be entirely up to Yi Seol-Ah, the Federation said they would provide as much help as they could during the process.", "And so with the Federation guiding them, Yi Seol-Ah and Marcel Ghionea arrived at their destination.", "“Wow…”", "Yi Seol-Ah couldn’t close her mouth.", "The magnificence of Tigol Fortress was one thing, but the giant ash tree in the center of the fortress, holding up the sky like a pillar, was indescribably majestic.", "“Most people who see the World Tree for the first time have the same reaction.”", "A clear voice rang out.", "Yi Seol-Ah saw a sharp-eared beauty walking toward her with light steps.", "The Sky Fairy looked at Marcel Ghionea and smiled.", "“Nice to meet you. My name is Taihi Ingraria, the commander of the Sky Fairies.”", "“I’m Marcel Ghionea.”", "“Yes, I’ve heard. And this must be…”", "When Yi Seol-Ah met the Sky Fairy’s eyes, she hurriedly lowered her head and greeted her.", "Taihi scanned her from top to bottom, then flashed her eyes.", "“…It really is true. A human with spirit affinity… I didn’t think it was possible.”", "“She could understand Little Chick, I mean, the Arcus Spirit.”", "“That’s understandable. Let’s see. It’s not fire or earth. Water and wind are a bit weak, but I can definitely smell the scent of air.”", "“Does that mean she can contract an Air Spirit?”", "“I’m not sure.”", "Taihi shrugged.", "“By any chance, is one of your ancestors a Fairy?”", "“I don’t think so. We’re from a different world.”", "“Then I really can’t be certain whether a Spirit will take a liking to her… But don’t worry too much.”", "Taihi looked back at the World Tree with a smile.", "“World Tree-nim? Can you send these two to the Spirit Realm?”", "As if in reply to Taihi’s request, a branch came down from the sky.", "It poked Marcel Ghionea and Yi Seol-Ah before curling and forming a question mark.", "“No, he’s not here today. I’ve heard he’s busy.”", "The branch drooped down.", "Taihi laughed elegantly, then continued.", "“But he asked us to do him this favor. Can you take these two to Lord Ea?”", "Ssss. The branches of the World Tree shook.", "Next, two branches came down and wrapped around Marcel Ghionea and Yi Seol-Ah’s body.", "“Great. Looks like World Tree-nim will send you to the Spirit Realm right away. Are you ready?”", "“Yes.”", "“Have a safe trip. Normally, you would have to wander around the Spirit Realm for a few days and look for a Spirit to form a contract with, but there’s a chance Lord Ea might help you with it.”", "“Thank you.”", "Yi Seol-Ah examined her body in a fluster, but Marcel Ghionea was calm from having experienced the sensation once before.", "Soon, the two disappeared with a flash of light.", "*", "When Yi Seol-Ah opened her eyes, an entirely new world was spread out before her.", "[You’re here.]", "A silvery voice rang out from the blue sky in which neither a sun nor a moon could be seen.", "A beautiful goddess with sky-colored, short hair was lying down in midair.", "It was the Spirit King of air, Ea.", "She seemed to be made of air, just like her name suggested, and was lacking in facial features. She gave off a coy charm the way she had her eyes closed and her chin resting on the back of her hand while lying belly-side down.", "[World Tree-nim let me know. That child wants to form a contract with a Spirit?]", "“Yes. The general of the Sky Fairies said that the scent of air is strongest.”", "[Hmm.]", "Ea opened one eye. Yi Seol-Ah tensed up when her cold gaze fell on her.", "[Indeed… I can feel a lot of energy for someone who’s from Earth.]", "“Then—”", "[But it’s not as exceptional as I expected.]", "Ea spoke.", "[It’s uncommon for humans to form contracts with Spirits in the first place. Though it might be possible to communicate, that is usually as far as it goes.]", "“You mean it’s not possible for her to form a contract?”", "Ea shook her head at Marcel Ghionea’s question.", "[You must be misunderstanding something. Spirit affinity is only the minimum requirement to form a contract with a Spirit. It is entirely up to the Spirits to decide whether they want to form a contract with an eligible human.]", "Marcel Ghionea thought in depth before asking.", "“I understand what you mean. Can we meet the Air Spirits then?”", "[There should be no problem since World Tree-nim invited you. The question is whether any of them will be attracted to that child…]", "Yi Seol-Ah’s heart sank.", "She thought she had finally found her way.", "Although she had no plans to back off now, she couldn’t help but feel uneasy with the Spirit King talking negatively.", "[To be completely honest with you, the chance is close to zero. Even if I lower my standards to the bare minimum, I don’t find her all that attractive. But—]", "Ea said calmly before fully opening both eyes.", "[Because the one who revived World Tree-nim personally came and our savior personally asked us for this favor, it doesn’t feel right to just let her return empty-handed.]", "Ea snapped her fingers.", "[Aura?]", "An unusual ripple formed in the air as if to respond to the queen’s call.", "A deep sky-colored Spirit materialized in the air.", "A beautiful goddess resembling Ea appeared.", "[Did you call me, my queen?]", "[Yes. Aura, please form a contract with this human.]", "[Excuse me?]", "Aura’s eyes widened when Ea pointed at Yi Seol-Ah. She muttered in a fluster.", "[B-But Lord Ea, that human is…]", "[This is his request.]", "[?]", "[The man who received World Tree-nim’s blessing. If you form a contract with her, you will be able to help him more closely than any other Spirit.]", "[Ah!]", "[This is a very honorable thing. Of course, I won’t force you if you’re uninterested.]", "[No! I’ll do it! Let me do it, please!]", "Aura’s attitude took a complete turn. She seemed reluctant at first, but when Seol Jihu was mentioned, she was begging to do it.", "[Lala, lalala~]", "Soon, Aura slowly flew up to Yi Seol-Ah while humming.", "After stopping right in front of her nose, she looked into Yi Seol-Ah’s eyes and smiled.", "“Ah!”", "A yelp escaped the nervous Yi Seol-Ah’s mouth. Although Aura hadn’t said anything, Yi Seol-Ah could feel the Spirit’s voice directly entering her head.", "Aura just said to her, ‘Grab this hand if you want to form a contract with me.’", "In the next moment, Yi Seol-Ah closed her eyes and held the Spirit’s hands as though she was entranced.", "Aura’s smile thickened.", "The Spirit also closed her eyes, tightly grabbing Yi Seol-Ah’s hands and flying closer to her face.", "As their foreheads touched, Aura’s lips opened slightly.", "[Ego, Contrahere, Vobiscum….]", "Whoosh! Yi Seol-Ah felt a puff of air entering her body and reflexively took a deep breath.", "‘W-What a strange feeling…’", "Her body swayed side to side as if to dance.", "The air seemed to be melting inside of her.", "She trembled at the indescribable feeling of resonance and plopped down on the ground.", "This state lasted about 10 minutes. When she opened her eyes again, Aura was no longer in front of her. However, she could clearly feel another being co-existing in her body.", "“I… formed the contract…”", "Yi Seol-Ah panted.", "[Aura is a child I value very much.]", "Ea said in a monotonous voice.", "[If she can devote herself to helping our savior alongside you, I will be able to step down from my position with ease. She is the prime candidate for succeeding me, so please take care of her.]", "Yi Seol-Ah nodded her head multiple times.", "Actually, she was in a daze from the strange feeling swirling inside her body.", "Marcel Ghionea looked up at Ea after helping Yi Seol-Ah up.", "“I have another request.”", "[What is it?]", "“Can I take a look around Spirit Realm? It’s fine even if it’s for a little bit. I want to go back to that place.”", "[By that place, you mean…]", "Ea nodded her head heavily as if she had a place in mind.", "[I suppose it’s fine. You can ask Aura when you want to go back.]", "Ea closed her eyes.", "Marcel Ghionea bowed and then turned around and started walking.", "Yi Seol-Ah also chased after him.", "She felt like she was dreaming. Going to the Federation and arriving at the Spirit Realm was already hard to believe, but she had even succeeded in forming a contract with a powerful Spirit.", "“Ack.”", "Just as she came to her senses after getting used to the new sensation, she felt a soft impact on her face.", "Marcel Ghionea had stopped before she noticed.", "“S-Sorry.”", "[Fufu.]", "Aura’s giggling rang out.", "Marcel Ghionea didn’t say anything. He had his hands in his pocket as he stared blankly at an empty lot.", "“…It’s here.”", "Then, he spoke after a long period of silence.", "“What’s here?”", "“This is the place we fought Raging Temperance and Twisted Kindness.”", "Hearing this, Yi Seol-Ah looked around her surroundings.", "She didn’t see anything of note, perhaps because the land had been restored to its original state.", "However, Marcel Ghionea got down to his knee and scooped up a handful of dirt.", "“The smell of blood was also left in Tigol Fortress… and it’s the same here.”", "He rubbed the dirt between his fingers while showing a bitter expression.", "“…It would be wrong to call what happened a fierce battle. What it really was, was a one-sided assault. We were barely holding on, and if not for the lucky coincidence, we would not have come out victorious.”", "Yi Seol-Ah became lost for words.", "She became solemn as this was the first time she was seeing the usually cold Marcel Ghionea being so self-deprecating.", "She guessed that a battle surpassing her wildest imaginations must have taken place here.", "“…Thank you…”", "Not knowing what to say, she thanked him.", "Shortly afterward, Marcel Ghionea said while still kneeling down.", "“As you know, the Federation was, for the most part, antagonistic toward humanity.”", "He turned his head and looked up at Yi Seol-Ah.", "“That sentiment hasn’t disappeared completely. Normally, humans would not even dream of having the World Tree take them to the Spirit Realm.”", "Marcel Ghionea continued.", "“Despite that, we were able to enter the Spirit Realm without any difficulties, and you were even able to form a contract with a Spirit. It wouldn’t be an exaggeration to say that this was all thanks to Representative Seol.”", "It was true that Yi Seol-Ah felt an inexplicable awkwardness throughout the journey. Whether it be the Federation or the Spirit Realm, they were something that seemed so far out of reach that they seemed like something from the land of the stars.", "She knew that they existed, but she never thought she would go there personally.", "But the moment Seol Jihu’s name was brought out, the situation took a complete turn.", "The Federation welcomed them to the point of sending people to greet them, and a Spirit King had even introduced a high-ranking Spirit to her despite not finding her attractive.", "‘Come to think of it…’", "Recalling the series of events one by one, Yi Seol-Ah suddenly felt embarrassed.", "If there was one thing she learned from her previous expedition, it was that not all Earthlings lived well in Paradise.", "Even a decently skilled team had trouble making their ends meet. Because they usually had their hands full with just buying equipment, they lived in inns without ever thinking of owning their own place.", "But what about her?", "Frankly speaking, she had never starved a single day since the day she entered Paradise, and people that most Earthlings would beg to have on their team were all around her.", "That wasn’t all. She had entered the Spirit Realm and formed a contract with a powerful Air Spirit with ease.", "Everything was handed to her on a platter.", "All because she was from Valhalla and a companion of Seol Jihu.", "‘I….’", "Once her thoughts reached this point, Yi Seol-Ah gently bit down on her lower lip.", "Right, she had not been neglected. If she wanted to eat, she could have eaten however much she wanted.", "She simply didn’t.", "It wasn’t that she couldn’t, but that she didn’t. She wasted her time, using her mother as an excuse to go back and forth between Earth and Paradise.", "‘What did I do until now…?’", "As long as one entered an organization, they were expected to take care of their own problems.", "Only now did those words truly reach her heart.", "“Get stronger.”", "Marcel Ghionea spoke.", "“If you’re really grateful, get stronger no matter what you have to do. Then next time something happens, participate.”", "He was right. It wasn’t that Seol Jihu didn’t take her along on expeditions. She just couldn’t participate. If she had improved herself to even the bare minimum standard, Seol Jihu would have allowed her to go without a doubt.", "“I’m not telling you to fight an Army Commander. Nobody is expecting that much. But you need to get stronger to at least hold their feet. If you can do that…”", "Marcel Ghionea stood up at last and then said to the dazedly standing Yi Seol-Ah.", "“Both Representative Seol and I will feel that putting off our training and bringing you here was worth it.”", "*", "Marcel Ghionea and Yi Seol-Ah returned to Tigol Fortress.", "When Taihi, who was waiting under the World Tree, saw Yi Seol-Ah, she expressed both shock and envy.", "“To contract Aura among the countless Air Spirits… And she is even the most likely successor to Lord Ea…!”", "Supposedly, Aura was a fully-evolved, pinnacle-rank Spirit, of which there were only a few among the five Spirit types. It seemed Aura was even more special in that Ea designated her as her prime successor candidate.", "Although Ea said it nonchalantly, she had actually put great trust in leaving Aura to Yi Seol-Ah’s care.", "“We will be leaving now.”", "Marcel Ghionea bid farewell as he bowed to the shocked Taihi.", "“Ah, you’re already leaving?”", "“Yes, we finished what we came here for. I will be sure to let Representative Seol know that you helped us out greatly today.”", "“Ah, yes… I’m a Sky Fairy. Just make sure you don’t say I’m a Cave Fairy by mistake.”", "After saying goodbye, Marcel Ghionea turned around and began to walk down the fortress. Yi Seol-Ah silently followed after him.", "During the walk down, neither side said a single word. The Archer of Steel was normally the silent type, and Yi Seol-Ah had been in deep thought even before leaving the Spirit Realm.", "“…Wait.”", "Then, she suddenly stopped and called out.", "“What is it?”", "“I-It won’t take long. Can I go to see the World Tree real quick?”", "“The World Tree?”", "Marcel Ghionea tilted his head, but he didn’t say no. He nodded his head as if to say, go ahead.", "Yi Seol-Ah raced up the path she had walked down.", "Taihi was lying down beneath the World Tree. She was holding her stomach and tossing and turning, yelling, ‘Aigoo, my stomach!’", "“Taihi-nim!”", "When Yi Seol-Ah called out to her, she shot up in a hurry.", "She dusted off the dirt on her hands and made an elegant expression.", "“Oh my, didn’t you go back?”", "“If it’s okay with you… I want to ask you for a favor.”", "“Y-Yes?”", "“I formed a contract with Aura, but I don’t know anything about Spirits. Nothing at all.”", "“Well…”", "Taihi rolled her eyes in the middle of talking. She had a feeling she knew what the girl was going to ask her.", "However, that wasn’t the end.", "“And I heard Fairies are excellent, natural-born Archers.”", "“That’s true.”", "Taihi said proudly.", "Yi Seol-Ah spoke with more eagerness and desperation than ever before.", "“So if it’s possible… I want to remain here.”", "“So you’re saying…”", "Taihi replied with a sweet smile.", "“You want to stay here and learn how to become an Archer that can wield her Spirit properly.”", "“I won’t make it hard on you. I’ll take care of my meals, and if there are any rules I need to follow, I will make sure I do. I’ll be quiet, so please let me stay.”", "“Sure. You contracted a pinnacle-rank Spirit, so I don’t see why not.”", "Taihi agreed rather easily.", "“I applaud your enthusiasm, but don’t try to do everything alone. You’re a complete beginner without any knowledge of Spirits. There is a limit to self-study. Given what our benefactor asked us to do, I would be more than willing to introduce an excellent master to you.”", "She rubbed her chin and glanced sideways.", "“But it won’t be easy to emulate a Fairy’s art with a human body… And you would have to wield a Spirit on top of that. Are you sure you can do both?”", "“Yes.”", "Yi Seol-Ah answered right away.", "She had already made up her mind. She didn’t care about being criticized for leeching off Valhalla and Seol Jihu’s achievements.", "What mattered was getting stronger.", "There was no need for her to walk the same path as her brother. She had to find her own path to walk.", "And now that she came this far, she decided to eat up everything she could get her hands on.", "“If you’re going to introduce me to a master…”", "And so, Yi Seol-Ah said the same words that a certain someone once said.", "“I’d like you to introduce the most skillful and rigorous master there is.”", "In that instant, Taihi’s eyes lit up.", "If she was looking at a lucky girl before, now her eyes were slightly more hopeful.", "“…Ever since the Parasites appeared on this land, we Sky Fairies have adopted a new tradition.”", "After a short silence, Taihi spoke in a quiet voice.", "“No matter what you learn from whom, there is no better teacher than real-life experience. Every Sky Fairy who undergoes their coming-of-age ceremony immediately joins a patrol team and patrols the border region. Although the region is safer now because the war just ended, small-scale battles were frequent in the past.”", "With that, Taihi asked furtively.", "“Of course, the Federation is also recovering from the war, so we have many open slots in our patrol teams… What do you think?”", "Patrolling the border region. This wasn’t the region between the Federation and humanity, but the region between the Federation and the Parasites.", "Just imagining it gave Yi Seol-Ah the chills.", "Moreover, the border region must be the Hiral Mountain Range. Just patrolling the area while constantly being on the lookout would likely sap her energy.", "However, Yi Seol-Ah didn’t avoid it.", "“Yes!”", "Her comrades had fought the Army Commanders and even the Parasite Queen herself. How could she be afraid of mere corpses and parasites?", "“Please let me.”", "“I guess I have no choice.”", "Taihi smiled brightly.", "“I appreciate your help. But, the patrol team that I am in charge of goes to the deepest, most dangerous area of Hiral Mountain Range, so please keep that in mind.”", "After talking with Taihi, Yi Seol-Ah went back down. Although she decided on her own, she still needed to get permission.", "After listening to her explanation, Marcel Ghionea silently passed the communication crystal. Yi Seol-Ah personally explained the circumstance.", "—Oho.", "Phi Sora chuckled.", "It was a surprised laugh rather than a mocking one.", "—Look at you. I’m surprised… Alright, go ahead. But let me advise you, don’t go at it half-heartedly. The Parasites aren’t such easy targets.", "“I’ll put my life on the line.”", "—Don’t you know what middle ground is? Don’t die. What am I gonna say to the representative if you die?", "Phi Sora grumbled.", "—Anyway, good luck. Since you’re going that far, I’ll look forward to meeting you again.", "Phi Sora hung up.", "Yi Seol-Ah handed the communication crystal back to Marcel Ghionea and then bowed politely.", "“Thank you for bringing me here.”", "“…This is the first time you’re doing something praiseworthy.”", "Marcel Ghionea murmured quietly.", "“It’s the same with your brother. Looks like I’ll have one less thing to worry about now. I’m sure Representative Seol will be happy too.”", "“Ah, we have to tell Orabeo-nim too…”", "“Well, that’s if he comes back before you. But he said he would be gone for a long time…”", "“Where did he go…?”", "“I don’t know. Only the team leaders know the specifics. He didn’t say anything to us.”", "Marcel Ghionea smacked his lips once Seol Jihu’s name was mentioned.", "“But I can take a guess. He probably thought the same thing I did.”", "Looking up at the sky…", "“Maybe…”", "He heaved out a light sigh.", "“He might be in greater pain than anything he experienced during the last war….”", "*", "Same time.", "As a boulder rolled down the mountain with a thundering noise, a gruesome scream echoed out.", "Black Seol Jihu stared with his chin on his palm before taking the tree branch in his hand and completing the counting character (正) on the ground.[1]", "Looking at the innumerable counting characters drawn on the ground, he smiled bitterly.", "“2,475th try. Also a fail.”", "1. This (正) character is used to keep count. Each completed symbol represents five because it needs five strokes to draw it. "]}