{"cid": "273", "title": "Chapter 273. The Savior of Eva (2)", "content": ["Silence lingered.", "Charlotte Aria looked down at the young man with an awkward look. Judging by her flushed nape, she looked hot.", "After a brief moment of silence, Charlotte Aria rubbed her neck.", "“You dare speak in such a manner in my presence?”", "She spoke in an authoritative tone. She came off more cute than imposing, but Seol Jihu did not reveal his inner thoughts.", "“My apologies, Your Majesty.”", "“It is fine. Earthlings are all like that. Since you were also in Haramark, it isn’t as if I cannot understand.”", "She was subtly berating the Haramark Royal Family, who dealt with Earthlings without formality.", "Seol Jihu did not lose his smile. He wanted to say Haramark was a thousand times better than Eva, but he couldn’t flip the table before the dishes were even set.", "“There’s what I did as well… Ah.”", "Charlotte Aria abruptly asked while fanning herself with her hand.", "“I heard you had a very close relationship with Teresa Hussey.”", "“She helped me both physically and emotionally.”", "“From what I hear, Teresa Hussey seems to give you special treatment…”", "Expecting her to ask, ‘So why did you come to Eva?’, Seol Jihu prepared his answer. However, what followed was a completely unexpected question.", "“Since you mentioned my beauty, I have gotten curious about your real intention. Right, what did you think when you saw her?”", "“…Pardon?”", "“Did you not say you lost your train of thought at my beauty? Did you say the same thing when you saw Teresa Hussey?”", "Seol Jihu barely held back from saying, ‘What?’ Although she phrased it better, wasn’t she basically asking, ‘Who do you like more, me or Teresa Hussey?’", "However, Seol Jihu was unfazed by the sudden question and answered without hesitation.", "“When I first met Princess Teresa Hussey in Haramark, I don’t believe I said those words.”", "He wasn’t lying. After all, he wasn’t in any situation to say something like that when he first met Teresa. He only felt a strong attraction to her.", "“Is that true?”", "However, Charlotte Aria, who did not know the circumstance of Teresa Hussey and Seol Jihu’s meeting, twinkled her eyes.", "“I beg your pardon, but it is true.”", "“Really? Is it really true?”", "Her manner of speech suddenly changed. Her tone also went up. Although Seol Jihu’s reaction wasn’t what she expected, his lack of hesitation in answering seemed to have made her happy.", "“I can ask Unni, you know~”", "“You’re welcome to.”", "Though he felt like he was digging his own grave, now that he already said it, Seol Jihu went all out.", "“I am only telling the truth as is.”", "“Mhmm, I see. Looks like your fame is not fabricated. You are truly a man of character.”", "‘Jesus.’", "She was calling him a man of character just because he made it sound like she was prettier than Teresa?", "‘She really is a kid.’", "This display should be Charlotte Aria’s true nature. Without her crown, she was no different than an ordinary girl.", "“Oh my, Princess Teresa would be very sad if she heard it.”", "It was then. An uninvited guest suddenly barged into the harmonious atmosphere. When Seol Jihu turned his gaze, the intruder replied with a smile.", "“Excuse me, I am—”", "She paused and then looked back at the queen. Charlotte Aria nodded her head.", "“Ah, I made her stand next to me and forgot to introduce her. You may both rise.”", "Seol Jihu and Kim Hannah stood up from their kneeling position.", "“This is Jung Sua, the representative of Evangeline. Greet each other.”", "“Hello!”", "Jung Sua saluted in a cheerful voice. Seol Jihu also responded.", "“Nice to meet you. I’m Seol Jihu.”", "“Yes, I know. I’ve heard the heroic tales of Valhalla’s representative countless times. By the way, the one next to you is…”", "“Kim Hannah.”", "Kim Hannah replied with her business smile.", "“Ah, it’s nice to meet you. I’ve heard of Kim Hannah-nim’s fame as well. I’ve always wanted to meet you.”", "Jung Sua held her hands together and made her eyes twinkle. Although people said you cannot spit on a smiling face, Seol Jihu felt that her actions were extremely contemptible.", "Charlotte Aria looked back and forth between Jung Sua and the man and woman duo before letting out a dry cough.", "“Ah, that’s right, I heard the two of you had a minor misunderstanding.”", "“….”", "“Jung Sua said she wanted to participate in this meeting to resolve this misunderstanding. I gave her permission, so do not mind it.”", "“Jeez, Your Majesty, you brought it up this early?”", "“Hmm? Ah, come to think of it, we were meeting for lunch. Shall we go to the dining hall first?”", "“No, it’s fine.”", "Jung Sua shook her head with a smile.", "“I wanted to take my time and talk, but since you’ve mentioned it, I think it’s better that we discuss this first.”", "“You’re saying you want to talk to them privately?”", "“Yes. Like I said this morning, it would be great if you could permit it. It’s fine even if it’s just for a little bit…”", "As Charlotte Aria had already been briefed this morning, she agreed easily.", "“Now that I think about it, Representative Jung was very interested in talking with you two. Especially… uh, Miss Foxy, was it? Your title is rather famous.”", "“It is just a trifling nickname.”", "Kim Hannah replied courteously.", "“Right. Anyway, Jung Sua has been wanting to meet you. How about it? Would you like to try talking with her before lunch?”", "‘Iya…’", "Kim Hannah was impressed. Even after summoning them all the way here, this so-called queen was telling them to resolve the issue with Jung Sua on their own?", "This wasn’t something a queen should say. However, Kim Hannah figured out what happened. She had expected as much when she saw Jung Sua here.", "Jung Sua must have felt pressured when the queen’s cognition of Valhalla began to change. She must have joined this meeting forcefully to deal with the anxiousness in her heart.", "Her intention was clear just from her previous action. Suddenly barging into the queen’s conversation with Seol Jihu and trying to set up a private meeting with Kim Hannah, both of these must have been a show to say, ‘Look. This is my position. This is how much the queen thinks about me.’", "‘I guess it doesn’t matter.’", "In fact, Kim Hannah wanted to welcome it with her arms spread out. She originally planned to set up a private meeting by borrowing Sorg Kühne’s authority. But the criminal must be suffering from a guilty conscience as she was putting herself back into the crime scene.", "Since she wanted to enter the fox’s mouth so much, it would only be right to thoroughly devour her.", "Kim Hannah’s smile thickened.", "“I see no reason to refuse. I wanted to talk with Representative Jung as well.”", "Charlotte Aria’s expression brightened. Although she talked big and told Jung Sua not to worry, she was not used to interfering in such matters. She was troubled on how to lead the conversation, so how could she not be happy knowing that this issue was resolving itself?", "“Great. I will be talking with Representative Seol, then.”", "“Thank you for listening to my request, Your Majesty.”", "“Are you that happy? I can see you’re full of smiles.”", "“Yes, I am very happy.”", "Jung Sua walked forward with a beaming smile. After giving Seol Jihu a mysterious smile, she passed him and stopped in front of Kim Hannah.", "“Thank you for accepting the offer. I was scared you might reject it.”", "“How could I when you said you’ve been wanting to meet me for a long time? Plus, I have also been meaning to talk to you.”", "Charlotte Aria made a joyful expression, seemingly happy that the two women were getting along.", "“Don’t talk for too long. Come to the dining hall before the food goes cold.”", "“Yes, Your Majesty.”", "The two women said courteously.", "“Follow me. I know a quiet place.”", "“Perfect. A quiet place was exactly what I was hoping for as well.”", "Seol Jihu swallowed hard.", "‘They’re both smiling… but both of their eyes are unmoving.’", "Was this what it felt like to witness the calm before the storm? Seol Jihu felt cold sweat flow down his back.", "Just like that, the two women bearing knives in their stomachs left laughing. Once the two disappeared, an awkward silence filled the grand hall.", "“Uh… what did you say your name was?”", "“It’s Seol Jihu.”", "“Right, Seol Jihu. And your organization name….”", "“It’s Valhalla.”", "A meaningless conversation went back and forth. Now that only the two of them were left, Charlotte Aria looked lost. She was very clearly trying her best to find something to talk about.", "‘No.’", "To be more precise, she probably did not want to talk about a topic that would make things awkward. She must be racking her brains right now to talk only about things that both sides wanted to hear and ultimately end the meeting comfortably.", "But Seol Jihu could not let that happen. Since Kim Hannah had walked up to the stage first, it was now his turn to go up.", "But before that, he had to create the stage first.", "“Thank you for inviting me today.”", "Seol Jihu spoke after organizing his thoughts.", "“I should have come to see you first to submit the report on the royal mission’s completion.”", "“Ah.”", "Charlotte Aria turned cheerful. The awkward silence was killing her, but a good topic to waste time on had presented itself.", "“Now that you mention it, I heard you successfully escorted the Federation’s members back home.”", "“It was nothing difficult. I’d like to apologize for reporting so late.”", "“No, no, it happens. You don’t need to apologize.”", "Charlotte Aria waved it off like it was nothing important.", "“Were you busy with something?”", "She took the bait earlier than he expected.", "“Rather than busy, something unexpected happened.”", "“Hmm? Something unexpected?”", "“Yes, while I was away, the Eva Alliance carried out an attack.”", "Seol Jihu did not give her the chance to speak.", "“Thankfully, we were able to resolve the trouble with the Triads’ support…”", "Short and sweet, that was the name of the game.", "“From what I know, the Earthling who incited the Alliance to attack has not yet received any punishment.”", "Charlotte Aria’s eyes widened.", "“N-No.”", "“Your Majesty, why are you protecting Jung Sua?”", "Directly hit all of a sudden, Charlotte Aria’s expression quickly stiffened. Not knowing where to look, she barely managed to squeak out.", "“T-That is a misunderstanding.”", "“No, it isn’t.”", "Seol Jihu denied it firmly.", "“Y-You’re wrong. It is a misunderstanding…”", "“What part of it are you saying is a misunderstanding?”", "“Jung Sua said—”", "“Those are the words of the perpetrator. There are no evidence or even witnesses to back up her claim. She is only using her close relationship with Your Majesty to claim innocence.”", "Though not loud, Seol Jihu spoke with clarity.", "“On the other hand, the evidence we provided all point to Jung Sua being an accomplice. Given this, I am failing to understand why you are trying to cover up for Representative Jung.”", "Charlotte Aria shut her mouth. She stared at Seol Jihu at a loss for what to do. She seemed to be mumbling something in a barely audible voice, but Seol Jihu could not make out any words.", "Seol Jihu closed his eyes. The Status Window did not lie.", "This queen, Charlotte Aria, was weak. Almost too weak.", "Since that was the case, Seol Jihu was left with only one option — to force her to see and hear the truth, even if that truth left her with great shock.", "“Queen.”", "“….”", "“Representative Jung is a liar.”", "“Jung Sua is…!”", "Charlotte Aria was about to shout something but shut her mouth in the next moment. She chewed on her fair lips in a flurry.", "Seol Jihu’s eyes flickered with light. In truth, he expected Charlotte Aria to get furious the moment he denounced Jung Sua. He fully expected to get on her wrong side or be kicked out of the palace, but her reaction was rather stale.", "Should he consider himself lucky?", "‘Maybe….’", "Perhaps Charlotte Aria knew deep inside that Jung Sua was using her. In that case, she must be keeping her around because Jung Sua was the only one understanding her and accepting her tantrums.", "Of course, this was only a conjecture.", "Seol Jihu sighed. He didn’t plan to talk for long. If words would have any effect, Sorg Kühne would have gotten the job done a long time ago.", "Things had come to this point because she could not be persuaded with words. By now, Kim Hannah must be carrying out her plan as well.", "Seol Jihu walked forward without asking for permission. Charlotte Aria shrunk back into the throne, almost as if she was burying herself in the seat.", "“D-Don’t come closer. Y-You’re scaring me.”", "She must really be scared as her tiny shoulders trembled faintly. Seol Jihu shook his head.", "“Don’t be afraid. I am here to help you, queen.”", "“Help me?”", "“To tell you the truth, an acquaintance has asked me to come. To help Your Majesty open your eyes.”", "“An acquaintance asked you to come?”", "Charlotte Aria frowned as she repeated what Seol Jihu said like a parrot.", "“Just who… Don’t tell me, you are talking about Teresa Unni?”", "Seol Jihu did not answer. He stopped in front of the throne, casting a shadow over it.", "“Your Majesty might not know, but Representative Jung has tricked you thoroughly. From the beginning to the end.”", "“I-It isn’t that bad.”", "“Your Majesty must not know. No, even if you did, you would not want to believe it.”", "Once Seol Jihu perfectly pointed out her inner feelings, Charlotte Aria’s expression became even more anxious. Tears began to well up around her eyes as she looked up.", "“So I will show you.”", "Seol Jihu smiled faintly.", "“Whether Representative Jung is lying through her teeth or not, please decide after seeing and hearing it for yourself.”", "*", "Meanwhile, the air flowing between Kim Hannah and Jung Sua could not be any colder.", "Jung Sua was glaring at Kim Hannah in dismay. She had entered this private meeting, fully prepared to yield as many benefits as possible.", "Although the Eva Royal Palace was Jung Sua’s home ground, given the opponent she was dealing with, she was prepared to tolerate her overbearing attitude.", "But setting aside Kim Hannah’s attitude and bearing, Jung Sua was struck speechless by Kim Hannah directly refusing to negotiate on anything.", "“I don’t like repeating myself.”", "Kim Hannah spoke as she rubbed her thumb over the fingernail of her index finger. Her expression could not be more apathetic.", "“Just hurry up and choose.”", "Jung Sua smirked.", "“You sure are greedy.”", "“I know I’m a fat lump of greed, so you don’t have to say it. Now, I will say it just one more time.”", "“Excuse me.”", "“Do you want to quietly leave with what you have now? Or do you want to be dragged out in tears and snot after suffering all sorts of nasty things?”", "Jung Sua clenched her teeth. She squeezed her interlocked hands and feigned a smile.", "“I’ve heard your name many times, so I’m surprised that a woman known as the Fox cannot distinguish between heaven and earth.”", "“I can’t distinguish between heaven and earth?”", "“That’s right. What if I say no to both?”", "Jung Sua tilted her chin up.", "“Then what are you going to do?”", "Kim Hannah raised an eyebrow. Jung Sua asked again.", "“Let me be blunt. What can you even do?”", "“You’re more cheeky than I anticipated.”", "“Miss Kim Hannah.”", "Jung Sua continued softly.", "“It looks like you are gravely mistaken here. This is not Scheherazade, and Valhalla is not Sinyoung.”", "“….”", "“I didn’t think you would be this terrible at grasping the situation. I was wondering why you were kicked out of Sinyoung. Now I’m starting to understand.”", "“Kik.”", "Kim Hannah dropped her head. Her body trembled as she continued to snort.", "Jung Sua spoke blandly.", "“Do you need to put on airs like that? Do you think such a boorish act will make me bat an eye?”", "“Put on airs?”", "Kim Hannah raised her head with great difficulty and said while snickering.", "“Miss Jung Sua, let me tell you something.”", "“No, I’m good. I don’t really want to know.”", "“When you’re provoking someone, you need to know who you are up against. I can’t count the number of people who acted so arrogantly in front of me without knowing their place and ended up going through hell.”", "“Ah~ I see. Well, that was very enlightening. It’s much more original than just saying, ‘Do you know who I am?’”", "Jung Sua struck back without the slightest change in her expression.", "“Right, you need to act brave when you can.”", "Kim Hannah nodded.", "“They’ll say this and that, acting without a fear in the world. But they all end up the same way, pissing out blood and tears, begging on their knees to forgive them just once. Well, it’s quite a sight.”", "“I didn’t come here to listen to your poor hobbies.”", "Jung Sua scoffed.", "Chuckling, Kim Hannah rubbed the transparent crystal earring on her left ear and reached out with the other hand. She took out a thick stack of paper from her handbag.", "“What do you think this is?”", "She asked while gently waving the stack of paper in the air. Jung Sua did not reply. She only stared at Kim Hannah with a leisurely face.", "“It’s a report about you. Everything about Miss Jung Sua is written here, starting from your birth to how you ended up in your current position.”", "Jung Sua frowned slightly.", "“…What?”", "Kim Hannah handed the stack of paper over to Jung Sua and continued.", "“Born in 1994 in the Year of the Dog at Dongjin Hospital in Gunsan. You have two older siblings— one male and one female. You attended Sundo Elementary School until second grade and then moved to Seoul, transferring to Samsil Elementary School. Next…”", "As Kim Hannah continued to read about her life, the creases on Jung Sua’s forehead became clearer.", "“You investigated my background?”", "“Ah, just to be clear, I didn’t do it. I never asked for it either.”", "“How the hell does that make any sense? How else would—”", "“Oh, trust me, it makes sense. Sinyoung gifted it to us at our opening ceremony.”", "Kim Hannah smiled sweetly.", "“Sinyoung?”", "“For someone who’s quick to grab opportunities, you’re quite stupid. I was going to correct you before, but what makes you think I was kicked out of Sinyoung?”", "Kim Hannah clicked her tongue as if she pitied Jung Sua.", "“Seol Jihu invited me while I was with Sinyoung, and after coming to Eva, he created an organization with unprecedented speed. Doesn’t this ring a bell?”", "Kim Hannah flicked the stack of paper.", "“And this report, it came from Sinyoung’s Director Yun. She even delivered it personally.”", "Jung Sua flinched.", "“I’m sure you heard that she visited us for the opening ceremony. With how busy she is, do you think she really came all the way to Eva just to bother a former employee?”", "The smile on Jung Sua’s face finally began to wilt.", "“Like jeez, I’ve never heard anything so absurd. I mean, I get that you’re high-spirited with the queen’s trust, and it’s also true that it’s difficult to touch you or Evangeline. But that’s not the only available method.”", "Kim Hannah flipped a few pages.", "“Here it is. Your father’s name is Jung Hwansung. He’s still alive and healthy, working for Sinyoung Engineering for the past 24 years… Iya~ What a small world. He’s an employee of our affiliate company?”", "Once Kim Hannah brought up her family, sparks flew from Jung Sua’s eyes.", "“Do you think this will scare me!?”", "TANG! She slammed the table and shouted.", "“Go ahead, fire him if you want! My father is nearing retirement anyway. Do you think I’m not capable of basic filial piety?”", "“Oh my, I didn’t know you were so pure.”", "Jung Sua winced. The corner of Kim Hannah’s mouth curled up into a dirty smile.", "“An unfair dismissal was the best you could come up with?”", "Jung Sua’s eyebrows twitched.", "“Excuse me, Miss Jung Sua?”", "Kim Hannah leaned forward halfway.", "“You must be too young to realize.”", "She lowered her voice and continued in a whisper.", "“In South Korea, mentally and physically disabling a healthy person isn’t difficult at all.”", "“What—”", "“There are also tons of ways someone could be framed as a criminal and be banished from society.”", "Jung Sua’s face trembled faintly.", "“W-Why are you doing this.”", "“I know you know the answer.”", "“I said I was innocent!”", "“Right, right, sure you are~”", "Kim Hannah picked her ear.", "“Let’s see, your mother, Shin Chunja, is a middle school teacher. Oh? It’s almost time for her retirement. I hope she doesn’t get into any trouble so she should go through voluntary retirement.”", "“Stop! Stop it! Do you have any idea how hard my mother worked—”", "Jung Sua screamed in shock.", "“The son is Mister Jung Seunggi? Hwadong Pharmaceuticals? Now that’s a name I’m familiar with. Sinyoung is the undisputed king in the pharmaceutical industry right now, so this shouldn’t be difficult. Let’s see, the first daughter, Miss Jung Shiyeon, is a Gunjung University grad student. A tutor would be perfect for her.”", "Kim Hannah flipped over the pages nonchalantly.", "“You’re the youngest, Miss Jung Sua? What a shame that you don’t have a younger sibling. If you had someone going to school, I could have made their school life a true wonder.”", "Though she knew it wouldn’t work, Jung Sua shouted frantically.", "“How can you touch my family!? Because of mere Paradise…!”", "“Mere Paradise?”", "Kim Hannah laughed.", "“Wow, you incited someone into committing murder and that’s what you say? Well, I understand that you want to seem like a kind, model daughter… but are you really that retarded?”", "Kim Hannah finally showed her true colors. Hearing this direct insult, Jung Sua’s expression turned cold.", "“…You bitch.”", "“Oh?”", "“Dirty, disgusting bitch!”", "“Mm… I’ll add that to my list of motherfucking bitch, cruel heartless bitch, vicious bitch, and so on. Well, I admit it fully. I’ve heard all these at least once. But are you any different?”", "Kim Hannah replied shamelessly.", "“You…!”", "“Don’t think too badly of me. My motto is an eye for an eye, a tooth for a tooth. You touched Valhalla which is like a family to me. Technically, I will have to mess with Evangeline for accurate calculations, but…”", "Kim Hannah took a little pause and glanced sideways.", "“So…” Jung Sua gritted her teeth. “You’re saying you will mess with my family no matter what.”", "“Pretty much. I can’t do anything about your family on this side, so I’ll have to at least attack the family on the other side. Your father, mother, oppa, unni— all of them, of course.”", "Jung Sua was no longer listening.", "Drrrk! She shot up while dragging the chair roughly. After panting in anger for a long time, Jung Sua spat out furiously.", "“You made a mistake.”", "“Mistake? We are far stronger on Earth. What are you going to do about it?”", "Kim Hannah returned the exact same words Jung Sua said to her. Jung Sua’s mouth twisted.", "“I told you, didn’t I? This is not Scheherazade. This is Eva’s royal palace.”", "“I know where I am. I’m just curious what you’re going to do.”", "Kim Hannah rested her chin on the back of her interlocked hands and shrugged.", "Jung Sua’s expression distorted.", "“Do you think I will surrender to such an underhanded threat?”", "“It worked wonderfully before. Everyone who talked like you, they all gave up in the end.”", "“…Oh yeah?”", "Jung Sua turned around as if there was no point in speaking more.", "“You messed with the wrong person.”", "“Huaaaam.”", "Kim Hannah tapped her mouth and yawned in a big motion. Jung Sua glared at her with sharp killing intent before stomping away.", "As she made her way to the grand hall, tears suddenly burst out. The massive humiliation she suffered stimulated her entire body and forced her to cry.", "Jung Sua headed to the grand hall while crying quietly.", "“Your Majesty!”", "As soon as she saw the queen in the distance, she ran forward and grabbed Charlotte Aria. Crying her heart out, she confessed everything Kim Hannah said just now.", "“So you’re saying…”", "Charlotte Aria spoke in a trembling voice.", "“Kim Hannah threatened you?”", "“Yes!”", "Seeing that the queen was furious, Jung Sua nodded her head as if she had been waiting for this moment.", "“She told me to leave quietly! Otherwise, she would mess with my family!”", "“Family?”", "Charlotte Aria cut her off and asked back.", "“By family, you mean your one and only younger sister?”", "“Ye… Yes!”", "As she agreed in the heat of the moment, Jung Sua felt that something was out of place.", "The queen’s attitude was somewhat different than usual. Rather than throwing a fuss and asking what this was about, she was extremely calm.", "Moreover, her eyes seemed to be tinged with great sorrow as she stared back at her.", "“That’s… good to hear.”", "“…Pardon?”", "“You said your parents passed away when you were young and the fight over the inheritance made you fall out with all of your relatives.”", "Jung Sua blinked rapidly.", "“Since you don’t have an older brother or an older sister, you can just focus on looking after your younger sibling. With your ability, taking care of one person should be easy.”", "What was this? Why was she suddenly like this?", "The answer was revealed soon. Seol Jihu, who was standing next to Charlotte Aria, raised his arm. In his right hand was a faintly flashing crystal.", "‘A communication crystal?’", "Looking at it closely, it was reflecting a familiar scenery.", "The moment Jung Sua realized it was the room she just stormed out of, shock spread out inside her pupils.", "Shortly afterward, the scenery inside the crystal slowly changed. As the crystal showed Kim Hannah waving her hand with a kind smile—", "“Ah.”", "Jung Sua’s eyes split open, and her mind went blank."]}