{"cid": "85", "title": "Chapter 85. Panic Room", "content": ["“Uwaaaah-!!”", "Chohong cried out. She managed to shove away Kazuki grabbing her arm to restrain her and dashed out, only to slam into someone else and ungainly tumbled backwards. Cinzia, with a cigarette hanging on her lips, was looking down at her with somewhat surprised eyes. They had returned, in other words.", "“What is….”", "Cinzia quickly closed her mouth. A total of seven people had returned. Six people went there initially, so at the least, it meant the team succeeded in rescuing one person.", "“Lawrence! It's Erica Lawrence!”", "“Richard Hugo is there, too!”", "The waiting contingent of people discovered the rescued captives and cried out in elation. However, their cheers didn't continue on for long.", "From the get-go, the success rate of this mission was deemed low. However, the atmosphere of the team that had rescued two captives was especially downbeat, more so than expected. It was as if looking at a bunch of dazed, soulless people.", "Cinzia's eyes, meanwhile, drifted off towards Ian's sweat-soaked face, now distorted into a sorrowful expression of defeat as he breathlessly panted out. Only then did she realize that the rescue team was lacking someone.", "“Ian! Iaaaaan!”", "Chohong had been sitting on her butt, looking dazed, before recovering her wits to rush towards the Magician.", "“Hurry! Hurry and reactivate the magic circle! Nooow!”", "The moment she grabbed him by his collars, Ian crumbled like a straw. It was because he had exhausted all of his mental power maintaining the magic circle.", "“Get up! You gotta get upppp!”", "Chohong cried out in desperation. The surrounding people began to murmur unsteadily. Cinzia hurriedly entered the boundaries of the magic circle and forcibly suppressed Chohong. She threw out a question while pushing down the crazily-resisting woman.", "“Ayase Kazuki, what happened?”", "The Japanese man couldn't open his mouth for a while. He was famed for his cold, collected demeanor, but right now, he looked just as confused as everyone else here.", "“….First of all.”", "Kazuki finally broke his long silence and spoke in a low, quiet voice.", "“We were able to get this far in the rescue mission all thanks to that young man. From the beginning until the end.”", "Cinzia immediately knew who this 'young man' was.", "“I know that.”", "“We didn't want to give up until the end. He and I remained until the end of the allotted time and searched everywhere. Because of that, we were able to rescue Richard Hugo and Erica Lawrence, and also, could save Ayase Yui, Ibrahim Ali and Edward Dylan in time.”", "This meant that the Earthlings were somehow been all rescued in one way or the other.", "“What about Teresa Hussey?”", "“The Princess was….”", "Kazuki faltered in his words and couldn't continue.", "“….He couldn't end his search even if she was nowhere to be found and he overshot his time limit?”", "“No.”", "Cinzia's guess was met with a needlessly sharp rebuttal from Kazuki.", "“It seemed that the Princess was being held as a prisoner by a high-ranking Parasite.”", "“A prisoner, is it?”", "“Yes. However, he managed to successfully rescue her. Even though he was discovered in the middle of his escape, he somehow broke through their dragnet and made it out of the prison block.”", "“There was a high-ranking Parasite present? No, hold on. He got discovered but still managed to escape?”", "Cinzia blinked her eyes. She was only half-convinced when she heard the news of the Arden Valley incident, but what with Kazuki being so serious like this, she had no choice but to believe.", "“So, what happened, then? If he escaped, why isn't he here?”", "Kazuki helplessly shook his head.", "“….I'm not sure.”", "“What?”", "“Damn it! I really don't know what happened. Yes, he was cutting it really close, but I was certain that he'd make it. We blew up the sky bridge and delayed the enemy's pursuit and sniped every single flying creature. And he was just about to safely enter the hideout, but…..”", "Kazuki pushed his bangs up. His forehead was soaked in sweat.", "“He was about to, so what happened next?”", "It was Agnes asking the question next. Kazuki's expression remained at a loss as he replied to her.", "“What I saw was…. Seol was running while carrying the Princess in his arms before he suddenly faltered.”", "“Are you saying he fell?”", "“No, it didn't look like he tripped and fell. If he tripped on something, the momentum from his running speed would still ensure that he…. Ah.”", "Kazuki's eyes narrowed to a slit, and he continued on with a half-convinced, half-unsure expression on his face.", "“Just before he entered the room, I think I heard a sound similar to a gunshot.”", "“A gunshot?”", "“That's the best I can describe. Even I can't be certain of this.”", "Upon hearing the word 'gunshot', Cinzia sneaked a glance at Agnes.", "Before anyone had noticed it, the surroundings had fallen deathly silent. No, Chohong was still loudly shouting at the top of her lungs. And also….", "“…..”", "Agnes quietly squeezed her eyes shut.", "*", "'He' missed them. No, should 'he' say that they simply disappeared without a trace?", "In all honesty, a handful of livestock escaping wasn't something to lose sleep over, as far as the high-ranking Parasite was concerned. However, it was a different story altogether when it came to Teresa Hussey. She was a royalty of Haramark, one of the seven kingdoms that played a pivotal role in the human faction. And more importantly, she also was in contract with the seven gods, as well.", "Once upon a time, the Parasite Queen lost her war on a certain planet. She fought against a powerful god and was soundly defeated. She managed to barely escape with her life and somehow ended up in Paradise where she set up a new base. She then rapidly expanded her influence and devoured the Chief Deity of this world to restore a portion of her powers.", "However, that was far from enough. She sought after absolute perfection for the sake of vengeance, and as a result, she craved after more power. To facilitate her goal, she wanted to absorb more gods. It was rather obvious that she'd be curious about the seven remaining gods of Paradise and to devour them too.", "In other words, the secrets Teresa Hussey possessed were a type of tribute for the queen. Even if the secret itself turned out to be useless, it could still become a proof of this high-ranking Parasite's worth. If things went well, it could have gotten an opportunity to evolve into an even higher being.", "Under the determined drive to not let her escape, it mobilized not just the forces underground, but even those elite creatures guarding the surface in order to track her down. According to its calculations, she should have been captured by now from the horde of Parasites flooding the first underground floor.", "Unfortunately, her escape speed was beyond its expectations, and its actions ended up becoming a waste of energy, instead. It reflected on its mistake, knowing that she should have been presented before the Queen upon her initial capture. The desire to evolve blinded the creature into holding the human woman as a captive to torture information out of her. It never dreamed of things turning out this way.", "“Grrrrr…..”", "The unknown Parasite crossed the restored sky bridge and entered the research area. After clapping its eyes on the hideout, though, it could no longer hide its fury.", "“Kuuuuuaa!!”", "It couldn't figure out how the rats managed to infiltrate the base, but this….", "This laboratory located in the former Delpinion Duchy was a critical strategic point and a military base for the future invasion of the human faction. Even more importantly, though, the plan of mass production actually began from here, so one could even say that this was the headquarters of all the mass production facilities out there.", "In order to get to the basement, one simply had to go through the surface first. And that was why the surface area was being strictly guarded, but now….", "“You damn rats!! How dare you resort to trickery like this?!”", "The high-ranking Parasite flew into rage before discovering a pool of blood near the bookshelf. The sniping seemed to have succeeded, but no one seemed to know what happened afterwards. What was certain, though, was that there was nothing to find nearby here.", "“Find her! Turn this place upside down and bring her to me!”", "Since the ones guarding the surface had all come down to the basement floor, there was hardly any room left to move, but under that command, they noisily scattered to all corners of the facility.", "The high-ranking Parasite breathed angrily for a while before stomping on the altar in the middle of the hideout.", "CRACK!!", "Just as the magic circle was shattered into fine dust…", "Rumble….", "Suddenly, the interior of the hideout shook around just a little.", "No, that didn't seem right.", "“?”", "The high-ranking Parasite raised its glare up to the ceiling. It could have been nothing, but the ceiling seemed to have trembled a little bit just now.", "“….Keuk!”", "However, this creature soon reverted his attention back to the manhunt. It spun on its heels and left the hideout.", "*", "Going back slightly in time, just after Seol Jihu was sniped.", "“Ah-aahk!”", "Tumble!!", "Teresa Hussey was thrown away without any warning. Obviously, she was completely dumbfounded by this development.", "She failed to understand what happened. The end goal was almost within reach, but then, her body went airborne all of a sudden before slamming into a wall. It was difficult to say that the person carrying her had simply tripped and fallen because she felt something akin to a large impact force being transmitted to her the moment she became airborne.", "“Ouch….”", "She somehow regained her wits but freaked out again after clapping her eyes on the young man collapsed on the floor, trembling intermittently with his arm reaching out towards the empty void.", "“A-Are you alright?!”", "She crawled to where he was and sucked in a cold breath after discovering his current status. She wasn't sure what hit him, but a copious amount of blood was bubbling out from somewhere below his upper torso.", "“A h-healer!!”", "She reflexively looked into the hideout before she became utterly dazed. Those people, wildly gesturing at the two to come quickly only until a couple of seconds ago, were no longer there. The magic circle was not emitting any light, either. There's no way they had abandoned her and Seol behind when the two were right in front of them, so this could mean….", "'Hang on, they were in a rush, weren't they?'", "There must have been a reason that she wasn't aware of. Teresa Hussey's thoughts arrived there and rather than be at a loss, she decided to make a move. She had to do something, anything, rather than standing around in a daze.", "Firstly, she dragged the young man's shuddering body away from the enemy's line of sight. Then, she very gently scratched the location of the bleeding with the spear oozing with icy coldness. Ice spread out in an instant to cover up his wound.", "Next up, she firmly but gently grasped Seol Jihu's head with both of her hands and looked straight into his eyes. His irises were quaking around like lone leaf against stormy winds. He gasped out repeatedly as if he couldn't breathe, and his dark irises tried to go upwards, showing the bloodshot whites below. It was the tell-tale sign of him going into shock. Most likely, he was not understanding his current situation.", "“Seol? I need you to listen to me.”", "She pressed her face closer to his ear and spoke to him, making sure to enunciate every word clearly.", "“It looks like we failed to escape. However, we came this far and I'm not planning to die like this. Please, come back to me! Wake up!”", "The chaotic trembling of his confused eyes gradually lessened. He dazedly looked up at her before coughing out a mouthful of blood.", "“Seol!”", "“Keuh…. Keu-reuhk…!”", "Even though bubbles of blood oozed out from his mouth, he began searching around. Teresa saw him rummaging around his pockets below and hurriedly slid her hand in one of them. That's where she found a piece of paper folded in half.", "She pulled it out to find a map. His trembling hand then pressed to a certain spot and, with a shaking finger, drew a broken, unsteady line. The winding, bloody line stopped at a different spot on the map.", "“Dummy?”", "Right next to where his finger came to a stop, there were a couple of lines on how to enter this space. Teresa Hussey's eyes gleamed brightly. For some reason, it felt like he was telling her to go there.", "There was no time to waste. Even if the sky bridge had been cut off, they were still in the middle of the enemy camp. It was pretty obvious that they would come knocking very soon.", "'This spot is where we are currently, and….'", "“Keuk!”", "While grasping the map tightly, she used the wall behind her as a support to push herself up. Although it was hard to control her own body right now, she was not planning to leave this young man behind.", "'Because of me, he…'", "Somehow managing to help him up, Teresa Hussey began laboriously stepping forward, one step at a time.", "*", "“It's a dummy hideout.”", "The village head rubbed his nose.", "“What do you mean, a dummy hideout?”", "“I told you before, haven't I? I'm a meticulous person.”", "The village head smirked confidently.", "“The day they issued the order to shut down the laboratory, I was immediately expelled from the research itself.”", "“You told me that you were the loudest opposing voice.”", "“That's right. They pretended to ignore me, but I'm sure they marked me as someone to keep an eye out for.”", "The village head continued on.", "“Let's go back to the main topic, shall we? The hideout you're going to use will be a bit cramped. Actually, it's a bit ambiguous to call that room a hideout, to begin with. However, the dummy hideout is a different story altogether.”", "“?”", "“Just its location alone, it's located in a place as deep as the third underground floor. The entry procedure is complicated, and it's been designed to withstand some hefty impact. I'm pretty sure it can even withstand the Dwarves' Thunder. I really paid a lot of attention to that room.”", "“But, you worked that hard on a mere dummy hideout?”", "“It's not 'mere', young man.”", "The older man shook his head.", "“That's how you get to perfectly fool others. I created that place thinking that it'd be found out eventually. However, if the hideout is too amateurish, what would those discovering it think?”", "“Mm… Were you worried about them being suspicious?”", "“That's right. I'm supposed to be a famous Mage, so if I did things half-heartedly, they would have suspected me even more. That's why I decided to use that stereotype against them.”", "“Aha. Something like it being the darkest below the lamp, right?”", "Seol Jihu let out an amazed gasp.", "“Indeed. Now, think about it. Who would ever imagine that a Mage known to be meticulous and thorough in his planning went ahead and created a hideout right behind his own bookshelf, a place right under everyone's noses?”", "The village head smirked again.", "“That's not all. Besides fooling others, I also had a need for a second hideout. Well, escaping isn't the end of the story, is it?”", "“Are you talking about the possible pursuit?”", "“Right. Long story short, the second hideout also has a transfer magic circle.”", "Seol Jihu's eyes gleamed brightly.", "“However, it'll be for the best that you don't use that one.”", "“But, why not?”", "“It's connected to somewhere in the center of the Empire. Well, if you want an audience with the Parasite Queen, you can go ahead and use it.”", "The location the village head escaped to was the vicinity of Haramark. In other words, the dummy hideout had one more trickery built-in to fool the potential pursuers.", "“….You really have thoroughly prepared for all events, haven't you?”", "“Against the Empire and the Duchy, yes, doing that much was a must. At the time, I even thought that it might not be enough.”", "Seol Jihu smiled wryly in reply.", "“In any case. I'm telling you about it just in case, but I'll pray that you wouldn't have to use that hideout during your mission.”", "The village head spoke in no uncertain terms.", "“The moment you close the door, that hideout will become a completely isolated space. There is no escape route out of there. It's a totally useless place during your mission, understand?”", "“You don't have to worry. 30 minutes is already pretty tight, you know.”", "The village head nodded absentmindedly and smacked his lips a little before murmuring with a slightly lower pitch voice.", "“….Indeed. You probably have no reason to go there, unless you find yourself in the absolute worst possible situation.”", "*How much time had went by?", "He opened his eyelids, his vision fuzzy and indistinct. He felt dizzy as if dark and white things were dancing around the edges of his eyes.", "In the end, he closed his eyes again. His neck, back, butt, and calves – the sensation of the floor supporting those four spots was cold and hard like stone.", "Somehow grasping onto the slender fabric of wavering consciousness, Seol Jihu woke up, only for his expression to crumple in an instant. The enormous outpouring of pain was one thing, but his body also felt quite different compared to before.", "“Keuk, keuh….!!”", "He tried to focus his mind and ended up gasping out a moan from all the pain attacking his body. He was suddenly reminded of the sensation he felt moments before entering the hideout. He wasn't sure what got him, but hell, he thought his shoulder had been blown clean off back then.", "However, it kind of felt like the insane pain had softened by just a tad now. Specifically, the shoulder joint and the waist on his left side felt quite cool at the moment. It was as if ice packs were pressed there before being taken away. However, the body parts above them were pressed by something soft and warm. This unexplainable warmth was being transmitted to him.", "It was cold but warm? What could be the reason for these completely contradictory sensations existing together?", "He could only open his eyes again a long time afterwards. The thirst scratching his throat prompted Seol Jihu to slowly shift his eyes this way and that. Only then did he begin wondering, 'Where am I?'", "The last scrap of memory he could recall was the face of Teresa Hussey. He summoned up every single willpower to point out the second hideout, and…. And, he couldn't remember what happened next. He must've blacked out.", "'Just what the hell happened here….?'", "Where was this? How long had it been? Were they even alive? Once he got used to the pain to some degree, questions started rising up one at a time.", "One of the first things his blurry eyes caught was his partially-destroyed armor over to the side. It served him so well since he bought it in the Neutral Zone, but now…. Next up was the miniature chain mail, visibly bloodied and with a gaping hole on the side. Suddenly, he felt fearful of looking at his own body's condition.", "'Hang on.'", "His armor was off his body?", "Seol Jihu groaned in pain. He wanted to see what the current situation was, but he feared that moving only a little bit would subject him to an unimaginable torrent of pain. Also, his left side felt heavy too, as if he was being confined by something.", "'Am I a prisoner?'", "His breathing was shallow and hurried as he forced his half-closed eyelids to open up. The fuzzy vision cleared up almost instantly.", "Seol Jihu slowly lowered his gaze. And he saw his naked body, with the sole exception of his underwear. The clothing he wore beneath the chain mail had been used up as bandages wrapped around his left shoulder and his body.", "'The Parasites wouldn't stop the bleeding of their prisoners now, would they?'", "“M-mng….”", "It was then, he heard a nasal moan tickle his body and shifted his gaze over to his left side. His puzzled face soon morphed into one of sheer dumbfoundedness.", "“….”", "And there he was, wondering why he felt so heavy until then. It wasn't just him imagining things – Teresa Hussey's naked body was hugging him tightly.", "Although he was somewhat distracted by the sensations of twin voluminous peaks as well as their inviting suppleness, he soon regained his calm. She was doing this for the sake of sharing bodily warmth. From all his body parts screaming out in pain, he could easily guess that he had been wounded pretty horrendously.", "'Which means, this emergency treatment was done by….'", "Finally, he could figure out what their current situation was. One of them being, he was neither dead nor captured by the enemy. Meaning, Teresa Hussey had successfully arrived at the second hideout. Along with him in tow.", "'Whew….'", "No matter how many times he thought about it, it just didn't make sense. He was almost there, yet what went wrong?", "Seol Jihu licked his dried lips before trying to calm his agitation down.", "For sure, the future prospect was still bleak. However, he managed to survive. And it seemed that the Parasites had not discovered this place, either.", "Seol Jihu felt relieved for the time being and thanked the village head in his mind. And then, he quietly whispered to Teresa Hussey.", "“Princess?”", "“H-ng…. Mm?”", "Teresa Hussey opened her eyes."]}