{"cid": "421", "title": "Chapter 421. If a Different Choice Was Made (2)", "content": ["Why, why, why, why!?", "Roe Scheherazade’s mindless screams, the pent-up anger that burst out, became an echo that continually struck everyone’s ears.", "She clenched her fists tight and panted for a while.", "When she eventually raised her head…", "“…I know.”", "She looked down at Seol Jihu and smiled faintly.", "“Of course, I know. I’m acting like a child who’s throwing a tantrum.”", "“Yes, you did not do anything wrong, Representative Seol.”", "“You just did not choose me.”", "When Seol Jihu met Roe Scheherazade that night, she certainly gave him a hint. Though she did not say anything directly, she asked why he had left Sinyoung standing.", "Would he have done things differently if he knew Roe Scheherazade’s story? Even after the contract was signed?", "Seol Jihu couldn’t come up with an answer easily.", "“It’s not like I could have said, ‘I will cooperate with the Parasites if you don’t destroy Sinyoung!’”", "Roe Scheherazade snickered and pushed her hair back.", "“I know it’s not right to resent you. I know that, but you just can’t help how you feel.”", "“Once you fall into the abyss and drown in the swamp of despair for a long time…”", "“You just end up hating everything, without reason.”", "Roe Scheherazade slowly straightened her back.", "“My sworn enemy is in front of me, alive and well, yet there’s nothing I can do.”", "“I’m being torn apart every day, but no man or god is willing to help me.”", "“Nation? People? How is that any of my concern when I’m about to die of frustration!?”", "“Huh…? But I suddenly see hope. Really? Really?”", "“Ah… in the end, nothing’s changed. I have to keep living like this…”", "Despairing, and despairing again.", "“Ah, what a shitty life.”", "“Why do I have to live like this?”", "“Because this is the world I live in?”", "“Ah, is that it? I see. Then…”", "At the end of her never-ending despair…", "“This damned world, to hell with it.”", "Only hatred remained.", "“Fufu, fufufu….”", "Roe Scheherazade chuckled silently.", "After rambling on like a crazy person, her expression turned fierce like a wicked demoness that would not exist again under Heaven.", "“Today, I’m finally one step closer to achieving my dream.”", "With an unburdened face, she spoke joyfully.", "“The Imperial Oath is split into three steles…. Although I haven’t obtained the one inside Gorad Boga, the five Commanders here have said that taking it out wouldn’t be a problem if they joined hands. The Parasites already have a stele in their possession…”", "With this, the Parasites had secured two of the three steles.", "“So, where might the last one be~?”", "Roe Scheherazade spoke mockingly with a smile.", "“Well, it’s fine even if you don’t tell me.”", "She then shook the necklace in her hand.", "Realizing what she was implying, Seol Jihu clenched his teeth.", "“I wanted to command the gods to bring the last stele to me…”", "Roe Scheherazade glanced at the necklace and shrugged.", "“But it turns out that’s impossible because the stele was made by the Chief Deity, whose rank was higher than the Seven Sins.”", "Of course, that didn’t mean there was nothing she could do.", "“But I’m sure they can tell me where the last stele is hidden.”", "Baek Haeju’s eyes widened.", "“Because not even the gods can defy the Royal Oath!”", "After shouting loudly for everyone to hear, Roe Scheherazade bowed modestly.", "“Well, I’ve done everything I wanted to do and said everything I wanted to say. That’s it from me.”", "“….”", "“I don’t know how long it will take until the stele can be taken out, but I’m looking forward to seeing your faces when that happens.”", "She walked away from the wall, snickering.", "“…Ah.”", "She then came to a sudden stop and turned her head halfway.", "“It would be a shame to say goodbye like this… so why don’t I give you one last chance?”", "A broad smile appeared on her face.", "“Maybe it’s not too late for an act of good faith to change my mind… Who knows? Maybe I’ll have a change of heart and hold off on using the Royal Oath.”", "“…Act of good faith?”", "“Yes. For example, presenting those bastards with deaths that go beyond the humiliation I suffered. Make them die a ghastly, horrific death.”", "“….”", "“Of course, it won’t be enough to just kill that bitch, the previous executive director, and the executives that violated me. Far~ from enough. If you can make everyone related to Sinyoung… no, if you can make every single one of their family members suffer the same thing I did…”", "Roe Scheherazade licked her upper lip while looking down at Yun Seohui.", "“Then maybe my heart can be somewhat appeased. Well, there’s plenty of time, so I’ll wait at ease.”", "Simply put, she wanted Sinyoung to be destroyed in both Paradise and Earth.", "“Hohohohohohoho!”", "Roe Scheherazade suddenly burst into laughter and walked off.", "“Well, shit, I know that women are notoriously fickle, but you’re not really going to do what this woman wants, are you?”", "Sung Shihyun, who was crouched down beside her, sprang up.", "“Like, really. To use a Royal Oath, you need proper authority, namely the rightful ownership over it. Since the transfer of ownership is only acknowledged when the owner does it unhindered, it’s meaningless to brainwash the owner. There’s nothing we can do if she really changes her mind.”", "He dusted his butt and pretended to be worried.", "Still, messing with the executives’ family members was simply absurd. They likely didn’t even know about Paradise’s existence.", "“Anyway, try your best. Oh, and let me give you a piece of advice. Don’t just sit around here. Not unless you want the other five cities to get ransacked.”", "Sung Shihyun smirked and then turned around.", "The other Army Commanders began to turn around one by one and walked down the wall.", "Baek Haeju glared fiercely as Sung Shihyun walked down the stairs. The Sung Shihyun she knew would have been antsy to try to talk to her or Seo Yuhui. However, he did not spare them a single glance.", "He only had his eyes fixed on Seol Jihu.", "From beginning to end.", "That’s what worried Baek Haeju.", "Because his eyes from just now were the same eyes he had when he devised the Parasite Queen Expulsion Plan and caught the Parasite Queen off guard.", "*", "The incident came to a close.", "With Roe Scheherazade and the Parasite Army Commanders gone, the city became depressingly quiet.", "No one dared to utter a word.", "“…Damn it!”", "Kwang! Chohong then spat out a curse and swung the Thorn of Steel. Despite the weapon receiving an 8x enhancement, not even a single scratch was made on the barrier surrounding the city.", "“Agh…”", "Hugo made a rare, troubled expression.", "“I’m not sure I understand everything, but…”", "He rubbed his forehead hard and sighed.", "“We’re kind of screwed, aren’t we?”", "Indeed, they were in a pretty shitty spot.", "To secure the stele, they had to reclaim Scheherazade. But not only were five Army Commanders holding the fort, but it was also the middle of enemy territory.", "There was a chance of success if the Federation and humanity joined hands to besiege the city and launch an all-out attack, but the activation of Gorad Boga made attacking the city an impossibility.", "There was nothing they could do to stop the Parasites from taking the stele inside Gorad Boga.", "“Fine, let’s just give up. Since we’re screwed as far as this stele goes, we might as well forget about it and form a new plan. But before that…”", "Huu, huu. Hugo took deep breaths as if to lower his rising blood pressure. Then, he aimed his halberd forward.", "“Let’s take care of this bitch first.”", "He growled fiercely while glaring at Yun Seohui.", "“Is this bitch even human?”", "“….”", "“How can you do something like that to a widow? Ah, you guys were the ones who killed her husband in the first place. As if that wasn’t enough, you made a queen serve alcohol at drinking parties? And you drugged her and made her do what in front of her deceased husband’s portrait?", "“….”", "“Is that something a human being would do? Not even a beast would do something like that!”", "“I agree.”", "Kazuki chimed in. He usually stayed out of such matters, but it seemed he couldn’t control his rage this time.", "Though it might be too result-oriented, the one-in-a-million opportunity to hinder the Parasites’ invasion with Gorad Boga and launch a counterattack was blown out of the water.", "In a way, Sinyoung had done the same thing Raging Temperance did.", "“Looking back, it’s not just this incident. There hasn’t been a single incident where Sinyoung wasn’t involved. They’re the root of all evil.”", "Kazuki continued in a cold voice.", "“Of course, Sinyoung was destroyed with Scheherazade falling, but it’s not as if they were wiped out. It’s best that we get rid of them once and for all before they do any more damage. Before it’s too late.”", "“That’s what I’m saying! What do you say, Seol!?”", "Hugo turned to the side while shouting fiercely. Then, he paused.", "Seol Jihu was standing quietly without a word. He seemed to be in deep thought, but that might not be the case judging by his tense eyes and his shaking hands.", "‘Again…’", "Phi Sora gulped.", "Seol Jihu’s switch had been flipped on.", "Knowing what ends up happening whenever Seol Jihu’s switch went on, Phi Sora couldn’t help but tense up.", "“Sssspp….”", "A deep inhale was heard.", "“Wheeeeew…”", "Followed by a deep exhale.", "Next…", "“…Any news from the other cities?”", "A low voice with suppressed rage escaped Seol Jihu’s mouth.", "Phi Sora and others hurriedly took out communication crystals.", "“Eva is racing over with members of the Federation. They should be here by tomorrow morning….”", "“Haramark says they will be here late tonight.”", "“Odor is…”", "Kim Hannah seemed to have done her job well as most cities seemed to be close to arriving.", "“Let the other cities know what happened here without leaving out any detail. Contact the Federation too.”", "After calmly commanding the team, Seol Jihu shut his eyes. What Ian said suddenly crossed his mind.", "[Isn’t it surprising if you think about it? That such a trivial choice can change your fate completely!]", "Just like he said, a single, seemingly trivial choice had led up to this event.", "If he had chosen Roe Scheherazade back then, if he had made a different choice, would things have turned out differently?", "There was no way to know, but there was one thing he could be sure of.", "And that was that he was once again facing an important choice.", "Yun Seohui was still sitting on the ground. She was completely dazed.", "“Miss Yun Seohui.”", "When Seol Jihu called her name, her eyes, which were blankly staring at the ground, went up.", "Seol Jihu quietly got on one knee and got on her eye-level.", "“I’m going to ask you a few questions.”", "“….”", "“I’d like you to answer them truthfully. No, you better.”", "Once their eyes met, Yun Seohui’s throat trembled. Then, she barely nodded her head.", "“First.”", "Seol Jihu started right away.", "“Did you know about Roe Scheherazade’s situation?”", "“…Yes.”", "Yun Seohui bit her lower lip but gave an affirmation.", "“Did you order it?”", "“Definitely not.”", "“You didn’t order it, but you knew about it. Why didn’t you stop it?”", "“…Because I was scared.”", "It was an expected reply.", "“You mean you were afraid of exposing your family’s wrongdoing?”", "“No, rather than that… I knew what would happen to me if I did.”", "“What do you mean? You’re Sinyoung’s executive director.”", "“You only say that because you don’t know my father and Sinyoung’s inner working.”", "Yun Seohui gulped.", "“Father handed over all authority to me and retired… but that didn’t mean the influence behind his name disappeared.”", "“Poisoning Gairos Scheherazade and doing those things to Roe Scheherazade… That’s right, my father was behind it.”", "“It hasn’t been long since I became Sinyoung’s executive director. At least, nowhere long enough to have the same level of influence my father does. Do you really believe my father would have stayed silent if I found fault with what he did?”", "“It’s not just Father. Dozens of top-level executives were involved in the matter. If Father steps in and receives their help, getting rid of me wouldn’t even pose an issue.”", "Meaning, there was nothing she could have done, and because she was afraid of losing her position as the executive director, she had stayed silent.", "“Second.”", "Seol Jihu moved on to the next question without picking at her words.", "“Did you plan the Valhalla Attack Incident?”", "“I thought I already gave my answer. Never mind planning it, I didn’t know anything about it.”", "“Third.”", "Seol Jihu continued without a pause.", "“Were you the one who texted me on Earth using Miss Yun Seora’s phone number?”", "“…That’s right.”", "“Why?”", "Hearing this question, Yun Seohui looked down helplessly.", "“Because I was curious.”", "“?”", "“I wanted to know what you thought about me and what you were going to do to me. That’s why.’", "“I remember the text message asking to meet up and talk. What did you want to do?”", "“Exactly that. Talk.”", "Yun Seohui clenched her teeth.", "“I wanted to try talking to you. Not with other people around, but just you and me, as people.”", "“….”", "“That’s why I texted you using Seora’s number. I thought you’d refuse if I asked to meet up. That’s all.”", "“…Alright. Fourth.”", "Seol Jihu didn’t dig too deep into the matter. He moved on as soon as he got a reply.", "“Why did you shoot my sister?”", "“…What?”", "Yun Seohui’s voice went up for the first time.", "“I won’t repeat myself.”", "“I didn’t do it. I didn’t order it either.”", "“It wasn’t you?”", "“Yes! It really wasn’t me. Really!”", "She protested as if this was the one thing she could not acknowledge.", "Chuckles rang out from the surroundings.", "“There she goes again.”", "“I’m sure it wasn’t you~”", "Yun Seohui’s brows went up. She turned left and right before looking up at Seol Jihu with a wronged expression.", "“Do you think I’m crazy? A psycho? Would I visit someone I tried to kill at the hospital and even go out of my way to accommodate her?”", "“You might since you failed.”", "“Hah!”", "Yun Seohui exclaimed and then gave Seol Jihu a stinging glare.", "“Let me be clear here. After signing that contract, I called HR Director Jung Minjong. This is what I said. I’m sorry, but I accepted Valhalla’s conditions. But don’t hold a grudge because I’m taking my suit off with you. Anyway, now that things have come to this, take responsibility!”", "“And Jung Minjong went missing after that?”", "“That’s right. I admit that your sister was hurt because Sinyoung couldn’t manage Jung Minjong properly.”", "Yun Seohui snorted.", "“Of course, there’s a chance that someone within Sinyoung conspired without my knowledge. At the very least, I can honestly say that I did not order anyone to hurt Representative Seol’s family!”", "“Hah, that’s how desperate you are to live, huh.”", "Phi Sora sneered. When Yun Seohui swiftly turned to the side and glared sharply, Phi Sora glared back.", "“Bitch, what are you so proud of? You better stop glaring, or I’ll pull those suckers out.”", "“…You don’t believe me?”", "“Of course, I don’t. Do I look like I was born yesterday? If you were me… eh?”", "It was then.", "While Phi Sora was sharply retorting, Yun Seohui suddenly began to rummage through her pockets. Phi Sora rushed forward in case she was trying to pull something funny but paused in the middle.", "What came out with Yun Seohui’s hand was a piece of paper. She also took out a pen and began to write on the paper.", "Upon closer inspection, the piece of paper was a contract bestowed with the power of god.", "Yun Seohui got up and shoved the contract to Seol Jihu. He took the contract and read it slowly, finding that everything she had just said was written on it.", "She even wrote that she would receive divine punishment and die on the spot if there was even a shred of falsehood in what she said.", "“Done reading? There’s no problem, right?”", "Phi Sora, who read the contract over Seol Jihu’s shoulder, sharply raised her eyes.", "Yun Seohui snatched the contract out of Seol Jihu’s hand and signed her name before anyone could stop her. She even bit her finger and stamped her thumbprint on it.", "Not once, but several times.", "No divine punishment fell from the sky.", "“So?”", "Yun Seohui spread her arms out.", "“Will you believe me now?”", "Now, Valhalla’s members were beginning to doubt themselves. They firmly believed Yun Seohui was behind it… but they were speechless after seeing Yun Seohui going so far to prove her innocence.", "Everyone, with the exception of Eun Yuri.", "“Oppa, do you…”", "Eun Yuri shut her mouth, stopping short of saying, ‘do you remember what I told you last time?’", "It was because Seol Jihu raised his hand. He then whispered something into her ear, and Eun Yuri backed off with a nod.", "“You think I’m desperate to live? No, it’s all over anyway. Why don’t you just kill me?”", "Regardless, Yun Seohui continued.", "“I’ll admit it. This incident happened because I neglected Roe Scheherazade to secure my position as executive director, and it’s also my fault that I didn’t keep a proper eye on my subordinate. Sure, I won’t feel too wronged if I die because of it.”", "Yun Seohui teared up and continued with a big but.", "“But as I said at the meeting and just now again… I swear I did not do anything to try and harm Representative Seol. Not once.”", "“….”", "“I wasn’t the one behind the Valhalla Attack Incident or the attack on Representative Seol’s family member… If you weren’t going to believe me, why did you save me in the first place?”", "Yun Seohui plopped down as if she couldn’t continue talking. Her red nose sniffled.", "“Just why?”", "After nibbling on her poor lower lip for a while, Yun Seohui asked with a choked-up voice.", "“Why does Representative Seol hate me so much?”", "“….”", "“Just why….”", "She then dropped her arms and head. Beads of tears fell to the ground.", "Seeing Yun Seohui’s trembling shoulders, Chohong shook her head and muttered.", "“Man, both you and that other bitch are really putting on a show today.”", "Meanwhile, Seol Jihu calmly looked down at the quietly weeping Yun Seohui.", "His eyes lit up faintly.", "[Yun Seohui’s Status Window]", "Summoned Date: 2013. 03. 22Marking Grade: SilverSex/Age: Female/26Height/Weight: 167.2cm / 49.6kgCurrent Condition: NervousClass: Lv 5. SaviorNationality: Korea (Area 1)Affiliation: SinyoungAlias: Sinyoung Executive Director, The Empress, Artificial Human Being, Brilliant Orator", "[2. Traits]1. Temperament—Social Cue (adept at reading people’s mind based on the situation)—Capricious (given to sudden and unaccountable changes in mood or action)—Manchild (actions and thoughts are like that of a child)—Selfish (concerned with one’s own benefits only)—Contrived (acting in a certain way to give a certain impression while not really being so)", "2. Aptitude—Synesthesia (sensitive to changes in other people's emotions)—Eloquence (gifted in speech)—Adaptable (Able to quickly and appropriately handle unexpected circumstances)—Tricky (crafty and resourceful)—Face Changer (Skilled in changing masks according to the situation)", "[5. Level of Cognition]Moderate (Actions and thoughts are sensible; hard-working) / Hopeful / Artificial Doll (an immature, thoughtless person who only appears to be human)", "‘Hopeful…’", "Seol Jihu drew a slight breath after confirming Yun Seohui’s level of cognition. The second slot reflected one’s current emotional state.", "Just what was Yun Seohui hopeful for at this point?", "Life? Or was it something else?", "That wasn’t all.", "There was one other difference since the time he saw her at Valhalla’s opening ceremony.", "‘Her color…’", "It had gone from five to one.", "This phenomenon could only mean one thing.", "The crossroads had been passed at some point and her future had been decided. In other words, Yun Seohui had decided herself.", "Of course, it wasn’t impossible for her color to change again. Still… Seol Jihu closed his eyes and calmly reached out his hand.", "“!”", "The pitifully weeping Yun Seohui suddenly flinched as she felt a warm sensation on her head.", "Seol Jihu had gently placed his hand on her head.", "His hand then moved from the top of her head to her cheek, from her cheek to her arm, and then from her arm to her hand.", "It was a chillingly soft sensation.", "Then, after reaching Yun Seohui’s hand…", "“Ah.”", "The hand slipped out.", "Yun Seohui blinked.", "She had expected Seol Jihu to help her up.", "No, thinking about it now, it felt like he smeared something on her.", "She raised her head while fumbling around her face. She then saw Seol Jihu giving a nod with his head turned.", "By the time Yun Seohui moved her eyes behind him, Eun Yuri completed the spell she was casting in advance.", "As she spun her index finger in the air, Yun Seohui’s line of sight also made a turn.", "“Eh…”", "After nodding once or twice like someone who was dozing off, Yun Seohui fell to the ground, unable to escape the sudden drowsiness that flooded in.", "“I’ll be off too.”", "When Seol Jihu nodded, Eun Yuri chanted another spell and then dropped as well. She had cast a sleeping spell on herself.", "The other members had confused faces. It wasn’t until Eun Yuri woke up that they realized Seol Jihu’s intention.", "“Oppa, Teacher said she will need more time…. Her willpower is apparently stronger than she anticipated….”", "Seol Jihu nodded as if it didn’t matter.", "He had given her a chance.", "Whether she would lie until the end, or confess the truth and show remorse.", "Of course, Yun Seohui even signed a contract to prove her supposed innocence, but that wasn’t enough to convince Seol Jihu. It was because he remembered what he and Eun Yuri talked about in the past.", "[Words have mystical powers.]", "[A soft answer turns away wrath. Sometimes the same word changes meaning depending on the context. You say one thing, and others will interpret it in hundreds of different ways.]", "He was convinced after seeing Yun Seohui’s status window.", "Yun Seohui was an eloquent speaker, someone who could create and alter the state of affairs with words.", "Now, it was time to find out Yun Seohui’s true intentions. No matter how incredible she was in the way of words, she would be like a child in front of Roselle and her magic.", "…In truth, he already knew the answer.", "How much time went by?", "Seol Jihu’s eyes lit up while he blankly looked down at Yun Seohui’s limp body.", "Yun Seohui’s eyes twitched. Soon, she slowly opened her eyes and looked left and right.", "Eun Yuri woke up immediately afterward.", "It seemed mental magic was a success, but Eun Yuri also relayed Roselle’s message that it would not last long and that he should hurry.", "“…Get up.”", "When Seol Jihu gave the command, Yun Seohui got up obediently like a doll. Drunk on sleep, she looked like she was having a dream.", "“Miss Yun Seohui.”", "Seol Jihu cleared his throat.", "“How do you feel right now?”", "He asked in a low voice.", "“….”", "Yun Seohui didn’t answer right away. She blinked for some time with a dazed expression.", "Then, the moment she blankly looked up at Seol Jihu…", "“…Heh.”", "Her previously despairing face twitched slightly…", "“How do I feel…?”", "And the corner of her mouth curled up slightly."]}