{"cid": "74", "title": "Chapter 74. King’s Wrath", "content": ["Everyone's steps came to a halt. Veronika looked behind her, puzzled.", "“Mm?” ", "“Ah….” ", "Seol Jihu's mouth bobbed up and down helplessly.", "'The color changed again.' ", "To be more specific, the cavern's color shifted to orange the moment the team decided to go further in.", "‘Do not approach!' ", "Suddenly, his throat dried up. The thought that he made a mistake raced through his brain. He should have been far more cautious from the get-go back when it was still yellow. But he got blinded by the allure of solving the mystery and ended up acting in haste.", "“What's the matter, leader?”", "“Let's go back.” ", "“What?!” ", "Veronika cried out in genuine surprise.", "“Are you serious? We came this far, but you wanna go back empty-handed?”", "Mikhail also displayed a similar reaction. Seol Jihu was about to say, ‘This doesn't feel right’, but quickly shut his mouth. He knew his gut-feeling wouldn’t convince them, especially since he was talking to a capable Archer.", "No, he needed a far better justification. Something that the other team members could agree on or, at least, understand the meaning behind. The problem was, he couldn't think of one on the fly.", "“…If my theory is correct, then this place is definitely one of the research centers I told you about. In that case, it will not be an easy place to explore.” ", "“But it doesn't look that way to me.” ", "“It doesn't even look like a laboratory, you know.” ", "He was hopeful, but sure enough, opposition was immediately raised.", "“Besides, even if there are enemies in there, it’ll just be more mutants. It's not like we can't fight them, right?”", "“We don't know if there's a higher-ranking creature controlling the mutants.” ", "“I wonder…. Even then, shouldn't we be able to win by combining our strengths together?”", "“I don't think that will be the case.” ", "“Look, it's great that you're being cautious, but don't look down on us that much, alright? All three of us are on the cusp of reaching Level 4. Maria and Chohong here are also just a step away from entering the ranks of High Rankers. Besides all that, aren't you also one hell of a fighter?\"", "Those words weren't wrong. In truth, this group was more than qualified to go on military expeditions. Seol Jihu formed the best team he could just in case, but never did he suspect that his diligence would come back to bite him like this.", "“Hold on, hold on! Seol? So what do you want us to do?” ", "Chohong quickly stepped forward as a mediator when the differences in opinion were threatening to boil over into something less civilized.", "“I believe there's no need to rush it. I simply wish to return to Haramark and bolster our overall combat potential before coming back.” ", "“Bolster our combat potential?” ", "“Right. I think we'll need at least one High Ranker with us. If we say we’ve uncovered the mystery, some will definitely show interest in joining us.” ", "“That's bull!” ", "Mikhail immediately opposed that idea.", "“What will you do if someone else discovers this place in the meantime?? We already dug out the whole place and anyone passing by can see it now! We worked this hard, yet you want to hand over the glory to someone else??”", "“It's only half a day's travel away. And it's not like there are other Earthlings in Ramman either.” ", "“You can't be sure of what'll happen in the future. Even if we follow your suggestion, that also poses another problem! It's the mystery, THE mystery! If we get ourselves a High Ranker, who do you think will hog all the limelight?” ", "“Mister Mikhail.” ", "“We got here after working our asses off, yet you’re telling us to watch someone else dine at our expense? Leader, please!” ", "Mikhail was completely, desperately resistant to the idea and pleaded with Seol Jihu to change his mind. The youth needed a superhuman level of endurance to suppress the words “That's not something you should be saying” that nearly jumped out of his throat.", "If there was one thing he learned from watching how Samuel operated back then, that would be to never lose one's cool regardless of the situation and to do your best to compromise and mediate the differing opinions. In all honesty, he already knew what kind of reactions he'd get the moment he spoke what was on his mind. It wasn't as if these guys hadn't done their part, either.", "'To think he told me it'd be fine to go back not too long ago….'", "Of course, there was a valid reason for the change in Mikhail's stance. If they hadn't discovered this place, fine – but now, the end goal was just within reach, so which sane Earthling would let go of this golden opportunity?", "Seol Jihu's lips were itching badly. He thought hard and long, but not one useful idea popped up in his head.", "'Should we just go in?'", "It wasn't 'Escape Immediately' or even 'Immediate Retreat Recommended’. Perhaps it wouldn’t be such a bad idea. ", "Such a thought entered his mind, but he quickly shook his head. A single mistake in 'Attention Required' was enough to get him killed, so there was no need to even think about taking on the higher level of danger the orange color posed.", "Which meant, there was only one option left to take.", "“It's still better than dying. No matter how much I think about it, this is wrong. We are going back.” ", "…And that would be to order them with the authority of the team's leader.", "“No, I disagree.” ", "Unfortunately for him, Veronika immediately raised her objection as if she was waiting for exactly this moment. Seol Jihu squeezed his eyes shut. During expeditions or explorations, headers possessed just as much of a right as the leaders to voice their opinion.", "“I can't pick up on any presence within that cave. None. Either mutants are waiting for us up ahead or there's nothing there like this place. It will be one of these two. Regardless of which, I believe it's the right decision to go further in. In fact, I don't see a reason why we shouldn't.” ", "Veronika's recommendation carried a lot of weight since they had been ably dealing with mutants earlier in the day. And, when opinions arrived at an impasse like this…..", "“Well, since the leader is so opposed to the idea….”", "Veronika studied everyone's reactions and cautiously continued on.", "“Why don't we decide it with a vote?” ", "Indeed, it was the voting time again. Seol Jihu glanced at Maria and Chohong. As long as these two supported him, the result of tie was a certainty.", "“Leader wants to go back, so let's call that 'for'. Mikhail and I want to go further in, so we're 'against'.”", "Veronika turned her head away and looked at others.", "“I'm against.”", "The first one to open his mouth was Gierszal, his arms crossed defensively.", "“At the very least, I think we need to confirm what's inside. Let's say we did as the leader said and went back to get ourselves a High Ranker. I'd imagine we'd land in real hot waters if we do that and find absolutely nothing inside.” ", "“He's right. That can happen.”", "Maria had been listening until then without saying a word, but now, she took their sides with a disinterested expression on her face. Seol Jihu felt his heart tumble down to the pit of his stomach.", "“We've got to think about the possibility of things not working out too. That's why I'm also 'against'. Don't think too badly of me, okay?” ", "So, one vote 'for', and four votes 'against'. The democratic process was over in an instant. Seol Jihu spat out a grand sigh as he heard Chohong clicking her tongue.", "All manners of thoughts raced past his brain. Should he reveal the existence of his 'Nine Eyes'? He was getting really tempted by that idea. However, he knew he should never do it. He was already under intense scrutiny by certain others, so if the word got out that he even possessed an Innate Ability, he couldn't even imagine what kind of crazy events might happen.", "'Should I then just say that I….' ", "…won't go in there with them?", "However, when that thought formed in his head….", "[That won't be allowed.] ", "Seol Jihu sank deeper into despair, and he recalled the words of a certain man, now gone from this world.", "[As long as you remain a part of this expedition, we must act as one, whether you like it or not. There are times when you'll have to do things that you don't want to, and you'll also have to back down regardless of your principles. If you continue to insist on doing whatever you want, then I can no longer recognize you as a member of the expedition.]", "Those were Samuel’s words.", "Hmm, Veronika cleared her throat and looked at the youth.", "“It's been decided, yes?” ", "“….”", "“Leader?” ", "“….”", "Seol Jihu remained quiet. Chohong scratched her temple in irritation, but eventually, she strode forward and put her hand on his shoulder.", "“Hey.” ", "“….Chohong.” ", "“Nothing you can do about it.” ", "“But….” ", "“I know. I know that it's the smart thing to listen to you. But these idiots don't know you all that well.”", "She had a point there. If these people had accompanied Seol Jihu to the Forest of Denial, then they would probably have given his suggestion far more consideration than this.", "Just like what Chohong said, he truly couldn't do anything about it. He was being too greedy for wanting every single thing to act according to his whims when the world clearly didn't operate that way.", "“Don't worry too much about it. This noona will protect you if shit hits the fan, okay!”", "Chohong heartily pounded him on his shoulders and made that manly declaration. He eventually nodded his head, but his expression was still frozen stiff. He didn't feel like smiling right now.", "*", "After getting back into the formation and having checked their equipment, the team cautiously went further into the underground cavern.", "Unlike his fears, though, they couldn't find anything. When they walked through that passage, they were treated to yet another large, empty dome-shaped area. Even the size of this chamber was similar to the previous one to such a degree that one could say they were copy and paste of each other. The sole difference being that the ceiling here was several times taller than the previous chamber. But that was about it.", "“Wow, this sucks out your enthusiasm all by itself, doesn't it?” ", "Mikhail formed a bitter smile.", "“I really can't tell what this place was used for. Doesn't resemble anything I can think of.”", "Gierszal looked deeply regretful too. However, it wasn't only them. Seol Jihu was also feeling rather flustered. Everywhere he looked, he saw an intense sea of orange, yet nothing was happening?", "“Hold on.”", "Veronika suddenly stopped looking around and knelt down on one knee to study the ground.", "“This is….' ", "Her eyes narrowed to a slit.", "“I found some kind of a trace here.” ", "“What?”", "Almost right away, all the team members gathered around her.", "“I found the footsteps of a person.” ", "Drop.", "“It's around three, four days old… Ah, that's cold!” ", "Veronika's eyes followed after the newly-discovered trace, only for her head to suddenly shoot upwards. Mikhail quickly asked her.", "“What's wrong?”", "“Uh…?” ", "She couldn't see anything on the ceiling. Veronika tilted her chin as much as she could to study the tall, tall darkness up above, but eventually, she lowered her gaze. While tilting her head this way and that, she touched her cheek.", "“What was that? A water droplet….?” ", "She was about to return to tracing the footsteps on the ground, but her complexion changed in an instant. The assimilation ability! Veronika hoped for the best and hurriedly looked up again. Inevitably, it happened then.", "From the ceiling's end, a massive, circular grey 'thing' slowly revealed itself….", "Whish, whish, whish!", "Immediately, dozens of tentacles shot out from its body and spread out all around them like an umbrella opening up suddenly. They descended on the group at a terrifying speed and shortened the distance between them in a blink. ", "In that split moment, Maria took out her crucifix. ", "Kaboom!!\nBoom, boom, boom, boom, boom, boom!!", "…And dozens upon dozens of tentacles pounced on the team. All of these happened in the blink of an eye.", "“U, uwuaahhk!” ", "Mikhail belatedly got frightened out of his wits and fell down hard on his butt, when tens of tentacles twice as thick as a person's arm began writhing viciously against the white barrier right in front of his nose.", "Chohong looked up at the enemy that finally revealed itself and dazedly muttered out.", "“…What the hell is a 'Nest' doing in here??”", "She looked completely shocked.", "“Fuck…. Fuck…!!” ", "In the meantime, Maria was spitting out cusses one after the other.", "“I, I don't give a fuck if it's a Nest or whatever, just do something…!!” ", "Her entire body shuddered pitifully and sweat poured out in buckets. Mikhail finally recovered his wits and hurriedly pushed himself off the floor. He tried to cut a tentacle in front with his sword, but he could barely nick it with his attacks. It recovered almost instantly the moment he swung his sword to damage it. The rate of recovery was incomparably quicker than any mutants they fought so far.", "“You fucking retards…!! Stop wasting time cutting at tentacles, hit the main body…!!” ", "Veronika quickly nocked arrows and let them loose. Her shots accurately landed on the main body of the creature but didn't even hurt it in the slightest.", "“Useless bitch!!”", "Maria gnashed her teeth and gripped the crucifix hard as if to crush it. She felt her heart might explode from frustration at this rate.", "Crack, craaaack…!!", "“….Ah…!!”", "In the end, cracks began forming on the protective barrier. Her expression turned uglier and uglier. She closed her eyes shut and tried to squeeze out every drop of her energy, but then….", "“?”", "Wuuuuueeeehhhh!!", "She heard a horrible cry coming from up above and the pressure on her lessened considerably. She opened her eyes just a sliver and spotted Seol Jihu and his raised right arm. He quickly rummaged through his bag and short throwing spears tumbled out in droves. The youth instantly picked one up and, after taking quick strides forward, threw his raised arm.", "POW! The spear flew and struck the body of the creature accurately. Only then did Maria notice that there were two spears stuck there. In other words, he had thrown one before. She finally spat out a breath of relief.", "The Nest let out a horrifying screech that was loud enough to shake the entire cavern after it was struck several times by the throwing spears. Disregarding that, Seol Jihu picked up yet another spear. Tentacles receded away as if they were colts scalded by a hot branding iron. He threw his spear as fast as he could, but it was deflected away by the retreating tentacles. He clicked his tongue and quickly shouted out.", "“Everyone!! Get out of the ca….?!” ", "He couldn't finish his shout. Four of the Nest’s tentacles were already blocking up the sole exit.", "Huuuuooong-!", "Immediately afterwards, the shadow cast by the Nest loomed larger and larger. All hair on his body stood up.", "Boom!!", "“Euhk!!”", "“Keuheuk!!”", "The ground undulated violently from the immense vibrations. The team members barely managed to regain their balance, but their expressions were not good at all. The only exit was now completely blocked up by the Nest. It was their mistake to venture deeper into the cavern, lured by the trace of someone’s footsteps.", "They didn't even have the leeway to blame Veronika. The grey-colored Nest filled up their view with its unimaginably huge size. Its height alone exceeded two metres, while its width was easily twice, thrice that. As if to show that it was a living, breathing entity, red and blue veins pulsed and wiggled all over its formless figure, with countless tentacles dancing all around it. Grotesque didn’t even begin to describe it.", "“This…. That's a mid-level Nest! Why the hell is a Parasite doing in here?” ", "“A mid-level Nest? A Parasite?” ", "Chohong muttered to herself in disbelief. Seol Jihu quickly picked up his spear up while asking her for clarification.", "“A Nest is a type of 'Cerebrate'. That thing creates the Medusa, the highest evolved form of mid-ranked Parasites. A Medusa then gives birth to low-ranked Parasites….” ", "Chohong leaked out a helpless groan.", "“B-But, this makes no sense! I've never, ever heard about a Nest with assimilation or regeneration ability before!!” ", "Chohong's expression morphed from one of disbelief into one of pure anger.", "“You idiots! If only you listened to him…!!” ", "Seol Jihu quickly covered her mouth.", "“Hey! Let me go! You…!”", "“It'll barely be enough for us to work together to defeat that thing. Are you trying to get us killed?”", "Seol Jihu rebuked her with a sharp voice. She gritted her teeth.", "“…Damn it!” ", "In the end, she picked up her mace and recited a chant. The youth understood where her anger was coming from, but there was nothing to gain from losing one's cool right now. With their escape route blocked off like this, they had to focus on fighting their way out of this place. Seol Jihu quickly issued his commands.", "“Veronika!” ", "“H-Hm??”", "“Keep shooting your arrows at the main body and distract it. Gierszal, you protect Maria no matter what happens.”", "Gierszal's face was stiff but he still stood before Maria, his shield at ready.", "“Chohong? Mikhail and I will harass that thing from left and right, so you….”", "“You want me to take that opening and destroy the main body, is that it?” ", "She only needed one glance. Chohong lifted up the mace now glowing white-hot and nodded her head.", "“It ain't gonna be easy, but I'll give it a shot.” ", "A short while later.", "Three Warriors dashed forward in three different directions. Tentacles pounced on them as if they were waiting for the humans to come out of the protective barrier.", "Whoosh!", "The power behind each extended tentacle whipping down was sharp and terrifying. None of them made contact with him, yet Seol Jihu felt like blades of wind were slashing his skin. ", "He realized that the moment he tried to block one, either his whole body would be split in half or he'd get flung to a faraway wall and end up as ground to a meat paste.", "Kwang!", "Seol Jihu lightly leaped away to evade the tentacle. It left a big crater on the floor and got stuck for a second there. Using this opportunity, he struck down with his spear. ", "Slice!", "The sensation of cutting through a hefty slab of meat was transmitted to his hands. Perhaps due to the excellent spec of his spear, the thick tentacle got separated into two in no time. The separated piece of the tentacle wriggled around violently like the torn-off tail of a gecko. He confirmed the ice forming on the cut surface and gripped his spear tighter.", "'The Nest itself doesn't have any special abilities.'", "If they could eliminate these tentacles, then they certainly had a chance. By concentrating on evading and cutting down the tentacles patiently one at the time, then….!", "As if to mock his train of thoughts, dozen more tentacles pounced on his direction, and he could only suck in cold breath. The Nest must have split its tentacles to three different directions, yet there were well more than a dozen of them still heading his way. Seol Jihu hurriedly retreated from his current position.", "Kwang, kwang!!", "Noises of explosions nearly deafened his hearing. The ground beneath his feet trembled non-stop. Seol Jihu endured the vibration emanating from pretty much everywhere and searched for the nearest tentacle. He tried to take a swing at it, but as if they didn't want to let him get away with it, other tentacles shot out of the rising dust cloud and rained down on him.", "Seol Jihu was taken by surprise and tried to quickly withdraw, but the tentacles suddenly came to an abrupt stop in the middle of the air.", "Squirm, squirm…", "They didn’t budge as if something was holding them still. Seol Jihu didn't need long to realize that Maria was looking after him. He quickly danced with his spear to slice off three more tentacles. He hoped Maria would feel less pressure the more tentacles he cut down. He judged that he couldn't let this opportunity slip by, so he quickly dashed closer to the rest of the tentacles.", "Unfortunately, his greed had gotten the better of him. Maria's limit to holding back dozens of tentacles came a lot sooner than he expected. The moment those things got freed again, Seol Jihu felt something sweeping him off his ankles. His view suddenly rotated 90 degrees and he caught the sight of a single tentacle sweeping on the ground as it went past him.", "“Ah.”", "Tumble!", "Seol Jihu crash-landed on the ground and rolled around for a brief while before a tentacle wrapped around his arm. He swung the spear reflexively while completely relying on nothing but pure intuition, and thankfully enough, he was able to free his captured left arm right away. Unfortunately, what waited for him the moment he regained his bearing was….", "“Uwaaahh!” ", "…The intolerable pain of his shattered ankle. Not only that, a tentacle swelling up greatly and positioned itself in front of him to take aim at his face. Greenish liquid spewed out in a straight line towards the youth crying out in pain.", "“Luxu, Lu, Luxuria!!” ", "His entire body sparkled in bright light. The green liquid arrived a moment later but couldn't touch his flesh and simply slid off to the ground.", "Tzzzzt!", "The ground coming in contact with the liquid melted down as white fumes rose up. Seol Jihu's jaws nearly dropped to the floor as he sensed a sudden warmth flooding into his body. The pain from his ankle disappeared, and vitality began filling him up again.", "However, he had no time to say thanks. An almost dead prey regaining its vitality seemed to have angered the Nest as more tentacles came flying towards him. ", "Seol Jihu immediately retreated and confirmed the condition of the battlefield through the corners of his eyes.", "He couldn't see where Mikhail was as that direction was blocked off by the Nest's body. Chohong had retreated some distance away just like he did and was panting non-stop at the moment. There were a dozen destroyed tentacles laying on the ground near her as if to prove her credentials as a grizzled combatant. However, her expression showed how desperate she was feeling inside.", "“Haaa…. Haaa….!” ", "It was roughly the same story with Maria. She was panting madly. She had sweated so much that actual droppings of liquid were falling from the ends of her damp blond hair.", "But that was to be expected – she ended up expending three spells in a row trying to save Seol Jihu just now. More importantly, she was watching three different directions at the same time, so she had to use nearly ten spells in that very short span of time.", "“Why are you acting like an idiot too?!” ", "As soon as she locked eyes with Seol Jihu, she cried out in pure anger. In all honesty, he could be considered more than decent enough for a Level 2. ", "Of course, she was aware of that, too. No, the reason Maria got so incensed wasn't because of him, but something else.", "“What are you trying to do, making me use up almost all of my spells already?! Do something!! Hurry!” ", "She was running out of the spells she had prepared in advance, yet the Nest was still in one piece. Even though Chohong's skills and Seol Jihu's battle prowess had resulted in the group reducing the number of tentacles by over a dozen, there were still over thirty of them remaining.", "Wuuuooeuh!", "Perhaps furious from all the hindrances during critical moments, the Nest let out an eerie, unhappy growl. Maria flinched. She felt like the Nest was glaring straight at her.", "“Stop that thing!”", "Chohong was the first to sense the change and cried out loudly to let the others know. Three Warriors freaked out and pounced on the monster, but one of the tentacles still managed to slip through and flew forward at a frightening pace.", "“Lu….” ", "Maria was about to chant another spell but realized that it was too late and quickly hid behind Gierszal. At that moment, the tentacle suddenly changed its trajectory.", "Thwack!", "“Aaahk!”", "In the blink of an eye, the tentacle slammed the side of Veronika standing not too far from them. The Archer, previously in the middle of supporting Mikhail, screamed out loudly and got flung away to the nearest wall; she crashed unceremoniously against it and stopped moving.", "“Shit! Veronika!!” ", "She fell to the ground, blood pouring out of her. Mikhail cried out and reached out to her. Because of that, he lost his concentration for a second, and a tentacle seized this opening to smack him in the back.", "“Huek…” ", "Mikhail fell hard to the floor, completely knocked out cold.", "“You fucking idiot!” ", "Maria jumped up and down on her spot and pushed at Gierszal's back.", "“What are you doing?! Go and bring them over here!” ", "They had lost two combatants in an instant. However, the real despairing thing they needed to worry about was….", "Keu-duk!! Keu-dududuk!!", "The tentacles they thought were taken care of now showed signs of movement again. Bubbles slowly rose up from the tentacles Chohong's mace crushed, and ice particles steadily fell off from the parts Jihu had sliced off. Its speed of regeneration was agonizingly slow, but the meaning behind that development was far, far too obvious to everyone present here.", "'We're screwed.'", "Seol Jihu continued to wield his spear but felt his innards twist in knots. The flow of the battle had turned to the absolute worst. They lacked two people, which meant he and Chohong had to take up the slack. They still had Gierszal, but if he stepped up, then Maria would be in danger.", "“I'll be fine, so go and bring them over here!! Do you want to die??” ", "Maria angrily kicked Gierszal in the shin when he remained standing there like a stone statue. Only then did he step forward hesitantly, but his complexion hardened rapidly out of the blue. He raised his shield up high to his right and began running forward while hugging the nearest wall as much as possible.", "Maria was about to frantically chant a new spell, but then, an expression of stupefaction formed on her face. ", "Gierszal actually jumped over the slouched Veronika. He even ran past the fallen Mikhail. He maintained that speed and soon disappeared behind the Nest.", "'Staying here means death! I'm taking my chances!' ", "He had carefully watched the developing situation and made a shrewd but drastic choice in the end. When he saw no hope, he chose to run away while using his teammates as baits. As far as he was concerned, remaining here would only lead to his death.", "“That son of a bitch…!!” ", "Maria plopped down on her butt as if she no longer had any energy left to cuss. Chohong let out a wry chuckle.", "While he desperately evaded the tentacles, Seol Jihu also saw Gierszal escaping through the now-open exit. Whether he knew that several tentacles were following him from behind or not, it was unknown. Perhaps the Nest didn't want to let anyone escape, but whatever the case may have been, Gierszal running away was a depressing sight. As the old saying went, you might know what's under the river, but you could never tell what was in a person's mind.", "'He didn't look like that kind of person….’", "In the end, the number of people still standing up was reduced to a mere three. The Nest must have thought that it won because after using a powerful slap with a tentacle to push away Seol Jihu and his persistently annoying attacks, the Nest remained in its spot and let its appendages wiggle around in a disgusting dance routine.", "Trapped within this despairing situation, Chohong analyzed their chances quickly and quite accurately. The battle had gone beyond the point of saving, never mind overturning it to their favor. Furthermore, the time was on the Nest’s side. ", "They couldn't see any escape route, so what would happen once all the incapacitated tentacles regained their mobility?", "“Seol! Take a step back! Keep your eyes open and get ready to hit it with everything you got!” ", "Chohong loudly yelled out and stood upright. Her mace was lowered towards the ground.", "“What are you….?!”", "Maria's forehead creased up. She saw Chohong's lips rapidly bobbing up and down. As if she was reciting a chant, she didn't waste a single second and breathlessly muttered out non-stop.", "Guuuoooo…. Soon, the strands of her long black hair began floating up one at a time, and….", "Flash!", "Blinding rays of light suddenly exploded from beneath her feet. An unthinkable amount of the latent power roused up from its slumber and the entirety of the dome-shaped interior began reverberating in resonance. The energy pulsing out of her was so great that even the Nest flinched noticeably and stopped extending its tentacles towards the fallen Mikhail and Veronika.", "Wuooooo?", "By the time it shifted its attention towards her, vivid curtains of light had completely enveloped Chohong in their embrace. Seol Jihu did as she said and had retreated to some distance away by then. His eyes nearly popped out of their sockets after seeing the change taking place on her.", "“Chohong?”", "The bright, shifting light rapidly changed to rather cool-looking armor made out of pure light wrapping around her upper and lower torso. A wing-shaped tiara settled down on her forehead next. Finally, a brilliant light shone down from the top of her head, dyeing her hair in beautiful shades of sparkling silver.", "Maria's jaw almost fell to the floor. What Chohong had just activated was the most powerful Level 4 manifestation spell, one that could only be performed by a paladin personally acknowledged by the gods themselves.", "The 'Valkyrie Skirt'. ", "“A-are you trying to kill yourself along with the enemy?!” ", "Maria yelled out at the top of her voice, but Chohong didn't even respond. She only icily glared at the Nest with deep silvery eyes reminiscent of a field covered in wintery snow. She raised her shining mace and silver shield.", "Maria bit down on her lower lip. She wasn’t a fool and knew better than anyone else why Chohong chose to activate this right now.", "If that was the case….", "“God damn it! Fuck!” ", "Maria angrily yanked her bag closer and pulled out an altar. The signs of internal struggle were clearly visible on her face, but in the end, her trembling hands placed the crucifix on top of this altar.", "After that initial preparation, she chanted a spell for a protective barrier. With a gravely determined face, she reverently knelt down before the altar. She slowly prostrated and opened her mouth to speak.", "“O Luxuria!”", "That was the beginning of another Ceremony."]}