{"cid": "462", "title": "Chapter 462. Preparation for the End (4)", "content": ["Seol Jihu put most of his focus at first in helping everyone get used to the place. The trials aside, the Path of the Soul was a place that could easily break someone. Since his mind almost broke as well, he couldn’t help but be worried.", "And so, he told the others that this place was similar to a Neutral Zone where one could revive infinitely, and if anyone seemed to be suffering from repeated deaths, he barred them from climbing the slope.", "Or at least, he tried to.", "“It’s fine. You don’t need to baby me.”", "Chohong brushed off the hand that Seol Jihu put out and got up.", "“You don’t have to push yourself to climb the slopes. This place isn’t a trial space.”", "“I know. I know this place is for training.”", "Seol Jihu tried to dissuade her, but Chohong was adamant.", "“But you also….”", "She was about to say something but closed her mouth after looking at Seol Jihu. She seemed to be holding back.", "“Anyway, leave me be. It’s not like I’m actually dying… like you.”", "Chohong shook off Seol Jihu’s arm and ran toward the slope. Seol Jihu still seemed confused. It wasn’t as if climbing the slope didn’t help, but there were other ways to train, so why was she so insistent on doing things her way?", "“Just leave her be. She says she wants to.”", "At that moment, a familiar voice rang out behind him. Black Seol Jihu walked over, yawning with his hands behind his head.", "“I’m just worried.”", "“She’ll be fine. She experienced it once before, and now has a clear goal.”", "Experienced what once before? What goal? Seol Jihu tilted his head at Black Seol Jihu’s vague explanation.", "Black Seol Jihu sighed.", "“Think, buddy. Earthlings get a wider range of classes to choose from the higher level they become.”", "“Right.”", "“I suppose I don’t need to tell you how important choosing a class path is. Especially when it comes to Unique Rankers.”", "“Yep.”", "“Now then, why do you think our happy-go-lucky Honghong went with Guardian instead of Paladin, which would fit her style more?”", "Seol Jihu blinked.", "“You don’t get it?”", "“….”", "“See? You’re as dense as a brick. What was that? You said you wouldn’t be done in? HAHAHA! Ah, just thinking about it makes me crack up.”", "Black Seol Jihu cackled and then walked off. Seol Jihu snorted before looking back up at the slope with a worried gaze.", "However, at the end of the day, Black Seol Jihu was right. Seol Jihu’s worries turned out to be unfounded. Everyone worked strenuously, but they put all their efforts in without giving up. Not only Chohong but everyone.", "Seol Jihu did not know this, but everyone entered the Path of the Soul with a fierce determination. It should be said that they came in with a different mindset than usual.", "Seol Jihu’s death had been a massive shock to everyone. The one person they thought would never die had come back a gruesome corpse.", "That was when they belatedly realized just how naive they were to think he would never die. Seol Jihu was not superhuman, but a normal human being like the rest of them.", "They refused to let the same thing happen again. To do that, they needed power. The power to at least help Seol Jihu and the power to at least bind the enemy’s feet, even if they wouldn’t be able to rival them in strength.", "Seol Jihu had given them this opportunity to grow, so no one dared to take it easy just because it was hard.", "They shared the same goal. To become stronger so that Seol Jihu would not shoulder everything alone.", "“Keeeeu!”", "“Uaaaah!”", "So today, just like every other day, screams and spirited shouts resounded in the Path of the Soul.", "*", "‘I have to navigate this well.’", "Once Seol Jihu realized he didn’t have to worry about the others, he began to think about his own training. He was no longer in a realm where his strength would grow by doing things without a plan.", "“Trinity Harmony, a perfect harmony of the mind, technique, and body. It is indeed an incredible realm.”", "Black Seol Jihu agreed with him.", "“But just because you entered that realm, it doesn’t mean you are complete.”", "“Mm….”", "“Don’t give me mmmm…. I want a clear explanation of what you think Trinity Harmony is.”", "Seol Jihu tilted his head and then smacked his lips.", "“…I’m not sure.”", "“You don’t know? Not even a little bit?”", "“No, um… how should I say this…. There’s a strange sensation that envelops you like you’re in a dream…. And inside it, you feel boundless freedom, like you can do whatever you put your mind to….”", "“So you’re saying your body knows, but your head doesn’t.”", "Black Seol Jihu spoke clearly.", "“I guess it can’t be helped since that’s how you were enlightened. Although you fully achieved it during your fight with Sung Shihyun, it was when you were breaking out of the Parasites’ encirclement that you stepped into the realm about 90% of the way.”", "“Right.”", "“Even then, it’s not perfect. Rather than saying you achieved it with your own strength from start to finish, it was thanks to the Spear of Purity’s Limitlessness Authority helping you out as a stepping stone.”", "Seol Jihu frowned. Black Seol Jihu had poked him where it hurt.", "“You’re the one who stepped onto that stepping stone and jumped, so don’t feel too bad. All I’m trying to say is that you must want to understand your realm better, right?”", "“Of course.”", "“But you don’t know how to bridge the gap between what your body knows and what your head knows.”", "Black Seol Jihu crossed his arms after deliberating for a moment.", "“Let me ask you something. What do you want to do?”", "If Seol Jihu replied, I don’t know, Black Seol Jihu was sure to curse him out. And so, Seol Jihu said what had been on his mind for a while.", "“First, I want to find my flaws and fix them.”", "“Flaws? Why? Do you want to learn Seamless Sublimity? Trinity Harmony isn’t enough for you?”", "“Of course not. I know maximizing your strong suit is an option, but for me, that would be my mana. If I only focus on mana….”", "“Right, it wouldn’t go well with your Trinity Harmony.”", "Black Seol Jihu nodded.", "“Okay, I get what you’re saying… but are you only going to work on your flaws?”", "“No, I’m going to ruminate while I fix them.”", "“Ruminate on what?”", "“On what my mind is thinking, how my techniques are being used, how my body is moving, and how these three things synergize and affect each other…. I have a feeling a path will open up if I dig into all of these.”", "“A path to getting stronger, that is.” Seol Jihu added with a shrug.", "“….”", "Black Seol Jihu stared blankly for a while. It was because he thought the same thing when he ran into a wall.", "“…Hey.”", "Soon, he spoke with a grin.", "“Do you remember what you said to me in the past?”", "“Hmm? When was this?”", "“After you climbed the first slope. You asked if you could learn Trinity Harmony if you kept at it.”", "“D-Did I?”", "Seol Jihu became embarrassed.", "“Yeah. So, do you finally understand me? What you’re worried about now is the same as what you were worrying about back then. How could I not be angry?”", "Black Seol Jihu cackled. Seol Jihu coughed drily.", "“Fine, let’s assume you’re right and give that a go. It’s not like you don’t have any flaws to fix anyway. You still have a lot to do.”", "Black Seol Jihu stood up.", "“Though, there really isn’t much I can teach you at this point….”", "He continued as he stretched his arms.", "“But, I can at least think about it with you.”", "Then, he suddenly turned to the side. To be more precise, he turned to Little Chick, who was sitting on Seol Jihu’s head and looking at him sourly.", "“So, I’m hoping you’ll unlock the sixth and seventh stage already.”", "“What?”", "“Don’t what me. I get that this is your mission, but you should know what kind of a guy he is by now.”", "“….”", "“It’s not like the Parasite Queen is an easy opponent. Or what, are you going to unlock the stages at the very last second again? Or maybe just before he dies? Let’s prepare in advance, alright?”", "Little Chick sighed. It did not hesitate for long.", "“Damn it…. If only the situation weren’t like this…. What a lucky bastard.”", "Grumbling, it directed its wing to its forehead, where a red and a violet feather were protruding out. Seeing this, Black Seol Jihu smiled gently.", "“He sure is lucky, alright. Haa, if only I had that spear….”", "Hearing this, Little Chick paused and snorted.", "“Dream on.”", "“?”", "“If it were you, bastard, I wouldn’t have unlocked the first stage even if humanity were about to be destroyed.”", "“What was that?”", "“What! What!”", "Black Seol Jihu and Little Chick began to wrestle. Seol Jihu stopped them in a fright.", "“Why are you two fighting!?”", "“That birdhead started it!”", "“It’s that bastard’s fault!”", "When Seol Jihu separated them, the two of them glared at each other, panting.", "“Getting a little chicky, aren’t you?”", "“You wanna go? I entered my adulthood. Let me show you who’s your daddy!”", "When they growled and were about to break out into another fight…", "“Time for food!”", "A voice cut in from a distance, saving Seol Jihu from a predicament.", "“Come here, Snowy and Blacky! You too, Taffy! I brought you your favorite dish!”", "“Come on, guys. You’re not going to fight when there’s food, right?’", "“…I’ll see you afterward.”", "“Same to you.”", "Black Seol Jihu and Little Chick stopped fighting at Seo Yuhui’s calling and scurried off with Seol Jihu.", "*", "Seol Jihu’s intense training started that day. Now that he knew what to do, he began to work hard without rest. Just like Black Seol Jihu said, there was a whole slew of flaws he could find when he started looking.", "He first began with his basic movements, including basic spear techniques. Although he beat down Black Seol Jihu, not being able to do it instantly with his high physical level was a shock.", "And once he started digging into his basic spear techniques, he looked at the Spear of Purity in a renewed way. To be more precise, the crescent blade on the side of the spear blade caught his attention.", "Until now, Seol Jihu thrust, cut, and struck with his spear. He had never thought about utilizing the crescent blades. He discussed with Black Seol Jihu about this and studied together.", "That said, he didn’t solely work on fixing his flaws. He didn’t forget to get used to the Spear of Purity’s sixth Authority, Thousand Stream Convergence, and the seventh Authority, Spear God.", "Besides these, he worked on developing new skills or new abilities and sparred with the Parasite Queen in his head based on her description given by Black Seol Jihu. Of course, Black Seol Jihu was his training partner in all of this.", "In any case, with so many things he had to do, it wouldn’t have been enough even if he had two bodies. However, the busiest person was undoubtedly Black Seol Jihu.", "In the beginning, he only paid attention to Baek Haeju and Seol Jihu, but other members started approaching him after listening to the advice he gave. Black Seol Jihu did not turn down anyone who came to him on their own.", "Jang Maldong once said that knowing something and teaching something were two completely different things. In this sense, Black Seol Jihu was an excellent teacher.", "He did not know how to do things step by step like Jang Maldong, but he was extremely sharp in pointing out areas where someone was lacking and how they could improve.", "He was so good that no one could utter a word of complaint despite his terrible attitude. Whenever someone swallowed their pride and asked for his advice, the others would see a noticeable improvement in them, and this naturally caused everyone to seek Black Seol Jihu’s help.", "Of course…", "“The heck? Why are you coming to me for help?”", "“…Am I not allowed to?”", "“Are you kidding? How can I teach a Magician? You don’t need my help anyway. You already have an excellent teacher.”", "There were some people he couldn’t teach, like Eun Yuri, who climbed to the peak with her own strength in only 37 days.", "“Ah, it’s slippery because the path froze over, so you want to make grooves in the ground. Hey buddy! I think I found your soulmate! Come here and see!”", "“Aha~ So you can’t acquire it on your own because you used contribution points all this time like it was some sort of a game…. So what? Get out of here if you can’t put up. Go hunt down some parasites and learn with contribution points. I doubt you’d be able to, though.”", "“Fucking hell, I never thought a day would come when I would miss teaching Seol Jihu. Why did my buddy make someone like this a Unique Ranker? I just don’t understand.”", "“Iya~ Your representative even died once to make contribution points to help you level up and train…. Yet the donkey who took everything for free is resting because it’s a little hard. What a lovely group, what a lovely group~ Aigoo, my poor buddy!”", "Despite his foul-mouth, no one could deny that Black Seol Jihu taught with passion. As he was the only one who did not need to eat or sleep, there were times when he talked non-stop for 24 hours.", "Perhaps because of this, more and more people began to climb the slope.", "“Are you mad? You must be. Then climb to the summit with your own strength. For anyone who succeeds, I will let you hit me all you want! Not that it will ever happen! Hahahaha!”", "…In truth, many of them worked tenaciously just to punch Black Seol Jihu.", "In any case, there was one thing that was for certain.", "And it was that everyone was getting stronger by the day.", "*", "Time flew by.", "As a training masochist, Seol Jihu enjoyed every single day that he spent in the Path of the Soul. But of course, he knew he couldn’t stay here forever.", "There was now only a day left until they had to leave.", "There wasn’t anything special going on just because it was the last day. Seol Jihu trained until late at night, just like always, before coming back to his tent and preparing to sleep.", "He only hesitated when he saw Black Seol Jihu before falling asleep.", "“What are you thinking about so much?”", "“…You saw through me.”", "“If you’re trying to say thank you for everything, don’t. If there’s something else you want to say, go ahead.”", "“….”", "“For example, if you want to ask what your chances are in defeating the Parasite Queen one on one, I’ll tell you that it’s about 4 to 6.”", "4 to 6… Seol Jihu smiled softly.", "“Aren’t you being too stingy?”", "“I’m being generous. I was going to say 3.5 to 6.5 but changed it a little since she shaved off some of her divinity last time.”", "Even then, this was only a match because the Parasite Queen was restricted by several factors like the Imperial Oath and the law of causality.", "Originally, the Parasite Queen was a high-ranking god that even ordinary gods did not dare to fight. Having a 40 percent chance of victory against a god that once ruled over a galaxy was truly a noteworthy thing.", "However, what Seol Jihu wanted to ask wasn’t about his chance of victory. It was similar but different.", "“If you have something to say, just say it. Don’t delay it like last time.”", "“…I’ll think about it.”", "Seol Jihu smiled faintly before closing his eyes. Soon, the sound of snoring rang out.", "“…To be honest….”", "Black Seol Jihu grinned and muttered something inaudibly.", "*", "The morning dawned.", "The morning would be spent as a final checkup. The members who managed to climb to the summit numbered three, excluding Eun Yuri.", "They were Yi Seol-Ah, Phi Sora, and Hugo. Most of the others managed to pass the second slope, but not the third.", "In any case, when the portal appeared on the altar, everyone ran toward it with joy. It couldn’t be helped since they were in the Path of the Soul for close to two years.", "Of course, no one forgot to bid farewell to Black Seol Jihu before leaving. The three who reached the summit especially did not forget to have the moment they were waiting for.", "“Ow, ow, ow…. Those bastards, do they not feel any gratitude toward their teacher?”", "Black Seol Jihu grumbled, but his lips were curled up in a smile.", "He wasn’t sure if even one person would be able to surpass their limits, but with three people managing to do just that, he was justifiably elated.", "On the other hand, Seol Jihu looked a little regretful. He wanted to stay in this place for a bit longer, but he knew they had to leave to make it in time for the march.", "“You should get out of here too. Everyone else left. Let me finally get some rest.”", "Black Seol Jihu commented. Seol Jihu didn’t like awkward situations either, so he walked toward the portal obediently. Then, he looked back at Black Seol Jihu.", "“…Hey.”", "He asked.", "“What happens in the future?”", "“Hmm?”", "“The future must have changed quite a lot. What happened?”", "“…Is that what you wanted to ask?”", "Black Seol Jihu chuckled.", "“You already know I can’t tell you. I was manifested by Gula’s power, so I can’t divulge such profound secrets all willy-nilly.”", "Black Seol Jihu hopped up.", "“But, I guess I can tell you one thing….”", "He rolled his eyes and glanced at Seol Jihu.", "“You’ve never looked at yourself, have you?”", "“?”", "“With your Innate Ability, I mean. After it evolved.”", "Seol Jihu’s eyes widened. Come to think of it, he had never looked at himself after unlocking all directions. He’d just never thought to do so.", "“When you get out, look at a mirror and activate it. You’ll at least be able to see what changed.”", "“Now you’re making me curious.”", "“For the record, there is no mirror here.”", "“Alright, alright, I’m leaving.”", "Seol Jihu shook his head and walked along.", "“…Hey.”", "Just as he took half a foot into the portal, a voice rang out behind him.", "“Did you really think I’d make you fight her alone? I’ll at least make it a 5 to 5.”", "“…Excuse me?”", "Seol Jihu turned around reflexively.", "“So don’t worry about it too much.”", "Inside his ocean-colored vision, Black Seol Jihu was smiling and rubbing the back of his neck while gradually becoming fainter and fainter."]}