{"cid": "144", "title": "Chapter 144. Choice of Destiny (4)", "content": ["—Stop making things more complicated. Clear your mind, and focus only on distinguishing the perpetrator and the victim.", "“That should be easy enough.”", "While the case was all tangled up and convoluted, the roles were clear. The information broker was the perpetrator while PAX and White Rose were the victims.", "—Why?", "But Kim Hannah raised a question.", "—Who says Bok Jungsik is the victim of this case?", "Was the leader of White Rose not a victim?", "—Didn’t Bok Jungsik say so himself? Because they were unable to find a partner organization, they canceled their expedition plan right before departure.", "Seol Jihu nodded his head.", "—That means they canceled it of their own accord. To willingly abandon an expedition even before anything went wrong…. Doesn’t that mean they’ve already set their minds to take their losses before that point?", "Kim Hannah emphasized ‘already,’ pointing out the implication that the expedition wasn’t canceled because of the protests.", "She was right. Seol Jihu stammered.", "\"B-But.\"", "—Yes. And as a result, that foul-mouthed bitch forced the expedition. I can definitely see her doing that.", "“Why? If the leader canceled the expedition, she shouldn’t have gone, right?”", "—That’s what you think. But that scumbag is the ace of White Rose. She’s the real deal. While Bok Jungsik is the guild master by name, he actually is only a figurehead.", "[Our leader must have all grown up now, knowing how to gossip behind my back.]", "[It’s fine. I’ll start talking instead.]", "It was true. Bok Jungsik definitely didn’t seem very influential. And he had seen her act unbridled. However, Seol Jihu hadn’t imagined Bok Jungsik to only be a figurehead.", "—And all of this took place before PAX made it an issue. It was information they traded 10 gold coins for, and they’ve also confirmed the existence of the ruin. But to suddenly overturn the expedition over a minor issue after painstakingly planning for months? It makes absolutely no sense.", "Kim Hannah’s face drew closer in the crystal ball.", "—There’s another thing I’m suspicious about.", "Her voice dropped to a whisper.", "—10 gold coins isn’t a joke. That’s money worth 500 million Won. And how much do you think the preparation cost them? To suddenly evaporate their plans means throwing everything they’ve prepared in the trash. What do you think went through the members’ minds? Would you not have doubted the competence of the leader, too?", "“What’s your point?”", "—Look at the bigger picture. A bastard who is already in a precarious position sets up a situation where they must advance even if they can’t profit off of it and then suddenly decides to pull out. Looking at it after the situation exploded, don’t you think everything was staged?", "'After the situation exploded?’", "Seol Jihu started.", "\"Wait. Then that means Miss Phi Sora is…\"", "—Screwed.", "Kim Hannah summed it up in one word.", "—The moment that scumbag moved independently, all the responsibility fell on her. And no matter how unfair White Rose thinks the situation is, the royal family will most likely listen to PAX who bought the information first. Now, to wrap this up…", "\"….\"", "—If she dies there, everything ends. Even if she somehow comes back alive, she’ll still be drowned in controversies. Meaning, whether or not the expedition succeeds, the final result has already been determined.", "Kim Hannah gave a faint smile.", "—Excluding the broker, the one who’ll profit the most is….? Who?", "Seol Jihu blankly stared at the crystal.", "After the call, Seol Jihu leaned against the railing and looked outside.", "Kim Hannah said she would call again when she found definite proof, but like she said, the outcome was already decided. He didn’t know why, but his thoughts kept flowing in a strange direction.", "Tightly closing his eyes, the scene of Phi Sora hanging herself with a smile in a rundown room came to his mind.", "'The Choice of Destiny….'", "[You seem to think that fate is something amazing, but it’s not.]", "Destiny was something inborn; an unavoidable fate.", "That’s what Ian had told him.", "It was a fate to breathe as long as you were born a human, and it was also a fate to die if you stopped breathing.", "This law of causality was an absolute ‘invariant’. Destiny ultimately did not connote ‘change’.", "For example, the moment Phi Sora forced the expedition and created a ‘cause’, the ‘result’ of her hanging herself had to happen.", "This was an unavoidable fate, or as Ian put it, the acceptance of one’s destiny.", "Then what was the reason behind the inclusion of the word ‘choice’?", "It meant that there wasn’t only one possible fate, but multiple.", "Seol Jihu could have forcibly stopped her from leaving, have accompanied her in the expedition, or even gone and saved her right now.", "In the end, he didn’t take any action, nor did he plan on doing so, but if he had decided on something, Phi Sora might have met a different fate.", "If he did not take action, her breath would stop and she would undoubtedly die, but on the flip side, if he did, then her breath would not stop, preventing her from dying.", "He could interfere by choosing between the two unavoidable fates.", "And thus was the ‘Choice of Destiny.’", "[What are you thinking so hard about?]", "Seol Jihu opened his eyes at the sound of a pleasant voice. He could see a cloud of black smoke floating in front of him.", "“Did you have a good time?”", "[Yep. Just made a quick trip around the place. I’ve already seen all that’s there anyways.]", "He could hear a slightly bored tone in Flone’s voice. She still must have had some lingering dissatisfaction with leaving Scheherazade so early.", "Then again, she had been stuck inside her tomb for hundreds of years, so he understood why she was so curious about the outside world.", "“I’ve been thinking about the ancient emperor’s villa.”", "[Why? You’re not thinking of going, are you?]", "In reply to the anxious voice, Seol Jihu shook his head.", "“No. It’s just that I heard someone I know is on her way there.”", "[Why would that person go….]", "“Well, it’s human nature to want to do something they’re told not to do.”", "[I guess. There were a lot of those blind idiots in my time too. ]", "“There were?”", "[Yeah. To be honest, it’s not like I haven’t entertained the thought of going there either. My mind knows I shouldn’t, but I can’t help but be curious.]", "Seeing the black smoke nodding, Seol Jihu suddenly remembered the story that she didn’t finish telling before.", "“Flone. What was that villa used for when the emperor was alive? It didn’t seem like it was simply used for recreational purposes.”", "[It had a political use and was also used as his personal safe.]", "\"Political use? A safe?\"", "[To remove political enemies and store their wealth.]", "Flone let out a deep sigh.", "[Gorgonu, Rothschear, Rodrick, Rhetinhen, Monpansha, Baluark, Aluah, Angju…. I don’t know how many family heads were sacrificed in that villa.]", "The shocked Seol Jihu narrowed his eyes.", "“Wait. By Rothschear, you mean…”", "[You remembered.]", "Flone’s official name was Flonecia Lusignan La Rothschear.", "Meaning…", "[You’re right. Our family was one of the emperor’s targets. We were famous for our large wealth.]", "[According to the imperial records in the Royal Library, she’s listed as the beautiful youngest daughter of the formerly prestigious but fallen family.]", "As Flone and Ian’s words came together in his mind, Seol Jihu’s mouth fell open.", "“Then because of that incident, your family fell apart, and you were…”", "[…That’s right.]", "Flone confirmed his thoughts with a bitter voice.", "“But why would he do that? If he was an emperor of an entire empire, he must have had absolute power. What could he have lacked…?”", "[It was for money.]", "Flone replied bluntly.", "[That greedy emperor waged wars like a madman. But engaging in war required extremely large amount of finances. It was impossible even for the emperor to handle the costs of a war lasting dozens of years.]", "“Right.”", "[So after pondering about possible sources of money, he set his eyes on the assets of noble families and stole them through various excuses.]", "“Excuses?”", "[If the emperor invites a person to his villa, do you think they can refuse?]", "“Can’t they just not go?”", "[Then they’ll face the crime of refusing a royal decree.]", "Seol Jihu made a face that said he still didn’t understand.", "[No one knows what happened inside the villa. But from what I’ve seen and heard, the emperor tried to assassinate his guests. My grandfather died from that too. Then, under the pretense of an investigation, the emperor led an army to search through our family.]", "“And they confiscated the family’s wealth in that process?”", "[That’s right.]", "Seol Jihu scoffed.", "“That’s messed up.”", "[There was no one who didn’t know it was all a plot. Not even one.]", "Flone quietly spoke before closing her mouth.", "[But we didn’t just take it quietly either.]", "Flone continued speaking after a brief moment of silence.", "[When the invitation came to our family, my grandfather, who was then the head of the Rothschear family, immediately noticed the emperor’s intentions. So he plotted a scheme.]", "Seol Jihu made an intrigued face.", "[If he was going to die whether he went or not, he at least wanted to protect the family’s property. So he secretly hid everything without the emperor noticing.]", "“Then the reason your family fell…”", "[The problem was that we became aware of this fact only after we heard the news of my grandfather's death and found the will that he had left behind in his personal study.]", "“Did he not leave behind the location of the property or something?\"", "[No. All that was written in the will was that he was going to die, that he moved all the family’s wealth before the emperor tried anything, and that we must burn the will after reading.]", "Seol Jihu tilted his head.", "“In the end, while your family didn’t lose anything, there was nothing left either?”", "[Strictly speaking, yes. Except for this.]", "He suddenly felt his neck getting pulled. Seol Jihu stared at the necklace hanging in the air.", "\"The necklace….\"", "[This was the only item left behind by my grandfather. My mother said that he had called her separately to give it to her before he left. He told her to not lose it no matter what and to cherish it dearly.]", "‘So that was why she was so mad when Clara touched the necklace back then.’ Seol Jihu could finally understand a bit.", "“If other families did the same, I doubt the emperor would have been very happy.”", "[While there were smart people like my grandfather, there naturally were dumb family heads as well. I bet that it wasn’t just a few that straight-out offered everything up to the emperor in fear.]", "“Wow!”", "Seol Jihu let out a gasp. If Flone’s words were true, then he couldn’t even imagine how much wealth the villa contained.", "An emperor’s villa was already grand enough, but adding the assets of several major families…", "Seol Jihu who was swallowing his drool…", "“Heuk—”", "…choked on his breath after seeing Flone’s face form from water-like vapor right in front of his face in the midst of the black smoke. He didn’t know when she materialized, but he could see her squint at him.", "“Y-You scared me.”", "[You’re planning on going, right?]", "\"Huh?\"", "[No. You can’t. I’m not going to let you go.]", "\"But…\"", "No matter how much he retorted, the black smoke tightly bound both his hands and legs. Unable to move, Seol Jihu sighed.", "\"Fine, I won’t go. Now let me free.”", "[I don’t believe you.]", "\"Why?\"", "[Your eyes were shining.]", "\"Don’t be like that and let me go. How long do you plan on holding me like this?”", "[Oh, I don’t know. For around a year? Won’t your thoughts of going disappear by then?]", "‘An entire year!’", "It was impossible, no matter how much he thought about it, so he ducked his neck and began licking the pendant.", "[Ewwwwwww!]", "Flone shrieked as she drew back.", "After freeing his limbs, Seol Jihu was able to see the ghost flying far away while squirming in disgust.", "[You meanie! You know I hate that!]", "Hearing the upset tone echoing in his mind, Seol Jihu scratched his head.", "“You were gripping me too tightly.”", "[I was worried!]", "“I know. I won’t go, okay? I promise I won’t.”", "Seeing Seol Jihu rub his palms together in a plea, Flone timidly approached.", "[Really?]", "“Of course. You said so yourself. It’s not a place where living people should go. It’s obvious that nothing good will come out of going there anyways…”", "It wasn’t empty talk; Seol Jihu really did not have any intentions of going.", "Not only did the Nine Eyes signal all sorts of warnings to not go, but there was also no reason for him to go in the first place.", "[Good. You thought well.]", "Flone said with a slightly relieved voice.", "“But didn’t you say you’re curious as well?”", "[My grandfather said too much curiosity was poisonous. There’s no need to go to such… a scary place, just out of curiosity.]", "Hearing the depressed voice, Seol Jihu sniggered.", "“Well, that’s surprising. That even you have something to be afraid of.”", "[Well, that’s because my family is directly involved, and also because it happened when I was young…]", "“But since you are already—.”", "‘—dead, does it matter?’ Seol Jihu didn’t finish the sentence out loud.", "While he already knew Flone was strong, there were words he should say and words he shouldn’t. He knew it was rude.", "[Me? What about me?]", "“Uh… strong.”", "[Already strong? That doesn’t even make sense.]", "But despite trying to switch topics, Seol Jihu broke into a cold sweat as Flone’s characteristic persistency was activated.", "[Why? Do you not like me suddenly disappearing all the time?]", "“It’s not that.”", "[Then should I always stick next to you?]", "He wondered how such a conclusion was reached, but unable to win against her persistent barrage of questions, he confessed to a certain extent.", "“So, uh… even if I don’t personally enter the villa…. As long as it’s in range, you can…”", "When he couldn’t continue speaking, the tweeting voice suddenly stopped.", "It was true that there was nothing inside the villa that could harm her. After all, she was a spirit, or in other words, already dead.", "Also, Flone was an evil spirit born from hundreds of years of resentment. She had been able to easily annihilate those terrible Parasites back then, too.", "Even if there was a monster inside, wouldn’t it be simple for her to handle?", "As all sorts of thoughts came to Seol Jihu’s mind, he carefully searched for her response.", "Flone who hadn’t released her materialization had a dazed look on her face.", "‘Damn it! Me and my big mouth.’", "He had made a mistake even while knowing Flone had a lot of regrets concerned with living.", "When he was just about to apologize out of guilt.", "[…Ah.]", "Flone let out a stunned voice.", "[You’re right!]", "Her eyes grew as large as lanterns.", "\"Excuse me?\"", "[You’re right. Why was I afraid?]", "Then like a child who discovered something interesting, she became excited and floated in the air.", "“F-Flone?”", "[I’m going out for a bit!]", "And Flone flew away just like that.", "Seol Jihu was left staring endlessly at the spirit that was now becoming a small dot on the horizon.", "‘…She didn’t know?’", "No, that wasn’t it. She might have been instinctively afraid because of the trauma that she was induced with when she was a child.", "Or so he thought, until he could see the quickly returning Flone.", "Seol hastily gripped the railings using all his strength after vaguely realizing why she was flying towards him.", "A moment later, on the third stairway of the Carpe Diem building, a strange scene of a spirit pulling on the collar of a young man holding onto the handrail like a cicada, unfolded.", "“No. I’m never going there.”", "[Why~! Let’s go~!]", "\"I’m scared, okay?\"", "[But you don’t even have to go in~! I’ll go in by myself!]", "\"I don’t want to! Uggh.\"", "[Heuk!]", "'What, what power!'", "Seeing his grip loosening, the panicked Seol Jihu quickly licked the pendant with his tongue.", "[Ahhhhh! I’ll kill you!]", "Seol Jihu flinched hearing Flone’s threat.", "\"No! We don’t even know what’s inside!\"", "[It doesn’t matter!]", "In reply to Seol Jihu’s screams, Flone brightly shouted as if she never cared at all.", "[After all, I’m already dead!]"]}