{"cid": "215", "title": "Chapter 215. A Dream Inside A Dream (3)", "content": ["Intense light exploded out of the pile of stones, and the pendant began glowing with the same color in response. The two objects madly began pulsing as if they were resonating with each other.", "But that was it.", "Seol Jihu waited a bit, expecting some sort of phenomenon, but the dolmen and the pendant just continued to blink.", "A dead silence continued in the area.", "Murmuring amongst each other, the expedition team approached the stones. Upon closer inspection, the rocks were normal stones, erected in the form of a dolmen. There were no symbols on their surfaces; they were just ordinary stones.", "\"Should we try digging?”", "Chohong suddenly suggested.", "\"It looks just like a dolmen. Meaning, this might be a tomb of some sort. Won’t there be grave goods buried underneath them?”", "It was a good idea, especially considering that it was Chohong who said it. Afterall, artifacts were commonly buried beneath the ground.", "Seol Jihu decided that it was a reasonable suggestion and instructed the others to try digging around the stones. The expedition team started to dig without complaint.", "A moment later.", "\"Whooaa!\"", "Hugo exclaimed.", "Seol Jihu, who had been digging the ground with his spear, lifted his eyes.", "Hugo was prancing around with a long spear in one hand.", "\"It’s a spear! A spear! Doesn’t it look crazy expensive?”", "Then Teresa also shouted.", "\"Kyaa! A chest! It’s a treasure chest!”", "Seol Jihu’s eyes widened.", "Jackpot.", "The results of digging the area could be summed up in that one word. It was the biggest jackpot in the history of Paradise.", "Not to mention the Spear of Purity, there were numerous treasure chests overflowing with gold and silver. If they included the offerings and decorations they found, the total value was simply immeasurable.", "After making a fuss over their harvest, the expedition team left the Pagoda of Dreams with smiles on their faces.", "They hadn’t seen a pagoda of any sort nor had they seen anything that resembled a small tower, but it wasn’t important.", "They had achieved a jaw-dropping result, so was a mere pagoda even worth mentioning anymore?", "And so the expedition team safely returned from the forbidden region, received purification from the Sky Fairy, bid farewell to Yuirel, then embarked on their way back home.", "Their bags were heavy, but their footsteps were light.", "Wanting to return as quickly as possible, the expedition team marched for a long time before finally stopping late at night to set up camp.", "That night, Chohong stroked a treasure chest while speaking with a dreamy face.", "\"What should I do first when I arrive… Ehhehehe!”", "\"I’m buying equipment! I’m going straight to the auction house at Scheherazade to plaster my whole body with the most expensive equipment I can find!”", "Hugo passionately shouted like a boy lost in his dreams.", "The expedition team ate and drank merrily until early in the morning, each of them chirping about what they would do with the expedition rewards.", "When morning came, the expedition team’s atmosphere plummeted down to an all-time low. No, it was better described as a powderkeg on the brink of an explosion.", "There was just one reason.", "Only a single night had passed but all their spoils from the Pagoda of Dreams had disappeared like magic.", "Everything was gone without a single gold coin remaining.", "The culprit was Maria Yeriel.", "It could only be her, since she couldn’t be found anywhere when they had woken up.", "“Is this for real?”", "Chohong exploded with anger.", "\"That Priest bitch ran off with all of that? Is that bitch fucking crazy?”", "\"It’s not impossible.”", "Kazuki remarked with a solemn face.", "\"She could have had a high-quality magic bag with her. It wouldn’t be surprising if she did, since she always hoards money like a scrooge.”", "\"Fuck! That little good-for-nothing bitch! She’s still nothing but a flea even if she scampers away! She dares to run away with the expedition rewards? The moment I catch her, her head will— ugh!”", "Chohong clenched her grip around the Thorn of Steel with red eyes.", "\"There’s no time for this. Kazuki! What are you doing? Hurry up and track her.”", "\"Of course!\"", "Kazuki replied in a cold voice before turning to look at Seol Jihu.", "Seol Jihu agreed with them, but his heart was in chaos.", "'I believed in her….'", "He knew that she loved money with a maniacal obsession, but he still thought she was a loyal person.", "'Miss Maria….'", "The expedition team pursued Maria in full force.", "They were gaining on her at first, but after a day, they could only give up.", "Her tracks disappeared.", "To be exact, Maria’s footsteps were gone, replaced by endless carriage tracks. She must have gotten lucky and hitched a ride on a passing carriage.", "The despondency that the expedition team felt then could not be described in words.", "They combed through the city like they were catching fleas once they arrived at Eva, just in case, but sure enough, they could not find even a single hair of Maria’s.", "Whether she returned to Earth or left for a different city.", "She had vanished.", "In the end, the expedition team gave up the pursuit and got on their way back to Haramark under a dispirited mood.", "It was an obvious fact, but the complexions of the company were not too good.", "Seol Jihu tried to rouse himself by constantly reminding himself that it was only one part of the inheritance and that there were still four remaining.", "But what was waiting at Haramark for the Carpe Diem guild was only tragic news like a bolt out of the blue.", "It was the news of Seo Yuhui, Jang Maldong, and the Yi sibling’s deaths.", "Seo Yuhui had been ambushed while she was praying at the temple and was brutally murdered.", "Jang Maldong and the Yi siblings were found dead at the Huge Stone Rocky Mountain. The culprit remained unknown.", "By the time the expedition team had arrived, the cases were already hushed up.", "Seol Jihu cried.", "He shed tears all day long, shut away in his dorm.", "It wasn’t as if the thought that he had to do something didn’t appear in his mind, but his brain just stopped functioning from the impact of the sudden accidents.", "Meanwhile, his comrades started to disappear one by one.", "Chohong and Hugo left saying they were going out for revenge, and all news about them was cut from then on.", "Marcel Ghionea and Phi Sora must have left without saying anything; they suddenly couldn’t be found at one point.", "By the time Seol Jihu barely managed to come to his senses, he was alone.", "He curled up in a corner of the office and looked around the room with dull eyes.", "The office that had always smelled of people and used to be bustling was now bleak and desolate.", "His weary face stained by tears scrunched up in distress.", "'No way….'", "How did things become like this?", "Seol Jihu hung his head in front of the inconceivable reality.", "\"Pathetic.\"", "He suddenly heard a familiar voice above his head. It was Teresa’s voice.", "\"Why are you like this over the death of just a few Earthlings? It’s hard to believe you’re a war hero.”", "'Just a few?'", "His eyes widened.", "Seol Jihu involuntarily opened his eyes in disbelief, unable to believe that it was Teresa who said such venomous remarks.", "But instead of Teresa, he found Hao Win standing in front of him.", "\"You’re a complete wreck now.\"", "Hao Win turned his body around after spitting a short statement.", "\"I judged you wrong.”", "Seol Jihu stupidly gazed at Hao Win’s back leaving through the door. Not to mention catching him, he couldn’t even muster the energy to call out.", "Seol Jihu belatedly tried to move but found that he didn’t know what to do.", "He finally remembered Kim Hannah and tried to call her, but she didn’t pick up.", "In the end, everyone had left him. The strings of relationships that he had tied in Paradise were all cut away.", "There were no tears left in his eyes.", "'They’re all gone….'", "Seol Jihu caressed his head.", "'It’s a dream.'", "He knelt and repeatedly smashed his forehead on the ground.", "'A dream! It’s all a dream!'", "He didn’t know what he was doing himself. He only yelled inside his mind that it was all a dream while slamming his head on the ground. And as Seol Jihu was drowned in despair, refusing to accept reality—", "\"Heuk—!\"", "Seol Jihu jerked up from his bed in shock.", "Bright light prickled his eyes.He rapidly blinked, and his blurry vision gradually cleared.", "And as he looked around him, Seol Jihu displayed a shocked expression as if there wasn’t anything more absurd than what he was seeing at the moment.", "A crystal chandelier hanging from the ceiling and several dozens of green tables. And the numerous people sitting in front of those tables.", "‘This is….'", "Seorak Land.", "It was the casino that Seol Jihu had once frequented. While he was still dumbstruck, Seol Jihu suddenly felt someone hold his arm and help him up.", "\"Friend, you’re crazy!”", "An aged voice. A middle-aged man was supporting his arm. It was a face he had seen a couple of times.", "\"Even if you’re crazy about gambling, how could you fall asleep in the middle of a game? You have to think about others too!”", "Seol Jihu’s eyes widened.", "He had absolutely no clue what the man was saying.", "\"Here, here. Go and freshen yourself up with some cold air outside. Rather, it’ll be good if you get some sleep. Your eyes are bloodshot.”", "\"N-No.\"", "As Seol Jihu was still stuttering, the middle-aged man dragged the young man outside.", "After being forcibly pushed out of the casino, Seol Jihu froze in place like a statue.", "He pinched his cheeks, but his mind remained clear.", "The cold morning air that he could feel on his skin could not feel more real.", "Like the middle-aged man had said, he had fallen asleep while playing a game.", "'Then?'", "A dream?", "The one year he spent in Paradise, all of it? Everything was just a few minutes worth of a daydream?", "'There’s no way!'", "Seol Jihu hurriedly searched his pockets. But all his hands grabbed were a wallet, some coins, and his phone.", "He couldn’t find a piece of paper even after flipping his pockets inside out.", "\"Paradise!\"", "He tried shouting it out just in case.", "He felt his chest sink.", "\"Gula! Ira! Luxuria! Invidia! Haramark! Scheherazade! Parasite Queen!\"", "Due to the contract, he could not speak aloud any words related to Paradise on Earth.", "That was supposed to be the case, but he could hear all the words ring extremely clearly in his ears.", "No. This couldn’t be happening. It shouldn’t be like this.", "\"Taxi!\"", "Seol Jihu immediately got in the taxi and rode it to his neighborhood.", "But reality did not change.", "He stopped in the middle to drop by the restaurant at Hongik University Station, but Phi Sora was nowhere to be found. Moreover, none of the employees knew of her either.", "Upon returning to his old room, Seol Jihu stood dazed at the sight.", "A trash dump.", "It had been like this back when he had fallen deep into gambling.", "\"Haha… Hahaha….\"", "His eyes became hot as he stood there, staring at the room. Tears that he had thought were dried up began to spill down his face.", "'Paradise… didn’t even exist in the first place?’", "A final place of refuge which Seol Jihu had barely found and where he had pieced his life together.", "The place where he could stay had disappeared like a mirage.", "That fact caused enormous and endless despair for Seol Jihu.", "And finally, when Seol Jihu couldn’t take it anymore and hung his head after falling on his knees.", "Cling!", "A sound of metal along with a faint sensation on his neck was felt.", "As Seol Jihu subconsciously looked down, a glint suddenly flashed in his eyes.", "A pendant was dropped in the hallway, its jewel pulsing with light.", "'Huh…?'", "That moment.", "[Heeeeeeey!]", "A voice he had completely forgotten slammed into his ears.Seol Jihu narrowed his eyes in reflex before holding his breath.", "[Get a hold of yourself! Hurry!]", "The shouting voice belonged to none other than Flone.", "\"F-Flone?\"", "[Quickly! Hurry up! It’s dangerous!]", "He didn’t understand what she was saying, but whatever it was, she sounded extremely urgent. While Seol Jihu was standing there in a daze, her voice continued.", "[Are you listening? Can you hear me? Well, listen carefully. You’re thinking that the world you’re in is real, right?]", "\"Huh? Well that’s—\"", "[It’s not. You might think that, but that world is definitely not real. You’re inside your dream. You’re currently dreaming in the middle of an expedition!]", "\"….\"", "[It might sound unbelievable, but you have to believe me. Dreams are like that. You might find them ridiculous after waking up, but you don’t realize that when you’re inside them.]", "Flone was speaking extremely calmly despite talking fast.", "[Think carefully. Wasn’t there anything that you’ve experienced that didn’t seem right to you? Anything at all?]", "Seol Jihu’s mouth slowly gaped open.", "[You can hear me, right? Please, please wake up! You’re in extreme danger! You’re about to die of suffocation…!]", "The pendant bounced up and down. Seol Jihu instinctively grabbed the jewel.", "'Now that I think about it….'", "He suddenly felt a strong sense of incongruity immediately after hearing Flone’s words.", "The pendant, for a start. The fact that he could speak about Paradise meant that he had never entered Paradise.", "But how was he holding onto an item from Paradise? His foggy mind suddenly cleared up. And finally, all doubts disappeared from his eyes. He slowly, extremely slowly looked around the world.", "'Starting with Flone….'", "He wasn’t denying reality like he had when he had fallen into despair in Paradise.", "The moment he doubted his ‘dream’—", "\"Keuk—!\"", "Seol Jihu opened his eyes."]}