{"cid": "146", "title": "Chapter 146. A Dreamy Night", "content": ["She scratched, crumpled, ripped, and tore with her teeth…. Even if someone had taken a piece of paper and drenched it in water before thoroughly ripping it into pieces, it would have been difficult to make it like the current state of the painting. ", "Seol Jihu observed the frenzied Flone with an awkward gaze. She normally looked cute and innocent, just like a little girl who was unaware of the dark side of the world, but once her switch was flipped, she was an unstoppable demon that went on violent rampages. ", "However, her monstrous side could not have been more reassuring given his current situation.", "[Oh no! Did I surprise you a lot?]", "Hearing the worried voice, Seol Jihu let out the breath he had been holding. ", "“I’m fine. But what was that just now?” ", "[A kin.]", "“A kin…. You mean a ghost?” ", "[Yeah. It was probably the spirit of someone who died in this villa.]", "Seol Jihu tensed his shoulders and looked down. The fallen painting — no, the absolutely shredded pieces of the portrait came into view. ", "‘So they really existed.’", "The person must have been someone who had been murdered for political reasons or someone who died trying to sneak in the villa and steal a fortune. The sudden hunch that the villa might be a ghost nest made his chest feel tight.", "Seol Jihu closed his eyes. ", "[Are you… mad?]", "“Wait a minute.”", "He spoke with his eyes closed. ", "\"I’m doing a mind control on myself.\"", "[Mind control?]", "\"Yes. A Hyung I know taught me. It’s basically repeating ‘I can do it, I must do it’ in my mind.” ", "[But why do you need to do that?]", "“Because I’m utterly terrified.”", "He continued in a low voice. ", "“Times when I’m scared, but still need to do something… times when I don’t want to, but I still need to… It’s just a habit. Let me concentrate just a little bit more.” ", "Flone who was tilting her head in confusion murmured in a small voice. ", "[I think people are scarier though…]", "Seol Jihu burst into laughter after hearing that. ", "After around five minutes, Seol Jihu opened his eyes while letting loose a deep breath. ", "Finally achieving inner peace, his mind that finally started working again reviewed the events that happened within the past day. ", "'It’s a relief.’", "Seol Jihu made a bitter smile.", "While he thought he had come somewhat prepared, he realized he could have done more in retrospect. Since the Empire’s historical records even contained detailed accounts of the passing of a noble family’s daughter, there was no doubt that it also would have included a tale famous like the one concerning the emperor’s villa.", "He could have found more useful information by just flipping through a few annals, and with that information, he could have created more reliable countermeasures for clearing the expedition.", "He should have at least explained his situation and brought a trustworthy Archer with him. He had come alone since he didn’t want to bother anyone, but was there really no one that would have readily followed him without asking anything?", "\"….\"", "But it was all just in theory, and there was no use regretting it now. ", "The important fact was that the place he was in was an extremely dangerous location. ", "When the realization that he was practically on a one-man expedition struck him, he knew that he had made a very big mistake. ", "It wasn’t that he didn’t have anything to rely on. Yet he knew he couldn’t depend on others all the time. ", "“Sigh…”", "Roughly scratching his head, Seol Jihu suddenly saw the golden bead that he hadn’t packed. After the previous incident, his hands weren’t so eager to take it anymore. ", "“Flone. Could the woman in the portrait have been angry because I touched that without permission?”", "[No. That wasn’t it.] ", "“Then why did she look at me like that…”", "[Because she was happy.]", "\"She smiled because she was happy?\"", "[A living human being came in of his own volition.] ", "Noticing what Seol Jihu was worried about, Flone calmly explained. ", "[Not all dead are like that, but the majority of the souls instinctively want to cling onto the living when they see them.]", "Seol Jihu nodded. The dead were hostile to everything that lived. He had heard about this in the Tutorial. ", "[Because they’re envious, because they want people to know their regrets… That’s why they approach people and harass them. To make them fulfill their wishes.]", "\"I’ll have to be careful, then.\"", "[You should. But you don’t need to worry too much.]", "Flone put her hands on her hips. ", "[As long as I’m here, I won’t let them touch a single hair on you!]", "Seeing her stomp on the shredded pieces of paper and strike a pose with confidence made Seol Jihu almost shout, ‘Girl crush!’ but he hid it with a small grin instead. ", "\"Is all of this because you think I want to turn back?” ", "[!]", "“Don’t worry. Since you are putting in that much effort, what can I do but believe?” ", "[It’s not exactly like that but… Yep. Believe in me!] ", "Anyway, the conclusion was that he could take the ornaments above the shelf. The grotesque smile of the lady in the portrait was still vivid in his mind, but they were still too precious to just leave them be. ", "And so Seol Jihu gained 12 golden nuggets the size of grapes, a wide emerald cup, and a crystal lampstand. After packing them, he pondered for a while before asking. ", "\"Flone.\"", "[Yeah?]", "“Let’s cancel the plan of turning back after one hour.” ", "[Why all of a sudden… Aha!]", "Flone grinned while squinting with her white eyes.", "[Did the ornaments change your mind?]", "“No.” ", "Seol Jihu shook his head. ", "“You aren’t here to play but for a specific purpose.” ", "Flone nodded hearing the sudden remark. ", "“People tend to get hasty when they aren’t able to finish everything in time. I’ve been like that too.” ", "[Well, that’s…]", "\"So that’s why I wanted to cancel the plan. Let’s take this slow.” ", "Don’t get restrained by time, but instead, make sure to do it surely and thoroughly. ", "Flone wasn’t stupid to not understand what he meant, so a warm smile blossomed on her face. ", "[Yeah!]", "She had felt sorry for Seol Jihu since she thought she had forcibly dragged him in, so hearing him say that made her heart feel lighter. ", "[I like you!]", "\"W-wait a minute.\"", "[I like you! I like you a lot!]", "\"Flone!”", "Not only did Flone hug his neck tightly, but she also rubbed her cheeks against his face, making Seol Jihu panic once again. ", "*", "The exploration proceeded without any problems. There wasn’t even an ant in view after searching through the first and second floors. ", "Unlike their worries, they didn’t encounter anything, so while it was natural for them to feel more relaxed, Seol Jihu fixed his thoughts and did not let go of his wariness. It was because he knew that everything had only been smooth-sailing thanks to Flone. ", "But it also didn’t mean that he was going to take charge and lead the way. ", "As the old saying went, you could go halfway as long as you stayed still. ", "If you don’t sit still in your seat and do stupid stuff in a bus, such as randomly pushing the stop button or attempting to escape through the window, the bus driver would find it difficult to drive. ", "So, Seol Jihu decided to be alert at all times and move with extreme caution while he was on the expedition. After all, it required skill to ride a bus well. ", "After safely exploring the second floor, Seol Jihu proceeded onto the third floor on which he found more luxury objects. To be precise, he found a human-like doll dressed up in a full suit of armor and helmet holding a spear. ", "Their gazes were stuck on the end of the long spear, which looked like it was stained black with dried blood. ", "Seol Jihu slowly turned to stare at Flone who shook her head. ", "[I think it’s best not to touch that.]", "\"Why?\"", "[It feels strange. It’s overflowing with an ominous feeling… No, I guess it’s resentment?]", "\"Can’t you do something about it?", "[I don’t think it’s possessed by a ghost or anything. Rather, the spear itself seems cursed. Nothing good will come out of taking that.]", "Hearing that, Seol Jihu’s thoughts of taking the spear immediately vanished. Things that he felt doubtful about were best left untouched.", "‘Just how many were killed with that spear that… even the armor…’", "Then again, there were traces of an expedition team looting everything in sight; so thinking that there must have been a reason the armor was left alone, he decided to give up. ", "It wasn’t that he didn’t have any lingering regrets, but after Flone appeased him with the jewels she retrieved from the chandeliers on the ceiling, the two happily went up the stairs. ", "Now that the survey of the third floor was complete, there was only the fourth floor left. ", "[There’s less stuff than I imagined. I thought it’d be overflowing with gold.]", "\"It’s because there were people who came before us. Who would leave anything behind if there were treasures right in front of them?” ", "[Ugghh! Do you think they searched the emperor’s bedroom or his personal safe?]", "Knowing why Flone was placing so much interest in finding valuables, Seol Jihu said with a bitter smile. ", "“It’s fine. I’m content with what we’ve found so far. There’s a saying that having too much is as bad as having too little.”", "[Too much is as bad as too little… it’s a good saying.] ", "\"Isn’t it?\"", "And the moment he placed his foot on the stairway to the fourth floor. ", "“I’m really okay so you should — ?” ", "A sharp cling grazed his eardrums. ", "While it was only a minor stimulus, Seol Jihu stopped his steps ‘intuitively.’ It was because his whole body was wrapped around by a sense of danger. ", "It was an unexplainable sensation, but it felt like he had crossed a boundary the moment he stepped onto the stairway. ", "[Ah…!]", "Flone hurriedly placed herself before Seol Jihu and looked up the stairs. ", "\"Flone?\"", "[Don’t look.]", "Seol Jihu who was about to look up immediately stopped his actions. ", "[Close your eyes.]", "\"Huh?\"", "[You might fall into a trance the moment you look, so close your eyes, now!]", "Because Flone’s voice sounded extremely urgent, Seol Jihu did as he was told and closed his eyes.", "Though his heartbeat started rising rapidly because of the sudden situation, he could calm down after feeling the cold air from his ice spear. ", "[Who do you think you are?]", "Flone raised her voice sharply. ", "[Why are you hiding there? What’s with all the tricks?]", "'Tricks?'", "[…You want me to give him to you?]", "[What if I don’t want to? He’s mine.]", "Her voice rang out as if she was talking with someone. ", "He didn’t know what to make of the situation as Flone, who had always attacked first when she sensed ill intent, was trying to talk with the other being. ", "[What? You’ll tell me if I hand him over? Quit your shit, or I’ll rip your mouth off.]", "[Huh? Fuck off while I’m being nice.]", "And whilst the unknown conversation continued. ", "[You seem to be greatly misunderstanding something.]", "Flone lowered her voice. ", "[…Fine. You want a go huh?]", "The next moment… ", "Kaduduk-! Paduduk!", "The sound of teeth violently gnashing rang out right next to him, causing him to involuntarily shiver. ", "It was a familiar sound. It wasn’t a noise made by the unknown thing on top of the stairs. ", "The once fluffy smoke suddenly felt like hundreds of thousands of needles that seemingly stabbed his skin. It was the sign that Flone was extremely angry. ", "[I’ll kill you…]", "The moment the death statement filled with killing intent rang out. ", "[….]", "The grinding noise stopped, and the stabbing sensation washed away. ", "[…It fled.]", "\"Can I open my eyes now?\"", "[Yep. You can open them.]", "Opening his eyes, Seol Jihu found that the scenery remained unchanged. Only, the feeling of danger had vanished like a lie. ", "\"What was it?\"", "[A kin.]", "Flone answered with the same reply she had given on the first floor. Her voice contained a bit of embarrassment.", "[…It probably was from the same era as me. The amount of resentment it held wasn't normal.]", "Meaning, it was a ghost that was at least a couple hundred years old. ", "\"Can you beat it?”", "[It’s nothing hard.]", "Flone confidently replied.", "[There was something I wanted to know so I tried asking if it knew…]", "\"Knew what?\"", "[The memories it had when it died. Anyway, it kept blabbering about stupid things.]", "Seol Jihu had a gist of what those ‘stupid things’ were so he didn’t ask. ", "[So just as I was about to get real, it immediately tucked its tail and ran.]", "\"Then that means that there’s a possibility that your grandfather really might be here somewhere.” ", "[Honestly, I’ve almost given up on it… But there’s a little spark of hope now.]", "In other words, Flone wanted to quickly search through the rest of the villa. ", "Seol Jihu glanced up the stairway. Seeing how there seemed to be nothing there anymore, the unknown being must have really ran away. It didn’t seem like Flone was lying either. ", "\"Then let’s head up.\"", "After carefully observing with his Nine Eyes, Seol Jihu began to boldly climb the stairs. ", "Right before taking the last step to the fourth floor, he turned around just in case. ", "\"….\"", "The stairs were still there. ", "Thinking that he should take care to remember the path he took, Seol Jihu finally stepped onto the last floor. ", "The fourth floor looked particularly darker than the other floors. ", "Looking around under the light of the illuminating stones, Seol Jihu reflexively stopped breathing.", "'This smell…'", "His eyes grew serious. ", "[It reeks of blood.]", "Flone’s voice resonated.", "[Very strongly at that.]", "Seol Jihu nodded. The stench of blood was so strong that it had filled his lungs the moment he took a small breath. ", "It seemed to be relatively recent. ", "'Could it be that the expedition team..?'", "A particularly strong smell came from a certain direction. ", "Seol Jihu slightly swiped the blood on the floor. The blood dripped down from his foot as he lifted his leg. ", "'Perhaps.'", "The fact that the blood hadn’t solidified yet meant… ", "'There might be people who are still alive….'", "Swallowing back the saliva that pooled under his tongue, Seol Jihu carefully observed his surroundings. ", "The bloodstain continued across the floor and into the corridor.", "After following the trail for a bit, Seol Jihu’s expression suddenly scrunched up."]}