{"cid": "214", "title": "Chapter 214. A Dream Within a Dream (2)", "content": ["Seol Jihu froze up on the spot. Standing around with a dazed expression, he scanned the area with a dumbfounded look.", "‘There are… two colors?’", "Right. Seol Jihu’s eyes were showing him two colors — yellow and blue. The two colors mixed together like paint dissolved in water and undulated in front of Seol Jihu’s sight.", "This wasn’t the first time an object shone in the color of the right direction. He had experienced the same thing twice before, once at the valley fortress and once at the ancient emperor’s villa.", "The problem was that this was the first time that two colors showed up simultaneously. Setting ‘Attention Required’ aside, how was he supposed to interpret ‘Choice of Destiny’ blending with it?", "Just as Seol Jihu’s mind was thrown into disarray, he heard someone call out his name.", "“What do you want to do?”", "It was Chohong’s voice. Seol Jihu sighed inwardly and touched his pendant.", "‘Maybe there’s some sort of a mechanism in place to help whoever came to find the inheritance.’", "For example, a safety measure of some sort.", "‘Maybe that’s why this place is shining blue.’", "As this was something only Seol Jihu knew, he couldn’t be blamed for thinking this. However, he shook his head in the next moment.", "Being optimistic in such a dangerous, uncertain situation couldn’t be good. Flone only said that the pendant stored the coordinates of the hidden inheritance. She didn’t say anything more.", "In the end, there was only one pathway left.", "After deliberating for a long time, he decided to follow through with last night’s decision.", "“We’ll proceed.”", "A look of unease flashed across everyone’s face. Phi Sora looked especially tense, still not having overcome her trauma. Seol Jihu quietly watched his comrades getting ready to enter before speaking.", "“I’ll add one more condition. If you don’t feel at ease, you’re free to wait outside. I won’t fault you or pick a problem with it. I promise.”", "The seven members of the expedition team, excluding Seol Jihu, exchanged glances. Chohong then snorted.", "“The hell is that? Now that we’re on an expedition, we gotta act together. That’s how it is, isn’t it? Members of an expedition share the same fate!”", "Kazuki chimed in.", "“You’re not wrong, but you have to understand, given the uniqueness of this ruin.”", "“But still—”", "“I won’t argue since the leader gave his approval. Anyone’s free to stay out. But don’t forget, you won’t be included in sharing any of the loot.”", "Kazuki put the nail in the coffin by flicking in a stimulant he got from Seol Jihu into his mouth. Then, the signs of hesitation vanished. Everyone took the stimulant, put on the Flower Robe, and lit up their eagerness to go ahead.", "It was easy to see that everyone was anxious. But they were clearly shaking their fears off because of Seol Jihu’s declaration to proceed. After all, he had turned nearly impossible missions into dazzling successes several times.", "Seol Jihu didn’t reveal anything on the outside, but his team members’ expectations felt heavier on his shoulders than usual. At last, seeing Phi Sora getting ready to enter, Seol Jihu turned back to the front.", "‘I should thank my lucky stars it isn’t orange or worse.’", "No matter how much he tried to maintain his focus, he couldn’t deny feeling anxious. This was the first time he was carrying out an expedition without a single clue.", "Kazuki walked to the front.", "“Can I go?”", "Seol Jihu nodded his head.", "“I wish you luck.”", "With Yuirel’s parting words behind, the expedition team marched forward.", "*", "The conquering of the Pagoda of Dreams began.", "Just like Yuirel said, the expedition team found traces of the Sky Fairies’ attempted communication soon after marching in. Because nothing seemed out of the ordinary, the team simply passed by it.", "The forest was eerily silent, and the expedition team’s mood sunk more the deeper they went in. Maria, who was looking around the greenery, rubbed her arms and shuddered.", "“What a creepy place…”", "Chohong retorted, continually wetting her lips with her saliva.", "“Fuck, I’d rather risk my life to fight Parasites than this.”", "Two extremes were more or less the same. An area swarming with monsters was bad, but so was an area that was too bleak and desolate.", "Given the forest’s current atmosphere, no one would be surprised if something suddenly popped out of the woods. As the expedition team walked further in, the indescribable anxiousness they were feeling exhausted their tense minds.", "The severity of the atmosphere made it seem as if whoever created this place was aiming for this effect. Chohong raised her voice in an attempt to shake off this pressure.", "“Kazuki! Can you sense anything?”", "“Nothing.”", "Kazuki gave a short reply.", "“If what the Federation said is true, there should be nothing in this area.”", "“Not even the undead?”", "“Unsightly Humility should be recuperating, so it’s unlikely that the undead army is here. Plus, we can’t eliminate the possibility of the undead being able to dream. As long as they have their own will, that is.”", "“What? Undeads don’t even sleep!”", "“Then you force them to dream.”", "Kazuki spoke firmly.", "He had a point. Since animals other than humans could also dream, it wasn’t so impossible for the undead to dream.", "But that wasn’t something the expedition team should be happy about. The Pagoda’s curse had already reached them and was enveloping their bodies. Their half-burnt Flower Robes were more than enough evidence.", "Seol Jihu activated the Blessing of the Circum just in case and immediately furrowed his brows. The tri-circular shield shattered just four seconds after it was produced. It was clear that the curse was getting stronger the closer they got to its source.", "The forest grew darker the deeper they marched into it. Large trees blocked the sunlight from shining down, making the tree trunks and leaves look dark.", "The biggest problem, however, was a hazy, fog-like smoke that impaired their vision. Would it be right to describe this as walking between clouds? Perhaps Seol Jihu was mistaken, but he felt his mind growing dim and struggled to keep himself sharp.", "The stimulant must be doing its job as he could quickly clear up his foggy mind. Trying not to let his guard down, Seol Jihu chanted inwardly.", "‘Please let us get out of here safely…!’", "How much time went by?", "Kazuki suddenly gave the stop signal after walking nonstop for a long time.", "“…Seol.”", "Seol Jihu stepped forward, calming his beating heart down.", "“What’s up?”", "Kazuki didn’t say anything for a while even though he was the one who called Seol Jihu. He narrowed his eyes, then murmured quietly.", "“…Something’s strange. Presence… No. Even though they’re not moving, I feel a large number of something surrounding us.”", "What he said sounded strange if one only heard it briefly. He said they were surrounded by unmoving things, but Seol Jihu couldn’t see anything when he scoured the area.", "“Almost like statues…”", "Kazuki muttered to himself before biting down on his lip. His slightly distorted expression clearly showed that he was vexed.", "It would have been nice to tell everyone about it more clearly. He was the expedition’s header, so he was frustrated at himself for being unable to even relay information properly when they entrusted the role to him.", "His ability was lacking, strictly speaking, but no one mocked Kazuki for it.", "Kazuki was one of the best Pathfinders in Haramark. If even Kazuki was confused, the result would have been similar no matter who they brought along.", "Kazuki grit his teeth and continued.", "“That’s not all. I feel a powerful aura up ahead.”", "This was something even Seol Jihu could sense. To be more precise, he had been feeling it ever since Kazuki began to speak.", "“…Hold on, everyone. Wait here.”", "“What are you trying to do?”", "“Let me walk up just a little bit.”", "Seol Jihu walked forward by himself. It was extremely dangerous given their severe lack of information, but he had something he wanted to try.", "Before anyone noticed, the fog had gotten so dense that it was severely impairing everyone’s vision. Seol Jihu couldn’t see anything either, but he tapped on his pendant. A black smoke flowed out as if it had been waiting.", "[Un!]", "Seol Jihu asked quietly.", "“Flone, can you feel anything?”", "After a moment, the top of the smoke shook. She seemed to be saying‘No’. Seol Jihu asked again.", "“Then… can you fly forward and see what’s up ahead? Just a little bit is fine.”", "Seol Jihu couldn’t help but be sorry as he carefully made this request. In a way, he was using the fact that Flone was a ghost to dump a dangerous task at her.", "[That should be easy.]", "Flone must have been listening to Kazuki’s explanation as she accepted without any unnecessary questions.", "“Sorry! Just a peek is fine, so don’t push yourself.”", "[Okay, okay. Don’t worry about it.]", "The black smoke flew forward like flowing water and disappeared. He heard someone calling his name from behind, but he raised his hand to tell them he was okay and waited for Flone.", "‘What’s taking her so long?’", "Given Flone’s speed and the distance she was traveling, she should already be back.", "Plus, we can’t eliminate the possibility of the undead being able to dream. As long as they have their own will, that is.", "As he grew nervous, remembering Kazuki’s words, a black smoke cut through the fog and reappeared.", "Seol Jihu barely held himself back from shouting.", "“Flone, are you okay?”", "[Un. There wasn’t anything out of the ordinary.]", "Flone whispered in a ladylike manner.", "[I didn’t see anything special… well, other than a pile of rocks that was shining blue.]", "“A pile of rocks?”", "[Yeah, it looked like this.]", "The black smoke flew down and drew a picture on the dirt. Two headstones were standing vertically and a large flat stone was sitting horizontally on top of them. The entire structure looked just like a dolmen.", "[It looked kind of odd… so I flew over and poked it, but nothing happened.]", "Seol Jihu smiled bitterly. He had told her to only take a look, but it seemed curiosity had gotten the better of her.", "[Should I go break it?]", "“No, no, it’s fine.”", "Seol Jihu stopped Flone. The problem was that he didn’t know what the pile of rocks was. Breaking the stone structure would be great if it resulted in the fog or the curse lifting, but it could also be the same as poking a beehive. As no one knew what result it would bring forth, it was best not to touch it so recklessly.", "Seol Jihu returned to the expedition team.", "“A dolmen that’s shining blue?”", "When he explained what Flone told him, Kazuki gave him a strange look.", "“How did you see? I still can’t see anything with my eyes.”", "“Oh, uh….”", "“You didn’t even go that far out.”", "Seol Jihu let them know about the dolmen since now wasn’t the time to hide any information, but he was still hesitant to reveal Flone.", "It as then that Chohong suddenly spoke.", "“Oh right, what was that about?”", "“?”", "“During the war! You flew in the air! You said you’d tell me after the war. Argh, I’ve forgotten about it until now.”", "[Chet, I got tricked!]", "‘Tricked?’", "Seol Jihu smiled bitterly. His comrades did not know about Flone yet. A part of the reason was how secretive Flone was, but the main reason was that she hated revealing herself. Even last night, when the team was having banquet noodles, Flone had gone off by herself to eat in secret.", "Seol Jihu suggested many times for Flone to introduce herself to the team, but she flew off whenever he brought up the topic.", "The reason was rather silly as well.", "She said she was too embarrassed.", "‘She can’t hide herself forever.’", "It really looked like Flone was just embarrassed, so Seol Jihu decided to introduce her once and for all after the expedition.", "But since they were in the middle of an expedition right now, he only revealed the necessary bits. When he explained how Flone came to accompany him, everyone’s expressions turned strange.", "And when he mentioned that she was the evil ghost from the Forest of Denial’s tomb, Chohong and Hugo let out loud gasps.", "“Wha, wha, wha, what? T-The ghost that killed Samuel’s team?”", "“Stop.”", "Kazuki cut Chohong off.", "“We’ll listen to the full story later. We’re in the middle of an expedition right now.”", "He then turned to Seol Jihu.", "“I know you have your own thoughts as the leader. I’m not trying to intrude on your authority, but I think it would have been better if you told us about her sooner.”", "“….”", "“That way, we would have been able to check if the curse affected ghosts as well when the Sky Fairy lifted the curse for us, and she could have scouted for us too.”", "Seol Jihu dropped his jaw at Kazuki’s perfectly logical argument. He had indeed not thought that far.", "“Sorry. She just hates showing herself in front of others….”", "“Mm… I guess it can’t be helped then.”", "Kazuki slowly closed his eyes. He seemed to be organizing his thoughts. After a brief moment of silence, Kazuki opened his eyes and asked.", "“So to sum it up, you asked this ghost to scout what’s up ahead?”", "“Yes.”", "“This is a ghost, not a human.”", "Kazuki seemed to be focused on the fact that Flone was a ghost rather than the dolmen she discovered. Seol Jihu was having similar thoughts.", "“Yes, but her ego and consciousness is crystal clear. She’s no different than a human. She even sleeps periodically.”", "“…What an interesting ghost.”", "[What? What are you suggesting here? Is there a rule that says a ghost shouldn’t sleep? Have you tried being dead!?]", "Flone fumed from inside the pendant. Of course, only Seol Jihu could hear her, and Kazuki smacked his lips.", "“Looks like we have no choice but to keep going. We can’t treat humans and ghosts the same, but we don’t really have a choice.”", "Seol Jihu agreed with this statement.", "“Yes, I think so too.”", "Once the leader and the header came to an agreement, the expedition team began to march forward again. No, just as they were about to start…", "“Oh?”", "Phi Sora’s shrill voice grabbed everyone’s attention. She was looking down at the ground with her right foot raised and with a bewildered expression.", "“What’s wrong?”", "“N-Nothing. I think I stepped on something….”", "Seol Jihu examined the thicket carefully, but he didn’t see anything strange.", "“You sure you aren’t just imagining it?”", "“No, I definitely felt something….”", "Phi Sora tilted her head, then moved away as if it was unpleasant. After this short happening, the expedition team slowly marched forward.", "Not long afterwards, they began to see a bluish glow, just like Flone said. The light became brighter the deeper they went in until their surroundings were half-fog, half-light.", "Finally, when they could vaguely see the pile of rocks from the distance…", "Kazuki, who was standing at the front, leaned back and whispered.", "“I think that’s it—”", "It was then.", "Paat!", "While everyone was looking straight forward, the dolmen-like pile of rocks burst into blue light.", "‘What?’", "Seol Jihu shut his eyes reflexively as if a camera flash had gone off in front of him. Intense dizziness instantly swept through his head.", "[Aaahhh?]", "Starting with Flone, several groans rang out. Seol Jihu felt his body sway. He immediately opened his eyes and looked around the area. Everyone was squinting or covering their eyes with their hands. Other than that, he didn’t see anything strange. Nothing really caught his attention either.", "When he looked down, wondering if anything happened to his body…", "“!”", "Seol Jihu blinked quickly.", "The pendant, which had turned black after Flone’s liberation, was glowing brightly.", "And in the same shade of blue as the dolmen."]}