{"cid": "447", "title": "Chapter 447. While He is Gone (4)", "content": ["Seol Jihu was still in the hospital.", "His routine couldn’t be more boring. Every day he was examined, given pills and injections, and he slept. When he wasn’t sleeping, he spent all his time staring into the air.", "His doctor told him he shouldn’t rely on pills and suggested reducing doses over time, but Seol Jihu had no intention of following his advice.", "It wasn’t that he didn’t try. He did, but nothing changed. A splitting headache shook his brain whenever the effects of the drugs wore off. Moreover, his sense of emptiness and lack of motivation deepened, driving him further into a severe depression.", "Seeing how much pain Seol Jihu was in, his doctor once again prescribed antidepressants to him, admitting that even though it was only a temporary solution, it was what he needed at the moment.", "Yes, this was much better than before. His senses grew dull and he couldn’t move his body as well as before, but at least, he didn’t feel any pain—because he felt almost nothing.", "If he were to develop tolerance to the current dosage, it would have to be increased. Not even his doctor was sure how long the drugs would work. Regardless, he felt grateful for the numbness caused by the pills.", "Of course, that was only in his opinion. Others could tell he was getting thinner and paler by the day.", "Today too, Seol Jihu was lying in his bed with a blank expression across his face, his eyes staring into space.", "Yoo Seonhwa peeped inside the hospital room with a worried look before clearing her throat.", "“Jihu~”", "Trying to sound happy and bright, she entered the room, holding a tray.", "“I’m back. It’s already lunch-time, so I grabbed some food from the cafeteria. Let’s eat.”", "Yoo Seonhwa chattered, as she removed the restraints that had been placed on Seol Jihu. The hospital allowed patients’ restraints to be removed while their drugs were in effect, at their guardians’ discretion.", "“Wow. There’s a reason they say that SY is the best of the best. Look at this. It’s huge, right?”", "With a look of pleasant surprise, Yoo Seonhwa picked up a large piece of grilled shrimp with her chopsticks.", "Seol Jihu was silent. He’d been staring into space ever since Yoo Seonhwa entered the room.", "“Let’s dig in before it gets cold. Here, I’ll peel it for you.”", "Yoo Seonhwa peeled a shrimp and brought it close to his mouth.", "Seol Jihu finally responded. He shook his head slightly from side to side to indicate he didn’t want to eat.", "“Just try one bite. You love grilled shrimp.”", "“…”", "“Jihu? Come on, say ‘ah~’”", "Seol Jihu turned his face away from her.", "“Jihu….”", "Yoo Seonhwa’s smile faded. She bit her lower lip and let out a long sigh.", "“You have to eat to get better….”", "She murmured with downcast eyes and began stroking Seol Jihu’s back with her palm.", "“…Alright.”", "After a moment of silence, Yoo Seonhwa leaned toward Seol Jihu.", "“Do you want to go out for a walk? Maybe that will make you feel better. What do you say?”", "Again, there was no reply from Seol Jihu. Nonetheless, Yoo Seonhwa pulled him up from the bed and pressed the nurse call button.", "Seol Jihu was dragged upstairs to the hospital’s rooftop. A belt, which was connected to a rope in Yoo Seonhwa’s hand, was tied around his waist, and two male nurses accompanied him as well.", "The sky was clear and the wind was cool.", "There were several people on the rooftop. Seol Jihu’s eyes immediately met those of a person staring at him from afar, but he paid no mind to it.", "“This sure calls for a misunderstanding, huh?”", "Yoo Seonhwa lifted her end of the rope and smiled bitterly.", "“The weather’s nice~ I hope you get better soon so that we can go out and play.”", "She made Seol Jihu sit on a bench before flopping down beside him. Then she began to chatter without a pause. This confused Seol Jihu. She wasn’t like this when she threw the 2 million won in his face….", "Or was she?", "Seol Jihu’s forehead tensed in a small frown. It was then.", "Buzz!", "Yoo Seonhwa’s voice stopped at the same time as a vibration rang in her pocket.", "“Ah….”", "She saw the name on the screen and glanced at Seol Jihu.", "“Wait here. I’ll get you something to drink.”", "Seol Jihu couldn’t tell if it was an important call or if it was something else, but he was better off not knowing. Anyhow, Yoo Seonhwa handed the rope to the nurse and got up.", "“Yes, yes…. Right now….”", "Yoo Seonhwa’s voice receded farther and farther into the distance.", "In the meantime, Seol Jihu sat perfectly still, his eyes staring up at the sky when suddenly someone approached him from the railing and sat down next to him.", "“Hey.”", "A voice called him.", "Seol Jihu slowly dropped his gaze.", "There, he saw a woman whom he had probably never met before in his life, looking at him with a bright smile across her face. He could tell from the way she was dressed that she was a patient just like himself.", "“Yes, you.”", "“…”", "“Haven't we met somewhere before? Ah, don’t get me wrong, I’m not trying to hit on you. I’m really just curious.”", "“…”", "“You’re quiet, aren’t you? You remind me of myself when I first came to this hospital.”", "The woman smiled when Seol Jihu remained silent.", "Seol Jihu slowly shook his head.", "“No? That’s odd. You look familiar….”", "The woman tilted her head slightly, but before long, she shrugged as if the issue had already disappeared from her mind. Then she raised her arms above her head and stretched.", "“Isn’t the weather nice today?”", "With an expression as bright as the autumn sky, the woman closed her eyes to enjoy the cool breeze on her face.", "Seol Jihu was about to turn his eyes back to the sky, but instead, he stopped to examine the woman who was brushing away her hair from her face. Perhaps it was because of what she said that suddenly made him feel like he had, in fact, seen her somewhere before.", "“When I’m feeling down and low, I find that the best solution is to go on a trip. The weather’s so nice, too….”", "The woman opened her eyes slowly and glanced at Seol Jihu.", "“Should we go?”", "“…”", "“On a trip, I mean. Should we just leave?”", "Seol Jihu couldn’t figure out why she was asking him of all people. He turned his gaze away from the woman, not even bothering to answer her question.", "“To somewhere, no one knows.”", "But that was before she said this. Seol Jihu turned his gaze back to the woman, and she smiled.", "“Over there.”", "Suddenly her voice dwindled to a whisper. She quietly gestured behind her. Seol Jihu’s eyes now reflected the sky and the cityscape beyond the railing.", "“Do you want to go with me?”", "A trip…. A trip to somewhere no one knows.", "Seol Jihu stared at the sky with empty eyes. He didn’t know why, but he felt intrigued by the woman’s suggestion. A trip sounded nice to him.", "“But you have to make some preparations beforehand.”", "Seol Jihu’s eyes widened slightly.", "“Because you won’t be able to leave in that state.”", "The woman pointed at the belt tied around Seol Jihu’s waist.", "“So smile.”", "Smile?", "“Like this. Look at me.”", "She pulled up the corners of her mouth with the tip of her fingers. Her red lips curved upward to form a smile.", "“Smile even if you feel sad, and then you can go on a trip.”", "He then noticed that there was no rope attached to the woman and no nurse watching her nearby.", "“How about it? When you’re ready, we should—”", "It was then.", "“Jihu!”", "Yoo Seonhwa hurriedly jumped in between them, looking slightly angry.", "“You…!”", "The woman met Yoo Seonhwa’s fierce glare with a look of innocent surprise, tipping her head slightly to the side.", "Fuming from her nose, Yoo Seonhwa turned her head to the nurse.", "“Why didn’t you stop them?”", "“Pardon? But they were just talking… and it wasn’t anything weird. They were talking about going on a trip.”", "“A trip?”", "“We don’t necessarily stop patients from interacting with each other unless otherwise noted.”", "Yoo Seonhwa let out a deep sigh.", "“Jihu. What did she say to you?”", "“…”", "Yoo Seonhwa looked down at Seol Jihu and clicked her tongue.", "“…Let’s go back to your room.”", "She grabbed Seol Jihu’s arms and helped him up.", "‘A trip….’", "While heading for the stairs, Seol Jihu glanced behind his shoulder. It turned out that the woman was also looking at him, and their eyes met.", "The woman waved and smiled brightly as if assuring him that they would meet again.", "*", "Draft calls were issued in all of the cities.", "The situation was grim.", "The Parasites, with their superior mobility, invaded both Grazia and Caligo at the same time. Sung Shihyun and Vulgar Chastity were in charge of the former while Exploding Patience and Twisted Kindness were in charge of the latter.", "Fortunately, unlike Nur’s case, the two cities were able to evacuate their residents before the enemy arrived. But the fact remained unchanged that humanity lost two cities without even getting a chance to fight back.", "They had no choice. The Parasites attacked with a ferocity that the two cities couldn’t possibly stand.", "The Parasite Queen’s intention was clear. She was taking advantage of Seol Jihu’s absence to destroy any and everything that he might come back to.", "The Federation dispatched auxiliary forces and humanity was gathering soldiers as well. However….", "‘We have to save at least one city….’", "The situation was not in their favor. Nur and Scheherazade were already in ruins, and now two more cities were under enemy control.", "Only three cities remained.", "Both Odor and Haramark lost their use as fortresses when the enemy penetrated their rear defense. The only comforting thing about the current situation was that Eva, which was closest of all cities to Tigol Fortress, and whose fortification was almost complete, still remained intact. However, there was no guarantee that it would stay that way even after the Parasites decided to attack it with full force.", "“Haaaa….”", "Teresa looked down at the map spread across her desk and fell into contemplation. She was so focused on her thoughts that she failed to notice the footsteps approaching her.", "“Take a look at this.”", "“…Hmm?”", "It wasn’t until she saw a necklace dangling in front of her that she came to her senses.", "The necklace was beautifully handcrafted.", "Teresa raised her head. Prihi pulled his arm back, then tossed the necklace into the air and caught it again, as if to flaunt its splendor.", "“…Father?”", "“Yes, it is me.”", "“That necklace….”", "“It’s my wife’s and your mother’s keepsake.”", "Prihi answered calmly.", "“And it’s also a Royal Oath.”", "“…What?”", "After a brief pause, Teresa jumped back in surprise.", "Prihi snorted.", "“Why are you so surprised? You know that both you and I each have one.”", "“But you said you already used it!”", "“I said that I would accept Valhalla’s terms, but never said that I used the Royal Oath to gain the right to manage Earthlings’ settings.”", "“…”", "“But my kind and generous future son-in-law sent the members of the Federation to Haramark without even double-checking. I trusted him not to kill his future father-in-law over this.”", "Prihi winked.", "Teresa’s face brightened.", "“So… you had it with you this whole time?”", "“Mm. Well, since there’s only one left, I was going to use it at an appropriate moment. I knew the Parasites wouldn’t leave us alone.”", "Prihi shrugged his shoulders and continued.", "“The truth is that I tried to use it many times already.”", "“?”", "“How could I sit still knowing my future son-in-law is in danger? I heard one Divine Wish isn’t enough, but I figured I’d convince them somehow.”", "“You did!?”", "Teresa leaned forward in excitement.", "“Yes.”", "Prihi tilted his head back calmly.", "“I asked them if they could reduce the number of contribution points needed for the Divine Wish or modify the resurrection setting.”", "“And?”", "“They said both can’t be done.”", "“But why!?”", "Teresa sounded desperate.", "“More precisely, they said it would be a waste of a good Royal Oath.”", "Prihi gave a bitter smile.", "“At its core, a Royal Oath is a Divine Wish. The only difference is that the gods can’t refuse it.”", "Which meant that Royal Oaths too had limits.", "“There’s no reason for me to use it if it can’t achieve more than a Divine Wish can.”", "Basically, a Royal Oath’s maximum output was the same as that of a Divine Wish, and nothing worthwhile could be achieved with just one in regards to the problem at hand.", "“When I heard that, I couldn’t press them further. Now that I think about it, if it were really possible to wish for something of that caliber, I probably would have wished for 100 new Royal Oaths.”", "Prihi muttered, looking slightly downhearted.", "“…What about the resurrection setting?”", "“Same. It can’t be changed with a single Royal Oath. They said if they could, they would’ve already modified it.”", "Prihi smacked his lips.", "“The cause of my future son-in-law’s death is the Parasite Queen…. The gods said in order to change the result, I need something that could match the grandiosity of the cause, and one Royal Oath falls short by a lot.”", "“…”", "“They kept mentioning the law of causality, the law of the world, blah, blah, blah…. I couldn’t understand any of it. Anyway, I began thinking about what to do next….”", "Prihi fidgeted with the necklace before suddenly swinging his arm.", "With widened eyes, Teresa instinctively reached out her hand.", "“I, Prihi Hussey, hereby transfer the ownership of the Royal Oath, to Teresa Hussey.”", "The announcement was all too sudden.", "“F-Father?”", "“Well… Do think of it as your dowry. It’s the least I can do as the father of a daughter who’s going to marry the greatest hero of our time.”", "Teresa’s jaw dropped slowly.", "“I noticed that you’ve been falling behind your rivals ever since you two parted. Use this as an opportunity to win his affection.”", "“Ah….”", "Teresa became speechless.", "Prihi smirked.", "“Anyway, that necklace is now yours. Use it at your own will but with discretion.”", "“Father…!”", "Teresa’s voice rose in pitch.", "Seeing his daughter’s eyes sparkle with delight, Prihi spread his arms wide open with a gentle smile.", "“Yes, my daughter….”", "And Teresa….", "“I’ll go tell everyone right now!”", "…rushed out of the room, past her father, with the necklace in her hand.", "“…”", "A gust of cold wind blew past Prihi.", "“So much for raising a daughter….”", "His arms dropped to his sides.", "‘I miss you, sweetheart.’", "His heart began to fill with a longing for his wife, who he lost during the war.", "‘Gee.’", "But shortly after, Prihi broke into a smile.", "It wasn’t as if he gained nothing. He got to see his daughter smile, who he knew was only pretending to be okay.", "‘The number of Divine Wishes required has been reduced by one. However….’", "Prihi fell deep into thought as he shuffled out of his daughter’s room.", "The decision made by the Star of Avarice was a reasonable one. If only acquiring a Divine Wish was easy….", "When Prihi heard from the gods that no Earthling in Paradise currently had enough contribution points to exchange for a Divine Wish, he immediately abandoned that method. It was not only dangerous but also virtually impossible to obtain the necessary contribution points during the coming war.", "So there was only one hope left—he somehow had to obtain a second Royal Oath.", "‘Eva’s already used theirs… and Nur’s can’t be transferred…. What should I do….’", "The Queen of Grazia had already used hers a long time ago to revive her dead son. It’s a shame because even though she used a national treasure for her personal gain, her son died again in less than two years fighting in the war.", "Odor and Caligo’s royal families used theirs to obtain the right to manage the Earthlings’ settings when they first allied with the Federation.", "In the end, there was only one royal family left.", "‘Given the circumstances, she may have already used it. But….’", "He couldn’t know for sure, but if there was any chance at all, he had to reach out for it. A name crossed Prihi’s mind.", "Roe Scheherazade."]}