{"cid": "286", "title": "Chapter 286. After the Setup (7)", "content": ["‘Modern dance major, huh.’", "It was an answer that was outside his expectations, but it didn’t matter.", "“Nothing. I just thought you’d be a student at a police academy. Or a police science major, at least.”[1]", "Seol Jihu let out a laugh before replying. He then let out a long sigh and started to think while clasping both hands together and rubbing his thumbs.", "He knew what she was getting at. The problem was whether it was possible or not.", "“Hmm….”", "Silence fell again.", "Wooo— Woooooooo—", "Only the howling of the killer they had thrown outside the backdoor could be heard. While Seol Jihu’s face grew more solemn as he fell deeper into his thoughts, Eun Yuri gently waved her hand.", "“It was just my opinion. There’s no need to do it if it’s too difficult.”", "“No, that’s not it.”", "Seol Jihu shook his head.", "“It’s not a bad plan. If it works, it’s good for us, and if it doesn’t… well, it won’t be without any risks, but I think I can manage.”", "“…”", "“The problem is whether it’s possible or not… I’ve actually also been summoned from Earth, so all my artifacts and equipment were left behind in Paradise.”", "After saying so, Seol Jihu organized his thoughts.", "According to the Diary of an Unknown Survivor, they managed to successfully catch another killer after killing the first one. From the contents of this entry, it wasn’t likely that the difficulty of the Tutorial would suddenly rise to an impossible level even if they killed off one of them.", "It was probably correct to assume that the remaining killers gradually increased in strength whenever they killed one.", "‘If that’s the case…’", "Seol Jihu finally decided after thinking hard about it.", "“It sounds good. I think it’s at least worth a try.”", "Maybe they could really find the hidden space. If Eun Yuri was correct, the rest of the Tutorial would become much easier. He began to get fired up.", "Seol Jihu brightly smiled and spoke.", "“Since we happen to have what we need, should we start right away?”", "“Yes.”", "Just when the two of them stood up simultaneously as if on cue…", "Koong koong, koong koong koong koong!", "They suddenly heard someone banging on the door.", "Seol Jihu and Eun Yuri reflexively turned to stare at the front door before quietly looking at each other.", "Click, click!", "They could also hear someone trying to open the door. It sounded like the person was in a hurry.", "When Seol Jihu signaled Eun Yuri by placing his index finger on his lips, Eun Yuri silently nodded her head.", "Seol Jihu crept towards the front door as silently as possible.", "“…”", "Was it his imagination that he heard a faint sound from outside the door?", "‘The color is green, but…’", "Seol Jihu gently put his ear on the door.", "“Help… Please help me…”", "A struggling voice.", "“Whoever’s inside… the lights were on… please… help me…”", "The voice came and went intermittently as if it was on the verge of being snuffed out. The man seemed to be dying judging by his shortness of breath.", "‘It might be a killer trying to trick us by sounding like a survivor… no, wait.’", "It didn’t matter even if it was a killer.", "After Seol Jihu muttered to himself, he tightly gripped his machete. When he stepped back after opening the locks, the door slid open as a large man collapsed into the room. It seemed like the man had been leaning on the door.", "“Keu… Uhh… “", "Seol Jihu frowned after seeing the man convulsing on the ground.", "He could tell at first glance that his condition was critical. Besides the numerous stab wounds all over his body, there were many holes with teeth marks scattered across his limbs. They looked as if something had sunk its teeth into him and chewed until his flesh hung in tatters.", "“Are you alright?”", "He quickly kneeled on one knee to examine the man’s wounds, but there was nothing he could do for him at the moment. Seol Jihu wasn’t a Priest nor did he have any medical supplies with him.", "Rather, it was doubtful whether he could be saved even if he had the supplies. His injuries were so severe that he was surprised the man had made it this far.", "“Please… please save me…”", "The man desperately pleaded with a dying voice.", "“What happened? Were you attacked by the killer?”", "“I-I don’t know. I was caught while running from the lot…”", "‘He was caught?’", "The axe killer had chased after Seol Jihu and Eun Yuri. In other words, it meant that the man had been caught by another killer.", "“Can you give us more details?”", "The man’s eyes trembled. Looking at him now, he resembled a large dog with his big stature and gentle eyes.", "“You….”", "He opened and closed his mouth before scrunching his face.", "“Keuk,” he let out a moan.", "“Be… be careful.”", "His voice became a little clearer as he forcibly squeezed out the words.", "“Be careful?”", "“Yes. The killer… he put me here.”", "Seol Jihu’s eyes narrowed.", "“As for the reason… I don’t know either… The bastard placed me in front of this cabin and then… he suddenly disappeared…”", "The man continued with great difficulty while gasping for breath.", "“Was there anything else that was strange?”", "“Uh… I feel like I’ve heard a strange howl…”", "A howl.", "Seol Jihu was jolted back to his senses as soon as he heard that. Now that he thought about it, the axe killer’s howls had abruptly ceased at some point. Suddenly, the Diary of an Unknown Survivor flashed past his mind.", "[We need to look for a way… but the killer’s howls are noisy.][We need to hurry up and do something about it…]", "‘No way.’", "“Miss Eun Yuri.”", "When he stood back up and turned around, he saw Eun Yuri ripping a sheet she had dusted into long strips.", "“Stay here.”", "Seol Jihu flew out the door as he said that. Lightning sparked from his feet as he stamped the ground.", "Pang!", "As expected, when he tore through the back door…", "…He could see another killer squatting next to the axe killer, attempting to untie it. As the ropes were tied around the axe killer in a tortoise shell binding, making it hard to unravel, the killer had given up trying to use his hands and resorted to ripping it apart with his teeth.", "“You bastard.”", "The killer raised his head in surprise as Seol Jihu immediately rushed towards them. However, its opponent was too fast. Seol Jihu transformed into a ray of light as he bolted towards the killer and swung his machete.", "Pak! Before the killer could respond, the machete slashed across its neck. The killer fell on its side without being able to even scream. Its body started convulsing as a fountain of blood sprouted from its neck.", "“Woo— Wooooo—”", "The axe killer started to howl again once he saw its companion fail in its rescue.", "‘Did the diary entry mean this when they said they had to quickly do something?’", "Who knew that the killer would try to call its companions to make an escape? Seol Jihu and Eun Yuri had almost lost the necessary material for their plan.", "“This says it’s the cannibal killer.”", "Seol Jihu heard a voice from the back door as he was sighing in relief. Eun Yuri was looking at Seol Jihu while holding her phone.", "‘Cannibal.’", "He didn’t have to read the diary to guess.", "“How’s the man?”", "“He fainted. He’s still breathing so I assume he’s alive, but…”", "Eun Yuri trailed off.", "Seol Jihu clicked his tongue as he shook the blood off the machete. Bandages and disinfectants were probably not enough to heal the man, and going to the Neutral Zone was also out of the question.", "The only way to save him was to find something equivalent to a high-rank healing potion. He wasn’t sure, but he could only think of one place that might have such an item.", "“Are you fine with leaving right now?”", "“Yes. I’d prefer that actually.”", "“Okay, then…”", "Seol Jihu glanced down. They suddenly had two materials available… although one seemed to be on the verge of death.", "Seol Jihu first went inside to examine the fainted man. Eun Yuri had wrapped his body in multiple strips of fabric to stop his bleeding before hiding him under the bed. That was the best they could do for now.", "It was all up to the man to endure before Seol Jihu returned with an adequate healing item.", "After extinguishing the lights and tightly closing the door to the mountain cabin, Seol Jihu asked Eun Yuri to tie the axe killer back up.", "Seol Jihu chuckled seeing Eun Yuri tie the killer back into the tortoise shell bind.", "‘Do they teach this in modern dance nowadays?’", "In any case, it was all good since it delayed the killer from saving its companion.", "When she finished tying the killer up, Seol Jihu took the end of the rope and tied it tightly around his waist. He then circulated his mana, causing electricity to spark all over his body.", "Watching the electric discharge with curious eyes, Eun Yuri blinked rapidly.", "“No way, are you planning to bring it along?”", "“Yes, we can’t have him escape.”", "Seol Jihu continued while stretching his waist and rotating his ankles.", "“I think it would be good to have a spare.”", "“Still…”", "“It’s fine. Running is my specialty among specialties.”", "Seol Jihu grinned as he passed her the machete.", "“I’ve run with dozens of logs tied to me. I’ve also hit different colored stones thrown in the air while using Flash Thunder. Anyways, this much isn’t anything.”", "Eun Yuri tilted her head but still took the machete.", "“Can you kill?”", "“Yes, may I?”", "“Of course. Ah, but immediately afterward…”", "Seol Jihu jumped in place a couple of times to warm up and patted his chest.", "Eun Yuri lowered her head to look down at the cannibal killer while tightly gripping the machete.", "“Seup—”", "She quietly took a breath before stabbing down the machete without hesitation. The blade accurately pierced through the wound that Seol Jihu made before. The cannibal killer trembled before its convulsions quickly stopped.", "Eun Yuri gripped the handle with both hands and twisted it left and right to force out the machete. She had better skills than he had expected.", "“Guooo—!”", "A death throe sounded. Following that, a dark smoke slipped out of the killer’s body, just like the Diary of an Unknown Survivor had described.", "It climbed high in the skies like smoke rising out from a chimney, then speedily moved towards a certain direction.", "“Miss Eun Yuri.”", "Seol Jihu called out to Eun Yuri without taking his eyes off of the smoke. When Eun Yuri hurriedly came towards him, he lifted her up, supporting her back and calves in a princess carry.", "“Hold on tight.”", "After seeing Eun Yuri nod her head, Seol Jihu lowered his stance.", "“We’re off.”", "And the moment he heavily stamped the ground…", "Chaaaak!", "Seol Jihu’s figure abruptly shot forward accompanied by a clap of thunder. It was a speed that could not be followed by the average person. Only the direction he was moving in could be estimated by the mad flinging of the axe killer tied to Seol Jihu’s waist, as it was flying up and down like a mad seesaw.", "“Mommy!”", "Eun Yuri uttered a belated cry of surprise, terrified at the speed that far surpassed her imagination. At last, she hastily wrapped her arms around Seol Jihu’s neck.", "‘It looks like she’s right.’", "To sum up Eun Yuri’s plan in one word, it was ‘pursuit’.", "She had deduced that there was a connection between the killers and the Sixth Mother, pointing out two sentences in the diary as evidence.", "[As the killer screamed its last breath, black smoke shot out of its body and disappeared into the far distance.][How can we eliminate the killer without the Sixth Mother finding out?]", "If these lines were intentionally placed in the entry like Eun Yuri said, there was definitely a relationship between the Sixth Mother and the killers. This was why she suggested killing one of the killers and following the black smoke when it came out. There was a possibility of the killer’s ‘soul’ returning back to where the Sixth Mother was to inform her of its death.", "‘And the place where the Sixth Mother is hiding is likely to be the hidden space.’", "It was a plan that an ordinary person couldn’t even dream of. However, Seol Jihu was different from any other survivor.", "He was a Level 5 Earthling possessing a movement technique called Flash Thunder, an upgraded version of the Flash Steps.", "It was too bad he didn’t have his Festina Earring with him, but as Seol Jihu had said before, running was his specialty.", "He had been forced to run with his stamina already depleted, across volcanic areas and places known for their rugged topography like the Huge Stone Rocky Mountain all the while carrying sandbags and dragging tens of logs.", "Crossing a forest while dragging a single, scrawny killer was the same as sprinting on flat ground for him.", "Thanks to Jang Maldong’s hellish training, Seol Jihu could maintain the use of Flash Thunder to follow the smoke.", "*", "How long had he been running for?", "The black smoke flew across the sky for a long time before it finally started to descend as a large mountain next to the ocean came into view.", "It dropped straight down like it was crash-landing before disappearing somewhere near the waist of the mountain.", "[The ‘cannibal killer’ has been killed by a certain survivor.]", "[The ‘Sixth Mother’ is angry.]", "[The remaining killers will become stronger. Their movement speeds have increased.]", "[The Sixth Mother’s rage has been transmitted to the killers. The remaining killers will now drop everything to chase the murderer upon sight.]", "A series of messages were suddenly heard.", "‘Damn.’", "Seol Jihu flew in pursuit before stopping to look around the area where the smoke had vanished.", "It was dark but thanks to his improved vision after eating the Golden Wind Phoenix, he could distinguish the shapes around him relatively clearly.", "Only, the smoke was nowhere to be seen.", "At that moment, Seol Jihu found a wisp of smoke rushing past his waist. Seol Jihu quickly chased it to a cliff covered by thick vines and strangely shaped stones. There, he clearly saw the smoke disappearing into a cave carved into the cliff, facing the sea.", "[The ‘axe killer’ has been killed by a certain survivor.]", "[The ‘Sixth Mother’ is furious.]", "[The remaining killers’ five senses will sharpen. They will be able to find the locations of the survivors more quickly.]", "[The killers become more hostile. One of the killers will start looking for the murderer that killed its companions.]", "‘Oh?’", "The axe killer died?", "‘I didn’t even hear its death throes.’", "Seol Jihu subconsciously looked behind him.", "A sack of meat was hanging at the end of the rope tied around his waist. It was a corpse that was pitiful to look at with its entire body mangled and ripped apart.", "‘Ah.’", "Seol Jihu finally understood what had happened.", "The smoke that had disappeared into the cave just now was the soul of the axe killer that had given up its breath after he had arrived at the mountain.", "It seemed to have died after being smashed around on its way here. Eun Yuri was protected by Seol Jihu, but the killer had practically been tied behind a horse sprinting at full speed.", "He had focused all his attention on following the smoke that he completely forgot about it.", "‘Whatever.’", "The killer had only been a material they needed to use to locate the hidden space.", "Seol Jihu shook Eun Yuri who was in his arms while looking at the dark cave which was 10 meters in front of him.", "“Miss Eun Yuri! Miss Eun Yuri!”", "Bzz, bzz!", "Hearing the phone buzzing just in time, Seol Jihu lowered his gaze with a happy expression.", "1. Police science is an actual major taught at the Police Academy/ University in Korea. If you are interested in reading up more then check the Wikipedia article for ‘Korean National Police University’, and the section ‘Academics’ for more info. "]}