{"cid": "11", "title": "Chapter 11. The Different Types of People (2)", "content": ["[A new user has been registered.]", "Clang!!", "Accompanied by dull metallic clanks, the pointed ends of the metal spikes separated from the ceiling almost immediately and then retracted into the floor below with an even faster speed. As soon as those metal spikes were gone, the space in the front became a wide-open passageway they could enter.", "“W-What the hell just happened? What did you do?”", "Hyun Sangmin was full of questions as he tried to follow after Seol and walk past the area of the spike barrier.", "Slam!", "“Huh!?”", "As soon as Seol walked past, the spikes shot right back up and slammed into the ceiling once more. Having become separated, Hyun Sangmin held onto the spike barrier and shouted out in alarm.", "Seol also fell into a state of confusion. But he spotted a red button mounted on the interior wall near the barrier. He quickly pressed it, and the metal barrier squeaked noisily before retracting again, just as he suspected it might.", "“D-Damn… Feels like I lost ten years of my life just now.”", "Hyun Sangmin hurriedly entered past the barrier and rubbed his chest to calm his pounding heart.", "[Mister Hyun Sangmin has arrived at the second-floor waiting area.]", "Hearing that, Seol flinched slightly. He was caught off guard as he had forgotten about the automatic arrival announcements.", "When he took a glance at Hyun Sangmin, he was only spitting out sighs of relief. It seemed that he had not noticed the announcement yet. Perhaps he missed it from all the shouting, as well as the sound of the metal barrier opening and closing.", "“Oh! So you've finally arrived…. Hm?”", "Kang Seok was waving his hand towards Seol, but when he spotted Hyun Sangmin, the ends of his sentence trailed off.", "“…What the. You two decided to work together?”", "Hyun Sangmin raised his head after hearing Kang Seok's rather unhappy tone of voice.", "“What about you then?”", "“Well, as you can see. We arrived here a long time ago.”", "Kang Seok winked in a playful manner.", "Seol looked around and found Yi Hyungsik and Jeong Minwoo as well.", "The so-called waiting area reminded him of a regular high school corridor. With the exception of steel bars barricading the windows, everything looked the same. At the end of the passage to the left, there was another door, and to the right, a solid wall.", "“This place is like a prison…. That monster can't possibly enter here, right?”", "“It can't. Dunno why, but that thing can't seem to get past the metal barrier. No telling what will happen if there was no barrier, though.”", "Kang Seok replied nonchalantly. Meanwhile, Hyun Sangmin was nodding his head along, before quietly asking back.", "“Back then…. did you manage to open the door?”", "“Not open, but more like breaking it down. Thanks to a certain someone high tailing it outta there, after throwing down rocks and flower pots all over the place.”", "“You’re blaming me?”", "Hyun Sangmin's voice was icy cold. Kang Seok's eyebrows rose up before he smirked softly.", "“No way! I told you this before, didn't I? I don't really care what you do unless it involves the three of us. As long as you don't hinder us in any way, it's fine.”", "“….”", "“Hmm. Maybe I sounded a bit rude just now. Sorry about that. I'm always like this…. Well, there's no reason for us Invited to be at odds with each other, right?”", "“…That’s true.”", "“Great! As an apology, I'll let you guys in on interesting info.”", "Even Seol had to shift his attention to Kang Seok's direction after hearing the word, ‘info’.", "Kang Seok's lips twitched when he realized that none other than this fancied 'Gold Mark' was paying attention to him. His posture suddenly became a bit stiffer and more arrogant compared to before.", "“Now look closely. This here is the passage we came through.”", "Kang Seok pointed to his back, and then pressed a button on the wall. The metal spikes retracted to the floor before shooting back up again. Hyun Sangmin muttered under his breath.", "“So, it's not on the outside, but inside….”", "“That's right! That's where it gets interesting.”", "Kang Seok clapped his hands.", "“To put it simply, this entrance became mine as soon as I entered first. Only I can open or close the barrier.”", "“What?”", "“I only figured it out after entering here. The first one to enter through the barrier is given the right to control it. One person per barrier, though.”", "“How does that even make sense?”", "“If you don’t believe me, why don’t you try it out?”", "Kang Seok stepped aside, allowing Hyun Sangmin to quickly press the button on the wall. However, there was no reaction from the barrier. He pressed it a second time, then a third, and then many more times afterwards, but the metal spikes didn't budge an inch.", "Still half in doubt, Seol's eyes drifted towards the map on the phone, and he belatedly realized something. Out of the six blue icons blinking around the second-floor waiting area, four had now turned red. However, only one was red when he was in the club room.", "“Was there a need to make three entrances yours?”", "“Oh? How did you figure that out already?”", "Seol's question caused Kang Seok to become visibly surprised.", "“What's the matter? Don't you think it'll get more interesting later on? Oh, right. How about you make that other one yours?”", "Kang Seok stared at Hyun Sangmin and pointed towards another barrier on the opposite side.", "“Well, passages on this side all belong to us now, so you should take one from that side over there. All you have to do is to grab the spike. Simple, right?”", "It seemed that Hyun Sangmin was quietly debating on it. He sneaked a glance at Seol, then slowly shook his head.", "“I'm… gonna pass. I'm fine with simply being here and all.”", "He and Seol then found a nice little spot for themselves and settled down.", "“Oh well. Do whatever you want.”", "Kang Seok and his two lackeys sat down too, but soon, they had to get back up again as Hyun Sangmin pulled out a new pack of cigarettes. The trio reached out and pleaded for a smoke, so Hyun Sangmin handed one to each while saying it was compensation for providing the info.", "Then, just as Seol was digging through his own pockets to find a smoke too, Hyun Sangmin presented a whole bundle to him.", "“How about smoking these?”", "“Uhm….”", "“I saw earlier that you were running out, so I packed in a few at the convenience store.”", "Hyun Sangmin whispered quietly and gave Seol a thumbs-up.", "Soon enough, the corridor was filled with the blue smoke rising from the five men.", "Now that most of the tension had ebbed away, Seol's sight slowly blurred and he felt his eyelids had become much heavier than before. It wasn't like he had to endure an all-nighter, yet he felt quite drowsy. This was probably due to the fatigue accumulated from overusing his ability.", "'Should I sleep for a bit?'", "They had over three hours left until the time limit.", "It seemed that sleep was the best means to cool down his overworked eyes and brain. He knew now wasn't the best time to close his eyes and drift away into the slumberland, but…. He had regained his power somehow. It'd be deathly stupid if he lost it again through overuse.", "Seol entrusted himself to the encroaching embrace of sleep.", "And that was why he couldn't hear it.", "*", "“….I can't tell whether he's got balls of steel or doesn't really care about the Tutorial.”", "Seeing Seol's head droop ever so lower in sleep, a wry smile broke out on Kang Seok's face. He flicked the cigarette butt away and groaned out.", "“Just when is this supposed to end? It'd be so much better if it ended soon.”", "“We still have over three hours left…. Fuck this. Why are we waiting for four hours in a mission like this?”", "Yi Hyungsik grumbled as he rechecked the mission details on his phone. Kang Seok silently agreed with that opinion and massaged his head with his interlocked hands.", "“I'm so~ bored. I really hope someone comes through the path on this side.”", "“What if no one else shows up?”", "“Eii, no way. The rest of the Invited haven’t shown up yet.”", "“What, you mean that Yi Seol-Ah? She's already dead, isn't she?”", "“Not that dumb bitch…. Ha, people who act like heroes always end up getting killed first.”", "Kang Seok darkly muttered out those words, which made Jeong Minwoo lick his lips in regret.", "“What a waste, though.”", "“Yep, that I agree. But, then again, don't you worry. We still have one more left.”", "“Who?”", "“You know, the other one. What was her name? Yun Seora?”", "“Ah, that arrogant girl?”", "When Yi Hyungsik chimed in, the three of them giggled out in sync. Their laughter sounded leery and ominous.", "“Whatever. Maybe I should catch up on some sleep myself.”", "Kang Seok's yawn was large enough to nearly rip open his jaws. Just as he was about to lie down, something happened.", "Out of the blue, noises containing both loud shouts and hurried footsteps could be heard from the distance. Kang Seok blinked his eyes a couple of times before shooting right back up. Excluding the sleeping Seol, everyone present scanned the barriers.", "“Which one? Which one is it?”", "Jeong Minwoo pointed towards the middle barrier on the opposite side. Since Seol had “taken” over the left barrier there, that particular one had no owner as of yet. Kang Seok seemed to be incredibly disappointed by this development as he looked at Hyun Sangmin.", "“It's still not too late, though.”", "“….I told you, I'm fine.”", "Kang Seok spat out a sigh and stood there with his hands across his chest. His attitude was that of a man who had just found something interesting to spectate on.", "The noise got closer very soon.", "There were three people running up as if they were being chased by something— a middle-aged man, a woman, and a young girl. The middle-aged man was wearing a worn-out business suit and a pair of glasses, and was leading the woman holding the young girl's hand. His necktie danced uncontrollably as he ran up in a huff. It was none other than the man who asked for Kang Seok's help earlier on.", "“Just a little bit further! Just a bit…. Huh!?”", "He rounded the corner in a hurry, but as soon as he saw the metal spikes on top of the stairs, his steps came to an abrupt halt. He must not have considered the possibility of the path being blocked. Despair began to dye his expression pale.", "Soon, though, he discovered Kang Seok past the spike barrier. The woman and the girl following him ran into the middle-aged man's back and awkwardly bounced back. And finally, sharp and familiar-looking hooks pounced on them. All these things happened at roughly the same time.", "“Help us!!”", "The bespectacled man ran up to the barrier without hesitation and shouted out.", "“Let us in!!”", "[A new user has been registered.]", "With a loud clang, the metal barrier slid open. The wide-open entrance caused the expression of stupor to appear on the man's face. And when he turned around to look behind him while still carrying that expression…..", "“Help!”", "….He couldn't help but flinch. Both his wife and daughter were already in the grips of the chasing monster.", "“Help us!!! Help!! Dear!!”", "“Dad!! Save us!! Daaaad!!”", "They pleaded, yet the man's steps were halting and retreating. When he met the gaze of the monster and its large, bloodshot eye…", "“D-Dear… Hee, Heejin….”", "He couldn't move. He was completely frozen up.", "Splat, splat!!", "Step by step, the sticky footsteps got nearer. The middle-aged man's expression distorted into an unsightly mess of tears, snot, and uncertainty. He cast his glance over to Kang Seok, asking for help again. However, the young man bluntly spat out.", "“Quickly make up your mind, will you?”", "“…Huh?”", "“Are you going to come in or not? Make up your damn mind. You planning on killing us too?”", "Was it because of Kang Seok's shouting or was it because of the threatening atmosphere emanating from him? Whichever case it may be, the middle-aged man finally made his decision and moved.", "Slam!", "“D-Dad!?”", "“Dear!! No! Don't leave us!!”", "The middle-aged man chose to enter the waiting area.", "“Daaaaad!!”", "“Don't abandon us!!! Dear!!”", "A pair of jet-black hands grabbed the legs of the screaming mother and daughter. The man squeezed his eyes shut after seeing his family being lifted up into the air, hanging upside down.", "Rip!", "The sickening noise akin to a sheet of silk being ripped up in one go pierced his ears. The terrified, pained screams rang out loudly from the stairwell. The man collapsed on the floor and hurriedly covered his ears. He violently shook around on the dusty and unclean floor.", "He never lifted his head up again.", "Not until all the screams finally died down.", "*", "It was only obvious that Seol would wake up from his light sleep due to all the unfolding chaos. By the time he fully regained his consciousness, the screams couldn't be heard anymore.", "He hastily got up and took a look past the metal barrier, only to see the corpses of the mother and the daughter— both ripped in half.", "What shocked Seol the most, though, was their expressions. Their expressions that hadn't eased even after they died. Their expressions, twisted and corrupted by the combination of pain and terror, despair and fury. It was plain to see their ardent desire to live, right up until their last breath.", "“I, I, I…. I don't, I don't know…. I, I didn't do that, I'm not responsible….”", "The middle-aged man remained on the floor, huddled and not moving, except that his entire body trembled and shook all the time.", "“There…. there was no helping it….. There was…. nothing I could do….”", "No one said anything, yet he continuously spat out incoherent babble while sobbing pathetically on the floor.", "“Pffft.”", "Out of the blue, a short burst of laughter leaked out from someone's lips. The middle-aged man's trembling came to a sudden halt, hearing that. Meanwhile, Kang Seok hurriedly covered up his mouth.", "“Puhahahahaha!!!”", "Even though he looked like he was trying to keep it in, in the end, he lowered his head and his shoulders shook from the unrestrained laughter. The middle-aged man's hands tightly clenched into fists, nails digging in under the skin.", "A wise old saying said that if you weren’t planning to give something to a beggar, you shouldn't at least kick his begging bowl. Recalling that old saying, a deep frown formed on Seol's face.", "'He’s actually laughing in a situation like this?'", "It was then. They could all hear another metallic clang. Yun Seora walked in from the last remaining door that had no assigned “owner”.", "As if she too had searched through the school premises, she was holding a handful of A4-sized papers. Just like back when she was in the assembly hall, she swept her gaze around the waiting area once, found a quiet spot for herself and settled down, before concentrating on a paper in her hand.", "And with this, the confirmed number of survivors was seven. It was not even half of the starting 36.", "Within the quiet silence, time continued to flow. Every now and then, they could hear some kind of chaos unfolding downstairs, but those died down eventually.", "Seol came to a conclusion. There shouldn't be any more survivors left. However, his thought was proven wrong about 30 minutes before the time limit.", "“We are almost there, everyone. We'll arrive there soon, so go up as quietly as possible.”", "Contrary to his expectations, more survivors showed up. And it wasn't just one or two, but a group of five. Seol even recognized two people.", "One was Shin Sang-Ah, the woman who raised her voice at Kang Seok back in the assembly hall, and the other one was Yi Sungjin, the younger brother of Yi Seol-Ah. He didn’t know what they went through, but they had successfully arrived at the destination.", "Unfortunately, the path they had taken was occupied by Kang Seok and his cronies.", "“Oh, wow, look who it is!”", "Kang Seok blinked his eyes and theatrically exclaimed out in surprise.", "“So, you managed to make it alive! The cry-baby has done it!”", "“H–huh?”", "Shin Sang-Ah had been climbing the steps cautiously, but finding the barrier, she fell into a state of confusion. Seeing the people beyond the metal spikes, she blankly muttered out a question.", "“What… what is going on? Why is the path blocked?”", "“Oh, that?”", "Kang Seok smirked like a snake. It was as if the moment he'd been waiting for all his life had finally arrived. Seeing that oily smile, Shin Sang-Ah couldn't help but frown deeply.", "“What?”", "“What do you mean, what? I'm the owner of this barrier.”", "“The owner… of this barrier?”", "Kang Seok burst out in laughter and began to gleefully explain things. It was as if he had transformed into a well-paid private tutor, and explained everything one by one, bit by bit, and in full gory detail.", "Of course, his audience wouldn't be able to concentrate on this useless yammering. Shin Sang-Ah became even more anxious as she kept on looking back behind her. The tone of her voice became ever so urgent as well.", "“I get it now, so you can open this barrier, right?”", "“Oho, you’re smarter than you look! Or maybe my explanation was just that good.”", "“I get it, so open up already!”", "“Really now, how did you manage to get here? I mean, you’re just a Contracted. I’m surprised you managed to evade the monster.”", "Kang Seok showed no indication that he heard her plea and seemed to be genuinely enjoying this situation.", "“I, I don't know. We nearly got discovered, but this boy used something he got from the Random Box. We all escaped somehow during the confusion, okay?”", "Shin Sang-Ah pointed at Yi Sungjin. The boy's complexion was still dark and aimless. It seemed that the death of his older sister had hit him real hard.", "“Oh, well, I guess he’s an Invited too. So at least it wasn't all luck.”", "“Okay, now. Open the barrier so that we can enter.”", "“Hmm….”", "Kang Seok slowly opened his mouth.", "“I don’t wanna.”", "A truly disgusting smile crept up on his face."]}