{"cid": "430", "title": "Chapter 430. Supernova (4)", "content": ["Philip Muller’s party was running for their lives. There weren’t that many Parasites chasing after them, nor were they surrounded by the enemies.", "They were only facing off against one enemy.", "The problem was that this enemy was an Army Commander, and even worse, Twisted Kindness.", "Philip Muller had already used all the spells he had stored with Memorize. Chanting under his breath while running madly, Philip Muller suddenly felt a terrifying surge of energy behind him.", "‘Damn it!’", "He didn’t have the time to look back or think any further. He grabbed the item hanging by his waist and threw it in the direction of the energy.", "A large stone shining with a deep blue light flew across the sky.", "It was a Special Thunder.", "Flash!", "A chilling flash erupted, and a massive storm blasted out.", "Philip Muller was in no position to check whether the Special Thunder worked or not. He quickly completed and unleashed his spell.", "A magic circle formed above his head, and with a radiant light, the three of them vanished.", "It was only after the Teleportation spell completed that Philip Muller found out the Special Thunder was effective.", "Of course, there was no way to tell just how effective it was.", "“Do you have any Thunders left?”", "Philip Muller asked before chanting another spell.", "Marcel Ghionea shook his head as Eun Yuri lay on his back.", "Not only were the Special Thunders incredibly precious, but the Federation had gifted Valhalla with only ten of them. They had used one at Scheherazade, and the rest were split evenly among the seven parties. This naturally meant a party had at most two Special Thunders.", "Philip Muller clicked his tongue. Then, he stopped just as he was about to begin running again.", "It was because he saw an existence floating in the distant sky and looking down at him. Unsurprisingly, it was Twisted Kindness.", "“Keuk!”", "The two men grunted. They thought they managed to buy some time, but Twisted Kindness had somehow surpassed them and was waiting for their arrival.", "Philip Muller quickly began to chant his next spell. Marcel Ghionea also threw Eun Yuri off his back and took out his crossbow.", "“Ow!”", "A short yelp came out, but no one could pay attention to it. The original plan was to use Marcel Ghionea and Eun Yuri as throwaways to let Philip Muller escape by himself. But sacrifices were only possible when the situation allowed for it.", "‘Of all people!’", "Twisted Kindness was known as the strongest Army Commander. Everyone knew she wasn’t an opponent they could slip by.", "Twisted Kindness looked down at the two scrambling males with indifference. She looked incredibly bored.", "Next, she heaved out a small sigh and reached down with her hand.", "A spinning red magic circle popped out of her palm.", "Philip Muller hastened his chant in a fright, but Twisted Kindness was twice as fast when it came to completing her spell.", "Marcel Ghionea continued to shoot Twisted Kindness, but all of his attacks were bounced off without even making contact with her.", "“It’s about time you return to the void. What a shame too. I was expecting a little more since you’re an Execu…?”", "Twisted Kindness blinked in the middle of her speech. She had definitely infused her energy into the magic circle, but the magic circle wasn’t manifesting the spell. It was only spinning like a broken wheel.", "Just what happened?", "Twisted Kindness tilted her head before her eyes lit up. She spotted a female looking up at her with her left arm outstretched.", "Only then did Twisted Kindness feel a faint impurity mixed into her magic circle.", "“Oho, you are…”", "Twisted Kindness recalled seeing the female earlier at Via Lactea. She was trying to prevent the humans from escaping, but this human girl had broken through her obstruction and successfully cast Teleport.", "In the next moment, Eun Yuri raised her right arm high. A magic circle manifested on her palm, and the three of them disappeared in an instant.", "It was Teleport.", "“Hoh!”", "Twisted Kindness couldn’t hide her astonishment.", "To be able to cast Teleport while continuing to obstruct her spell. Twisted Kindness had never seen such an immaculate use of parallel spellcasting since the renowned Witch of Dreams that lived hundreds of years ago.", "“Now this is quite intriguing….”", "Twisted Kindness’ long tongue stealthily licked her upper lip. A hint of interest flashed on her otherwise indifferent expression.", "“It’s probably best that I kill her. We don’t want a second Brightest Star appearing.”", "She murmured to herself. Then, just as she was about to use Teleport of her own, she suddenly paused.", "“Pardon?”", "She asked back even though she was alone.", "“Unsightly Humility… you said?”", "She frowned.", "“The location is… got it. I will stop my pursuit here and join up with the others.”", "“I will be a little late. I will get ready as soon as I arrive, so please tell the others to stall for time.”", "Twisted Kindness then turned in the direction she came from and disappeared in an instant.", "Meanwhile…", "“Is she not coming after us?”", "Marcel Ghionea murmured while looking around the surroundings.", "“Who knows? Maybe she will be waiting for us up ahead.”", "Philip Muller replied with a light cough.", "They had managed to gain some distance from Twisted Kindness. It was because Philip Muller completed his Teleport spell immediately after Eun Yuri used her own.", "They obviously couldn’t lower their guard, but they could no longer feel Twisted Kindness’ presence.", "“W-Wait…”", "At that moment, a faint groan rang out. Eun Yuri was sitting on the ground gasping for breath. Her face was pale with blood smeared around her mouth.", "“Were you awake?”", "Marcel Ghionea asked while hurriedly handing over a healing potion.", "“Yes…. I was half-awake… and then woke up when I was thrown on the ground….”", "Eun Yuri spoke in a feeble voice while tilting the bottle of transparent liquid against her lips.", "“Was that you just now?”", "Eun Yuri gulped down the liquid and nodded her head at Philip Muller’s question.", "“Whew! Teacher said that the power of the Dragon race’s magic is based on their ridiculously elaborate spellcasting technique. But, this intricacy is also their weakness. I could tell she wasn’t really paying attention to her spell, so I fiddled with it a little while avoiding her eyes….”", "In other words, Eun Yuri had interfered with Twisted Kindness’ magic circle.", "Philip Muller looked at her in a renewed light.", "This is a Level 4 Magician?", "Never mind being a Unique Ranker, it was surprising enough that a non-High Ranker could use Teleport. Philip Muller couldn’t help but think that Eun Yuri would have become a Magician on the same level of fame as Seol Jihu if only she had entered Paradise a few years earlier.", "Philip Muller heaved out a quiet sight.", "Being shocked could wait.", "“I know it must be hard, but get up. And if possible, I’d like to take turns using Teleport.”", "“Right away?”", "“No, not now. Just be ready so we can use it the moment we see the enemy.”", "Eun Yuri nodded her head and got up.", "“Oh right.”", "Then, she did a double-take and asked.", "“What about Oppa?”", "*", "Seol Jihu was in the middle of a fierce battle with the Parasite army.", "Carcasses of Bugs and Cockroaches were littered everywhere as if he’d already gone on a rampage.", "The situation was much worse compared to when he encountered Unsightly Humility. Not only was he facing off against two armies, but the quality of the parasites had also gotten much higher.", "Moreover, there was a vast difference between having two Army Commanders versus one.", "At Scheherazade, Exploding Patience and Twisted Kindness appeared after he had beaten Vulgar Chastity to a pulp, but this time, two had appeared simultaneously.", "‘Should I use Supernova Explosion?’", "The thought briefly crossed his mind, but he shook his head.", "If he used it, he would be able to wipe out at least half of the enemy forces and focus on fighting the Army Commanders, but the problem was the huge mana expenditure.", "He had a change of heart from having gone through multiple battles.", "Although his pool of mana had expanded to a vast sea, he wouldn’t last if he had to use up a river’s worth every time.", "Moreover, he would have wasted his energy if the Army Commanders abandoned their army and fled like Unsightly Humility.", "Just like how he planned to take off right after making Unsightly Humility release his divinity, the enemy might employ a similar tactic.", "Not even a day had passed since the start of the battle. He couldn’t even estimate how much longer he would have to fight at this rate.", "And so, he needed to be careful with allocating his resources so that he could maximize efficiency while minimizing resource consumption.", "Of course, it was easier said than done. But the current Seol Jihu felt like he could do it.", "Seol Jihu stretched out his arm while looking to the left. He opened his palm toward a group of Hydras boasting their sizes and dragged his hand to the right. It was as if he was pushing them.", "Then, something surprising happened. The four Hydras that were stomping toward him suddenly tilted sideways. They staggered in huge motions before collapsing in one direction.", "Koong, koong, koong, koong! As the four Hydras simultaneously fell, the others running behind them began to topple like dominos. Heavy thuds rang out as even more Hydras tripped on their feet and collapsed.", "The Hydras broke out in a clamor. As their heavy bodies mixed and mangled, a huge commotion broke out among them.", "“Crazy….”", "Vulgar Chastity, who was watching this scene, muttered in shock before making a venomous expression. She was burning with a thirst for revenge, but her sense of reason hadn’t disappeared.", "Although Seol Jihu hurt her pride, it meant he was a human capable of doing so. Meaning, he wasn’t an insect that could be crushed to death like all the other humans.", "She was done with being beaten from letting down her guard. After contemplating deeply, Vulgar Chastity soared to the sky.", "“Burn!”", "She stretched her wings out all the way and shouted.", "“World!”", "Haze rose from the ground for a moment. Soon, pillars of lava broke through the ground and soared to the sky.", "The pillars of fire that spurted out like fountains curled simultaneously. Spiraling in the air, they all turned toward the same point and descended at once.", "Seeing the masses of flames diving down, Seol Jihu stuck out the Spear of Purity.", "Kwaarrrrr!", "The fire whirls that seemed to want to engulf Seol Jihu were blocked by the spear shaft. They rolled and raged violently, trying to push the spear back. However, this only resulted in the flames getting scattered to the side.", "Vulgar Chastity was calm despite having her ultimate move blocked by a single spear. As if she had expected as much, she brought her army forward and prepared a new spell.", "Tong! Seol Jihu used Ethereal Shift, phasing through the succubi and chasing after the enemy. Then, Vulgar Chastity fanned out her purple hair as if she had been waiting for this moment.", "Her hair grew, long enough to touch the ground from her position in the sky. Then, it began to coil around her body as if to protect it.", "Within a few seconds, the hair accelerated and began to swirl fiercely like a windmill. Each strand of hair turned into a sharp wire that cut through the air.", "Vulgar Chastity had blocked Seol Jihu from getting near her. Meanwhile, Vulgar Chastity’s mouth was continuously moving, and she was constantly flying farther back.", "Seol Jihu’s eyes narrowed. As with Unsightly Humility, he was confident in beating her in close-range combat, but the battle got more annoying as she tried to secure more distance.", "Of course, this was to be expected unless he was facing off against a complete idiot. Still, having enjoyed quite a bit of fun through the enemy’s arrogance and carelessness, Seol Jihu couldn’t help but feel a little disappointed.", "That said, it wasn’t as if he was out of options. Even if the enemy wasn’t lowering her guard, he could just overpower her with overwhelming strength.", "Seol Jihu raised his spear. He began to cut and stab the air in a seemingly wild fashion.", "Those that didn’t know any better would think that he had gone mad. But it was easy to tell this wasn’t the case by looking at the air undulating with each movement of the spear blade.", "Level 7 Star Seeker, Secret Art — Mutilation.", "Chweeeeeek!", "Piercing winds stormed out. Soon, a violent wind bearing a vivid golden light descended.", "The storm of blades cut the succubi to shreds and clashed with the gust enveloping Vulgar Chastity.", "A mere rush of wind was incapable of fighting a fierce storm. Vulgar Chastity’s swirling hair was torn apart.", "Although her hair was regrowing instantly, it was being cut at a faster rate. As the continued onslaught began to blow holes through the dense defense, Seol Jihu used Ethereal Shift and rushed in.", "Vulgar Chastity must have finished chanting her spell as well since she stretched out her hands.", "At that moment, Seol Jihu’s eyes flashed with a bright light.", "Kwaaaa!", "In an instant, golden sword qi burst out of the speartip that was aimed at Vulgar Chastity. The flurry of sword qi pounced on her like a lion.", "“Aaaaack!”", "By the time the wave swept through her, Vulgar Chastity was plummeting to the ground.", "‘You won’t escape this time!’", "Seol Jihu leaped up with determination. Then, once his target was below him, he felt a strange sense of disharmony.", "Vulgar Chastity had been hit directly with attacks laden with anti-evil energy, and though there were wounds and burn marks here and there, she was in a better state than he anticipated.", "Moreover, even though she was screaming, her eyes were staring straight at him.", "Seol Jihu did a double-take. What if the new spell she prepared wasn’t for an attack but defense? That would mean Vulgar Chastity purposely baited him, expecting him to charge in.", "As Seol Jihu’s brain sent warning signals, Vulgar Chastity rushed in. She hugged Seol Jihu’s back tightly, locked her fingers together, and wrapped the rest of his body with her hair.", "Seol Jihu struck down at her face with his elbow at the same time that an intense light burst out of Vulgar Chastity’s body.", "Boom! The air rumbled along with a thunderous explosion.", "“Mmm….”", "Seol Jihu groaned quietly after landing on the ground. He felt slightly light-headed, and his sides stung a little.", "Although he escaped at the last second with Ethereal Shift, it seemed he failed to fully escape from the range of the attack.", "“Keeuu!”", "Vulgar Chastity, who had plunged to the ground, was in far more terrible shape. Her beautiful hair was sparse like it had trimmed randomly, her skin was cracked like a rice paddy suffering from drought, and her seven orifices were overflowing with blood.", "“Ki… kikikik!”", "Despite this, Vulgar Chastity staggered up and cackled.", "“Keuheuu! That attack would have wiped out an ordinary human in both body and soul… but you…”", "She chuckled dumbfoundedly.", "Indeed, Seol Jihu would have been in trouble if he had taken a direct hit.", "Seol Jihu raised his guard to the limit despite not having received a fatal blow.", "He didn’t expect Vulgar Chastity to go for a suicidal attack.", "It wasn’t a stupid move by any means. The strength of the Parasites lied in their regenerative ability, and on the Nests’ contaminated territory, this ability only got stronger.", "Surely, Vulgar Chastity wouldn’t have chosen a suicidal attack unless she was confident in recovering quickly. Sacrificing her hair and preparing a defensive spell must have been to minimize Seol Jihu’s anti-evil power as well.", "“You monster…. Are you really human?”", "Muttering as if she was sick of him already, Vulgar Chastity widened the gap between them.", "“What was that? You want to eat another Thunder?”", "Seol Jihu chased after her, retorting with a snide remark, before suddenly coming to a stop.", "Tatatatang! Something resembling a bullet brushed past his eyes.", "If he hadn’t stopped instinctively, he would have been blinded by the shot.", "Little Chick was still out of energy, but shouldn’t Flone be handling the Evil Phantoms?", "Seol Jihu looked around in a hurry and found out where the attack had come from.", "[Eeeek! Get out of the way! Move!]", "Flone was fighting fiercely while surrounded by hundreds of banshees.", "The banshees were knocked out as the black smoke swirled around madly, but as expected of an army under the banner of an Army Commander, it seemed it wasn’t easy to lose them.", "That wasn’t all. He could feel a terrifying amount of energy from above Exploding Patience, who was floating in the sky.", "Their eyes met.", "“Ssssp!”", "Exploding Patience took a huge breath in, then…", "—KIAAAAAAAA!", "Just as her name suggested, she vomited up an explosive scream.", "A voice filled with power that was impossible to ignore resounded in his ears. The rotting trees and rocks around him crumbled, and even a huge crater formed on the ground.", "The scream didn’t stop. It continued endlessly.", "Seol Jihu furrowed his brows. He roused his mana to resist the sound that was pressing down on his body more strongly with every passing second.", "He had been wondering what Exploding Patience was up to since she didn’t attack with Vulgar Chastity. It seemed she was preparing for this attack the entire time.", "‘I guess I’ll be treating Exploding Patience with the Special Thunder. I’m sure she’ll shut up once it goes into her mouth.’", "Seol Jihu murmured inwardly before escaping the pressure and looking up.", "It was then.", "‘Light?’", "A scorching light suddenly flashed in front of him.", "What was important was that the powerful energy he felt was still there despite Exploding Patience starting her attack.", "In fact, it was still getting bigger exponentially.", "Something felt off. Seol Jihu scanned the sky in haste, his eyebrows twitching. He saw a small sun high up in the sky. No, it wasn’t a sun. It was a blazing orb that was shining like one.", "It was only then that Seol Jihu caught sight of the thing that had escaped his eyes until now.", "High up in the sky, far beyond the clouds, was a tiny dot.", "The being that was floating proudly and preparing a large-scale spell alone was none other than Twisted Kindness.", "‘Since when?’", "Seol Jihu frowned for the first time. He had neither sensed her arrival nor her spellcasting. He thought Exploding Patience was preparing everything….", "‘Ah.’", "It was a double, no, a triple-layered bait.", "His assumption had been wrong this entire time. The Parasite army, Vulgar Chastity, Exploding Patience… they had all been tools to buy time.", "Though Seol Jihu found out, it was already too late.", "A huge magic circle spanning several kilometers was formed in the sky, and complex runes that Seol Jihu couldn’t even begin to make sense of were intricately weaving together.", "Kuuuuuuuuuuu!", "Without even the slightest bit of exaggeration, a mountain-sized sphere plunged down. It was as if the sun was falling.", "‘I… I can’t dodge this!’", "He wouldn’t be able to escape the range of the attack even if he used Ethereal Shift. It was hard to rely on the cape’s special ability since an attack of such magnitude would never end in a second.", "‘That crazy bitch…!’", "Should he say, as expected of Twisted Kindness?", "It seemed she put every variable into consideration after the loss they suffered at Scheherazade.", "While Seol Jihu hesitated, what looked like a small dot gradually expanded in size. Descending rapidly, it eventually became large enough to cover both Seol Jihu and the two Army Commanders.", "Despite a good amount of distance being left, the air boiled and his skin seethed.", "The mass of energy was so terrifyingly large that it seemed like it would just eat up Thousand Thunder and Hell Severing.", "After much thought, Seol Jihu bit his lip. This definitely wasn’t the time to worry about reserving strength. And so, he risked exerting his energy and began to prepare Supernova Explosion. It was then.", "Hwaaaaak!", "Suddenly, light gathered above Seol Jihu and formed a translucent film.", "Chiiik, chiiiik!", "It burned and began to melt the moment it touched the blazing sphere, but the holy barrier magnificently managed to halt the descent of the artificial sun for a moment.", "That wasn’t the end.", "“?”", "As a large amount of holy power suddenly accumulated in the air, Twisted Kindness furrowed her brows and looked around.", "“What’s this?”", "Vulgar Chastity also muttered in shock while continuing to widen the gap.", "“Wait, this power…”", "Vulgar Chastity unknowingly came to a stop and murmured in a daze.", "Krrrr, krrrrr!!", "Then, she lifted her head at the sudden rumbling of distant thunder.", "The sky split in half, and a brilliant ray of light shone down on the land.", "Level 8 Atera’s Saintess.Wide Area Buff / Debuff.Requiem of Stars.", "A dazzling meteor shower began to fall from the sky."]}