{"cid": "3", "title": "Chapter 3. A Son of a Bitch (2)", "content": ["", "“I need more money so I can go back.”", "Seol stood in front of Nonhyeon Station, pondering his next move, before finally coming to a decision. He was seemingly surrounded by enemies on all sides, but there was one secret hill he could always run to for help.", "*", "The alarm buzzed loudly. It was 5:30 in the morning. Yoo Seonhwa opened her eyes and stretched her limbs out from a refreshing night’s sleep.", "The morning sunlight beamed through the window and brightly illuminated a small frame on her drawer. The frame contained a photo of seven people, including Yoo Seonhwa and her younger sister. Looking at it, a faint smile bloomed on the young woman’s face.", "There was Seol Ahjussi, who looked uptight on the outside but was warmer and more caring than anyone else on the inside; his wife, who always treated Yoo Seonhwa like her own daughter and made sure she was eating properly.", "It wasn’t just those two in the photo, though. There was also the husband and wife’s oldest son, Seol Wooseok, who looked cold and stiff but possessed a warm heart; the youngest daughter, Seol Jinhee, who was open and outgoing; and finally…", "There was a young man with a gentle smile in the middle of the two. Then, there she was, leaning on his shoulder and smiling radiantly.", "“….”", "Looking at the photo, a hint of worry crept into Yoo Seonhwa’s complexion. When she checked her phone to see the time, the shadow on her face grew darker.", "*", "“You’re leaving already? Why don’t you stay for a cup of coffee?” ", "“Uun, I wanna do that too, but I really gotta go. I need to finish that piece and turn it in tomorrow.”", "“You didn’t forget anything? You’re good to go?”", "“Of course! I’m not a little kid. Okay, I’m heading out now! See you later!”", "The front door closed shut, and tiny footsteps grew farther away. Left alone, Yoo Seonhwa finished her breakfast with a thin smile on her face. Her little sister’s bright face had made her energetic as well. She had been nothing but happy in the few days, so much so that she began to wonder if it was okay.", "Right, she was definitely happy. That was, if she were to disregard one little thing.", "After finishing her meal, she began packing her lunch with the leftovers, when she heard footsteps growing closer to her door and snickered. Koong, koong. When she heard the hasty knocks on the door, she quickly went to unlock it, as if she knew this would happen.", "“See? Didn’t I tell you to double-check every….”", "Yoo Seonhwa was about to lecture her little sister but froze up on the spot instead.", "“You thought I was Seunghae?”", "The person standing in front of her wasn’t her little sister. The man wearing clothes that were at least a couple of days old reeked like he went swimming in sewage. There were dark bags under his eyes as if he had not slept a wink.", "“You… Why are you here?”", "“Yo, it’s been a while. Have you been doing well? Wow, this place looks spotless no matter when I show up.”", "Seol entered the flat and took a look around. Once he spotted the leftovers on the kitchen table, he reached out with his dirty hands, shoved it down his mouth, and nodded with approval.", "“Delicious. I was just getting hungry, so this is perfect. Make me some breakfast.”", "“….”", "“Come on, hurry up.”", "“Who told you to come in?”", "The young man’s eyes widened from the voice full of hostility.", "“What’s wrong?”", "“This is my house, not yours. Don’t you know that forcefully entering someone else’s house is a crime?”", "“What are you talking about? How is this place yours? I know full well my dad paid the security deposit for this place.”", "“I already paid him back a long time ago. Why are you talking about that now? Besides, even if that was true, you have no right to come in here.”", "“…Hey, don’t be like that. Between us?”", "“Between us? Really?”", "Yoo Seonhwa’s voice became sharper and colder.", "“Stop dreaming. It’s over between us. You and I aren’t anything. Not anymore.”", "Her words went beyond cold and began to feel venomous. Seol rolled his eyes and let out a deep sigh. Then, with a groan, he lied down on the floor.", "“I’m starving, so make me food. I’m exhausted from walking all the way here.”", "“Hey! I’m not going to humor your antics anymore! Get up. Get up and leave before I call the police!”", "Seol snorted. But when Yoo Seonhwa really pulled out her cell phone, he hurriedly stood back up.", "“C-C’mon, can’t we talk this out? I came because I had something to say. For real.”", "“I have nothing to say to you. If you want to talk to me, go to the casino and ask them to ban you from entering. Then I’ll think about it.”", "“Wow~ Why are you so sensitive today?”", "Yoo Seonhwa felt like she might explode with frustration. She shut her eyes, lowered her head, and took a heavy breath.", "“…Get out.”", "“Come on, you’re really gonna be like this?”", "Before he could finish, a piercing shout rang out. In the end, Yoo Seonhwa exploded from her pent-up rage.", "“You think I don’t know why you’re here!? You’re here to ask me for money again!”", "Seol flinched as she had accurately hit the mark.", "“Hey, hey, what do you mean….”", "He smiled self-consciously, trying to evade the topic, but Yoo Seonhwa was already experienced. This wasn’t the first or second time this was happening.", "It had only been four months ago that she had told herself to trust him one final time since he got on his knees and begged for her forgiveness for several hours.", "Seeing the smile on Seol’s face that was starting to look ugly, a never-before-felt repulsion began to boil up inside her.", "“I can’t give you a single dime. No, I won’t. What? You want to start over? Am I crazy? What, it wasn’t enough that you blew away our security deposit last time!?”", "After blowing out the anger inside her, Yoo Seonhwa took a deep breath. She even coughed from the heated shouts.", "Seol stood there in a daze. He seemed to be at a loss of words from her adamant stance, but a cruel smirk hung on his twisted lips.", "“I’ve been patient and this is how you act? You little bitch….”", "Yoo Seonhwa’s thoughts of ‘Did I go overboard?’ lasted for a brief second. She couldn’t help but doubt her own ears.", "“What did you just say?”", "“What, are your earholes blocked up now? You think I’m a fool too? Fuck.”", "It was the first time Yoo Seonhwa was hearing Seol curse so openly. She blanked out from the sudden mental shock.", "“You of all people can’t do this to me. You clung to me when things were hard for you, but now you’re like this? I didn’t wanna bring up old tales because it’s petty, but did you forget about me taking care of you in middle school and high school? You ran around every day crying about wanting to see your mom and dad. When your little sister came crying to me about you disappearing, it was always me who went out to search for you.”", "A disgusting, nauseous feeling clogged up Yoo Seonhwa’s throat. She tried to hold it in, but her eyes became wet and hot from the feeling of betrayal.", "“What about when you wanted to go overseas and study but had no money? Didn’t I postpone my own studies and support you? I even worked part-time to send you money so that you wouldn’t starve out there!”", "It was all true. Yoo Seonhwa wanted to go overseas to pursue her dream, but reality made it difficult. She agonized in secret as she couldn’t tell anyone about her problems, and that was when the youth in front of her stepped forward. When he delayed going back to university just to support her with his tuition, she couldn’t even describe how grateful and sorry she was.", "That was the kind of man he was, a man who supported and cared for her more than anyone else. When they entered the same university and he confessed to her, she felt like she had obtained the world. When he promised her their future, she loved him so much she thought she might die from it.", "But how did things turn out this way? How did he ruin himself to such a degree?", "Yoo Seonhwa stood there and trembled like a lone leaf on a tree. She sniffled and then raised her head. She seemed to have calmed herself down a bit, but her eyes and nose were tinged with red.", "“…You son of a bitch.”", "“W-What?”", "Seol’s anger subsided as he stuttered. Rather than angry, he looked dumbstruck. He knew how much Yoo Seonhwa hated swearing. She had never cursed a single time in her life.", "“How much was it?”", "Her tearful voice was resolute as if she had finally made up her mind.", "“Huh?”", "“How much was it? The money you gave me when I went overseas.”", "“Uh… The tuition was 5 million, and I sent you another 2 million from working part-time.”", "“I’ll pay the tuition back to your dad. You gave me the money, but it was his to begin with. As for the 2 million, I’ll give it to you now.”", "Yoo Seonhwa spoke as if she was repeatedly swallowing something. She picked up her cell phone.", "“There, I sent it. It’s 2 million exactly, so check it.”", "Seol let out a dry cough and took out his phone. After checking his bank account, he grinned.", "“Wow, you have a lot of money now. How much do you have in your bank account?”", "“Are we done now?”", "Her tearful voice came out like she was squeezing out every word from her throat. Hearing the ominous voice, Seol’s delight disappeared with a surprised flinch.", "He looked at Yoo Seonhwa and shrugged.", "“Hey, I never asked you to give me money. If someone heard, they’d think I stole it from you or something.”", "“I paid off all my debts now, right?”", "“Uh… yeah, I guess.”", "“If you’ve confirmed it, get out. You and I have nothing to do with each other from now. Not even a debt.”", "“This again?”", "In the end, Yoo Seonhwa couldn’t hold it back and dropped to her knees. Seeing her desperately trying to hold her tears back, the young man scratched his greasy hair.", "“Fine, fine, I’m leaving.”", "Seol, with his shoes still on, hurriedly left the flat like a burglar who was caught stealing. His refreshing sense of accomplishment only lasted a moment.", "—Huuuunng….", "When he heard the restrained wail from behind the closed door, he suddenly felt dirty.", "He ran out and looked up at the sky. The morning sky was blue, a color so damnably clear.", "The fatigue he had forgotten about rushed in. Seol returned to his flat after filling his empty stomach at a nearby convenience store. After turning on the lights, he plopped down on the dusty blanket.", "After some time, the midday sun went over the western horizon, and darkness began to dye the orange glow of twilight.", "Bzzzz!", "A small buzz rang out, and circular ripples formed in the air. The ripples gradually gathered to a single point before instantly transforming into a blue fragment. The fragment dropped down and gently fell onto Seol’s forehead like a lover’s kiss.", "Soon, the fragment slowly sank as if it was sinking below the water.", "Flinch.", "Seol’s unmoving, sleeping body jerked.", "“!”", "And his eyes shot open.", ""]}