{"cid": "432", "title": "Chapter 432. Past, Present, and Future (1)", "content": ["Chwaaaa—", "Rain poured down like a waterfall from the sky that day.", "“Ehew. Why is it suddenly raining? I guess that’s just my luck.”", "Looking up at the sky full of dark clouds, a Priest complained before glancing back. About 200 meters away, she saw a young man soaked in the rain. Though she couldn’t make out his expression, she knew he was watching them.", "“That guy, he’s still following us.”", "“….”", "“Hasn’t it been like four hours? The city is in the opposite direction….”", "The Priest murmured before glancing to the side. Baek Haeju was walking angrily while keeping the hood of her raincoat pulled down to hide most of her face.", "The Priest could hear her huffing in anger. It was rare for Baek Haeju to show so much emotion as she had always maintained a cold and detached attitude in front of others.", "“But seriously, what’s the matter? You, helping a person in need? Wasn’t your motto, live alone, die alone?”", "Baek Haeju did not reply. Her steps quickened as if to indicate she didn’t want to talk about it.", "Sensing Baek Haeju’s anger, Seo Yuhui glanced at her fellow Priest and signaled her to stop. However, the Priest was persistent.", "“I mean, am I wrong? I’ve been suspicious since you first agreed to do it, even going as far as to delay other missions. Yes, the reward was pretty good, but everyone knows that money isn’t something you care about. And it’s not like you’re particularly fond of Sinyoung either.”", "“….”", "“I thought you’d refuse for sure, but with one look at the list of rescuees, you changed your mind. As if that wasn’t weird enough, the important members were all rescued, yet you searched all over that villa for a slave whose only use was to be a meat shield. Even Sinyoung thought he was dead and abandoned him.”", "The Priest was convinced there was unfinished business between Baek Haeju and that man.", "“Most importantly, after all the trouble you went through to rescue him, why did you get so angry? Yuhui Unni, you saw Miss Baek Haeju grab that man by the collar, right? That really scared me.”", "Baek Haeju stopped and turned her head to the priest.", "When the Priest saw the icy look on Baek Haeju’s face — a look as though she would murder her with the spear in her hand if she said one more word — she quickly raised both of her hands as if in surrender to the enemy.", "“Okay, okay. I’ll shut up now.”", "Baek Haeju glared at her for a few more seconds before resuming her walk.", "She didn’t even glance in the direction of the man standing awkwardly in the distance.", "The Priest shrugged her shoulders and followed her.", "Hours passed, and night fell.", "The rain was lighter now but still falling steadily.", "After Seo Yuhui kicked out the Priest, who was protesting about sleeping separately, the tent fell silent. Only the sound of someone turning and coughing was heard from time to time.", "Seo Yuhui turned her head and glanced behind her. She had never seen Baek Haeju so restless.", "The fact was that Seo Yuhui felt suspicious about the same things the Priest had pointed out earlier. She didn’t know the whole story, but she could tell that Baek Haeju was upset.", "“How did he find out?”", "Seo Yuhui asked carefully and then waited patiently without prying as the Priest did.", "“…I made a mistake.”", "After a long silence, Baek Haeju let out a soft grunt.", "“I don’t understand why he entered Paradise in the first place…. And I’m worried that someone might have found out about me….”", "In Paradise, everything about the Earthling named Baek Haeju was fake, even her name and appearance.", "In her low-level days, she was lucky enough to have found the treasures of a notorious phantom thief who made an excellent reputation for himself in the Empire of the past.", "She discovered these treasures in a nest inhabited by a giant monster, and the phantom thief had turned out to be a dragon that had been interested in human culture.", "Among the treasures was an artifact that granted its user the ability to change their appearance, and Baek Haeju decided to use it as she left the dragon’s nest.", "She had no choice.", "The organization Baek Haeju belonged to at the time had many enemies because of its allegations of tampering in the Neutral Zones and other miscellaneous incidents. And during this expedition, they had all died, leaving Baek Haeju on her own.", "She realized that if she went back alone, her fate would be far from ideal. It seemed right for her to deceive the world into thinking that she died here with her comrades and start a new life with a new identity. That way, she could secure safety in both Paradise and on Earth.", "And so, that day, a new Earthling named Baek Haeju was born.", "She couldn’t even dream of joining an organization that required her to reveal her status window even just a tiny bit, but that was okay.", "Despite working alone without being part of any organization, Baek Haeju quickly became stronger with the help of the treasures she found in the dragon’s nest.", "She began to make a name for herself and forged her past as an Earthling who entered Paradise in the early days that most people knew nothing about.", "Of course, she couldn’t have done all that on her own.", "The person Baek Haeju chose to get help from was Seo Yuhui.", "Seo Yuhui helped Baek Haeju create a new identity in return for receiving help from her. That was the beginning of their relationship.", "“I asked him a few questions… but he wouldn’t answer them straight… so before I knew it, I….”", "Seo Yuhui couldn’t help but smile as she listened.", "For a person as cold and rational as Baek Haeju to have made a mistake in a fit of anger….", "As much as she found it hard to believe, she couldn’t help but wonder about their relationship.", "“It’s still raining….”", "But instead of prying, she changed the subject.", "“It didn’t look like he had a raincoat… and he’s in bad shape. It might be dangerous to leave him alone.”", "“I don’t care if it’s dangerous or not.”", "Baek Haeju’s voice was cold.", "“Come on.”", "Seo Yuhui held back the urge to ask her why she helped him in the first place if she was going to ignore him afterward. Instead, she persuaded in a soft voice.", "“It’s not good to let him keep following us. We’re getting closer to the Parasite territory…. You’ve saved his life once. I think it’s right to send him back now.”", "Baek Haeju remained silent.", "Only a small sigh filled the tent.", "Seo Yuhui waited for a long time before slowly raising herself.", "She stuffed a bunch of camping gear, a sleeping bag, water, and some food into a bag.", "She wasn’t sure about the exact circumstances, but Baek Haeju didn’t seem to want to talk to that man even though she cared about him.", "So, she thought she’d step up to help Baek Haeju.", "Baek Haeju was obviously shaken, which could negatively impact the expedition that was about to unfold.", "Of course, Seo Yuhui was more than willing to quit if Baek Haeju showed any signs of disapproval, but her comrade remained silent until after she left the tent.", "The man who followed them was sitting under a big tree to avoid the rain.", "But he was still soaked from head to toe, unable to avoid the rain falling through the space between leaves.", "That, combined with the gloomy look on his face, made him look shabby and weak.", "The young man raised his head.", "Seeing Seo Yuhui approach, he hurriedly got to his feet.", "“Are you feeling alright?”", "“Y-Y-yes. Thanks to you….”", "He nodded his head with a nervous look and asked.", "“Um, about Seonhwa—”", "“Shh.”", "Seo Yuhui quickly put a finger to her lips.", "“You shouldn’t mention her name here. It’s for her sake.”", "The young man blinked his eyes once, then did a double-take.", "From that, she could see that he was not a complete newbie but was familiar with Paradise’s culture.", "“I don’t know what kind of relationship you have with her, but I think it’s best if you leave.”", "“Is there any way I can talk to her? Ten minutes, no, just five minutes is fine. I was so confused when I first got out of the villa. I just want to see her!”", "The man begged, but Seo Yuhui shook her head.", "“She says she doesn’t want to see you, and there’s nothing I can do about it.”", "“Please….”", "“More importantly, Miss Haeju and I have to enter the Parasite territory soon.”", "Seo Yuhui continued calmly.", "“I can’t tell you the details, but our mission is dangerous and urgent. We can’t guarantee your safety if you keep following us. Not only that, but your presence could also put the entire expedition, including Miss Haeju, at risk.”", "In other words, she asked him to leave so that Baek Haeju, the central figure of the expedition, could concentrate entirely on the mission without being disturbed.", "“P-Parasite territory?”", "The young man looked shocked.", "“But why is Seon… I mean, Haeju… on such a dangerous mission…? She can’t even kill a bug….”", "Baek Haeju can’t even kill a bug?", "No, that statement was most certainly false.", "Laughing inwardly, Seo Yuhui spoke again.", "“I don’t know how she is on Earth, but in Paradise, Miss Baek Haeju is one of the best. Of all the Earthlings, only a few can be her match.”", "The young man’s eyes widened in surprise and disbelief.", "“Other members are upset to see Miss Baek Haeju so distraught. Of course, I have no doubt she’ll do just as well as always once she regains her composure.”", "“….”", "“I understand you’re worried about her. But don’t you see she’s also worried about you?”", "Her voice was kind but firm.", "“So that Haeju won’t worry….”", "The young man lowered his head and fidgeted.", "Because he seemed like a sensible man, Seo Yuhui thought she had given him enough explanation and handed him the bag she had brought over.", "“Take this and sleep here for today.”", "Without thinking, he received the bag.", "Having tasted such kindness for the first time in a long time, he wrapped his arms around the bag as if it were a treasure.", "“…Thank you.”", "After a moment of silence, the young man bowed his head.", "Seo Yuhui bowed in return and turned to leave.", "It was then.", "“Um….”", "A hesitant voice caused her to stop in her tracks.", "“Please take care of… my Haeju….”", "Seo Yuhui blinked.", "Though she had just told him how strong Baek Haeju was, he still sounded worried.", "‘My Haeju.’", "His voice was filled with such affection and regret that even Seo Yuhui’s heart ached for a moment.", "Seo Yuhui turned around. Whatever the reason, she couldn’t think ill of this man standing in front of her.", "She asked in a whisper.", "“What’s your name?”", "“Huh?”", "“Your name. You don’t have to tell me if you don’t want to.”", "“Ah….”", "He scratched his head.", "“It’s… Seol.”", "“Seol?”", "Seo Yuhui tilted her head.", "The young man averted his eyes in slight embarrassment.", "Seol? She thought ‘Baek Seol’ sounded too much like a girl’s name, which meant he wasn’t Baek Haeju’s brother. Perhaps he was her ex?", "Seo Yuhui muttered inwardly before breaking into a smile and heading back to her tent.", "She told Baek Haeju, who was pretending to be asleep, that everything worked out well and that he would leave tomorrow morning before sliding into her sleeping bag.", "Right before she fell asleep….", "“…I’m sorry. And thank you.”", "She heard a whisper from the other side of the tent.", "This was the first time she heard an apology and an expression of gratitude from Baek Haeju. Seo Yuhui closed her eyes with a smile.", "The next morning, she woke up at the crack of dawn and saw that the tent near the big tree had disappeared, and so had Seol.", "The rain had stopped in the meantime.", "Seo Yuhui glanced around and saw a figure in the distance, trudging down the mountain slope.", "Even though she confirmed he was leaving, instead of turning around….", "“….”", "She stared at Seol until the morning mist swallowed him whole.", "‘What’s wrong with me?’", "It was strange now that she thought about it.", "Ever since she became an Executor, Seo Yuhui had suffered from constant lust and avoided contact with others.", "But yesterday, she voluntarily chose to talk to a man she had never met before.", "That wasn’t all. She recalled that whenever she looked at Seol, she felt the lustful desire that tormented her recede. Instead, an aching longing and a surge of pity filled her heart.", "Like a tsunami, these newly discovered emotions quickly sunk her desire. She felt as if she had reunited with a child she had met a long time ago.", "‘Strange….’", "Seo Yuhui sighed with a slight tilt of her head.", "For some reason, she felt it was a shame that he left.", "Just like that, Seo Yuhui and Seol Jihu’s first meeting came to an end.", "*", "The expedition failed to bear fruit, but its members all returned safely. They had a strange encounter in the middle, but that was the only unusual thing about the trip.", "After returning, Seo Yuhui became busier than ever before. The Parasites seemed to be planning something, as strange events began taking place throughout Paradise.", "Seo Yuhui came back to Paradise even after retiring because she heard that Sung Shihyun had gone missing.", "She wasn’t worried about Sung Shihyun. Rather, she worried about what he might do to others.", "Thus she undertook an expedition in search of Sung Shihyun, but he was nowhere to be found.", "“Sung Shihyun? I don’t know. He just left one day without a word.”", "She visited Sinyoung for clues, but Yun Seohui had nothing new to offer her.", "“I don’t think we did anything wrong to him…. Of course, some people disliked him, but you know what his personality is like.”", "Seo Yuhui obviously knew about Sung Shihyun’s personality and could not defend him in that area.", "“We did everything we could for him. It’s a shame, but it’s okay. I found something better.”", "Yun Seohui smirked.", "“Just thinking about it now makes me want to laugh. He came barging into my office in the middle of the night, and do you know what he said? He said he wants to get stronger and will do anything if he can stop being a meat shield. That guy, he’s really something.”", "“Who are you talking about?”", "“One of our employees. I thought he was just a nobody, but it turns out I underestimated him. I liked his determination. Guess I won’t be bored for a while.”", "Seo Yuhui got up without a word.", "She had enough to deal with as it was and didn’t have time for pointless chit-chat.", "Time flew by.", "After her return, Seo Yuhui did her best to save Paradise, but everything seemed to worsen by the day.", "Humanity was still indifferent to the Federation and its problems and eagerly competed among themselves for power.", "Paradise was steadily heading toward destruction.", "One consolation was that, despite these circumstances, Earthlings who truly valued Paradise and were skilled at the same time began to appear one after the other.", "Then one day, it happened.", "Sung Shihyun, who had been missing, suddenly reappeared in Paradise.", "The next day, Roe Scheherazade committed suicide after using the Royal Oath, and the stele inside Gorad Boga disappeared.", "Sung Shihyun was the one who stole it.", "Only then did Seo Yuhui realize Sung Shihyun had betrayed humanity and was deeply shocked.", "Worried that the Parasite Queen might revive, Baek Haeju began preparing for an expedition to retrieve the stele, and Seo Yuhui joined in.", "There was a good chance that they would die in the course of their mission.", "Surprisingly, however, the expedition team was able to retrieve the stele without much difficulty at all.", "She later learned that an unknown Earthling had persuaded the Federation to attack the Parasites, to divert their attention from the expedition team while they carried out their mission.", "She also heard an unbelievable rumor that a man called Spear Demon had killed Abhorrent Charity.", "“That damned pipster…. just how did he find out…?”", "Baek Haeju sighed, rubbing her forehead as if she knew who the man from the rumor was.", "Seo Yuhui tilted her head questioningly.", "“Pipster?”", "“…It’s a nickname.”", "“What a cute nickname!”", "“He was as cute as a rabbit when he was little. But not anymore.”", "Baek Haeju gritted her teeth, but Seo Yuhui couldn’t help but smile.", "Pipster, rabbit.", "For some reason, she liked how these words sounded and repeated them silently inside her head.", "In any case, although they had successfully retrieved the stele, it was still early for them to be relieved. They had to find it a new hiding place.", "However, the Parasites did not give them enough time to do so.", "It wasn’t like they let their guard down. The attack was just too sudden.", "The Parasites resorted to a surprise attack. Its army used a long-distance teleportation spell and appeared where Baek Haeju was.", "Their goal was to obtain the last piece of the stele.", "Baek Haeju and Seo Yuhui fought as hard as possible, but they were no match for the Parasites.", "The two, inferior to the enemy in all respects, were separated from each other while fighting.", "Seo Yuhui ran, but as a Priest, her stamina was limited. It didn’t take long for the enemy—Parasites and human traitors—to catch up with her.", "She was going to die. No, dying would be the best-case scenario.", "Looking at the traitors, who were giggling among themselves as they sent her lustful glances, Seo Yuhui instinctively knew what would happen next—a humiliation of which she did not dare to speak out loud.", "‘I shouldn’t have come back.’", "Seo Yuhui closed her eyes because she no longer wanted to see the arms stretching toward her.", "‘For what… did I….’", "Despair overtook her as strangers’ hands pulled her hair and ripped off her clothes. Then, all of a sudden, she heard a loud explosion followed by sharp shrieks of pain.", "When Seo Yuhui opened her eyes again, she saw bodies lying around her horribly crushed and beaten. Then, she saw a man in black armor, bloodstained from head to toe, holding a simple spear in his hand.", "What just happened? Who is this man?", "His sudden appearance baffled Seo Yuhui when suddenly…", "Tk!", "A human head fell out of the man’s grasp.", "Seo Yuhui saw a pair of eyes widened in shock, a face contorted with pain, and a mouth gasping in horror.", "The head belonged to Sung Shihyun.", "“I managed to kill Sung Shihyun….”", "The man began to speak in a quiet voice.", "“But I couldn’t protect… Haeju….”", "Seo Yuhui’s eyes widened.", "“She should have just handed over the stupid stele… but she tried to protect it until the end, and… got caught up in Twisted Kindness’ teleportation….”", "His face showed no expression, but his voice trembled.", "After a moment of silence, the man gulped and strode toward Seo Yuhui.", "“There’s one thing Haeju… asked me to do before she died.”", "From his voice full of guilt and regret, she could feel his determination to grant Baek Haeju’s last wish no matter what.", "“She asked me to protect you. She said you got caught up in this because of her.”", "With an expressionless face, the man took off his cloak and draped it over Seo Yuhui’s shoulders. Then, he put his arm around her shoulders and helped her get up.", "“I’ll protect you.”", "“…Ah.”", "Finally, Seo Yuhui came to her senses.", "She stared at the man with a puzzled look as he turned away from her.", "She realized that this man was not her enemy, but she couldn’t help but feel bewildered that a man she had never seen before in her life suddenly spoke of Baek Haeju and announced that he would protect her.", "The man seemed to have killed Sung Shihyun after a fierce battle to save Baek Haeju. This had to mean that he was one of the strongest Earthlings out there.", "“W-Wait….”", "Without thinking, Seo Yuhui called the man.", "But then she flinched because the man, who had so far been completely expressionless, looked like he was about to cry.", "And….", "“Could it be….”", "That face reminded her of an old memory."]}