{"cid": "277", "title": "Chapter 277. Winter’s Struggle (2)", "content": ["“I do know her… but how does Representative Seol know this name?”", "She sounded suspicious of him. Although the question he was afraid of was asked sooner than expected, Seol Jihu calmly responded with a straight face.", "“Is it a name I shouldn’t know about?”", "“No. It’s not that, but…”", "Kim Hannah tilted her head without finishing her sentence.", "With her reaction, Seol Jihu came up with a new hypothesis— that Eun Yuri might not be famous in Paradise.", "If she was renowned and everyone knew her, ‘of course you’ve heard the name,’ would have been the adequate reaction. After all, Seol Jihu was now an Earthling who’d spent some time in Paradise.", "But Kim Hannah’s current reaction was closer to, ‘how do you know her?’", "Meaning, Eun Yuri must be an Earthling that only a few people knew of.", "“Can you tell me anything that you know about her? This is quite important for me, personally.”", "Kim Hannah seemed to think that this was out of the blue.", "‘What for?’", "It was rare for this idiot to take on a serious matter apart from battles and training.", "‘What’s this?’", "On the other hand, her reaction carried a hint of high hope as Seol Jihu tended to surprise her when he was serious once in a while. Well, except for when he was coming up with names.", "“It’s no big deal telling you. But may I hear the reason first?”", "Although she asked out of curiosity…", "“I can’t say anything right now. I can only be certain once I learn more.”", "Seol Jihu flatly refused to answer. But because it didn’t feel right to hide everything, he told his intentions.", "“Although I will decide after I investigate more, I am considering recruiting her.”", "“Ah, recruitment.”", "Kim Hannah spoke, nodding her head.", "“I don’t know how you know her, but…that might be pretty hard.”", "“How so?”", "“As far as I know, the person named Eun Yuri…”", "And what followed…", "“Is already dead. In Paradise, of course.”", "…was simply shocking.", "Seol Jihu momentarily became speechless and could only blink his eyes.", "He thought it would either be that she was active in Paradise or had yet to enter. He never expected to hear that she had died.", "He did not even consider it as a possibility since he heard that she was alive until the final war.", "Of course, it could be that his actions changed the future. Otherwise…", "‘Does that mean she resurrected or something?’", "Seol Jihu frowned and roughly swept his forehead.", "“Just to make it clear, allow me to say something.”", "Kim Hannah’s voice echoed through the silent conference room.", "“Eun Yuri died in the Neutral Zone. She died without completing the three-month course.”", "“What?”", "Seol Jihu’s eyes widened.", "“Is that why you say it would be hard for us to recruit her?”", "“I meant that it would be challenging, not impossible. Um…”", "Kim Hannah paused briefly before asking suddenly.", "“How much do you know about the Tutorial and the Neutral Zone?”", "Seol Jihu stared blankly at Kim Hannah. She must have thought that further explanation was necessary as she slowly started to explain.", "For an Earthling to enter Paradise and become active, they had to go through two steps.First, an Earthling who accepted an invitation would be assigned a coordinate by the gold, silver, bronze, or red stamp. Once they were chosen as a subject for summoning, they would automatically move to the first testing ground when the time was right.", "Only after passing the three stages there, would they be authorized to move to the Neutral Zone.", "“Representative Seol, do you remember how you went from the Tutorial to the Neutral Zone?”", "“I entered a portal.”", "“Then how about when you left the Neutral Zone? Tell me what the first thing you saw was.”", "“Obviously it was the scenery of Paradise… Ah.”", "It was then that Seol Jihu began to realize what Kim Hannah was trying to say.", "“The important thing is the portal. Although they are both testing grounds, the Tutorial is held on Earth while the Neutral Zone is a building located in Paradise. This is the biggest difference between the two.”", "Kim Hannah smiled and continued.", "“Of course, the results are the same no matter where you die. The only difference is the degree of dissociation you would feel afterward. You would lose all your memories of Paradise and resurrect on Earth.”", "“But there is a difference if you resurrect in Paradise, right?”", "“Exactly. If you die during the Tutorial, there is no limit on re-entering. Since it's before entering Paradise, it is considered that you died on Earth.”", "Kim Hannah refined her voice.", "“On the other hand, if you die in the Neutral Zone, it is considered the same as an Earthling’s death. Each Earthling is given only one chance to resurrect, and even that requires the use of a Divine Wish and going through the process of inviting the resurrected from Earth once more.”", "“It’s not just similar, but identical.”", "“No, there’s one, just one difference.”", "Kim Hannah’s voice stressed importance on ‘one.’", "“For example, let’s say all the tests just ended. If you die from a sudden accident after the door opens, you will resurrect outside of the Neutral Zone, regardless of whether you were still in the Neutral Zone building or not.”", "Meaning, one would be considered an Earthling as soon as the Neutral Zone ended.", "“But it’s a different story if you die in the Neutral Zone before its completion. In this case, you start over from the Tutorial when you resurrect.”", "“Not from the Neutral Zone?”", "“No. Although you technically entered Paradise, your Neutral Zone curriculum is considered incomplete. Apparently, it’s a decision made considering the fact that it takes at least 6 months in Earth’s time to re-enter.”", "“Who decided that?”", "“The seven gods.”", "Seol Jihu became lost for words.", "“…Why is it so complicated…”", "He let out a sigh, feeling as if his hands were tied.", "Eun Yuri had died in the Neutral Zone. Therefore, to bring her to Paradise, they would need to go through a resurrection ceremony.", "‘Eun isn’t a common family name, so it’s unlikely that it would be someone with the same name.’", "Now that he thought about it, the situation seemed strange.", "As far as Seol Jihu was aware, the Neutral Zone was considered an independent and separate area from Paradise despite its location. Meaning, there was no need to apply the rule of Paradise in it.", "Although there might be an issue with the law of causality or whatnot, he didn’t think the seven gods lacked the strength to do anything about it. They must have more than enough strength to do so.", "“That’s a bit harsh.”", "Seol Jihu grumbled softly, breaking his deep thoughts.", "“I get the point of testing Earthlings, but what’s wrong with giving them a second chance?”", "“….”", "“Why can’t they just set the respawn point to where the person died? What’s the point of only limiting the Neutral Zone?”", "“It’s because the Neutral Zone reveals the Invited’s value.”", "Kim Hannah answered with a low voice.", "“Although the scouts have their own standards, an Invited’s potential is unknown until their awakening. Only after passing the Awakening Chamber and acquiring a class would their true worth be revealed.”", "Kim Hannah suddenly kept silent for a while, hesitating to let out what was on the tip of her tongue.", "Seol Jihu frowned as he waited for her to continue.", "“No way.”", "“….”", "“It’s not, right? It can’t be that this restriction was also made because of Earthlings. Eii, no way.”", "“…It’s true.”", "Kim Hannah quietly admitted.", "Seol Jihu had a blank expression on his face.", "“Why?”", "“The Neutral Zone is an isolated area. Originally, no one except for the administrators managing the place knew what happened inside.”", "“But that’s not true. You’ve seen what happened.”", "“Hence the term, ‘originally’. It wasn’t like that before. A lot happened in Paradise before you entered, like killing an enemy organization’s Invited while disguising it as an accident or disturbing them so they can’t gather points. Tampering was especially common.”", "“Tampering? They ignored the primary negotiating rights?”", "“Yes. The general manager or an instructor would secretly approach them and suggest it.”", "“And there were people taking the offer?”", "“Why wouldn’t there be? As long as you coax them well, the Contracted are almost always guaranteed to fall. ‘You’re a Red Mark, aren’t you? Do you want to live as a slave? It would be a shame if someone as talented as you ended up in that organization. Hey, I’ll mark you again as bronze or silver. We can start again from the Tutorial. We’ll support you all the way! You’ve done it once already. Twice wouldn’t be hard.’ Something like this.”", "Kim Hannah shrugged.", "“If that doesn’t work out, they could assassinate them while they were asleep and bring them back after finding them on Earth. It would have been a problem if they did this out in public, but back then, there was no way of knowing.”", "Seol Jihu let out a feigned laugh and shot a glance at Kim Hannah. The way she explained everything so fluidly, she must have done this several times as well.", "“…Be honest with me. You’ve done it as well, haven’t you?”", "Kim Hannah did not answer. She only looked away and pretended not to hear his words. Soon, she cleared her throat and continued.", "“Anyways, after one huge scandal, the seven kingdoms stopped remaining as mere spectators. They announced it to every organization in Paradise right away.”", "“Announced what?”", "“Although it was nothing more than words, they warned that they would not stand by idly if it happened again. Then, they limited the activities of managers and instructors in the Neutral Zone with the help of the seven gods.”", "They could not harm pre-completion trainees without a valid reason, and just like how mentioning any matter regarding Paradise on Earth was prohibited, they were banned from saying anything that might be considered tampering.", "They placed communication crystals everywhere so they could observe the situation inside the Neutral Zone from the outside, and they made it so that a single organization could not monopolize the Neutral Zone admins.", "The death restriction in the Neutral Zone was created because of this as well.", "Even if they were able to slide their way through and succeed in tampering with the trainees, they would have to use immense contribution points to get what they wanted.", "“The seven kingdoms got away with that? Were there no objections?”", "“It was quite clear who was at fault. Also, small and mid-scale organizations all supported the royal families’ decisions.”", "“…I’ve been thinking about this since a while back, but Earthlings really do know how to kill the goose that lays golden eggs.”", "Seol Jihu, finally speaking up, shook his head. What he was hearing made him sick, so much so that Charlotte Aria, who was the epitome of frustration, seemed like an angel in comparison.", "“…Alright.”", "In any case, it was better to focus on the current matter at hand than to stay frustrated.", "“I have a question though. Did the seven gods reinforce the restrictions before or after Eun Yuri’s invitation?”", "“It was after.”", "“Then there is a chance that Eun Yuri’s death wasn’t her fault.”", "“Although I can’t say for certain since I wasn’t there, I do think that it is possible. Eun Yuri died the day the Awakening Chamber opened.”", "“The very same day… That’s fishy, alright.”", "Seol Jihu tapped on the table with his fingers.", "“Haven’t you considered re-inviting her? Setting all the controversy aside.”", "“Actually, it is a topic we’ve discussed at Sinyoung. That’s how I learned about her.”", "Kim Hannah faithfully answered.", "“The problem was that the seven gods interfered before the next Neutral Zone opened. It was too much of a risk to scrape together so many contribution points to make a wish when her class wasn’t clear. I believe it was the right decision for the company.”", "“The right decision, huh.”", "Seol Jihu smacked his lips.", "Eun Yuri was invited to Paradise and died in the Neutral Zone. This was an undeniable fact.", "The future could be altered, but there was no way to change the past.", "In that case, what choice should Seol Jihu make here?", "Should he erase the period on the writing and add in a comma, or should he stop reading?", "After thinking in depth, Seol Jihu decided to investigate a bit more. For some reason, it felt bad to close the book known as Eun Yuri like this.", "“You don’t know anything else, right?”", "“Unfortunately, no.”", "Kim Hannah caught the dissatisfaction on Seol Jihu’s face and asked.“Are you looking for more detailed information?”", "“Yes. Can you get your hands on it?”", "“I could if you want me to, but…”", "Kim Hannah did not finish her sentence.", "Indeed, there were more than just one or two tasks she was currently in charge of. Moreover, it was too harsh even for Seol Jihu to ask her to investigate without a proper intelligence team.", "But in reality, Kim Hannah did not need to take on this task personally. There was a better way to go about it.", "Now that Seol Jihu thought of something they could work on meaningfully, he spoke with a smile.", "“Alright, I’ll deal with this on my own. It pairs well with the other work I’ll be doing.”", "“Other work?”", "Kim Hannah’s eyes widened.", "*", "Time flew swiftly.", "Seol Jihu had been very busy recently, so much so that he did not realize that a new year had begun in Earth’s time.", "Although staying in the office every day was stressful, Seol Jihu remained patient. Now was a very important time for Valhalla.", "Since he knew that it would be more convenient if he took concrete steps now, he carefully carried out internal restructuring.", "‘Systematic change, huh.’", "Although Kim Hannah suggested they implement a military structure, Seol Jihu decided to add one more thing.", "It was the Youth System that was used in foreign soccer teams.", "Inspired by the fact that they could not leave the buildings in Haramark unused, he planned to use the old office as a facility to train newbies, Paradise’s experienced veterans being excluded, of course.", "Once these newbies showed growth in their performance, they would be called to Eva as an official member. Conversely, if a regular’s performance was lacking, they would be excluded from the front line and be sent to Haramark.", "Although the plan required a lot of effort, it was easily handled thanks to one person in Valhalla.", "Seol Jihu personally requested Paradise’s greatest trainer, and Jang Maldong gladly accepted the offer. Seol Jihu was worried that it would be too much work, but Jang Maldong almost seemed happy to take it.", "Although passing the training responsibility to Jang Maldong took some weight off his shoulders, there were other things to worry about.", "Before they could dive into the structural reform, Seol Jihu held a meeting to announce what he had discussed with Kim Hannah.", "Since it was a matter everyone already expected from before the organization formed, there wasn’t any great aversion to the idea. However, the problem was their reactions.", "When Seol Jihu asked, ‘Does anyone want to take over the new attack team?’ No one stepped forward.", "Seol Jihu was caught off guard since he was planning to keep one team under his supervision at the headquarters and create new smaller teams like military units.", "He was expecting either Hugo or Chohong to volunteer, but they did not seem interested at all. Seol Jihu called them separately and tried to persuade them, but Chohong’s answer left him speechless.", "“Think about it. You’ll have your own team.”", "“Ugh, just thinking about it stresses me out.”", "“It would give you the authorities as a team leader.”", "“I’m not interested in authorities.”", "“I want you, Chohong, to take charge.”", "“Why me!? I’m too dumb to deal with stuff like this. Just ask Hugo!”", "Seol Jihu’s constant bugging made Chohong lose her temper. She crossed her arms in a serious manner and spoke with a face full of betrayal.", "“Hey, this is no good. How can you do this to me?”", "“What do you mean?”", "“Who was the one who took care of you the most when you entered Paradise? It was me.”", "“?”", "“After all this time we’ve spent together, you’re trying to abandon me? This is really disappointing!”", "“Who’s abandoning whom?”", "“Anyway, I will be staying in the team under your direct control. I’m not suggesting there’s anything special between us, but nothing good ever comes out of abandoning your wife. Got that, bastard?”", "“Hey, Chohong!”", "Chohong flew off after saying what was on her mind.", "Seol Jihu was disappointed by her reaction, but what could he do when she didn’t want the position of a team leader?", "However, he could not fully let go of the idea of making the original members as team leaders. So, he asked one more person.", "“I don’t want to!”", "The reaction was as expected.", "“Why, why are you doing this? You startled me, saying such weird stuff.”", "The reaction was something more than a refusal.", "“M-Miss Phi Sora, listen.”", "“You already know, dear, why I’m not taking the offer. Do you want to see me cry a river?”", "“….”", "“Thank you for thinking of me so highly, but I don’t think I’ll take it for now. I will maybe reconsider it when I get better later, alright? Please.”", "Because she seemed so desperate, Seol Jihu could only turn back before finishing his explanation. Knowing Phi Sora’s trauma, he didn’t want to force the role onto her.", "‘I guess I don’t really have a choice.’", "In the end, he decided to keep the original members in their current team and have new members form new teams.", "Kim Hannah also wanted Phi Sora to take charge of a team, but she said things turning out this way wasn’t necessarily bad.", "Her logic was that the representative’s status would be elevated if all the founding members were in his team.", "But he left Attack Team 1’s spot empty just in case anything changed.", "‘She has the experience and skills.’", "Although she might complain if she knew, Seol Jihu thought there was no one else as a better fit as Phi Sora for the team leader. Both her status window and her past battles proved this point.", "Since Phi Sora also left the door open, Seol Jihu planned to eventually make Phi Sora Valhalla’s vanguard.", "And as he was spending his days like a headless chicken, the guest he had been waiting for visited Valhalla."]}