{"cid": "409", "title": "Chapter 409. Secret Weapon (2)", "content": ["[You know the stele’s whereabouts?]", "The Parasite Queen revealed an unprecedented interest.", "“No, not exactly.”", "Sung Shihyun shook his head.", "“From what I found out after I turned to the Parasites—well, I’m sure Your Majesty knows where one of them is hidden. Including the one that I hid, we know the location of two of the steles.”", "Sung Shihyun raised his index finger and middle finger before continuing with a but.", "“Unfortunately, we don’t know where the last stele is. I know it’s not in the territory of the Federation or humanity, but I wasn’t told anything more. But there’s a way to find out. We would have to use a little bit of force though.”", "The Parasite Queen listened to Sung Shihyun without missing a single word.", "Though she had her eyes closed, her mind was making calculations at a frightening speed.", "Was it possible or impossible? Should it be done or should it be not?", "“It’s simple, really.”", "Sung Shihyun continued.", "“If we succeed in baiting out the Brightest Star? Then we’ll drop everything we’re doing and solely focus on just attacking him. Even if he is under the protection of this world, he should not be able to survive the onslaught of the Parasites’ whole force.”", "On the other hand.", "“But what if we fail to bait him out? Though it would be a shame, it’s still not too bad because the Parasites would still have gained something. Something that swept away the past era’s Empire, Orc Kingdom, and other nations and races…”", "Sung Shihyun paused and rolled his eyes in a circle.", "“Actually, we don’t even need to go that far back. Your Majesty wiped out half of the allied forces at Tigol Fortress by unleashing divinity thrice. So imagine how they would react. Even I’m dying to know.”", "[Now that you mention it…]", "The Parasite Queen smiled furtively after having listened quietly.", "[Even I am greatly tempted by the prospect. I don’t want to give up either one.]", "“Ah, please, Greedy Queen.”", "Sung Shihyun dropped his hands in an exaggerated manner.", "“Pick one. Just one. Do you want to chase after two rabbits again only to catch none?”", "“I know how tempting it is, but didn’t you already experience it once during the Tigol Fortress War? Unexpected factors are bound to come into play this time around as well, so let’s just focus on doing one thing.”", "The Parasite Queen chuckled at Sung Shihyun’s rather adorable grumbling.", "Her mood, which had hit rock-bottom just yesterday, was gradually going up.", "It was because she felt like talking to Sung Shihyun was broadening the Parasites’ future.", "“Anyway, that’s all I have to say.”", "Sung Shihyun spread out his arms.", "“Whether this plan is worth carrying out, and which of the two we will focus on if we do, will depend on Your Majesty’s judgment.”", "He then bowed down like a magician bowing before his audience.", "*", "After Sung Shihyun left, the Parasite Queen became lost in thought for a long time in the empty grand hall.", "What Sung Shihyun said wasn’t wrong.", "Humanity was currently advancing toward a better future. She had to nip the bud before the change properly set in.", "In truth, the Parasites had to make a move now. Rather than this being the ideal time, it was because they already expended a lot of time recovering their forces.", "Thinking in this way, Sung Shihyun’s offer wasn’t so bad. In fact, it was quite excellent.", "It was a low-risk, high-return plan.", "The problem was deciding which rabbit to catch.", "[Oh yes, let me say just one more thing before I go.]", "[If Your Majesty chooses the first option, you will have to be very careful with how to eliminate the Brightest Star.]", "[You must know that Earthlings can revive once using a Divine Wish.]", "[If he dies without being corrupted or commits suicide after being captured, our efforts would have been for nothing.]", "[If we choose to kill him, we need to make sure he dies completely. We need to make it so that he won’t be able to do anything even if he revives.]", "[Is it possible? Yes, of course! I know the weak point of the Earthlings’ revival clause.]", "Recalling Sung Shihyun’s words, the Parasite Queen slowly opened her eyes.", "She then came to the decision: although the offered plan is a little vague, it can be a huge success depending on how it’s carried out.", "That said, she didn’t order Sung Shihyun to outline a detailed plan. Their next attack would be a different method than the frontal-breakthrough approach they had been using.", "Moreover, as the Parasites’ future rested on its outcome, she wanted to devote her own time into perfecting the plan.", "And just now, she had completed the plan.", "The Parasite Queen immediately summoned the Third Army Commander.", "“I’ve come, my dear queen.”", "After hurrying into the grand hall, the black-hooded Army Commander bowed respectfully.", "The Third Army Commander, Abhorrent Charity, was a necromancer. To be more precise, he was an Archlich, once a powerful magician who desired immortality, laying his hands on necromancy and transforming into an undead.", "As he pursued the Path of the Mana for hundreds of years, he was familiar, not only with necromancy but with all types of magic.", "[The reason I have called you here today is to ask you for a favor.]", "“A favor? Your command is my wish, my dear queen.”", "[Then I will be frank.]", "The Parasite Queen nodded and then spoke.", "[Prepare a surprise attack.]", "“…Pardon?”", "Abhorrent Charity looked taken aback as if he had not expected such an order.", "The “surprise attack” mentioned by the Parasite Queen meant using a large-scale teleportation spell to force oneself into the heart of the enemy. With the enemy having the defender’s advantage, it would naturally come at a huge risk.", "Teleport. This powerful spell allowed for instantaneous, long-distance travel, but it also came with many restrictions.", "The distance traveled depended on the mana of the spellcaster and the volume and mass of the teleporting matter.", "For example, “take the Parasites’ whole force and teleport to humanity’s capital,” would be too difficult a task for even Abhorrent Charity, who was familiar with magic and obtained a level of existence of a demigod.", "“I assume you don’t mean for me to go alone.”", "[Take three other Army Commanders and their armies.]", "“And the distance…”", "[From where you are standing right now to Scheherazade. Is it possible?]", "“To Scheherazade…!”", "Abhorrent Charity gasped. It was not an easy task at all. However, the Third Army Commander fell into thought without complaining.", "In truth, given the effectiveness of a surprise attack using Teleport, he had brought up this idea several times in the past.", "However, the Parasite Queen had held off on the idea back then for a few different reasons.", "The biggest reason was just how much risk it carried.", "A large-scale teleportation required a long time in both its activation stage and the actual movement stage. If they teleported to the middle of Tigol Fortress and became the focal point of a barrage of Thunders, they would just be a laughingstock of the whole world.", "So, they had to launch the surprise attack without the enemy finding out to maximize its effectiveness, but even this would only be a one-time thing.", "Unless their enemy were fools, they would prepare for another surprise attack after the first time, and this meant the risk of teleporting would only get higher.", "And so, the Parasite Queen had put off the plan of using long-distance teleportation, keeping it hidden for when it became necessary.", "And today, the Parasite Queen mentioned this hidden card.", "Abhorrent Charity thought for a long time before replying.", "“It is not possible as of now. To make it possible with those conditions, I need four things.”", "[Four. That is quite a lot. Speak.]", "“The first is the Seventh Army Commander’s assistance.”", "[That will be easy.]", "The Seventh Army Commander, Twisted Kindness, was a member of the Dragon race. With her profound knowledge of magic, she should be able to shoulder Abhorrent Charity’s burden.", "“The second, though only an assumption, is that I can only bring three or four Army Commanders with me at most. And among them, the First Army Commander and Seventh Army Commander must be included.”", "[I shall allow it.]", "Sung Shihyun and Twisted Kindness had fully absorbed their divinity and thus did not command their own armies.", "That was to say, Abhorrent Charity would only be able to teleport three armies at most.", "“The third is that my capabilities are limited. It will be difficult for me to use such a massive spell in my current state.”", "[I shall permit the release of your divinity.]", "The Parasite Queen gave her permission easily, but Abhorrent Charity smiled bitterly on the inside. He had only just finished recuperating from the aftermath of the Tigol Fortress War, but it seemed like he would be resting again soon.", "“The fourth, I’m ashamed to say, is that the success of the spell is uncertain even with the other three conditions being met. And so, I will need magic circles to help lessen the burden. Not only at the starting location, but also at the destination.”", "[You don’t have to worry about that.]", "The Parasite Queen spoke.", "[There is someone to help you at both the starting location and the destination.]", "“Pardon…?”", "Abhorrent Charity muttered confusedly and then did a double-take.", "“Ah, we do have a “link” in Scheherazade…”", "[Fufu….]", "The Parasite Queen chuckled faintly.", "[Now then, I will tell you the starting location, the destination, and when to launch the surprise attack.]", "“Please.”", "[First…]", "The Parasite Queen revealed her plan at last.", "Then, seemingly having heard something absurd, Abhorrent Charity suddenly raised his lowered head.", "“P-Pardon?”", "The more the Parasite Queen spoke, the more dazed Abhorrent Charity became.", "“Then…!”", "[Quiet. Do you understand?]", "“…Yes.”", "[Good. I will immediately summon the Army Commanders again, so you should make preparations so that all goes according to plan.]", "“Your humble servant accepts your command.”", "Abhorrent Charity bent his waist all the way and then hurriedly left the grand hall.", "The Parasites began to move again at last.", "Secretly and stealthily, without the Federation and humanity knowing.", "*", "The carriage holding Valhalla’s members arrived in Eva.", "And before they even went back to Valhalla’s building, Seol Jihu got a call.", "It was to deliver the news that all employees had finished signing the contract.", "“Iya~ They sure work fast.”", "“They better if they wanna live. It would’ve been better if they did it earlier!”", "Everyone chattered loudly and in a good mood while entering through the main entrance.", "“Eh?”", "Phi Sora, who walked at the front, suddenly came to a stop.", "A little chick with two feathers sticking out of its head was dozing off in the middle of the garden while basking under the sunlight.", "“Shh!” Phi Sora looked back at everyone and put up a finger to her mouth.", "As others looked at her curiously, she grinned and slowly approached the peacefully napping Little Chick.", "“Fus~”", "After bending down a little and taking a deep breath…", "“RO DAAAAAAAAAAH!”", "She screamed.", "“Piyaaaaak!?”", "Little Chick spread its wings and flew up in a startle before stumbling back down and rolling over.", "Boisterous laughter burst out.", "“W-What the heck!?”", "Little Chick shook its head and then made a dazed face after seeing the cackling Valhalla members.", "It then saw Phi Sora who was cracking up and glared at her.", "“You dare!”", "It raised its tiny beak, flying up like a butterfly and stinging her knee like a bee.", "“Ow!”", "“You wanna die? You wanna dieeee!?”", "“Sorry, sorry! My bad!”", "Phi Sora fell on her butt laughing and then wrapped her arms around her knees.", "“You were just too cute dozing off in the garden!”", "“What a load of a bull! Just when I thought things were getting quiet thanks to those guys…!”", "It was then.", "“Kkiing… pfft.”", "The fuzzballs that were strolling through the garden eating grass laughed mockingly.", "Little Chick blinked.", "“Is this funny?”", "“Kkihihing!”", "“What’s so funny, huh?”", "Little Chick asked threateningly.", "“Kki…hahahaha!”", "The fuzzballs burst out laughing simultaneously.", "The six of them rolled left and right like they were about to die of laughter.", "“Y-You little…!”", "Little Chick trembled.", "“You little bastards!”", "It then screamed and burst into a brilliant light.", "It grew in size in an instant, and a strange bird with a giraffe’s long neck and a deer’s slender body spread its wings.", "Little Chick had transformed into a phoenix.", "—I dare you buggers to laugh again!", "Swinging its head to the side, it saw Hugo slamming his fist on the ground, laughing. It craned its long neck and bit down on his head.", "“Uaaaack!”", "Hugo’s legs flailed around in the air as he went upside down inside the phoenix’s beak.", "—I’ll eat you! I’ll swallow you whole!", "“Ah! Why me!?”", "—Shut it! I hate you the most!", "“Someone help!!”", "All chaos broke loose in the garden.", "“….”", "Seol Jihu gazed at his comrades, screaming and running away, with an expressionless face.", "While everyone seemed to be having fun, he could not laugh.", "There were just too many things on his mind to be blindly optimistic about the future.", "‘…I’m jealous.’", "Seol Jihu quietly closed his eyes as he watched the phoenix spit out Hugo and chase after Phi Sora.", "He couldn’t help but wish he could laugh like them without any worry.", "But as his position rose and he gradually got more work to do, laughter disappeared from his face.", "When was the last time he relaxed and laughed freely?", "He who wishes to wear the crown must bear its weight…", "Remembering the words Ian told him long ago, Seol Jihu let out a short sigh.", "The phoenix succeeded in punishing Phi Sora at last and then stopped while on its way to look for the fuzzballs.", "Before he noticed, the six fuzzballs were huddled behind Seol Jihu’s leg trembling.", "“Hey, you! You’re supposed to be my partner, so how can you…”", "The phoenix trailed off in the middle of yelling at him.", "Seol Jihu, who was standing still, didn’t have a good expression. In fact, it could even be described as menacing.", "The phoenix stared fixedly at Seol Jihu before canceling its transformation and returning to its chick form.", "“…Are you alright?”", "It trotted up to him and asked.", "Seol Jihu laughed blandly.", "“You could transform?”", "“Can’t you see this?”", "Little Chick raised its wing and pointed at its forehead.", "A bright orange feather and an indigo feather.", "Seol Jihu blinked his eyes.", "“The first one was green… the next two were yellow and blue… now it’s orange and indigo… so the next two are red and violet?”", "“You only just noticed it?”", "“Since when could you evolve?”", "“Since the Spirit Realm Expedition.”", "Little Chick spoke calmly.", "“I used up the Spirit Kings’ energy that the Nests stole back then, but I stored the Nests’ energy separately. While you were out training, I took my time to digest them little by little.”", "Seol Jihu nodded his head.", "Born under the blessing of Chastity, the Arcus Spirit had an innate purification ability, and it could feed on any kind of evil creatures and use their energy as nutrients.", "Since it consumed five pinnacle-rank Nests and Seol Jihu himself had fed it quite a lot of holy power, it should have helped his growth tremendously.", "“Infancy, youth, adolescence, adulthood… You’re in the adolescence stage right now, right? How close are you to reaching adulthood?”", "“Feed me more holy power.”", "Little Chick said firmly.", "Seol Jihu chuckled and reached out his hand.", "“Let’s go.”", "“Oh, really?”", "Little Chick hopped up to his palm with joy.", "“You always pushed it off, saying it was wasteful. Now you’re doing it right away? What gives?”", "“I have a business at the temple anyway. Plus…”", "Seol Jihu closed his mouth without finishing the thought, ‘Because I think something is going to happen soon.’ He didn’t feel like it was the right thing to say, given that it was only his feeling.", "And so, he placed Little Chick on his shoulder and quietly turned to leave.", "*", "Seol Jihu filled Little Chick up with holy power as soon as he arrived at Gula’s temple.", "After watching Little Chick stroking its bulging belly with a satisfied face, he slowly looked up at the statue.", "‘…Gula-nim.’", "He stood straight and thought in his head.", "‘You must have read the question that is on my mind by now.’", "[….]", "‘I was given the trial to become the Apostle of Gula, and by wrapping up the matter with Sinyoung a few days ago, I wrapped up the plan I initially came up with.’", "[….]", "‘So I want to ask.’", "Calming the heart that was pounding with nervousness…", "‘At the point in time…’", "Seol Jihu asked the question that he continuously thought of on his way back.", "‘Can you say that humanity has changed?’", "Seol Jihu swallowed his saliva and awaited Gula’s response.", "After a short silence, Gula’s unique languid voice echoed in his head."]}