{"cid": "86", "title": "Chapter 86. Strange Bedfellows (1)", "content": ["Her sparkling pinkish eyes began emitting clear light. Blink, blink. She blinked her eyes a couple of times, and a thin smile spread on his lips.", "“Good morning~. Did you sleep well?”", "She used her right arm to prop up her upper body. She then rubbed her eyes while yawning softly. Seol Jihu was rendered speechless from her asking if he slept well. For a moment there, he thought they were a blissfully married couple waking up on the same bed to greet a refreshing morning together.", "'In reality, we’re in dire straits….’", "He mocked himself just a tad but quickly changed his mindset. Their situation certainly wouldn't get resolved by stomping one's feet in anxiety. Of course, being calm didn't leave them in a better position either, but he thought that, at the very least, they needed to be realistic and be more relaxed about their fate.", "'Okay, my body first….'", "Huu, huu… Seol Jihu regulated his breathing and slowly put strength into his body.", "“Euhk!”", "Knife-like pain stabbed him. He wanted to give up and lay down again but gritted his teeth and pushed his upper torso up anyway. Leaning against a nearby wall infinitely made it better.", "“You gotta move your body, even if it's only a little.”", "Teresa Hussey stared at him quietly before offering up her opinion.", "“I'd love to tell you that you can take it easy for a while, but unfortunately, we don't have that luxury. If we're planning to move again, it'll be better to get used to the pain.”", "He briefly recalled the forced nighttime marches he had to partake during his military days and unconsciously nodded his head. If one developed blisters on his feet, it might hurt like hell initially, but by walking on continuously, one would eventually grow desensitized to the pain.", "However, there was nothing he could do about the state of his left shoulder. There was a hole the size of a bottle cap on his shoulder muscles, and he could only barely feel the connection to his arm. He tried to clench his fist only to be subjected to pain so severe that he nearly blacked out.", "“Haa….”", "In the end, he gave up on his left shoulder and took a look around. To the side, he spotted an altar with the transfer magic circle on the surface, just like the other hideout.", "Just in case, he activated Nine Eyes but the altar rapidly turned red. Indeed, it was a pie in the sky. No, make that a poisonous pie – taking a small bite would lead to one's immediate death.", "“Is this true? What's written here. That we are not supposed to use that.”", "Teresa Hussey spoke while looking at the map.", "“If you're referring to the transfer magic circle…. Yes, I heard that it's connected to the center of the Empire.” (Seol Jihu)", "“What the fuck? Let's just forget about it, then.”", "Teresa Hussey immediately gave up on the idea.", "“….”", "“….”", "For a long while, they didn't say anything. It wasn't as if either of them knew what to say, anyway.", "Thank each other for the rescue? Or be happy that they managed to survive? It was already a lot to ask for in their current situation.", "So how about, “how does your body feel?”", "Both of them knew that they weren't okay in the slightest. Right now, they had to focus on escaping this place.", "Eventually, Teresa Hussey broke this rather awkward atmosphere.", "“We have two options available to us.”", "Her powerless voice was closer to 'We have no other choice' rather than 'I have a brilliant idea'.", "“The first one is to wait 72 hours before going back to the hideout.”", "That would have been the most ideal option. If only that was possible, of course.", "“…I doubt the hideout is still in one piece.”", "“Given that bastard's personality, yes, it's probably destroyed beyond repair.”", "Teresa Hussey helplessly sighed before continuing on.", "“The second one is… We somehow escape from this place and walk our way back to Haramark. That's it.”", "Seol Jihu was about to chuckle hollowly but his expression hardened, instead. This was no laughing matter; if the hideout was really destroyed, then that was really the only way out.", "The problem was, the odds of success were just too low. Not only that, he had suffered a grievous wound, too.", "“Staying here forever isn't going to work, either. Our stamina will continue to fall. We might as well take a gamble while we can still move about.”", "'Gambling again, is it?'", "He was bitter, but reality was unkind. Besides the magic circle, everything within this hideout was in green, but that was just about it. There was nothing to eat or drink. Staying put just because it was safe would definitely lead them to die of starvation. By then, it'd be too late to do anything even if he wanted to.", "'It's also unrealistic to wait for another rescue attempt.'", "Them coming here would present another problem. The high-ranking Parasite wouldn't sit back and do nothing now that it got burned once already. In the end, all his thinking led to one inevitable conclusion, and that would be them needing to make a move.", "Seol Jihu deactivated Nine Eyes first. The longer he left it on, the greater the wastage of his stamina was.", "“What do you want to do?”", "Teresa Hussey pressed him for an answer.", "“Will you stay here and spend some lovey-dovey time before dying of hunger together? Or get out of here regardless of what happens next?”", "Before he could say it's the latter, he asked her something else.", "“How long do you think it’s been since we entered the hideout?”", "“Uhm…. I'm not sure.”", "She formed a troubled expression.", "“I'm sorry. Once I got here and finished your emergency treatment, I got so sleepy….”", "She formed a weak smile before sticking her pink tongue out. Who could blame her? She had gone through all sorts of hardship before finally being freed.", "“If that creature has a short fuse, maybe it stopped searching for us already.”", "“We can only hope that’s the case. It was throwing quite a tantrum before I fell asleep, though.”", "“We must have really pissed it off.”", "She handed the map back to Seol Jihu. The stairs going up or down were all located in the prison block. The research area was located on the left side of the prison block, connected by the long sky bridge in the middle as if it was an attached building. In other words, the overall design of the entire underground floor was in a 'ㅓ' shape.", "However, the dummy hideout located in the storage facility of the research area was excluded from this arrangement. According to the village head, this place might as well be the third underground floor in its depth alone.", "'…I can't think of anything.'", "He carefully folded the map away and laboriously pushed himself up. Teresa Hussey was right; rather than staying put, they had to move while they still could. Thankfully, his two legs were in perfect working order.", "'How much do I have left….?'", "He had about a fingernail-sized rudium left, but there was no more use for it. Both his shirt and pants were used up as bandages. He took a look at the armor and could only lick his lips. The left side of the Boiled Leather Armour was completely gone, and its lower right side was also in a heavily crushed state. Rather than a piece of armor, that thing was more like a rag.", "'Still, better than nothing….'", "He groaned helplessly before abruptly remembering that Teresa Hussey wasn't wearing anything at all.", "“…Would you like to wear this, at least?”", "He pointed at the chain mail with a hole in it, and she faintly smiled.", "“Wearing that with nothing underneath, well, that's gonna pinch my skin, but… I guess we don't have a choice now.”", "They gathered up their equipment and put it on. Teresa Hussey giggled afterwards.", "“Don't we look really funny like this?”", "Seol Jihu also chuckled softly. One of them was wearing a small chain mail over her naked body that barely came down to her belly, while the other one was wearing a broken armor over his underpants. Where would you find a more hilarious sight than this?", "“Well, it's refreshingly cool so I guess that's a plus. I hope I'm not going to develop exhibitionism at this rate.”", "Teresa Hussey picked up the ice spear. Seol Jihu naturally let her handle it. No matter how he sliced it, it'd be better to let her handle any weapons for the time being.", "“Before we leave, let's make a deal first.”", "She suddenly pointed the spear at his neck. She was not playing around anymore.", "“In a one in a ten thousand case…. No, wait. In nine thousand nine hundred ninety-nine in ten thousand cases that something goes wrong, what do you want me to do?”", "“?”", "“I'm saying, I can end your life before you're captured.”", "“There's no need.”", "Seol Jihu replied immediately as if he didn't even need to think about it. Teresa Hussey's eyes went round from a mixture of surprise and confusion.", "“Don't you know what will happen when you're captured?”", "“We don't know what's going to happen in the future. Besides, even if heaven collapses, there always will be a way out.”", "“But, you go back to Earth when you die, right?”", "“Even then, I'd like to do everything in my power to survive.”", "Heh~~, Teresa Hussey mouth opened a little wider.", "“That's new. You sure you're an Earthling?”", "Seol Jihu inwardly replied with the words of 'I don't want to give up on the life on this side that quickly.'", "A short while later.", "The two of them made up their minds and took their first steps. The exit of the hideout could be reached by the long staircase.", "One step after the other, they slowly climbed up. Teresa then abruptly opened her mouth to speak.", "“If we go back there and find the magic circle intact, we are going to feel real stupid, won't we?”", "“Even then, there is value in going back.”", "Seol Jihu replied to her.", "“Even if the magic circle is destroyed, there must be something we can salvage.”", "“If you're talking about supplies, wouldn't they have taken everything back with them?”", "“Not at all. There is a weight limit per transfer, so they wouldn't have taken anything back with them.”", "“In that case, that's good. One more reason to go and check, then.”", "'….It'd be wonderful if that's the case.'", "The best-case scenario was to find the abandoned supplies, return to the second hideout, and then wait 72 hours to reactivate the transfer magic circle. Unfortunately, the odds of that happening was as good as zero.", "'From the get-go, going outside like this is also….'", "Seol Jihu had to work hard to swallow back the sighs of lamentation from leaking out of his mouth. Soon, they reached the end of the staircase. A brick wall was blocking the end.", "“You know, I really struggled to open this thing.”", "Teresa complained unhappily while pressing her ear against the wall.", "Even if they were taking a gamble here, he had no thoughts of walking out without a plan, so he re-activated Nine Eyes. He figured that, at the very least, he should be able to tell the right time to leave. However….", "'….Huh?'", "Once he confirmed what color it was, he had no choice but to be surprised. Just like before, Teresa was colorless. That wasn’t all that surprising since that was how she had always been.", "No, the truly strange thing was the brick wall, which was now green.", "'Did they give up on the manhunt for real?'", "“I can't hear anything from the other side….”", "Teresa lifted her ear away from the wall and squatted on the ground. She pulled out the bricks at the bottom and the top before swapping their positions.", "Seol Jihu watched Teresa’s back blankly before regaining his wits after hearing a distinct click.", "“Yes! I'm really smart, aren't I? Look, I memorized everything after doing it just once!”", "Teresa proudly boasted herself before looking behind her.", "“Shall we?”", "Seol Jihu nodded his head.", "She lightly pushed with her hand, and a part of the wall rotated like a revolving door. He peered at the outside through the slightly-open gap and realized that the same green color was pretty much everywhere. He tilted his head this way and that before taking large strides out of the door.", "“Uh, uh?”", "Teresa panicked and quickly chased after him.", "“Even if you're in a hurry, we should at least check out the enemy's movements first….”", "She lowered her voice as much as she could and whispered to him. He couldn't really think of anything to say because everywhere he looked was dyed green. It really seemed that the Parasites had stopped searching and withdrew from here.", "“Let's head to the first hideout.”", "“H-Hang on!”", "Teresa tried to stop him, but Seol Jihu still took the lead anyway.", "The further he walked, the more puzzled he got. It was way too quiet here. And everywhere he looked was still dyed in the same green hue. Even Teresa had formed a confused face now. He took a long, hard look around their vicinity before addressing her.", "“By the way, you said that you heard a loud commotion outside just before you fell asleep, yes?”", "“Excuse me? Ahh, that. Yes.”", "She quickly admitted.", "“The dummy hideout was too deep and I couldn't hear it properly, but I thought there was an earthquake or something.”", "“How long did the commotion last for?”", "“Not really sure. I can't remember it all that well. But I don't think it went on for long.”", "They arrived at the room with the first hideout while deeply immersed in the conversation. It was rather messy inside, probably denoting the fact that the place had been turned upside down. The bookshelf was shattered into million pieces too.", "It was the same story with the hideout. They were expecting it, and sure enough, not only was the magic circle broken, the whole altar had been turned into powder. Fortunately, they still got to discover a small discarded bag at the corner of the room, which proved to be a huge relief.", "“Is there something to eat in there?”", "Teresa's eyes sparkled in anticipation, but unfortunately, the rescue team hadn't packed any food. The items in the bag were four bottles of healing potion, a canteen of water, and a coil of rope and a handful of daggers they brought just in case.", "“Chet.”", "She was visibly disappointed, but…", "“Oh, well. This is still better than nothing, I guess.”", "…She quickly recovered and popped the cork off one of the healing potions. The two of them used a bottle each and carefully applied the liquid across their wounds. Afterwards, they drank a bottle each to heal their internal injuries. Now that their thirst had been quenched somewhat, the condition of their bodies felt a bit better than before.", "“Ah! I finally feel like I’m alive.”", "As if she was trying to clean herself using this chance, she began rubbing her wet skin here and there. Meanwhile, Seol Jihu sneaked another look at the corridor.", "'It's the same story over there too?'", "He hadn't seen it wrong, and it was really 'green' over there. Not only that, the exit he could see faintly at the far back over yonder was also dyed in the green hue.", "'But, that doesn't make any sense.'", "Half-convinced and half-confused, he stepped outside the room. His puzzlement grew exponentially greater the closer he got to the exit. Only after he completely walked across the passage did he run into another source of disharmony.", "'….The sky bridge isn't here anymore?'", "It wasn't just the sky bridge either. He also couldn't see the prison block on the other side of the chasm. No, all his eyes could capture was the darkened empty void. Everything had literally vanished.", "'W-What the… hell….?'", "He looked around in a daze before raising his head up only for his jaw to drop to the floor. He saw the night sky past a hole so large that he couldn't even begin to fathom just how big it was. That chilly-blue thing floating way up in the sky was definitely the moon.", "'Am I dreaming?'", "Seol Jihu turned around and flinched. He found Teresa standing there with a shocked face, her line of sight looking diagonally at the bottom of the hole. He followed after her, and his eyes also ripped open.", "“I-Isn’t that…?”", "“…Yes, it's the research facility.”", "Teresa muttered in a hushed voice.", "The bottom of the hole was in a state of pure chaos. Although they couldn’t see clearly, there were debris that looked like pieces of the building lying about.", "The prison block, the hatchery, the experimental area… all of them had collapsed straight down to the ground.", "Looking at this sight suddenly brought goosebumps all over Seol Jihu’s skin. He recalled reading a news piece online about a sinkhole in the past.", "Was it in Japan? The ground in the middle of a city caved in and created a giant hole. He remembered feeling his bowels tighten after seeing a convenience store hanging precariously on the edge of the sinkhole back then. And this was exactly that spectacle. The previous layout of 'ㅓ' was gone and now only '-' remained.", "“….Princess?”", "“D-Don't ask me. I don't know either.”", "Teresa Hussey looked just as confused as he was. What on earth had happened while they were knocked out inside the dummy hideout?", "The first one to recover her faculties was Teresa. She quickly estimated the distance between the hole’s entrance and where they were. It was about six meters from the first underground floor to the surface.", "“Looks like we received the graces of the gods with those potion bottles.”", "Teresa spoke in an excited voice and roused up her mana. Bluish aura enveloped both of her hands.", "Crack!", "Her five bent fingers stabbed deeply into the bedrock as if they were crushing a block of tofu. Seol Jihu was momentarily taken back before remembering that she was a High Ranker.", "“Nice. With this….”", "She proceeded to create two holes in the wall, then stabbed the spear deeply in a spot just below them. She stood on the spear shaft and shoved her arm powerfully into the wall. After that, she placed her foot on the newly created hole and climbed up.", "The spots she dug out became footholds; her arms proceeded to move up and down, her climbing speed rather rapid to behold.", "He looked up in awe at her excellent rock-climbing skill before lowering his gaze while feeling a bit sheepish. Even if the current situation was like this, it didn't seem well-mannered to 'look up' at her.", "Not too long after, Teresa managed to escape out of the hole. However, Seol Jihu felt lost. All he had to was climb using the footholds she created, but his problem was with his useless left arm.", "It was at that point that a thick rope dropped down before his eyes. Teresa was waving her hand at him from the surface.", "“Don't try to grab it with your hand, just wrap it around you! I'll pull you up!”", "“…Ah.”", "Now that he thought about it, there was a rope in the bag. He pulled the ice spear out from the wall and tied the rope around his body. She roused up her mana as much as possible and began pulling him out.", "He became even more certain once he got near the surface. There was nothing moving around here. The surroundings were decorated by collapsed ruins of buildings as if their current state was the result of poor construction.", "'Seriously, what happened here?'", "Did the high-ranking Parasite get pissed off and….? No, that just didn’t make any sense. Perhaps a sinkhole really opened up with great timing.", "“Huuu!”", "Having successfully dragged him out of the hole, Teresa spat out a long, heavy sigh and plopped down on the ground. She might have consumed a bottle of healing potion, but that didn't mean her body had fully recovered. Seeing how tired she looked, he felt apologetic. It felt like he had become baggage, a burden.", "“I'm sorry.”", "Teresa Hussey had been catching her breaths with a relieved, light-hearted face, but her eyes went extra round from his words.", "“About what?”", "“Because of me, you….”", "The end of his sentence blurred, but she simply snorted disinterestedly.", "“Nonsense. Even paying you a chest full of treasure isn't going to be enough to repay everything you've done for me. Hang on, you didn't say that because you really wanted to apologize, right?”", "She grinned playfully and teased him while looking straight at him. At that moment, Seol Jihu felt this strange mixture of emotions.", "'Her lips are smiling, but….'", "Her eyes weren't laughing at all. Her two irises, the ones he always thought were rather pretty, were gleaming meaningfully under the chilly moonlight.", "“Isn't that right? You said that because you were being polite, yes?”", "She asked him again, this time a little more probing. Seol Jihu swallowed back his saliva. He definitely didn't say those words because he was being polite.", "Looking back, it was also the same story back during their first meeting. He felt this unexplainable attraction from her. For some reason, he wanted to stand up for her and take care of her. She was someone he wanted to help out. No strings attached.", "However, he didn't know why. If he were to forcibly put it into words, then the feeling he got was akin to paying off his debt. Something like that.", "“I guess I was right. You were saying it out of courtesy.”", "Teresa's eyes were now slightly lonesome as she averted her gaze, but then…", "“No, not at all.”", "…He finally addressed her.", "“Excuse me?”", "“Before coming here, I was warned of a possible sniper. But I completely forgot about that, and it resulted in our current situation.”", "“….”", "“I'm truly sorry for being unable to rescue you properly. I'm serious.”", "All traces of smiles were wiped off Teresa's expression. Her always-carefree face suddenly became scarily emotionless. He had never seen her react like this before.", "“…Why?”", "She finally opened her mouth.", "“Why do you think that way? You're an Earthling, aren't you? You became like this because of me, right? Aren't you resentful?”", "“Why do you say it's because of you, Princess?”", "Seol Jihu calmly asked back.", "“Regardless of who did it, the destruction of the laboratory had to be carried out. Am I wrong?”", "“W-Well, that, that’s true, but….”", "She blinked her rapidly. As the light in her eyes grew stronger, the look of disbelief spread on her face even more.", "'What's gotten into her?'", "He grew just a tad worried, wondering if he said something he shouldn't have, but then….", "“Wow, so there really is a person like him in this world….”", "Teresa murmured to herself. The gleam in her eyes also gradually quietened down.", "“I'm surprised.”", "“About?”", "“You were telling me the truth.”", "Seol Jihu scratched his cheek.", "“Aren't you trusting me a bit too easily here?”", "“Well, there's a reason for that.”", "She spoke with a rather hoarse voice.", "“You see, I have the ability to read people.”", "“Excuse me?”", "“Ahh, it's nothing much, really. One of my ancestors possessed the blood of a Sky Fairy, so….”", "Teresa Hussey hesitated slightly before quietly carrying on.", "“Of course, a long time has passed since then. Every now and then, though, a child is born with an Innate Ability. Like me.”", "“An Innate Ability?”", "Seol Jihu was shocked.", "“Yes.”", "“Princess, you aren't supposed to reveal that to….”", "“Today is my first time revealing that. Please keep it as a secret between us.”", "Teresa flatly retorted back to him. Seol Jihu activated Nine Eyes and reflexively checked her Status Window.", "[Teresa Hussey's Status Window]", "[4. Abilities.]", "1. Innate abilities (1)2. Class abilities (6)3. Other abilities (4)", "'She really has one… W-What the heck is it now?'", "There was another change that took place.", "Her color changed. A tinge of color began seeping into Teresa's previous 'colorless' state. The blindingly gorgeous color greeting him now was gold.", "The Golden Commandment.", "She sneaked a couple of glances at the young man standing there like a scarecrow before trying to get up by pushing down on the ground with her palm. But then…", "“In any case, we… Ouch?!”", "She frowned and hurriedly lifted her hand up.", "“Are you alright?”", "There was something sharp digging into her palm. The scorched-black object looked like a shattered piece of shrapnel.", "“Argh, seriously now. What the heck is…. Hm?”", "Teresa tilted her head before her eyes narrowed to a slit.", "“Isn’t this Thunder?”", "“Thunder?”", "She nodded her head.", "“Yes. It's a stone with the power of the Earth Spirit condensed within. It also happens to possess incredible explosive power.”", "“An explosive? You guys have explosives in this world?”", "“Not explosives, but 'Thunder'. It's called that because it makes a thunderclap when it goes off.”", "She corrected what he said with a simple explanation.", "“In any case, I've never heard of such a thing existing before.”", "“Eii, we’re not the Empire. The seven kingdoms obviously don't have the technology to manufacture something like it. I told you just now, didn't I? That the power of the Earth Spirit is condensed to create it.”", "Teresa hurriedly waved her hands about as if to say it was impossible.", "“If mana is the exclusive domain of humanity, then Spirits are the exclusive domain of the Sky Fairies. Besides, the Thunder is the result of a master Dwarf artisan polishing his technique to his limits. You could call it the secret weapon of the Federation.”", "“Wow…. No, wait, they have things like this, yet they are on the back foot against the Parasites?”", "Teresa smirked softly.", "“It's the opposite, actually. It's only because the Federation possesses something like this that they are managing to hold onto their tenuous balance. The main forces of the Parasites are truly beyond your imagination.”", "“What about the Medusa….?”", "“Sure, a Medusa is an ultimate evolution among the mid-tier Parasites, but still, if I were to be honest, they are more like the leaders of local hoodlums. Only when things like the Nosferatus pop up can you say, ‘Oh, the Parasites are serious this time.’”", "“Nosferatus?”", "“They are the Queen's personal elite guards. Anyways…”", "Teresa replied with a short answer and scanned the ground. Similar sorts of shrapnel could be found here and there. She seemed utterly at a loss by what she saw.", "“Strange, why are these things here?”", "[We already thought about it. The Federation were the ones that gave us the information, so they must be operating their own infiltration squads, but….]", "Seol Jihu recalled what Ian told him before and spoke up.", "“Could someone from the Federation have come here and destroyed this place? With that Thunder thing, I mean.”", "“The current circumstance suggests that might be the case….”", "Teresa crossed her arms across her chest. That possibility certainly made sense, especially if it was 'that alien race' that invaded Paradise but proceeded to construct the unified nation called the Federation.", "Since they were capable of flight from the moment they were born, it would be comparatively easier for them to make their approach.", "“Doesn't sound too convincing though.”", "“In what regard?”", "“Back during the first mission, I got to find out how much importance the Parasites placed to this place. If it weren't for Agnes, we wouldn't even have gotten anywhere remotely close.”", "Teresa continued on.", "“And even though the Thunder is really, re~ally powerful, you need to drop dozens of them in the exact same spot at the exact same time in order to create destruction of this scale. I’m not sure how that could have happened when the Parasites have been guarding this place day and night without rest….”", "She didn't finish her sentence, but he could more or less tell what she wanted to say. This 'Thunder' might be an earth-shattering item, but in order to use it, one had to be in the vicinity of the laboratory first.", "“The thing is, the defense perimeter set up by the Parasites around this place was just about perfect in every way. It didn't matter whether it was the air or the ground. They were keeping a very close eye for any intruders.”", "Besides, the Parasites would have stepped up with their security after the first infiltration attempt ended in failure. The longer she thought about it, the deeper it felt like she was sinking into a quagmire.", "“I don't know what to tell you either.”", "He shrugged his shoulders before briefly yelping out loudly. She watched him suffering in pain and broke out into a chuckle. She tried to get up, but then….", "“Ouch! That stings!”", "She pulled her head back and shouted out. The chains had pinched her skin.", "“Urgh…. In any case, that's not important to us now.”", "That was true. They had no idea what happened here, but the important thing was that the laboratory had been crushed. Plus, it was not the end of their trial just because they managed to crawl outside.", "They managed to overcome the first hurdle through unexpected luck, but they were still stuck in the middle of the enemy territory.", "“Let's go, my prince.”", "Teresa abruptly presented her hand. My prince, she said. Although Seol Jihu’s cheeks itched just then, it didn't sound too bad for some reason. Seol Jihu sheepishly reached out as well.", "Two of them held each other's hand and began looking in the same direction. It was in the direction of Haramark.", "“Let's go back home alive.”", "She whispered to him, and he nodded his head in determination.", "The escape was only now beginning."]}