{"cid": "406", "title": "Chapter 406. For the End (4)", "content": ["The one who knocked on the carriage door was none other than Roe Scheherazade’s attendant.", "The attendant relayed that the queen strongly wanted to meet Valhalla’s representative privately and asked if he could come to see her without anyone finding out.", "Deciding to accept this request, Seol Jihu turned back while pretending to go back to Eva, even going as far as using Ethereal Shift to sneak into the city.", "According to the attendant, the queen was waiting inside the royal palace’s private back garden. After jumping over the rear wall, Seol Jihu knelt down and collected his breath.", "‘Damn, using it consecutively isn’t easy.’", "Even with his mana being at High (High), using a high-rank skill consecutively was taking a huge toll on his mana.", "Hoping that this meeting would be worth the trouble, Seol Jihu put down the attendant.", "“Which way is to the back garden?”", "He asked while dusting off his clothes, but the attendant with disheveled hair didn’t say anything and only covered her mouth with her hands.", "Then, when their eyes met, she shot up as though she was frightened out of her wits and then ran for her life. Seol Jihu’s speed seemed to have scarred her for life.", "“…Was it that scary?”", "Seol Jihu tilted his head and started walking.", "Perhaps because the queen had taken appropriate measures, or because this was a private back garden, there wasn’t anyone in sight.", "After a bit of walking, Seol Jihu arrived at a petite garden decorated with trees and flowers.", "Finding the queen wasn’t difficult. A slender woman dressed in a white robe with long, faded-blonde hair was watering the flowers in front of a flower bed.", "It was Roe Scheherazade.", "“Ah.”", "She turned around, perhaps having heard his footsteps. She put down the watering can and smiled brightly.", "“You came.”", "Seol Jihu stopped about two meters in front of her.", "“Sorry for troubling you. I could have told you after the meeting, but it was a difficult situation…”", "Roe Scheherazade looked apologetic.", "It was indeed as she said. Things would have been easier if she had just asked to see him after the meeting. But Seol Jihu could guess why she chose to do things this way, judging by the way she asked him to come without anyone finding out.", "“It’s fine,” he replied. “I heard you wanted to meet me.”", "“Yes! Your fame knows no bounds. In truth… I’ve been wanting to see you for a long time. I’ve heard all sorts of unbelievable stories from my surroundings. So much so that my ears hurt.”", "“Surroundings…?”", "Seol Jihu asked just in case.", "“Did Queen Charlotte Aria or Princess Teresa tell you about me?”", "“N-No. I’m not really acquainted with them… Though it’s a bit embarrassing to say, it has been a while since we lost contact with surrounding kingdoms.”", "Roe Scheherazade smiled faintly while blushing in embarrassment.", "Seol Jihu saw her in a renewed light.", "The gentleness in her voice, the prim smile on her face… Her actions and speech both carried a subtle gracefulness that was befitting of a queen.", "He found it hard to believe that this was the same person as the frightened, stammering person he saw at the meeting.", "“I asked to meet Representative Seol privately… because I owe you an apology.”", "“An apology…?”", "“Yes. When the video was being played in Scheherazade and Valhalla was searching Luxuria’s temple… the Scheherazade Royal Family not only sent guards to hinder Valhalla, but it also sent an envoy to Eva.”", "Roe Scheherazade smiled bitterly.", "“When I think about how you must have felt… I can only say that I am sorry. Though you may think I am being shameless, please allow me to explain.”", "Roe Scheherazade cleared her throat before continuing.", "“I won’t deny that I authorized it to happen. But I would like you to know that I didn’t have a choice.”", "Didn’t have a choice. It sounded like Sinyoung forced her to do so against her will.", "‘Maybe that’s what she’s trying to tell me.’", "He suspected as much ever since she said that she lost contact with the surrounding kingdoms.", "“You don’t have to apologize. I’m happy that our meeting today ended well. To be honest, I had forgotten about it until you reminded me.”", "Seol Jihu spoke casually.", "“…You’re generous.”", "Roe Scheherazade smiled sweetly before turning around.", "“I’m infinitely grateful… If it’s alright, would you walk with me for a bit?”", "She opened her hand and gestured toward the garden.", "Seol Jihu nodded.", "“This is a beautiful garden.”", "“Thank you. I raised each flower with the utmost care and attention. I spend most of my time in this place, you see.”", "“Is gardening your hobby?”", "“Mm… No. It’s not like I hate it, but it’s just that this is the only place where my heart can be at peace.”", "Seol Jihu wanted to walk behind her, but Roe Scheherazade purposely slowed down so that they were side by side.", "They walked exchanging meaningless small talk when Roe Scheherazade suddenly asked.", "“How much do you know about this city, Representative Seol?”", "It was a sudden, unexpected question.", "“Do you know why Scheherazade became the capital of the Seven Kingdoms?”", "Roe Scheherazade asked another question as Seol Jihu racked his brains to figure out the intent of her question.", "“Because it’s at the center of the other six cities…?”", "“You’re not wrong.”", "Roe Scheherazade smiled softly.", "“But to be more precise, it’s not that Scheherazade is at the center of the other six cities. But the other six cities form a final line of defense around Scheherazade.”", "“Final line of defense?”", "“Yes. To the six cities, Scheherazade serves as the final bastion.”", "In other words, there was something more to Scheherazade other than its favorable location that made it special.", "“Representative Seol, have you heard of Gorad Boga?”", "Seol Jihu furrowed his brows at the sudden mention of the word.", "He certainly knew the word. But when the bishop was going on about the supposed divine land, he only pretended to believe him and scoffed on the inside.", "After all, the place he was describing was equivalent to the legendary, mythical places of Earth that were only talked about in literature.", "“I heard one of Gorad Boga’s special traits is an incredible amount of vital energy diffused in its surroundings.”", "Seol Jihu was indirectly saying how Scheherazade didn’t have vital energy in its atmosphere.", "“Not at all. Distinguishing Gorad Boga with the existence of vital energy is strictly a personal judgment, and it is a wrong interpretation.”", "Roe Scheherazade slowly shook her head.", "“Gorad Boga, the City of God, is the place that was ruled by the world’s first god after their birth. Any land with a trace of this god’s rule can become Gorad Boga.”", "She spoke kindly like a teacher instructing her student.", "“My ancestor discovered this trace and built a new city around the ruin. That city is Scheherazade.”", "Seol Jihu only half-believed her.", "He wasn’t the type to believe in a legend without proof, but he also didn’t believe that a queen would lie at a time like this. He just couldn’t see why she would trick him at this point.", "“You mean the ruin is inside this city?”", "“Yes, precisely.”", "Roe Scheherazade nodded her head.", "“A grand magic, the purpose of which is to protect the city of god, is hidden in Scheherazade.”", "When Seol Jihu stared at her blankly, the calmly explaining Roe Scheherazade blinked rapidly and waved her hand.", "“Ah, but that doesn’t mean it’s anything amazing. Although it has the power of a god, our enemy is also a god. At best, it will let the city hold out for a little while longer.”", "‘Gorad Boga…’", "Seol Jihu searched through his memories.", "[Why did you not do as you were told?]", "[…I had no choice.]", "[That’s surprising. I didn’t think I asked for anything difficult.]", "[It’s not that I didn’t, but I couldn’t. I couldn’t create the situation you wanted nor did I have the power to do so.]", "He remembered the talk Black Seol Jihu had with Yun Seohui during the defense of Scheherazade. They were talking about a plan of some sort. Could that have been related to Scheherazade being Gorad Boga?", "“Are you curious what magic it is?”", "Roe Scheherazade asked while furtively observing Seol Jihu’s expression.", "“Yes. Can you tell me?”", "“I don’t see why not… But Scheherazade being Gorad Boga is actually a secret that only a few people know.”", "Roe Scheherazade giggled.", "“How about this? I’ll tell you and even show you the ruin if you want. In exchange, Representative Seol has to answer just one question honestly.”", "It was nothing difficult.", "“Sure. What do you want to know?”", "Judging that it wasn’t a bad trade, Seol Jihu agreed. Meanwhile, he racked his brain trying to figure out why Roe Scheherazade called him here and just what it was that she wanted to ask.", "‘Is she trying to show this city’s value? To hasten the Federation’s entry into Scheherazade? No, that doesn’t explain why she wanted me to come secretly…’", "As all sorts of thoughts swirled inside this head…", "“What will happen to Sinyoung from now on?”", "A question that overturned all expectations flew out.", "Seol Jihu widened his eyes in surprise.", "“I heard that Valhalla destroyed a good number of organizations that were related to the attack incident.”", "A low, monotonous voice rang out.", "“Of course, Sinyoung agreed to all the provisions you laid out, but you can also see them as the main culprit behind the last incident.”", "Roe Scheherazade stopped walking.", "Seol Jihu stopped along with her.", "“Are you… not going to destroy Sinyoung?”", "Seol Jihu doubted his ears.", "‘The way she’s talking…’", "It almost sounded like she was desperately waiting for Sinyoung to be destroyed.", "That wasn’t all. The gentle warmth that she was giving off had disappeared in an instant, replaced by a bone-chilling coldness.", "[W-What? Such resentment… How can a living person have so much resentment?]", "Even Flone, who was inside the pendant, was flustered.", "‘Oh yeah.’", "Thinking about it now, the energy Roe Scheherazade was giving off was similar to the energy that was emitted by Flone, who became a vengeful spirit from hundreds of years of resentment.", "‘But why?’", "Seol Jihu felt he shouldn’t answer this question thoughtlessly. That said, the case was closed.", "Feeling rather uncomfortable, Seol Jihu glanced to the side.", "Roe Scheherazade was looking straight ahead, quietly.", "He wasn’t mistaken. Roe Scheherazade, whom he felt would break like a twig, suddenly changed.", "He could sense a bitter hatred from her pure, graceful face. This contradicting duality reminded him of Yun Seohui.", "Could it be that she was Yun Seohui? Was she disguised as Roe Scheherazade to try to figure out his intentions?", "This was a plausible suspicion as Seol Jihu had been thinking that the meeting concluded too easily.", "And so, Seol Jihu activated the Future-Gauging Nine Eyes. But when he glanced at Roe Scheherazade, he was surprised yet again.", "‘Her color…!’", "He couldn’t see it. Not just her color, but he also couldn’t see her status window. It meant his Innate Ability wasn’t working.", "This wasn’t the first time that the Nine Eyes didn’t work.", "But it was hard to believe that Roe Scheherazade was an Executor or a holder of the divine vestige.", "‘What’s going on?’", "Seol Jihu turned serious.", "It was then.", "The sound of hurried footsteps from the distance broke the heavy silence.", "The man and woman turned around simultaneously.", "The attendant who arranged their meeting was running toward them.", "“Y-Your Majesty!”", "After running up to them, the attendant went on her tip-toes and whispered into Roe Scheherazade’s ears.", "The queen’s eyes widened before a look of fluster flashed in them.", "“W-What?”", "“He asked what you were doing… and ordered you to come immediately…”", "“But, how? Wasn’t he…”", "“I, I’m not sure. He suddenly called us…”", "Roe Scheherazade bit her lower lip and waved her hand.", "The attendant went away with a worried look.", "Roe Scheherazade bit her nails with a stunned expression before doing a double-take and asking.", "“Um… did anyone see you on the way here?”", "“No.”", "“Are you sure? No one found out?”", "“I can’t be 100 percent certain, but I can say I’m 99 percent certain. I even used Ethereal Shift consecutively to go over the rear wall.”", "“Then…”", "Roe Scheherazade sighed deeply and dropped her head.", "“It must have been that child… Even though we’ve been close friends since we were kids….”", "It sounded like the attendant told Sinyoung about the queen’s secret meeting.", "“Representative Seol, can we talk about this matter some other time?”", "“That’s fine with me, but if you’re worried, I can go with you…”", "“No, thank you for your kind words, but it’s fine. I would actually appreciate your protection, but I’m afraid it will only make matters more complicated in the future…”", "“….”", "“It would be a different story if you’re willing to stay by my side though.”", "Seol Jihu stared at Roe Scheherazade who was smiling bitterly.", "From trembling with fear and looking weak, to giving off a gentle and wise aura, to looking like a vengeful villain, to then looking like a pitiful bird trapped in a cage.", "Seol Jihu could no longer tell which one was the true Roe Scheherazade.", "“I’m sorry for making you go through so much trouble.”", "“Wait just a bit longer.”", "Before leaving, Seol Jihu said to Roe Scheherazade, who was bowing her head and apologizing.", "“Scheherazade will change soon as well.”", "“…Will it?”", "It was a vague response that was neither positive nor negative.", "“You must have seen it in the provision regarding the Federation’s migration. Once you receive the authority to modify status windows, you’ll have more power over…”", "Seol Jihu stopped short of finishing his sentence.", "“To say that when you’re also an Earthling… It really is refreshing.”", "It was because the corner of Roe Scheherazade’s mouth curled up.", "It didn’t look like a positive response.", "“I know that you have good intentions. It’s just…”", "Roe Scherezade slowly pushed her hair back and smiled faintly.", "“It’s not just the Earthlings.”", "[Don’t think it’s just the Earthlings…]", "He had heard the same words before.", "*", "Though it seemed like his presence was known, Seol Jihu still used Ethereal Shift when leaving.", "The talk had dragged on longer than he expected, and he knew Valhalla’s members were waiting for him.", "He was bombarded by questions as soon as he entered the carriage. Did anyone catch you? Why did the queen call you? And such.", "“It feels like I came back from a pandemonium.”", "After summarizing the experience with a single word, Seol Jihu waved his hand, saying he had something to think about.", "Soon, the carriage set off.", "‘This is driving me insane.’", "Seol Jihu had agreed to meet with Roe Scheherazade hoping he would discover some clues that would guide him out of this foggy situation.", "But never mind clues, the meeting only made things more complicated.", "It was so much so that he wanted to use his contribution points, re-summon Black Seol Jihu in the Path of the Soul, and ask him questions.", "Though, he probably couldn’t answer anything even if he did succeed in re-summoning him.", "After remaining silent for a long time, Seol Jihu glanced to the side.", "Kim Hannah was staring into the air with an expressionless face.", "“…Can I ask you a question?”", "As Seol Jihu quietly asked, Kim Hannah’s pupils moved stealthily.", "“What kind of queen is Roe Scheherazade?”", "“…As a person? Or as a queen?”", "“Both.”", "“As a person, she’s a pitiful widow. As a queen… I wouldn’t say she’s a failure, but there’s nothing she can do.”", "Seol Jihu opened his eyes wide.", "“Widow?”", "“Yes. Her husband died from an unknown cause eight years ago.”", "“Ah, I heard about that too. There are rumors that Sinyoung killed him. Is that true?”", "Chohong suddenly cut in and asked. Kim Hannah continued with an indifferent expression.", "“She’s also called slut, puppet, marionette, and other such names… These are all names I heard when I was dragged to company dinners with high-ranking executives.”", "“That sounds pretty vulgar.”", "“It is vulgar.”", "Kim Hannah said quietly.", "“I don’t know the details because my job wasn’t related to the royal family and Sinyoung has been covering it up… but if the rumors going around the company were true, and if I were Roe Scheherazade, then I would have bitten my tongue and committed suicide long ago.”", "“It’s that bad?”", "“It goes beyond anything you can think of. As Miss Chohong said, there are rumors that Sinyoung assassinated King Gairos Scheherazade, and there are also rumors that Sinyoung’s high-ranking executives forced Roe Scheherazade into becoming their mistress…”", "Kim Hannah turned her head as if she didn’t want to talk about it any further.", "Seol Jihu laughed wryly and asked again.", "“Then what did you think about this meeting?”", "Kim Hannah closed her mouth and smacked her lips.", "“I regret it a little.”", "“You regret it?”", "“Yes. I’m wondering what would have happened if we had left a hole for them to dig through without driving them to a corner…”", "“….”", "“Our plan was detailed and well-executed. We received help from various places in a timely manner, and we even had a powerful card known as the Federation. Of course, Miss Seo Yuhui’s scheme and Sinyoung’s mistake played the biggest role in bringing about today’s event.”", "Indeed, as Raging Temperance’s example showed, an internal enemy was scarier than an external one.", "“But… I can’t help but think that leaving Sinyoung with no other option helped Yun Seohui justify her decision… If we had purposely left a weakness that the other side could dig into… I think it might have helped us figure out Yun Seohui’s sincerity…”", "Kim Hannah spoke almost in a mumbling voice and then pressed her forehead.", "“…I don’t know. I might be overthinking it. The results are what we wanted, after all.”", "Kim Hannah seemed to be wary of Yun Seohui as well.", "Seol Jihu couldn’t help but think that things would have been easier if he had wiped the floor with Sinyoung like with other organizations.", "‘I can be sure of one thing. There is something in Sinyoung, no, Scheherazade.’", "Right. Setting aside the overarching problem of Earthlings’ attitude, there had to be a serious problem, for Gula to have given him such a trial.", "Seol Jihu mulled over Kim Hannah’s words before coming to a conclusion.", "Though there was a slightly fishy aftertaste, his goal had been achieved to a certain degree.", "All that was left was to confirm it.", "Whether humanity had changed, or whether there was a persisting problem.", "Seol Jihu calmly said.", "“It seems I’ll need to visit the temple as soon as I get back to Eva.”"]}