{"cid": "398", "title": "Chapter 398. You’re Either With Us or Against Us (2)", "content": ["Clang!", "A small spoon dropped to the floor from Yun Seohui’s hand. However, picking it up did not even cross her mind as she asked dazedly.", "“…What did you say?”", "“Haramark’s Ill Destino was wiped out by Sicilia. Every member including Giovanni Greco was killed…”", "The HR director cupped his hands together and bowed.", "Yun Seohui bit her lower lip.", "Among organizations that had control over Haramark, Ill Destino was the organization that responded most favorably to Sinyoung’s call.", "‘Did they find out?’", "No, it was unlikely that they found out.", "The order of events was clear. Ill Destino had announced where they stood on the recent incident, and Valhalla had only moved as per their declaration from a few days ago.", "It was just that Sicilia carried out Valhalla’s will.", "And therein lay the problem.", "Yun Seohui would have much preferred Valhalla finding out about Ill Destino’s involvement.", "Sicilia’s action, in this current situation, was no different than openly supporting Valhalla.", "Of course, the public might criticize them for being too harsh. But the South’s War Hawks was not an organization that cared about the public’s opinion, and they probably wouldn’t receive much criticism anyway. After all, the public was standing by Valhalla’s side, and Sicilia had joined them.", "Yun Seohui nibbled on her lip for some time. After silently thinking for a while, she opened her eyes. After organizing the scattered documents on her desk with a calm expression, she got up.", "“I’ll be taking my leave now. I have a meeting to attend.”", "“A meeting…?”", "The HR director, Jung Minjong, blinked.", "“You should have told me earlier…”", "“Ah, it’s fine. I didn’t tell you on purpose.”", "Jung Minjong flinched.", "“You must be exhausted, right? You look very stressed.”", "As he slowly raised his head, he saw a sweetly smiling Yun Seohui.", "Her concerned expression was nowhere to be seen as she showed off her usual, artificial smile.", "“I believe in you, Director Jung.”", "Jung Minjong was strongly denying the allegation made against him, and Yun Seohui had just said she believed him.", "But she wasn’t telling him about her schedule despite always having done so before, and she wasn’t allowing him to join the meeting where he would be talked about without a doubt… How was he to interpret this?", "“….”", "For some reason, Kim Hannah crossed his mind.", "“Rest well.”", "Yun Seohui smiled with a slight bow before leaving the room with light steps.", "Jung Minjong stood in the same spot for a long time and dazedly stared at the door Yun Seohui left open.", "*", "The destruction of Ill Destino.", "The news of this incident struck all regions of humanity hard.", "What was even more shocking was the fact that it was Sicilia, and not Valhalla, that carried this out.", "But this incident was only the beginning.", "Valhalla finally stepped up to the plate.", "“Are you really going to do this?”", "Park Dongchun, the head of Dongchun Merchants, expressed his frustration with a sigh.", "“Come on, bud, what are you so worried about? I, Park Dongchun, am here for you! We’ve known each other for how many years now? I’m here to save your ass!”", "A skinny, ponytail-haired man, who contrasted Park Dongchun’s chubby figure, furrowed his brows.", "He was staring at a piece of paper in front of him with hesitation written all over his face.", "His name was Vahid Hosseini. He was from Area 5 and the representative of a large merchant group that had a firm grip on Nur. Meaning, he was a bit of a celebrity within Nur.", "“Hosseini, I know how you feel. But you know about the old Eva Alliance incident, right? What do you think was the cause of that? It was the illegal slave hunt! And at the time, I was actually caught red-handed by Valhalla’s representative.”", "Vahid Hosseini looked up slightly.", "“Back then, I thought I was done for. I’d captured a Foxman kid and was chasing another one that escaped when some demon suddenly looked at me with the runaway Foxman in hand.”", "“….”", "“What do you think this Park Dongchun did? I handed over the Foxman in my possession, apologized, and swore I’d never do it again!”", "“…And?”", "“What do you mean, and? Can’t you see I’m alive and well? Heck, I’m not just alive. I’m thriving in Eva right now!”", "Seeing that Vahid Hosseini was showing interest, Park Dongchun pounded his chest and spoke even more passionately.", "“You must think Valhalla’s representative is some kind of monster, but you couldn’t be any more wrong! Sir Seol is a human being too! He isn’t some inflexible fart.”", "“Mm…”", "“Just trust me. I’ll make sure to help you and your organization get out of this intact. Just close your eyes and sign here. Persuade your men to sign it too.”", "Park Dongchun tapped the paper on the desk.", "Vahid Hosseini smacked his lips and looked down at the paper, which was none other than a contract. To be more precise, it was a contract from Valhalla that was imbued with the power of a god.", "Though it was complicated, it could be summarized as follows:", "1. Those who sign the contract shall not collude with the Parasites and not do anything against the interest of humanity.", "2. In the case that a war against the Parasites breaks out, those who sign the contract shall spare no effort to help humanity.", "This contract, written by Philip Muller, was the simplest, most effective way to prove the remaining twenty-three organizations’ innocence and to control them.", "Earthlings that go against the terms of the contract would be barred from entering Paradise ever again at best, and be executed at worst.", "It was a clean, surefire way of dealing with potential traitors, but Seol Jihu argued with Philip Muller all night regarding this issue.", "Seol Jihu was of the mindset that every rat should be exterminated while Philip Muller suggested leaving a way out in consideration of the large gap that might be created within humanity’s camp.", "[You’re driving me nuts. Do you think you’re Hegemon King Xiang Yu, exterminating all your enemies?]", "[Having no choice but to fight his own country, he led his army to Xiangyang, killing even those who surrendered without mercy.]", "[As a result of this insane so-called March of Death, the people of his country resisted desperately knowing they would die regardless.]", "[My point is this. What are you going to do if the people who become your targets say ‘screw it’ and escape to the Parasites’ camp? Do you think the Parasite Queen will stay there after finding out about this?]", "Seol Jihu had not forgotten Philip Muller’s warning. So immediately after the fake Gorad Boga incident, he changed his mind to give the would-be traitors one last chance.", "And so, he made an example out of Ill Destino and sent envoys to the other organizations.", "To be honest, Seol Jihu did not expect a third of all organizations in Paradise would have participated in this latest incident. After finding out, he couldn’t help but agree that Philip Muller’s suggestion to reform the existing forces through contracts was better than his idea of destroying all the organizations that were involved and raising new Earthling recruits.", "Of course, he would only give this opportunity to those who did not collude with the Parasites, and it would be up to the organizations to decide whether to accept this offer or not.", "If they refused?", "Philip Muller said he would not deter him then.", "“I get what you’re saying…”", "Vahid Hosseini groaned after deep contemplation.", "“But these terms are just too…”", "“Ehei! Are you really saying that!?”", "Park Dongchun cut him off before he could even finish his thought.", "He then glanced at his old friend suspiciously.", "“Don’t tell me… you’re really colluding with the Parasites?”", "“Of course not!”", "Vahid Hosseini jumped with anger.", "“I’m innocent! I didn’t know the bishop was a traitor!”", "“Then just sign it!”", "Park Dongchun jumped with anger as well.", "“This contract isn’t even asking for much! Is it telling you to give up your life? Is it telling you to disband your organization? No!”", "“….”", "“It’s saying, we’ll forgive you and let you keep your organization intact, so help us fight the Parasites as fellow Earthlings!”", "Park Dongchun slammed the desk in frustration.", "“Plus, let’s get this straight. Even if he participated independently without your knowledge, he was still your subordinate. Not to mention, he was the ace of your organization! A direct subordinate! To put it bluntly, let’s say I tried to stab you with a knife. If I say, Aigoo~ I didn’t mean to but my hand moved on its own, would you say, Oh okay, and move on?”", "“N-No…”", "“A representative needs to take responsibility. Think long and hard about this. Right now, you’re the offender. No matter how many times you scream that you’re a victim, no one will believe you. They’ll only see you as a liar.”", "“….”", "Vahid Hosseini shut his mouth. He knew Park Dongchun was right.", "After quietly sighing for a long time, he slowly placed his hand on the contract.", "“…I just have to sign this thing?”", "“Ehei.”", "Park Dongchun’s expression softened a bit.", "“First, you sign the contract. Then, you go to Valhalla and apologize personally, and maybe even include a little token of gratitude!”", "He then coughed.", "“Kuhum… You should also mention Sinyoung in your public statement. That’s the least you can do.”", "Vahid Hosseini flinched once he heard Sinyoung’s name.", "Seeing him hesitate again, Park Dongchun clicked his tongue.", "“Ehew. Looks like you’ve gotten old since the last time I’ve seen you. Being so worried…”", "He cleared his throat and leaned forward.", "“Alright, I’m going to let you in on a secret… Listen up. I know what you’re worried about, but you have no reason to be worried.”", "“…What do you mean?”", "“What do I mean? I mean that things are going to change. Come here.”", "“Uh, okay.”", "“You remember the Tigol Fortress War from a year ago, right? When that war ended, Valhalla’s representative and the Federation’s upper echelon had a little talk…”", "Park Dongchun whispered with his voice lowered, and by the time he finished talking, Vahid Hosseini’s eyes were wide open.", "“Is that true?”", "“Of course!”", "“You’re not lying?”", "“Why would I lie!?”", "Park Dongchun snorted.", "“You know when Valhalla’s representative was gone for a long time? I was contacted by the Eva Royal Family and started preparing in secret. Come visit if it’s so hard to believe. I’ll show you.”", "“Mm, if you say so…”", "“Also, I wasn’t supposed to say this to anyone, but I made a special exception for you. So I’ll know it’s you if any rumor about this matter spreads. Our relationship will be over, friend or not!”", "“I know, I know. My lips are sealed. You know that I’m tight-lipped.”", "As Park Dongchun gave an ultimatum, Vahid Hosseini let out the breath he had been holding in.", "“Anyway, if what you’re telling me is true…”", "He then opened his desk drawer and took out a pen.", "With only a slight second of hesitation, Vahid Hosseini signed his name on the contract.", "*", "Japan Business Federation.", "It was an economic organization that held a sizable force inside Paradise.", "As one could easily guess from their name, most of their members were Japanese, and it was also the organization that Kazuki’s Umi Tsubame worked under in the past.", "Today, Kazuki was visiting the Japan Business Federation with Eun Yuri.", "Kim Hannah had suggested that he tie up loose ends from the past.", "[Team Leader Kazuki, I know your relationship with the Japan Business Federation isn’t particularly good… Why don’t you give them a visit?]", "[Representative Seol gave his approval. If you accept, you would be going as the Representative’s direct agent. For this matter, of course.]", "Just like she said, Kazuki did not have a good relationship with the Japan Business Federation. In fact, it could even be called terrible.", "As the Japan Business Federation valued command and discipline, they disbanded Umi Tsubame when Kazuki disobeyed their order to ‘not participate in the Delphinion Laboratory Rescue Mission’.", "Afterward, they hindered Kazuki’s effort to create a new team, thus worsening their relationship to an irreconcilable level.", "In the end, Kazuki could not endure the Japan Business Federation’s interference and joined Valhalla.", "Several years had passed since then, and now they were meeting again with their roles completely reversed.", "On the wooden floor of a large waiting room, dozens of people were sitting upright in two lines.", "And on a small platform in front of them, a beautiful woman was lying down and glancing up at the guests who had come to visit them.", "Languid, slightly curved eyes and neatly closed lips, straight hair with bangs that were cut in a single line, and a loose crimson yukata that fit like a blanket. This doll-like beauty was none other than the head of the Japan Business Federation, Tsuji Yuki.", "She stared at Kazuki with sleepy, half-closed eyes before slowly saying.", "“Valhalla’s representative…”", "“He did not come.”", "Kazuki spoke clearly.", "“He is very busy at the moment. But you don’t need to worry. I am here in Representative Seol’s place.”", "Tsuji Yuki’s lips turned crooked. She brought a long smoking pipe to her mouth and then looked down while resting her chin on the back of her hand.", "In front of her was a piece of paper that Kazuki delivered.", "It was a contract that was sent by Valhalla.", "“…I have a question.”", "Tsuji Yuki asked while reading the provisions in the contract.", "“Did other organizations get the same contract?”", "“No, they aren’t exactly the same.”", "Kazuki shook his head.", "“An extra clause was added to the one drawn out for the Japan Business Federation. It’s the first provision, as you can see.”", "“….”", "“Kishi Yukino, who is suspected to be one of the traitors along with the bishop, is from the Japan Business Federation after all.”", "“Did Kishi Yukino not confess everything?”", "“I’m not sure. I don’t know all the details regarding that matter.”", "Kazuki easily avoided Tsuji Yuki’s attempt to probe for more information.", "Tsuji Yuki smirked and then spoke.", "“If I remember correctly, an organization that is in the same city as we are refused Valhalla’s offer just yesterday.”", "“That’s right. Hanoi refused Valhalla’s offer. But that was Hanoi’s decision. Nur’s Arabia Merchant Group accepted Valhalla’s offer.”", "Kazuki continued calmly.", "“What decision other organizations came to is not of my concern. I am here to ask for the Japan Business Federation’s decision. Chairman Tsuji Yuki, as their representative, what is your decision on the matter?”", "Tsuji Yuki did not answer. Setting aside the other provisions, the first provision was more shameful and humiliating than an instrument of surrender.", "She really had to sign such a thing?", "It was then. As Tsuji Yuki’s expression contorted, the tightly shut door of the waiting room burst open.", "A man wearing a kimono rushed in and approached Tsuji Yuki.", "“What’s the matter?”", "“S-Sorry, Chairman. It’s just…”", "As Tsuji Yuki asked sharply, the man sweated profusely and whispered into her ears.", "Soon, Tsuji Yuki’s eyes widened.", "“…What?”", "“I went and confirmed it with my own eyes. The place was completely razed to the ground.”", "“….”", "“Hanoi… has been destroyed by Valhalla.”", "Tsuji Yuki turned her gaze with a surprised look.", "Kazuki was still looking at her with leisure.", "“…Hah.”", "Tsuji Yuki let out a chuckle. She had been wondering why Hanoi was left standing even after a day had gone by since their refusal.", "‘So it was for this.’", "She felt like she understood how Xi Jinping must have felt when he was told of America bombing Syria in the middle of his summit meeting with Trump.", "“Let me ask you again.”", "Kazuki spoke.", "“Do you accept or refuse?”", "After a short moment of silence, Tsuji Yuki sighed deeply and put down her smoking pipe.", "She had been hesitating, but now the scale had suddenly sunk to one side.", "Once she refused, Kazuki would leave this place and return with his comrades in less than a day.", "Though unfortunate, the current Japan Business Federation had no way of stopping Valhalla.", "“…So this is the type of man Representative Seol is.”", "Tsuji Yuki smiled bitterly and slowly raised her upper body.", "“It wouldn’t have been as bad if he had come personally to ask, but to ask me to show my body in front of my old subordinate… I see he has a rather unusual taste.”", "After lamenting briefly, Tsuji Yuki got on her knees and bowed waist-down.", "“…I apologize.”", "An apology came out of Tsuji Yuki’s mouth.", "She put her hands on the floor and bowed until her forehead touched the ground.", "On the other hand, Kazuki’s chin slowly went up.", "“Kishi Yukino being a member of the Japan Business Federation is an undeniable truth, and the fault of my subordinate is also my own. As the representative of the Japan Business Federation, I sincerely apologize to Valhalla’s representative for causing him the worry.”", "The Japan Business Federation gave in.", "The executives that were sitting behind her were all staring at Tsuji Yuki with distressed faces.", "“I am incredibly ashamed of my subordinate’s actions, and I beg for forgiveness from all who have been hurt by this incident. The Japan Business Federation will accept Valhalla’s offer and carry out the contract’s provisions wholeheartedly.”", "Tsuji Yuki released the breath she had been holding in.", "“And… the executives of the Japan Business Federation, myself included, will take the initiative and set an example by carrying out the first provision.”", "Speaking with a trembling voice, Tsuji Yuki slowly got up.", "Immediately, the yukata that was loosely hanging on her shoulders rolled down. She must not have been wearing anything inside as her bare, smooth body was revealed in full.", "Tsuji Yuki shut her eyes, spread her legs slightly, and raised her hands up high. It was like she was going through an airport body scanner.", "Kazuki nodded his head and then looked around the room.", "Then, with slight differences in timing, the silently sitting executives slowly got up and began to take off their kimonos.", "After fully undressing, they posed in the same manner as Tsuji Yuki.", "“I understand that Chairman Tsuji Yuki is meaning well.”", "Only now did Kazuki get up.", "“Then excuse me.”", "He then turned around and spoke to Eun Yuri, who was struggling to hold back her laughter.", "“Don’t laugh. This is an important matter. You should know what to do now. It might not be visible with the naked eye, so…”", "“I know, I’ll check with magic.”", "Eun Yuri clenched her teeth and nodded her head.", "Soon, the man and woman walked toward the group of naked people.", "‘A purple snake tattoo…’", "As Tsuji Yuki stood with her head lowered, Kazuki and Eun Yuri began to examine every nook and cranny of Tsuji Yuki’s body.", "*", "The morning sky was clear and quiet, but Sinyoung had been bustling even before daybreak.", "Though it may be good news to some, Sinyoung had only been receiving one bad news after the other.", "There was a saying, a rich man can live for three years even if they go bankrupt.", "When Sung Shihyun went missing, Sinyoung became a loner, left to fend for themselves without Sung Shihyun’s strength and political influence. However, they still managed to hold onto their position of power for several years.", "They were able to do this because they had ample military power and because many organizations had formed partnerships with them.", "The scale of this network of partnerships could not be compared to the old Eva Alliance.", "The Eva Alliance was, at best, a union of eight mid-sized organizations. In contrast, Sinyoung’s partners were each a top-ranking organization in their respective cities.", "Their far-reaching influence had a firm grasp on every city except Eva.", "But now, when three years had already gone by since then, the situation was different.", "Externally, Sung Shihyun had reappeared as a traitor, and internally, an organization that was more powerful than Sinyoung had appeared.", "Rallying the Triads, Assassination Guild, Magicians’ Guild, and Sicilia, this organization was now pointing its spear at Sinyoung, cutting off its limbs one by one.", "They were trying to uproot the foundation that allowed Sinyoung to stay on the apex.", "Sinyoung already had their hands full, trying to deal with the incidents that had broken out left and right, but unsurprisingly, another bad news came striking down around noon, today.", "It was news that the Star of Lust had returned to the Temple of Luxuria.", "Yun Seohui dazedly stared at the communication crystal that a messenger delivered.", "Inside the crystal, over a hundred Priests of Luxuria were gathered at the temple, and Seo Yuhui was sitting on a decorated white throne, speaking to the crowd.", "The way she addressed the countless Priests made her seem like an empress.", "—I’m sure you all know about the recent incident. Bishop Roberto Servillo has betrayed humanity and colluded with the Parasites.", "Her message was clear and simple.", "—As the Executor of Luxuria, I cannot let the Temple continue on this path. From today, I will officially return to the Temple’s main branch.", "—Furthermore, I express deep regret in allowing the bishop’s wrongdoings to happen. I will personally join Valhalla and help them wholeheartedly.", "And the reactions of Luxuria’s Priests were unsurprising.", "—Clap, clap, clap, clap, clap!", "Thunderous claps rang out from the video.", "Who would expect otherwise?", "The Temple of Luxuria was the organization of the recent incident’s primary culprit, and with the bishop having confessed to his crimes, the organization was surrounded by enemies on all sides.", "This was when Seo Yuhui, the most coveted Priest in Paradise, came back, and she said she would even join Valhalla for the two organizations’ reconciliation.", "This meant that Seo Yuhui would be officially joining hands with Seol Jihu, who was predicted to become the next Apostle of Gula.", "Not only was the Temple of Luxuria given a path of survival as an organization, but they would also reconcile with Gula’s temple. How could they not be happy?", "This was the chance for them to regain the glory of the past.", "If signing a contract or swearing an oath was all it took, they would be more than happy to do so. If they weren’t traitors, of course.", "Yun Seohui, who was watching Luxuria’s Priests cheer loudly, turned off the communication crystal and closed her eyes.", "‘You’re either with us or against us…’", "It was a statement by the American President, George W. Bush, after 9/11.", "At the time, the entire world held their breaths at America’s unprecedented fury.", "Even North Korea and China openly criticized the terrorist organization. When Pakistan refused America’s request to pass through their airspace, they were met with the threat: Be prepared to be bombed. Be prepared to go back to the stone age. And they ultimately yielded.", "The current situation in Paradise was similar.", "The recent attack had enraged Valhalla, and Seol Jihu proclaimed in front of everyone.", "[Those who attacked Valhalla, those who devised and supported the plan, and those who knew about the plan and remained silent. I will not distinguish them.]", "[Every organization and Earthling involved in this matter will have to take responsibility.]", "His actions matched his words.", "Ill Destino tried to avoid their responsibility and was promptly destroyed. Hanoi refused their offer and was also destroyed.", "On the other hand, the Japan Business Federation and the Arabia Merchant Group bowed to Valhalla and denounced Sinyoung. And now, the Temple of Luxuria was joining the fray.", "With things having come this far, Yun Seohui couldn’t help but admit that the once-solid foundation of Sinyoung was beginning to shake.", "Right, Seol Jihu was grabbing Sinyoung by the collar.", "Shaking it violently, he was chasing this…", "*", "“…You’re still going to remain quiet?”", "Sitting in his office, Seol Jihu sneered coldly.", "One of our fellow readers, MocoSeco, has submitted a fanart that he created from the first 10 chapters of the novel. Do check it out at the very bottom of the \"Official Artwork\" page, the link for which can be found on the main page of the novel."]}