{"cid": "377", "title": "Chapter 377. Thank you (1)", "content": ["After more than 1000 days of ceaseless repetition, the trial finally reached a new phase.", "Black Seol Jihu began teaching Seol Jihu Spatial Abilities and a variety of other skills.", "This didn’t mean that Seol Jihu stopped climbing.", "Like Jang Maldong, Black Seol Jihu equated experience with training. He wanted Seol Jihu to learn as he continued his trial.", "And Seol Jihu had no reason to refuse. When he reached the bottom of the second slope, he waited for the boulders to appear.", "—Thousand-Ton-Pushing Strength is a technique based on tai chi.", "Black Seol Jihu stood behind Seol Jihu and sent him a mental transmission.", "—Have you heard of the expression ‘softness overcomes hardness’? The point of this expression is that even powerful strength cannot subdue softness.", "—Think of inertia or a lever. Suppose someone is running at full speed towards you. Instead of facing him head-on, what do you think will happen if you move slightly to the side and trip him with your leg?", "—Your opponent will lose his balance and fall. Now you have him down without even breaking a sweat.", "—But in order for this to work, you need to be capable of identifying the size of your opponent’s strength, the direction of his movement, and his center of gravity in a split second and aim for the correct spot.", "—It will be difficult, especially during a battle in which your life is at stake.", "As the boulders neared, Black Seol Jihu stood closely behind Seol Jihu.", "—Relax your body as much as you can and focus on my energy.", "He then grabbed both of Seol Jihu’s wrists and pushed them forward, infusing them with his energy.", "Seol Jihu’s palms brushed gently against the first boulder.", "“!”", "Seol Jihu flinched.", "The familiar impact wasn’t there.", "‘But why?’", "The moment he touched the boulder, a stream of energy shot out from the center of his palm.", "The mana quickly trickled down the surface of the boulder and landed exactly where the boulder met the ground.", "As a result—", "‘What happened?’", "Even though his hands touched the boulder, he felt almost nothing.", "If anything, he felt the sensation of pushing the heavy boulder aside.", "In fact, the boulder had lost its equilibrium and was swinging from side to side as it rolled down the slope.", "—Floral Substitution is a technique that utilizes this principle.", "Black Seol Jihu’s mental transmission continued before Seol Jihu could even take a breath.", "—It’s similar to what I said earlier. You either pull or push your opponent’s arm in the direction he’s currently headed. You’re adding your strength to his strength, to deal him a greater blow.", "—What’s important is the flow. For example, when an opponent uses a skill, you should know how his energy moves in his circuit and how it is manifested outwardly. To penetrate into an enemy’s attacks, you need to know his flow inside out.", "At that moment another boulder touched his hand.", "Seol Jihu stopped thinking about everything else and focused only on the boulder.", "This time, instead of resisting the weight, Seol Jihu accepted it. He then mixed his energy into the energy of the boulder so that it would naturally slide sideways.", "—Pushing, sliding, and returning the weight. You need to know how to do all three in order to complete Grand Cosmic Shift.", "—Focus first on reviving your senses. You did it once when you fought Twisted Kindness.", "—I’m going to withdraw my mana soon. I’ll hold your arm for you. Try it with your own mana this time.", "After repeating the same procedure a few more times, Black Seol Jihu withdrew his mana like he said he would.", "He took a moment to observe Seol Jihu’s mana and then released him completely.", "Seol Jihu was moving his arms on his own.", "Every time his hands moved and his arms bent, the boulders changed their course and rolled down the slope like a flowing river.", "Sometimes they shook or bounced, but Seol Jihu was still calm.", "He was focused on maintaining the flow of mana that Black Seol Jihu had started for him.", "[Miscellaneous Ability, Thousand-Ton-Pushing Strength (Lowest)’, has been created.]", "So much so that he didn’t even realize a message window had appeared.", "Of course, with his sight and hearing being sealed, he would never have known anyway.", "Black Seol Jihu smiled.", "*", "Seol Jihu devoured Black Seol Jihu’s teachings like a starving person sitting at a table full of food.", "It was almost hard to believe that Seol Jihu was not at all close to achieving this feat until recently.", "He could easily pinpoint the exact moment when everything began to go well. It was when Seol Jihu first rose to a realm. The difference was incredible.", "The techniques that Black Seol Jihu was teaching were all high-leveled that required quick, detailed, and accurate mana control.", "Without the combination of Intuition and Perfect Harmony that accelerated his reflexes against mana, Seol Jihu wouldn’t have even dreamed of reaching this far.", "Learning new techniques was fun.", "Through the process of learning amazing skills that could only be seen in anime, he was awarded with an overwhelming sense of accomplishment.", "He could feel that he was getting stronger every day.", "Of course, that didn’t mean he was complacent.", "Though he achieved quite a lot and the next step was very far, Seol Jihu didn’t even stop for a moment.", "For example, his Intuition was already at Pinnacle-rank, but he still limited his sight, hearing, and sense of smell in order to bring it up to Special-rank.", "Seol Jihu even sacrificed his sleep to study and practice new skills.", "As a result, Baek Haeju’s attitude changed.", "She used to try to talk to him no matter what, but nowadays she just watched him from afar. She came and left quietly, leaving only her bento boxes behind.", "There was a reason for the change in her attitude.", "“Thousand Thunder is an Awakening Skill. Each and every cell in your body must be awakened in order for you to maximize the potential of your body and mind.”", "She could tell how dedicated Black Seol Jihu was about teaching.", "“You said it’s similar to Flash Thunder, but it’s not a movement skill. What does that mean?”", "And how passionate Seol Jihu was in learning.", "“It means what it means. Flash Thunder only focuses on raising your speed, but Thousand Thunder is much more versatile. It not only increases your physical reflexes but also increases the power of all skills to the limit.”", "“It kind of makes sense. So it’s like a buff…? Ah, but you said I have to link Thousand Thunder with Hell Severing.”", "Again today, Baek Haeju put down a shopping bag near the two men, stood back, and watched them from afar.", "She just wanted to see them eat before she left.", "“Hell Severing is a skill that focuses on destruction. You condense the already condensed energy into an even smaller mass of energy and burst it open instantaneously. As for Thousand Thunder, you can think of it as a buff like you said.”", "“Aha.”", "“Before we begin, I want you to promise me something. Thousand Thunder is a skill I created myself. And when I was creating it, I didn’t prioritize safety.”", "Black Seol Jihu continued.", "“When you use Thousand Thunder, you’re essentially dividing your energy into a thousand streams. During the process of converting those streams into lightning, you condense the energy and force your body to ignite. The moment you cross the line, your body will explode and you’ll die. I had only raised it to Intermediate-rank. I could’ve raised it more, but I just didn’t bother.”", "“A thousand streams… that’ll put a strain on the body.”", "“It’s more than just a strain. You might as well think Thousand Thunder as a last-resort weapon you use in exchange for your life. It’s more dangerous for you because you have the Essence of Lightning. Remember, no higher than Intermediate-rank. Even if you feel like you can do more, just don’t.”", "“Okay.”", "“Good. Then I’ll begin the explanation…”", "Black Seol Jihu paused and turned his gaze to the shopping bag. He pointed at it with his finger.", "“Before we begin, how about we take care of that first?”", "“Oh? So she came again. But why did she….”", "“She’s probably gone or hiding somewhere. She’s like the snail bride.”[1]", "The two sat together as usual and opened the lunch box.", "Baek Haeju’s eyes relaxed and her nose reddened as she watched the two men chewing spinach.", "That was before Black Seol Jihu bellowed out his dissatisfaction.", "“What’s with these side dishes? Why are they all green?”", "Blacky grumbled about the food.", "At least that’s what Baek Haeju saw.", "“What about them? They’re delicious. I like them.”", "On the other hand, Snowy seemed content with the menu.", "“I’m not saying they taste bad. I’m saying they’re all green. Don’t you think this is too much?”", "“But there’s a wide variety to choose from. She used just the right amount of sesame oil for the spinach, and the vegetable pancake is crispy and good.”", "“I want meat. MEAT. Hey, can you ask her to bring some meat next time she comes?”", "“How can I? She’s already doing us a favor by bringing these here on a regular basis.”", "“It’s not like we asked for them. And, does she think we’re rabbits or something? She’s always feeding us grass.”", "Baek Haeju flinched.", "Her eyes narrowed and she glared at Blacky as he complained.", "Blacky was constantly glancing at the place where she was hiding. He definitely knew she was still here.", "Unlike Snowy, who was always nice and gentle, Blacky could be mean sometimes.", "“Hey, butler! Are you listening? If so, I demand you bring fried chicken next time! If you don’t bring us fried chicken, we’ll boycott lunch!”", "Blacky publicly protested.", "The rabbit butler cleared her throat and spun around quietly.", "She snorted, but what choice did she have?", "It was her duty to grant the rabbit’s wish.", "*", "When asked about the theory of relativity, Einstein answered:", "‘Put your hand on a hot stove for a minute, and it seems like an hour. Sit with a pretty girl for an hour, and it seems like a minute. That's relativity.’", "In the past, a second would be so painful that it would feel like a minute. Now, it was the opposite.", "It was morning when he opened his eyes and daybreak when he fell asleep from fatigue.", "His sense of time faded from spending every day substantially.", "“I’m going to sleep for just a bit. I’m too tired…”", "“How many hours are you going to sleep?”", "“Four.”", "“Mm… Actually, just take the whole day off.”", "Lying atop the field of weeds, Seol Jihu stared at his alternate self with a renewed gaze.", "When it came to training, Black Seol Jihu had always been strict, though it lessened slightly when Seol Jihu ascended to his own realm.", "So why the sudden change?", "Black Seol Jihu laid down on his back across from Seol Jihu so that their heads touched.", "Putting his interlocked hands up, he rested his head comfortably and looked up at the sky.", "The silent night sky that was sparkling with stars was incredibly beautiful.", "After a moment of silence, Black Seol Jihu spoke.", "“Let’s try it properly tomorrow.”", "Seol Jihu’s slowly closing eyelids shot open.", "Black Seol Jihu nibbled on a tuft of weed and continued.", "“There’s still the third trial. It’s not like you’re going to be here for dozens of years.”", "“….”", "“I’ve taught you everything I can… so try using that to climb up. As I passed everything down, you should be able to score at least 50 points.”", "Seol Jihu closed his eyes without saying anything.", "For some reason, he felt it was a bit regrettable. He himself wondered why he felt this way, but drowsiness flooded in, and he soon fell asleep.", "Then eventually, the next day dawned.", "Perhaps because it had been a long time since he got such a good night’s sleep, he woke up feeling refreshed.", "By the time the sun rose to the middle of the sky, Seol Jihu had finished his preparation and was pushing the boulder. Not to learn Black Seol Jihu’s techniques, but to pass the trial.", "“Did you know?”", "Black Seol Jihu sat over the first peak and said with a bright smile.", "“Climbing the first peak is nothing to you now.”", "It was as he said. In the past, he had barely stepped up to the top using small grooves he made on the ground. Although he wasn’t like Black Seol Jihu, who climbed up the peaks like taking a stroll, he had no problem climbing up with both hands.", "“Your current score should be… about 80. Iya~ That’s a lot of improvement from 59.5.”", "Black Seol Jihu spoke as he watched Seol Jihu who was climbing the second peak.", "There was no reply. Seol Jihu did not restrict his senses today, and he was currently displaying extreme concentration.", "Not long afterward, a group of rocks appeared on the second peak. As they rolled down with a crashing sound, Seol Jihu stopped in place.", "He purposely closed his eyes.", "He was more used to this. Now, he even felt strange seeing with his eyes.", "As the senses picked up by Intuition drew a picture of the surroundings in his head, Seol Jihu immediately set into motion.", "The boulder soared up to the sky. Seol Jihu had thrown it into the air.", "Then, he reached out toward the rocks that were rolling down the crossroads.", "“Oho.”", "Black Seol Jihu exclaimed.", "Some rocks brushed past Seol Jihu and rolled down, but most began to spin and climbed back up the crossroads. Then, at the same time as he destroyed an incoming rock, he caught the falling boulder in one hand and then threw it back up.", "“Are you playing basketball?”", "Though it looked slightly funny, the fact that he managed to do both things simultaneously was worthy of praise.", "It was at this time that a new set of rocks appeared on the crossroads.", "Black Seol Jihu’s eyes lit up.", "The rocks falling from the crossroads clashed with the spinning rocks that Seol Jihu sent back up. As a result, a thunderous sound resounded, and the rocks bounced in all directions.", "Seol Jihu aimed the Spear of Purity at the rocks that flew at him erratically.", "In the next instant, dozens of golden sword qi burst out from the spear blade.", "Kwang, kwang, kwang, kwang!", "The released flurry of sword qi carpet-bombed the sky. Seeing the rocks shatter, Black Seol Jihu let out a chuckle.", "It was a brute-force attack no matter how he looked at it.", "Did he shoot the sword qi knowing exactly where the rocks were? Or did he overexert his energy, thinking the flurry of sword qi would hit all targets?", "Black Seol Jihu soon judged that it was the former.", "Because amidst the vibrant explosions, the boulder that he threw into the air was coming down without a single scratch. Black Seol Jihu became absolutely positive after seeing the sword qi pushing the rocks away from the boulder.", "And so, as all the rocks rained down from the sky as tiny fragments, Seol Jihu placed down the boulder that fell from the sky back on the slope.", "Black Seol Jihu crossed his arms.", "It went without saying that Seol Jihu’s proficiencies with the skills were less than his. He also lacked delicacy and attention to detail compared to Baek Haeju. However, his destructive power was most certainly worthy of note.", "Setting the evaluation aside, the current Seol Jihu was thousands of times better than his past self, who could only throw Mana Spears before ultimately being crushed to death.", "Black Seol Jihu nodded his head in approval.", "Seol Jihu opened his eyes again and then began to push the boulder back up the slope.", "Though there was small debris scattered around the path, the boulder rolled up effortlessly, protected by Seol Jihu’s mana.", "While climbing, Seol Jihu felt that the process of breaking the rocks and treading up the sloped path was similar to his own trial.", "Walls did not stand in a row. Once he climbed one wall, it would become a reliable stepping stone, and a robust road would be spread out in front of it.", "Of course, this road would not remain flat forever. It would steepen the further he walked, and he would eventually come across another wall.", "A wall — known as one’s limit — that would be far taller and larger than the previous one.", "But that wasn’t the case now. He had a long way to go before he needed to worry about reaching his limit.", "At least for now, he could run forward as much as he wanted.", "After walking for an unknown amount of time, Seol Jihu suddenly stopped and looked back. He could see the second sloped path that stretched far down.", "“….”", "Seol Jihu repeatedly raised and placed his foot down.", "The ground felt flat.", "A timely breeze tickled his face, and Seol Jihu gently closed his eyes.", "[You passed the second trial.]", "This day had finally come.", "After passing the first trial, he longed for the day he would reach this point.", "During the second trial, this place seemed far out of reach, and he was at a loss for what to do.", "But he had finally reached the top of the second peak.", "It had taken him 1,526 days to do so.", "Seol Jihu took a deep breath, emotions welling up inside him.", "He could see the first peak in the distance, looking quite small in comparison to where he currently was. He was deeply moved because the first sloped path wasn’t even visible.", "However, this feeling did not last for long as a series of alerts struck his ears.", "[Follow the Path of the Soul and place the boulder on the summit.]", "[Once you step onto the third peak, the one who walks on the Path of the Soul will enter the Chamber of Void.]", "[1. Inside the Path of the Soul, one’s five senses will be restricted, and the flow of time will slow down.]", "[2. In an environment where one cannot see, hear, smell, taste, or even perceive external stimuli, only illusions will initiate conversations with the challenger. Each time an illusion ends, the one who walks on the Path of the Soul must pay the appropriate price.]", "[3. There is no need to walk in a particular direction inside the Chamber of Void. There is no way of knowing where the exit is either. The challenger will eventually arrive at the summit if they keep walking.]", "[The use of external help or shortcuts is strictly prohibited in this process. You must step on the summit solely with your own strength to be considered as having passed the trial.]", "“65 points!”", "A voice entered Seol Jihu’s ears as he was carefully reading the alerts.", "Black Seol Jihu was walking up the slope.", "“…I’m surprised. I thought it would be 50 points.”", "“I lowered the requirement to pass the second trial to 75 points. As for the reason why you’re missing 10 points out of the 75 points… you already know, right?”", "Black Seol Jihu winked at Seol Jihu.", "“Of course.”", "Seol Jihu smiled blandly.", "He turned off the alerts and placed his hands back on the boulder.", "“You’re going right away?”", "“Yes. I tried it once before, and I know the conditions for passing it. Also…”", "Seol Jihu hesitated for a moment before saying with a smile.", "“You said so yesterday. That I can’t stay here forever.”", "Black Seol Jihu blinked rapidly.", "“Well… that’s true.”", "He took a couple of steps back and then nodded his head.", "“Alright, give it a try. Since you experienced it once and know what to expect, I assume you have a plan.”", "“I’ll be off then.”", "Seol Jihu pushed the boulder.", "He paused the moment he entered the third slope, but then he began to push the boulder up silently.", "How much time went by?", "Black Seol Jihu, who was staring fixedly at Seol Jihu, suddenly furrowed his brows.", "“…Eh?”", "A surprised voice escaped his mouth. He unknowingly craned his neck out and stared at Seol Jihu.", "It was then.", "AAAAAAH!", "A scream erupted for the first time in a while.", "Seol Jihu collapsed before curling up and rolling down the slope.", "His body quickly turned faint.", "After confirming the spot where Seol Jihu collapsed multiple times, Black Seol Jihu hurriedly turned back.", "Seol Jihu was shaking faintly while holding his body at the starting point. Then, he smiled as soon as he saw Black Seol Jihu walk up to him.", "“I thought I was prepared… but I guess it can’t be that easy.”", "“….”", "“I managed to hold out Hyung, Jinhee, and Seonhwa… but my heart sank as soon as I saw my mother…. Auu, I thought I’d gotten used to pain, but the pain from that heart-wrenching feeling was beyond my imaginations.”", "“…You.”", "Black Seol Jihu listened without saying anything and then asked.", "“You knew how to reach the summit?”", "“Huh? N-No.”", "Seol Jihu’s eyes widened.", "“It’s just that… I’ve been thinking a lot about it. The reason the content of the third trial is like that and the reason my family appears in it…. Then I figured out what to do when I saw the conditions for passing the trial.”", "“And what did you figure out exactly?”", "“To climb up blindly.”", "Black Seol Jihu’s brows twitched.", "“Blindly?”", "“To be more precise, I thought I had to go up blindly.”", "Seol Jihu continued.", "“How should I say this… I think that’s what the trial wants me to do.”", "“You know I don’t like ambiguous statements.”", "“While I was walking, no, climbing, there was something I came to think. That maybe, the pain I experienced after each illusion was the pain my family felt until now because of me.”", "Seol Jihu’s voice was clear.", "“Since the conditions specifically mentioned price, I thought of it as a punishment I deserved to get. If the pain my family felt gets deeply etched to my bones, I—”", "“What, you think you can hold your head up high the next time you meet them? Because you paid the appropriate price here?”", "Black Seol Jihu cut him off.", "“Haha… don’t try to make me more despicable than I already am. Never mind making me hold my head up high, it only made me reflect on my actions more.”", "Seol Jihu smiled bitterly and shook his head.", "“So this is how Hyung, Jinhee, and Seonhwa felt. So this is how much I hurt my parents. Once I realized that I became even more apologetic…”", "Seol Jihu trailed off before sighing.", "“I’m going to climb this peak. No matter how many times I die in the process, I will accept the pain and reflect on my past actions. And I will not forget what I felt here even after I leave. Until the day I really die.”", "“…I understand what you mean.”", "Black Seol Jihu crossed his arms.", "“But what do you think I’m going to say?”", "He sounded a bit apathetic.", "“You can say whatever you want.”", "Seol Jihu spoke firmly.", "“Even if this isn’t the right answer, I’m going to climb the way I want to. At least for the third trial.”", "Black Seol Jihu closed his eyes.", "Soon, the corner of his mouth curled up ever so slightly.", "He didn’t say anything. He simply uncrossed his arms and shrugged.", "Seol Jihu smiled brightly and turned around.", "Only then did Black Seol Jihu open his eyes and slowly gazed at Seol Jihu as he walked away.", "Then, he recalled what he had seen just a moment ago.", "‘Two-thirds…’", "Seol Jihu probably did not notice since he was walking inside the Chamber of Void, but Black Seol Jihu had seen it clearly.", "Seol Jihu had climbed two-thirds of the way as soon as he started the third trial.", "In truth, Black Seol Jihu had hopes that Seol Jihu would at least go one-third of the way. Since Seol Jihu’s temperament and aptitude had undergone a change since the trials started, and due to him experiencing some of the restrictions of the third trial during the second trial, Black Seol Jihu figured Seol Jihu would have a relatively easier time.", "However, Seol Jihu went beyond his expectations, going a third of the way more.", "It was a surprising result without a doubt.", "Because Black Seol Jihu expected the third trial to be the most difficult one among the Path of the Soul’s three trials.", "He had an idea as to why this happened.", "‘Master Jang.’", "The goal of the third trial lay in treating the fundamental cause of Seol Jihu’s addiction to Paradise — the trauma he had with his family.", "The point was to fix his rotten mindset of avoiding talking about his family. The trial would thus help in his personal growth so that he would face his errors without running away.", "“…Heh.”", "Black Seol Jihu expected him to be in tears and bawling like a child before even reaching the halfway point…", "He had no doubt that the reason Seol Jihu had surpassed his expectations was because of Jang Maldong.", "Because of his scolding, Seol Jihu went back to Earth and met his family.", "[So I’m finally ready.]", "[In front of my family… I’m ready to live as a criminal for the rest of my life.]", "With his inner self having grown from passing the second trial…", "[I’m sorry.]", "[I’m… really sorry… Father.]", "The resolve he made that day while begging for forgiveness in front of his father was helping him move forward.", "“…He’s better than me in this regard.”", "Black Seol Jihu chuckled bitterly.", "He heaved a deep sigh before crouching down on the ground.", "‘Looks like he’s going to pass the third trial quicker than I thought…’", "He smacked his lips and then looked up at the sky as if a weight had been taken off his chest.", "‘Now…’", "After staring blankly for a long time, he closed his eyes halfway.", "‘It’s about time for me, too…’", "He looked slightly lonely.", "1. From a Korean folktale. Feel free to Google. "]}