{"cid": "45", "title": "Chapter 45. To Paradise, Once More", "content": ["Seol Jihu carefully checked out the contract from Gula. Not one word had been changed from when he first read it. Of course, judging from the personality she displayed until now, Kim Hannah wouldn't try to pull a fast one like that.", "Seol Jihu finished scanning the contract and signed on the dotted line. As he returned the contract to her, he spoke.", "“Now that I've signed the contract, I want to ask you about something.”", "“?”", "“Don't you work for Sinyoung?”", "“Yeah, I do.” ", "“Why did you say those things back then? Wouldn't it be more advantageous for you if I ended up signing with them?”", "Kim Hannah carefully but professionally folded the contract and hid it inside her jacket before cocking an eyebrow.", "“I was wondering why you haven't asked me that yet. But shouldn't you have asked that question before signing the contract? What if you have a change of mind after hearing what I have to say?”", "“You'd have said things in such a way to make sure that I don't change my mind anyway. Well, I just wanted to hear your honest words without worrying about how you'd change the story.”", "“…You seem to get smarter when it comes to things like this, huh.” ", "Kim Hannah shot him a prim glare and took off her glasses. She even put the spoon down and began lightly tapping the table with her index finger.", "“Okay, fine. It's a long story, but since you want to hear it, I'll tell you. Do you know what the current situation is like for Sinyoung?” ", "Seol Jihu was about to ask, “Aren’t they the biggest organization in Paradise?” but held back. The way she asked her question, it sounded like something pretty serious was going on here.", "“They are stuck between a rock and a hard place, going nowhere.”", "Kim Hannah rested her chin on the back of her hand and gazed at the outside of the diner with half-closed eyes. Her face, as reflected on the glass, looked rather bitter.", "“Their situation is really complicated right now. Sinyoung lost their most powerful combat force, and they are also losing their justification for being there. It's not as if their foundation has become weak enough to be shaken around, but on the flip side, they can't deny that they have indeed been weakened considerably compared to the past. I'm curious, but have you read the Romance of the Three Kingdoms before?”", "She came out of nowhere with that one, but Seol still nodded his head.", "“Cao Cao succeeded in 'securing' the young emperor, thereby creating the firm foundation for himself to control the empire, right? Sinyoung did something similar. A year ago – no, wait. Three years ago in that place's time flow, the very first rebellion happened within the human alliance.”", "Kim Hannah lowered her voice and continued on.", "“To be more specific, a certain kingdom wanted the Earthlings to become more proactive, and they formed an alliance of sorts with other like-minded kingdoms and tried a method that was a bit more forceful than before. As a result, several organizations rebelled openly against their unreasonable demands. An entire region rose up to resist this push, so surely you can imagine how big of a rebellion it was.”", "“A region? Which one?” ", "“The South…. The resistance movement formed around the South as its center. And in the end, a war broke out. Those guys were defeated…. in the blink, and…. pushed to the brink…. Ah.” ", "In the middle of her speech, Kim Hannah went, ‘Ah!’ She forgot about the pact to never to speak about the secrets of Paradise and ended up doing precisely that.", "Seol Jihu waved his hands around briefly to show her it was fine.", "“Did every Earthling participate in the rebellion?”", "“No. Some participated, but there were some who supported the royal families. However, most were neutral.”", "Kim Hannah then placed her hand on her chest.", "“It was right around then. Sinyoung had remained neutral until that time, but they declared their support of the royal family and entered the fray.” ", "She then raised two of her fingers.", "“There were two reasons Sinyoung decided to intervene. The first thing was, of course, for profit. And secondly, they were confident in winning.”", "As if she was feeling thirsty, Kim Hannah took large gulps of the cold water.", "“Phew~. Of course, even Sinyoung didn't possess the military might to subdue a rebellion of that size by themselves. However, even though they were small in number, there were some Earthlings who supported the royal families, so they joined in. Sinyoung also persuaded their allies to participate as well. Then, using those events as the pivotal point, they began persuading other neutral organizations into participating. And most importantly….”", "To signify the importance of what she was about to say, her expression hardened noticeably.", "“They let loose a single Unique Ranker into the battlefield.” ", "To be acknowledged as a Unique Ranker in Paradise, one had to be level 7 or above. Not everyone could level up that high, and there were only a handful of such individuals in the whole of Paradise.", "“His name is Sung Shihyun.”", "Sung Shihyun… Seol Jihu repeated that name inwardly. He had heard of this name before. From the way she had crossed her arms against her chest, it seemed that Kim Hannah wasn't happy about something there.", "“Sinyoung was encouraged by Sung Shihyun's combat prowess, and through him, they were able to achieve a sweeping victory against the rebellion. The royal families wished to push forward with the momentum and even destroy the rebellion's headquarters, but Sinyoung didn't want that. No, they came up with a nice-sounding pretext of giving the other side a chance, saying that the continuous fight between humans would only weaken the influence of mankind on the planet. So, they went ahead with ceasefire negotiations.”", "No matter how good a pretext sounded, it'd always remain as a pretext. It meant that Sinyoung had already started their machinations on the political landscape of Paradise well before the negotiations began.", "“In the end, the royal families promised to allow complete freedom of the Southern region under the condition that all the remaining rebels were relocated there.”", "“Mm…. Isn't that the same thing as the rebels ultimately getting what they wanted in the first place?” ", "“If you look at the result only, sure. But you could also say that they were exiled there too. I'm sure you've heard by now that the South is always mired in warfare, right?” ", "Seol Jihu had heard the condensed version before – that there were currently four different species calling Paradise their home and that the humans were the weakest of them.", "“The South is pretty much the frontlines of the war. In other words, it's the most dangerous area.” ", "“Ah.”", "Seol Jihu let out a gasp of shock. He now understood who had gained the most out of the rebellion from those two sentences she uttered out.", "“That's right. It's the same thing as Sinyoung sending all their rival influences down to the South to act as their meat shield. And thanks to that, Sinyoung got to increase their political clout back in the Capital without a single worry. And they even had the royal family in their back pocket, so what did they have to fear now, right?”", "Kim Hannah spoke the last sentence with a slight hint of disdain before slowly leaning her back against the chair.", "“However, no flower blooms forever… Not everything was plain sailing for them, you see. About two years ago in the flow of time that side, a new problem occurred. One that nobody saw coming.”", "“A problem, you say?” ", "“Sung Shihyun.” ", "It was that name again.", "“Well, him… even I can't figure it out why he did what he did. Some say he had a falling-out with Sinyoung's management, and others say the royal family made their move after getting worried about Sinyoung's growing influence. Or maybe, Sung Shihyun's own greed got the better of him….”", "“Just what kind of a person is this Sung Shihyun, anyway?” ", "“I can't speak about his identity here. But know this, he isn't a nice guy. His abilities are indeed a real deal, but I remember him being incredibly arrogant, and that he used to do whatever he felt like. What's important is that he went ahead with a certain military expedition against other's wishes, spectacularly failed that, and went missing ever since.” ", "“He’s dead?”", "“That's the thing – no one knows. Just because he's 'dead' on that side, that doesn't mean he's dead this side too. However, he's completely disappeared without a trace over that side and over here, too.” ", "Seol Jihu agreed with the notion that it sounded rather bizarre and opened his mouth to speak.", "“I guess that with Sung Shihyun going missing, Sinyoung got affected pretty badly, right?” ", "“But, of course. That guy was what you'd call an Irregular.” ", "Kim Hannah nodded her head.", "“No matter which organization, there is a limit to how much manpower you can mobilize at once for individual requests and missions. The reason Sinyoung was able to grow at an explosive rate was because of the full support from the royal family. Of course, Sinyoung had to listen to the royal family's demands in return. And the nearly impossible missions or difficult tasks were taken care of by Sung Shihyun.” ", "However, with the disappearance of that Sung Shihyun, it became harder to carry out the demanding tasks set out by the royal families. And so, the foundation Sinyoung relied on to grow more influential and wealthy began to rock unsteadily.", "Understanding as such, Seol Jihu's eyes narrowed to a slit.", "“I think I can understand where the rebellion was coming from. Just how ridiculous were the demands made by the royal family? I get where they are coming from, but wouldn't you normally make the request after seeing what the current situation is like?”", "“Right…. That's how you'd normally do that, but….” ", "For some reason, Kim Hannah blurred the ends of her words. It was as if she was trying to be vague about something.", "“In any case, that's where this story ends. Actually, this isn't something you should be aware of, right now. But, I should answer that question you asked me earlier.” ", "Kim Hannah coughed to clear her throat and stared straight at Seol Jihu.", "“After the powerful combat potential called Sung Shihyun became missing, Sinyoung became incredibly busy. They have way too many business interests to look after, and they have to keep an eye on the royal family too. Even I'm supposed to handle eight different assignments right now.” ", "“Eight?” ", "Seol Jihu could only leak out a hollow chuckle. He even thought whether it was fine for her to be here or not.", "“And then, in the midst of this madness, a new Irregular has appeared. Of course, that's you. The paths you walked, the things you've done and achieved, they are remarkably similar to Sung Shihyun's. Well, if you are Sinyoung, how would you respond?”", "“I'll probably try to scout me.”", "“Obviously. But having lost Sung Shihyun once, they would make sure they are prepared this time. You felt it too when you took a look at their contract, right? Every single clause promising to support you were traps that would've shackled you real good. Sure, they would help you get stronger, but they will also turn you into a puppet that only moved according to Sinyoung's wishes.”", "He had been expecting something like that already, but now that he heard the truth straight from her, it certainly felt a bit different than before. Kinda like his body was shuddering or something.", "'But, why me?'", "“If I were to be honest, you’re currently a juicy prey waiting to be devoured.” ", "Seol Jihu stared blankly at Kim Hannah.", "He understood now why he shouldn't sign up with Sinyoung, but her helping him out was a different matter altogether. At the end of the day, Kim Hannah still worked for Sinyoung, after all.", "“And finally, the reason I'm helping you like this.”", "She locked her fingers.", "“Well, you can criticize me for being materialistic if you want. That gold stamp was my private property. And besides, I didn't want others to steal you from me.”", "“Steal?”", "“Mn. If I coerced you into joining Sinyoung, then sure, they would've praised me for it. They'll promote me as my reward too. But, that would be all, right? The moment you join the company, the higher-ups would do anything to possess you. And since I don't have any power, you'll end up being taken from me.” ", "Kim Hannah then raised both her hands in a slight shrug.", "“If that was the case, then wouldn't it be much more profitable for me if you didn't join and grow stronger outside the company? Mu~ch more, right? You grow powerful and strong and start supporting me, then I'd get to have a proper say within Sinyoung, you know what I mean? Uhuhuhuhu.” ", "“T, that's how it is?”", "“That's right! I raised this guy, he's friendly with me, he only deals with me, etc, etc. You wanna ask this guy for a request, then talk to me first. Keuh~.” ", "Kim Hannah's neck shrunk back slightly and her shoulders started to tremble a little as if the thought alone made her very excited.", "Now that he heard her story, he kind of agreed with her there. However, the rosy future of her dreams could only take place on the condition that Seol Jihu grew up to become someone with great power. Honestly, he felt burdened by her expectations.", "“I think you're thinking too highly of me.” ", "“Hmm.”", "Seeing the youth smile awkwardly, Kim Hannah pouted slightly.", "“Indeed. You do make me worried from how you acted this side, you know?” ", "She began giggling and that brought out a soft but genuine smile from him as well.", "The two of them continued on with their breakfast and chatted about what they needed to do for their happy future on the other side.", "“Don't think too hard about this.”", "As they left the diner and headed back to his place, Seol Jihu fell into deep thought. So, Kim Hannah offered a bit of advice.", "“You're still only Level 1. No one is expecting you to do something incredible. So, you should just focus on getting used to life on that side for the next couple of years. You can even think of it as playing a game.” ", "“Playing a game?” ", "“Right. Like video games. You log in when you have a bit of free time, kinda like that. Of course, it'd be your main line of work, though.” ", "Seol Jihu recalled hearing something similar to this before.", "[My ass. In the end, this is all just a fucking game, man. A game. And you're supposed to enjoy playing games.]", "But unlike when Kang Seok said those things, Seol Jihu didn't feel disgusted this time. No, he thought that it wouldn't be so bad to view this whole thing just as Kim Hannah had said. Everyone had different ways to enjoy themselves, after all.", "As they walked back to his place, they encountered a middle-aged woman busy sorting through the trash in front of the building where he lived. She was a cleaning lady he had seen a few times while he went about his business in the past.", "The woman was mouthing off her discontent while trying to sort out the mountainous pile of trash. She then spotted the youth and the glasses-wearing woman and tilted her head a little. Seol Jihu felt guilty about all the crap there, so he quickly bowed to her and ran inside his room.", "After entering his home, they began preparing themselves to return to Paradise.", "“This thing, is it fine to leave it behind here?”", "“Do what you feel like.” ", "After taking out all the prohibited items, Kim Hannah produced a small slip of paper from her pocket.", "“Well, then. It's finally time for us to head back to Paradise you so desperately wanted to return to.”", "Seol Jihu smirked and pulled his own slip of paper out. It was here that Kim Hannah spoke to him one more time.", "“I'm asking this for your own good, but you know what you need to do once we go back there, right?” ", "“Yes, I know.” ", "“Okay. Let's go, then.” ", "Rip.", "Along with the noise of the paper being torn, a circular light appeared in the empty air. Kim Hannah was swallowed up by this light from her head down to her feet and disappeared from sight in an instant.", "Seol Jihu observed this with great curiosity before deciding to rip his own paper – but then, he stopped.", "He spotted his smartphone, discarded to the corner of the room. After Yoo Seonhwa gave it back to him, he didn't even get around to charging it, so it was currently turned off.", "'The place I need to be…'", "He felt a sudden urge to confirm something. If he switched that phone on, wouldn't calls from his family or Yoo Seonhwa arrive?", "It didn't take too long for him to realize how embarrassingly unrealistic that wish was.", "'….There's no way they'd contact me, anyway.'", "Seol Jihu let off a lengthy sigh before ripping the transfer paper in half.", "*", "“Ehew, why is there so much trash here… hm?”", "The middle-aged woman continued to complain to herself as she sorted out the trash. It was then that she sensed the presence of someone behind her. She turned around to take a look.", "A beautiful woman with a pretty dress was standing there while holding an envelope in one hand. She must have come here the first thing in the morning because her hair was still damp.", "When their gazes met, the beautiful woman politely greeted her.", "“Hello there, Auntie.”", "“Aigoo, hello to you too. It's been a while…. Wait, I did see you for a little bit yesterday, so it's not a while, is it?”", "The middle-aged woman greeted the young woman warmly as if they were familiar with each other.", "“Besides that, you also came today? I thought you decided to not to come here anymore.”", "“Yes, I have a business here today.” ", "Yoo Seonhwa displayed an uneasy smile.", "“By any chance, have you seen the guy who stays in room 405?” ", "“Ahh… Him? Yes, I've seen him.”", "A light gleamed in Yoo Seonhwa's eyes.", "“Is he home?”", "“Well, that. Maybe, around 30 minutes after you left yesterday? One hour? Anyways. He came home around that time after you left. I want to tell him that you stopped by, but he seemed so tired and troubled, so….”", "Yoo Seonhwa's mouth hung open a little.", "Yesterday, after Seol Jihu ran off, she chased after him right away. There was something she just had to confirm. So, she paid the taxi driver extra just to get to Seol Jihu's place as soon as possible.", "The problem was that he hadn't come back home. She waited for a long time, yet he didn't show up.", "If she knew he'd come so soon afterwards, then she would have waited here. She couldn't have guessed that he'd come home after she left. He must have wandered around the streets aimlessly before stumbling back home somehow.", "“I think he's in there, now. But, what should I do…. Aigoo…”", "“What's wrong?” ", "“It's something a bit scandalous for me to say, but…. I wonder if it'll be fine?”", "“I'm sure it'll be fine. Please feel free to speak.” ", "“I saw him enter not too long ago, but some pretty lady was sticking very close to him, you see.”", "“Pardon?”", "As soon as she spotted Yoo Seonhwa's facial expression, the cleaning lady hurriedly added a few more words.", "“I'm not sure what's going on. That lady borrowed some cleaning equipment last night, saying that she's going to clean out room 405. She was speaking in such a curt and straightforward manner, even though she looks like a fox. All this trash, it's from that room, you know?”", "“….”", "“D, did I overstep my boundaries?”", "“….No, not at all.”", "Yoo Seonhwa said her goodbyes and hurriedly entered the building. She quickly ran up the stairs. She wasn't feeling something as petty as jealousy. It was definitely not lingering attachment, either.", "However.", "As she listened to the story from the cleaning lady, the various possibilities she thought of were converging into one situation she hoped would not happen.", "If what she saw yesterday was not wrong, then….", "'No, he can’t.'", "He had finally regained himself, yet this….", "If her suspicions were proven to be correct, then she swore to herself that she'd save him no matter the cost. With this in mind, she arrived at the door to room 405.", "“Jihu!”", "Thud, thud!", "“Seol Jihu!”", "She pounded on the door for a while, but there was no response.", "Yoo Seonhwa bit her lower lip and fished out a key from her handbag. He gave her this key a while back, saying that she should use it in an emergency.", "She knew that she shouldn't do this, but now wasn't the time to argue about the finer points. She inserted the key in the lock and heard it unlatch.", "Yoo Seonhwa pushed the door wide open but didn't enter. Because, as soon as she saw the interior, she displayed the expression of stupefaction.", "She heard just now from the cleaning lady that he was in his room, yet….", "“Ji, Jihu….”", "There was no one in the room.", "Not even a trace of human presence remained.", "The room was empty.", "Yoo Seonhwa dazedly looked around the room before she suddenly spotted items that didn't belong here. They were items for women. She could tell that those obviously didn't belong to Seol Jihu.", "Yoo Seonhwa squeezed her eyes shut before quietly closing the door. She locked the door again and stood in the same spot for a long time.", "“You idiot….”", "A short while later….", "Yoo Seonhwa breathed in deeply as if she had made her mind up over something. And with a grim expression on her face, she switched her phone on.", "Only a handful of rings went by before the call was picked up, and a voice that sounded artificial came out from the speaker.", "—Miss S, Seonhwa?", "“Yes, it's me.” ", "—Oh, my goodness! Is it really you, Miss Seonhwa? ", "“Yes, it's me. There's something I'd like to talk to you about.”", "Yoo Seonhwa spoke with a heavy voice before taking a look around her. She then brought the phone very close to her mouth and began whispering for a while.", "—…Pardon? W, what did you say?", "“That's what I'll be doing.”", "—Wait, wait a minute. Miss Seonhwa?", "“I can't speak at length at the moment. As for the details…”", "Yoo Seonhwa blurred the ends of her words and bit her lip again.", "A short moment of silence later….", "—…The things you said, are they coming from your heart?"]}