{"cid": "227", "title": "Chapter 227. Fox Princess, Rabbit Prince (1)", "content": ["Seol Jihu opened his eyes at the crack of dawn. He lit a fire to boil some water and after making a hot cup of coffee for himself, he read the information newspaper that the Assassin’s Guild delivered.", "Seol Jihu’s schedule for the day was set. He planned to introduce Flone to the rest of the team in the morning and then leave for Scheherazade in the afternoon.", "He would only feel at ease after at least knowing Kim Hannah’s whereabouts.", "Only, eating came first. Seol Jihu started preparing breakfast.", "He went back outside to light the fire once more and placed a potstove of rice on top. Paradise’s food also suited his tastes, but there were occasional moments when he craved rice.", "After lightly preparing 6 servings of rice, Seol Jihu fell into deep thought while taking out all sorts of cooking ingredients that he had brought from Earth.", "'Should I ask them to go with me…?'", "Recently, the atmosphere inside Carpe Diem was a sight to see. Everyone just sprawled on their backs, giggling to themselves the entire day.", "They sometimes went out, but it was only to visit the temple to check their money or to chug alcohol down their throats at the bar.", "Of course, it was only natural for them to take a break, especially now that the expedition was over, but it was obvious what they were thinking inside their minds.", "It was clear as day that all they were pondering about was, ‘What should I do with my money to make it well-spent?’ So if he asked them if they wanted to tag along to Scheherazade with him, they were sure to instantly agree. After all, the largest auction house in Paradise was at its capital, and no Warrior could deny their greed for equipment.", "Seol Jihu made a mental note to bring the matter up sometime in the morning before entering the office with the dishes he had cooked.", "After placing down the dishes full of three-colored vegetables seasoned with fragrant sesame oil and sprinkled with sesame seeds, twenty half-fried eggs, and neatly cut sausages sauteed in ketchup, the table looked impressive.", "Sitting himself down on the couch, Seol Jihu gave a bright smile.", "\"Thanks for the food.\"", "The moment he picked up two fried eggs with his chopsticks and was about to stuff them in his open mouth…", "\"?\"", "He suddenly felt a gaze and froze. Still holding the fried eggs, he stealthily turned his eyes.", "A moment later, Seol Jihu could see about half of a red egg in the bottom corner of the hallway leading toward the private rooms. Its 45-degree stance made it look like it was peeping its head to secretly spy on him.", "Their eyes met. No, there was no way the egg had eyes. But even though he didn’t understand how, he felt that their gazes collided.", "'Huh? Did I carry the egg out of the room?’", "While he was doubting himself…", "The egg bounced up with a Tong!", "Seol Jihu’s eyes grew wide and the fried eggs slipped from his chopsticks.", "Tong, tong, tong, tong. From the floor to the couch and from the couch to the table. Before Seol Jihu snapped out of his stupefaction, the egg had gently landed like a feather on the table full of food.", "It then rolled and stopped right in front of Seol Jihu. After that, it slightly tilted back, almost as if it was raising its head to look at him.", "\"….\"", "Upon witnessing such a bizarre phenomenon, Seol Jihu was at a complete loss for words. When he barely came to his senses, he spoke.", "\"Y-You, what are you? Did you come here on your own?”", "The egg bounced up and down.", "\"No, wait, what exactly happened? Have you been awakened? Even though you haven’t hatched yet?”", "Bounce, bounce.", "\"What happened?\"", "Bounce, bounce.", "\"Stop bouncing and say something… Ah, you don’t have a mouth. This is driving me crazy.”", "Bounce, bounce.", "\"W-What? What do you want?”", "As if it was frustrated, the egg kept bouncing for a while before rolling next to a plate. Then it nudged the bowl of hot, steaming rice.", "\"…Rice? You want some rice?\"", "As soon as Seol Jihu shared some of his rice on the plate, it quickly jumped on top of the plate.", "Munch, munch.", "'Huh?'", "Seol Jihu’s jaw dropped to the floor.", "It couldn’t be helped. An egg… was eating rice? Even though it was a thing with no mouth?", "Seol Jihu pressed his face in front of it. He carefully peered at the rice-eating egg, but as he had thought, he couldn’t see a mouth.", "Only, every time it ate, a circular dent was formed at the center of the egg, into which the rice entered. Its surface would ripple every time it chewed, and when it swallowed, a small gulp could be heard.", "'I thought it needed to be fed with divine power exchanged with contribution points?’", "Was it perhaps omnivorous? Did it eat anything well?", "While Seol Jihu was baffled, the egg continued to earnestly eat. Seol Jihu just continued to stare as the dishes that he had carefully prepared were being emptied out.", "Finally, the egg stopped its actions when it had finished all of the food.", "'Was the classic novel, Kim Won Jung[1] based on a true story…?’", "Seol Jihu stared at the red egg, plainly expressing his disbelief through his eyes. Just how did all of that food fit inside the small egg?", "\"Buurrp—\"", "\"!?\"", "Seol Jihu was so surprised that he hiccuped.", "\"You. You just burped, didn’t you? You burped!”", "Whether he asked or not, the egg ignored him. Then, as if it was done with its business, it bounced away. It landed by a sunlit windowsill and tilted back 90 degrees.", "It looked like it was grabbing a nap after eating its fill.", "Seol Jihu blinked his eyes for a while.", "The egg stopped responding after that. However, when Seol Jihu started to irritate it by constantly trying to talk to it, it bounced in anger and left the place.", "An unexpected event had happened, but Seol Jihu still proceeded with the schedule he had set for the morning. He called everyone for a meeting, telling them that he was going to introduce a new member.", "The team’s response was calm. It was because they had roughly heard about it during the expedition to the Pagoda of Dreams.", "Of course, they didn’t know everything, only that it was a good ghost.", "\"Sungjin didn’t wake up.”", "Jang Maldong said as he came out of his room, closing the door behind him. Yi Seol-Ah got up with a drowsy face.", "\"I’ll… wake him…”", "Her voice was hoarse.", "\"It’s fine. Just leave him.”", "Jang Maldong shook his head.", "\"I tried waking him up, but he started begging for his life while half asleep.”", "Chohong smirked.", "\"You should have gone easier on him. Just how hard did you train him that he’d beg you for his life? You’re going to kill him at that rate.”", "\"But… He wanted it himself….\"", "Jang Maldong let out a dry cough and sat down on the couch.", "As several pairs of eyes eventually landed on him, Seol Jihu closed his mouth and looked around him. He had told Flone to materialize, but she was suddenly nowhere to be seen.", "Flone was peeking her head out from around the corner of the hallway just as the egg had done. Seol Jihu hurriedly ran over and pulled her arm.", "\"Ah, why are you hiding again? Come quickly.”", "[Eeeek.]", "\"You promised. I’ve even prepared everything.”", "[Eeeeeek. Noooooo.]", "Although she refused with her words, she let herself be dragged over. He could tell that she was throwing a tantrum because she felt shy.", "It was only with some quibbling after dragging her over that he finally presented Flone to his teammates.", "Although they had all roughly heard about her, it was their first time seeing her, so they all looked at her with curious eyes.", "Her hesitant behavior was only momentary. Flone elegantly straightened her neck and after gently placing her hand on her chest, she started speaking.", "[This humble girl offers everyone the most careful greetings.]", "A clear and graceful voice sounded in everyone’s head.", "[This girl is the youngest daughter of the Spear of the Empire, the House of Rothschear, Flonecia Lusignan La Rothschear. It is my greatest honor to meet the knights of Carpe Diem renowned for their bravery.]", "Seol Jihu rubbed his eyes and pricked his ears. Where did Pippi Longstocking go and where did this heroine from a fantasy romance novel overflowing with dignity come from? And why did she sound like she was reading off a literature book?", "[I beg thee to call this girl Flone.]", "Flone politely curtsied and ended her greeting.", "Oooooh—", "A small cheer broke out followed by applause.", "They had been slightly nervous hearing that she was a ghost, but her elegant appearance coupled with her graceful manners earned their favor instantly.", "It was also because they were all seasoned veterans in Paradise which made them think, ‘Sure, there could be ghosts.’", "Of course, it wasn’t the case for everyone.", "Yi Seol-Ah, who hadn’t been informed in advance, had a fear-stricken face, clearly displaying her repulsion. As if she still wasn’t able to forget the ghosts she saw during the Tutorial, she showed signs of being terrified.", "But nonetheless, seeing that the general atmosphere was one that welcomed her, Flone let out a sigh of relief.", "\"Bravery… That’s excessive praise, but I thank you. This old man is called Jang Maldong.”", "As Jang Maldong requested to shake hands, Flone shook it with dignity.", "[I am honored to hear your reply. I’ve heard a lot about Master Jang.]", "As Flone pleasantly spoke like a lady from a distinguished family, Jang Maldong displayed a delighted smile on his face.", "\"Hoho, what a fine lady you are.”", "[No, no, you’re embarrassing me.]", "Intrigued by the sight of him shaking hands with a ghost, the rest of the team fought to shake hands with her too.", "\"Uh, nice to meet you… Flanaria…? Anyways, I’m Chung Chohong.”", "[Yes. You can just call me Flone.]", "\"Sure, Flone. That’s easier to remember. Hey, you’re the one who helped us during the war, right?”", "[If you’re talking about flying, then yes.]", "'I should have introduced her sooner.'", "Seol Jihu was pleased to see Flone talking with his teammates, who were gathered around her.", "Chohong laughed and asked a question.", "\"Ahha. I really have something I want to know. Just how did you end up sticking with Seol?”", "The mood was definitely great.", "\"Ah, that? I’ll tell you. You know the Forest of Denial, right? Do you remember the ghost inside the grave?”", "\"The ghost inside the grave…?\"", "Chohong’s eyes widened. Simultaneously, Hugo, who had been giggling, smitten by Flone’s beauty, suddenly froze.", "They had heard she was a ghost, not an evil spirit.", "\"Seol… is she….\"", "Hugo asked with a doubtful face.", "\"T-That… evil spirit full of resentment…?”", "\"Yes.\"", "\"The one that… ripped apart… Samuel’s team…?”", "And then.", "\"Yep!\"", "The moment when Seol Jihu affirmed with a bright face…", "\"Heuk!\"", "Chohong let go of Flone’s hand and convulsed as she collapsed backward.", "\"Ahhhh!\"", "Hugo ran out, screaming.", "\"Mommy!\"", "He didn’t know why, but even Phi Sora flapped her arms and ran away.", "As soon as the Forest of Denial was mentioned, everyone shot out at breakneck speeds.", "With a stunned face, Seol Jihu stared at the two that kicked the door open to escape and Chohong, who was still convulsing on the ground.", "'What… if you all just run away…’", "Worried about having her feelings hurt after she had barely mustered up the courage, Seol Jihu turned to glance at Flone. Then he made an extremely bewildered face.", "Flone… was laughing. As if the situation caused by her appearance was funny, her lips curled up. And turning to look at Yi Seol-Ah, who was trembling and staring at her with tears welled up in her eyes, Flone’s eyes started to shine.", "\"F-Flo—”", "Before Seol Jihu could say anything, Flone made a mischievous face.", "[Whooooo~!]", "When she floated towards Yi Seol-Ah with her arms extended in front of her, the latter sprang up with a shrill scream.", "\"Kyak! Kyaaa! Kyaaaaah!”", "[Oohhehehe.]", "Yi Seol-Ah wildly flailed her arms around, desperately running for her life, while a giggling Flone chased after her. Jang Maldong who was witnessing all this looked like he had received a culture shock.", "Seol Jihu listlessly stared at the office that had suddenly fallen into chaos. The almost heartwarming scene suddenly falling apart was enough for him.", "[I heard that the youngest daughter of the Rothschear House is a pampered tomboy.]", "Recalling Roselle’s words, Seol Jihu wrapped his face in his hands.", "\"She’s just like Casper.”", "The fact that at least Marcel Ghionea had remained calm was somewhat comforting.", "\"You don’t seem to be afraid of her, Mister Ghio.”", "\"It’s Ghionea. And she’s only a ghost in the end.”", "Marcel Ghionea calmly corrected him before letting out a small laugh.", "\"And it’s shameful to be afraid of a ghost as a man.”", "Then he asked a question as if he suddenly remembered something.", "\"Oh right. Leader, won’t you go to Scheherazade today?”", "\"Scheherazade?\"", "He was just about to bring it up, so hearing Marcel Ghionea mention it before he could, made Seol Jihu ask back with a surprised face.", "\"Yes. The capital's auction house is the largest… Actually, Chohong and Hugo are impatient to use their money. They said Miss Maria would also tag along.”", "[Scheherazade? I’m going! I want to go too!]", "Flone suddenly barged in between them.", "\"Hieeek!\"", "The frightened Marcel Ghionea performed a Bongsan mask dance while hastily retreating.", "\"….\"", "Seol Jihu just laughed.", "After giving up, everything seemed funny.", "The storm-like morning eventually passed.", "Around noon, when the team had all calmed down, Maria visited the office just like Marcel Ghionea had said.", "\"Oh~ Hohoho~!”", "Maria looked significantly different from before. She sported a black pair of sunglasses with a fur shawl draped around her neck, and over her body was an expensive-looking mink coat.", "And to top it all, she carried a glossy Saint Laurent college bag.", "No one could even force out a compliment seeing an 18-year-old girl dressed up like a rich middle-aged wife.", "\"You… What is all that?\"", "It was to the point that Chohong asked her, baffled.", "\"Ah~ This?\"", "Maria spread open both her hands as if she had been waiting. There were jewelry rings studded with diamonds and other colorful gemstones on all ten of her fingers.", "\"It’s just~ You know~ I only sold a single gold bar and converted it into cash~ A total of 10 million dollars in addition to exactly 1,987 dollars was deposited into my bank account~”", "After wriggling around her fingers some more, Maria slipped off her sunglasses and gave a smile.", "\"So I moved to a new house~ Bought a new car~ And I guess I slightly splurged?”", "She curled up her lips and covering her hand, she laughed.", "\"Oh~hohoho~ hohohoho~ hohohoho~hohohoho~!”", "'Isn’t it tiring laughing like that?’", "As Seol Jihu stared at her with awkward eyes, Chohong smirked and slyly asked.", "\"Hey, you must be feeling good after earning a lot of money.”", "\"Of course~! I feel amazing~!\"", "\"Then, how about you pay for lunch today? Cool?”", "\"No.\"", "Maria immediately became solemn and sharply refused. Her voice was firm.", "\"I knew you’d be like that. That scrooge nature of yours didn’t go away.”", "Chohong shook her head.", "Laughing inwardly, Seol Jihu got up from his seat.", "\"Let’s go. I’ve called a carriage.”", "A moment later, the six individuals and one soul boarded a carriage headed for Scheherazade.", "*", "\"Oh, Noonim. Have you just arrived?”", "A curly-haired young man got up from his seat to warmly greet her.", "\"Yeah. I was a bit late.”", "Kim Hannah cooly replied and gave a thin smile. She observed the young man sitting at what had been her desk not long ago.", "\"It suits you well.\"", "The curly-haired young man, Shin Hansung, awkwardly laughed and scratched his neck.", "\"I’m not sure. I don’t know what suddenly happened…\"", "He avoided her eyes and shrugged.", "\"Anyway, why were you so late? I thought you’d come immediately after talking with the HR director.”", "\"I had a lot to do.”", "\"Still. Because you didn’t come even after I waited a couple of days, I went ahead and figured out what I had to do by myself. You don’t need to teach me anymore.”", "\"Oh my. Are you being considerate of me?”", "\"Whatever you think. Oh right!\"", "Shin Hansung opened a drawer and took out a communication crystal. A faint light was swirling inside the crystal. A glint flashed across Kim Hannah’s eyes.", "\"Where is this crystal connected to? There was no label on it and it kept ringing so I kept wondering whether to pick up or—”", "Tak. Kim Hannah snatched the crystal off of his hand before Shin Hansung finished talking.", "\"N-Noonim?”", "Shin Hansung’s eyes widened. He flinched seeing Kim Hannah’s expression.", "After smacking his lips for a while, he let out a deep sigh.", "\"…Noonim.\"", "\"….\"", "\"I know what you must be feeling right now, but… I don’t think our superiors made a rash decision.”", "Kim Hannah fell silent. She merely stared at Shin Hansung with a subdued face.", "\"I’ll be frank with you. Noonim, you’re staying silent only because you have something you’re guilty of. You didn't even try to explain yourself.”", "\"Did I say anything?\"", "Because she was clenching her teeth, a forced voice leaked out.", "\"This is mine. It’s a personal communication crystal.”", "After snapping at him, she turned her body around.", "\"Noonim!\"", "Shin Hansung hurriedly shouted.", "\"You’re not really planning to leave Sinyoung, right?”", "But Kim Hannah did not reply. She didn’t look back nor did she stop her steps.", "\"You know it too! If you resign like this, even before you leave Scheherazade—!”", "She continued walking in her high heels, tightly clenching the communication crystal.", "In her slightly bloodshot eyes, deep resentment welled up like tears.", "Meanwhile, at the same time…", "\"We’re here!\"", "\"Oh, Scheherazade!”", "The Carpe Diem team arrived at Scheherazade.", "\"What now? Go straight to the auction house?\"", "\"No. It’s too early. Don’t you know that the climaxes of auction houses happen in the evening?”", "\"Aii, President Chung, what’s the worry? We can go take a look right now and visit again in the evening.”", "\"Ah, why are you in such a hurry? What I mean is, let’s find an expensive place to stay, dine at a fine restaurant, and live life a little.”", "With each of them carrying their backpacks, they had a heated debate before eventually turning to Seol Jihu.", "\"Hey, Seol! What do you want to do?”", "\"Me?\"", "Looking up at the tall building towering in the center of the city, he directed his gaze down. He put his hand inside his pocket and dug out a communication crystal.", "\"I….\"", "He trailed off and tightly clenched the clear crystal.", "It was the entrance of the Rabbit Prince here to rescue the Fox Princess from danger.", "1. A watermelon-sized egg-like thing appears in this story as well and eats things. "]}