{"cid": "405", "title": "Chapter 405. For the End (3)", "content": ["Yun Seohui signed the contract and passed the pile of papers to the left.", "The middle-aged man, neatly dressed in a suit, bit his lower lip.", "But he couldn’t possibly resist as his boss had already signed before him.", "Finally, the man took the pen out of his pocket and signed the contract papers.", "The same thing repeated. The next recipient signed the documents and handed them over to the person next to him.", "As the pile of contracts moved from left to right, Seol Jihu and Kim Hannah stared at Yun Seohui.", "They pretended to be calm, but the truth was that they were confused.", "They had spent days without any sleep preparing for this meeting, so it felt strange that Yun Seohui accepted their terms without a single objection.", "‘Could it be that….’", "With a light frown, Kim Hannah carefully went over Yun Seohui’s words in her head.", "[Sinyoung made a tentative conclusion concerning this case a few days ago.]", "This meant that Sinyoung had already reached a decision, even before this meeting.", "This was proven by the fact that Sinyoung’s executives were signing the contracts without any resistance, although their faces did look grim.", "‘But why?’", "But this logical conclusion confused her even more.", "The Yun Seohui is surrendering without putting up even a token resistance? Really?", "As new questions arose, the pile of contracts reached the far right, and when the last person finished signing, it was delivered back to Yun Seohui.", "Yun Seohui checked the documents one by one and handed the pile over to her assistant.", "Seol Jihu looked down at the pile of contracts that Yun Seohui’s assistant had carefully placed before him.", "Flip, flip! He quickly flipped through the papers, his eyes scanning the signatures, before raising his head again to look at Yun Seohui.", "“There’s something I want to tell you if you don’t mind.”", "Their eyes met and Yun Seohui gave a weak smile.", "“It might be a little, no, a lot childish, but… Can I?”", "Seol Jihu tossed her a little nod.", "“We—I don’t hate Valhalla.”", "She doesn’t hate Valhalla?", "One of Seol Jihu’s eyebrows slowly lifted.", "She was right. It did sound childish.", "“I’ve never felt envy or hatred towards Valhalla, nor have I ever considered you my rival. Because the achievements Valhalla has made in recent years are not something that Sinyoung can match.”", "Yun Seohui spoke in a low but articulate voice.", "“Of course, I understand this is sudden and that it may be hard for you to believe me. I have no excuse for that. However….”", "She let out a sigh and cleared her throat.", "“If I really thought badly of you… I would have done something about it a long time ago. Not only in Paradise but also….”", "Seol Jihu’s eyes sharpened.", "Yun Seohui didn’t finish her sentence, but he heard the words she didn't say loud and clear.", "‘But also on Earth.’", "“People who have earned grudges in Paradise often face threats on Earth. It’s a very common occurrence.”", "The atmosphere grew stifling, but Yun Seohui continued without a flinch.", "“You wouldn’t know what happened or how many attempts have been made since the last banquet was held a few years ago, and since you started making a name for yourself in Paradise….”", "Seol Jihu didn’t visit Earth often, but when he did, he never received any threat from anyone.", "Yun Seohui was saying that Sinyoung had been protecting him all along.", "“I’m not saying this to impress you or to convince you to go easy on me. I’m merely stating the fact that I had many chances to betray you, but I chose not to.”", "A faint smile spread across Yun Seohui’s face.", "“Because the thought has never once crossed my mind. I admired you, Representative of Valhalla, for all the incredible achievements you made for the sake of Paradise. I wanted to become your friend and help you in any way I could.”", "She slowly lowered her gaze and continued.", "“Of course, my opinion is mine alone…. There were a few people in Sinyoung who disagreed with me. I saw these people every day, but failed to notice what was going on inside their heads.”", "Yun Seohui closed her eyes.", "“In regards to that… I have no excuse to offer.”", "“So I made my decision before this meeting to let you know my feelings and set the record straight.”", "“Even if it means I have to accept every term that Valhalla offers.”", "With that Yun Seohui slowly rose from her chair.", "And she spoke.", "“I’m sorry.”", "She straightened her shoulders…", "“I apologize for the distress and the hurt caused by the recent series of incidents.”", "Clasped her hands in front of her waist…", "“From now on, Sinyoung will do its best to prevent the recurrence of such incidents.”", "And starting at her head…", "“And I promise in the name of God Invidia to faithfully fulfill the conditions set by Valhalla until your misunderstanding is resolved.”", "She bowed 90 degrees, in a polite and humble manner.", "*", "Their meeting ended much earlier than they had expected.", "Seol Jihu tried his best to stay alert until the end, but Yun Seohui’s subsequent remarks made him feel like he was overreacting.", "Yun Seohui promised to get signatures from each of Sinyoung’s employees, and with several executives, she took the time to apologize to each member of Valhalla.", "In the end, she shook hands with Seol Jihu, and, with a shy smile, asked if they could finally be friends.", "Before leaving, Seol Jihu observed Yun Seohui with his Innate Ability.", "She was still shining in five colors, like the last time he saw her.", "But more importantly….", "[5. Level of Cognition]—Enterprising (Takes the initiative in achieving one’s goal)—Given up—Chaotic (Many things are jumbled up and is impossible to unravel)", "The second slot of her Level of Cognition, which represented the emotion she was currently experiencing, stated ‘given up’.", "What exactly had Yun Seohui given up during this meeting?", "Seol Jihu couldn’t find the answer to that question even after the meeting was over.", "On their way back, the members of Valhalla were all in high spirits.", "The Sinyoung had given in to their demands. How could they not be glad that it was over?", "“Hey, did you see that? Did you? Sinyoung’s executive director just bowed to us!”", "“Bastards. That’ll teach them not to mess with us.”", "Chohong and Hugo cackled merrily.", "“I don’t know. Something did feel a little off…. When I was in White Rose, I never imagined something like this could happen.”", "Phi Sora seemed skeptical and a little worried.", "Hugo tilted his head in question.", "“What’s wrong? She apologized. And she’s super pretty.”", "“Look, if a pretty face could automatically earn forgiveness, I’d be making a living as a notorious criminal by now.”", "“But she signed the agreement. Which means she can’t mess with us now, right? Because of the consequences.”", "“Well, yes….”", "Even Phi Sora couldn’t find any fault with that.", "“I mean, she did swear on her god as a priest…. And our representative basically backed her into a corner…. Makes me think she’s smart, though I’m still not sure if her apology was sincere.”", "She shrugged, concluding that it wouldn’t be a bad idea to keep an eye on Yun Seohui for a while.", "“…”", "Oh Rahee stood staring at the Scheherazade Palace with cold eyes.", "One of her eyebrows raised slightly to reveal her annoyance.", "She stared and stared until their carriages arrived, then felt Seol Jihu’s gaze and turned towards him.", "“What?”", "“What are you thinking about?”", "“…Nothing.”", "Oh Rahee ran a hand through her hair with a sigh.", "“I just remembered someone from my past.”", "“Your past?”", "“A high school friend. We were part of the same group of friends that did everything together.”", "The topic was unexpected and her tone wasn’t a happy one.", "“Yun Seohui reminds me of that bitch…. The way they talk and the way they act, it’s basically the same.”", "She frowned angrily at the thought of her friend.", "“How are they alike?”", "“How should I describe it? They both have a mask. It’s like… they’re fake, or artificial….”", "Kim Hannah, who was standing next to Seol Jihu, threw a quick glance at Oh Rahee.", "“I can’t pinpoint exactly what’s wrong. Something about them annoys me, but I can’t say what for sure.”", "Oh Rahee shook her head, saying that some of her friends still think of that particular friend as a bright and outgoing person.", "“Anyway, I don’t want to be anywhere near her. It’s the first time I’ve felt this way about someone since Baek Haeju.”", "Oh Rahee, who spat in the direction of the palace, turned towards the carriage.", "“Are you still friends with her?”", "Seol Jihu blurted out.", "Oh Rahee stopped.", "“…Nope.”", "She turned towards him with a little smirk.", "“I cut ties with her a long time ago. It was the best decision of my life, without a doubt.”", "With a smile on her lips, Oh Rahee climbed onto the carriage.", "Seol Jihu followed after her, feeling somewhat restless.", "He couldn’t relax even after settling down in the carriage.", "The result wasn’t bad at all.", "Sinyoung readily accepted Valhalla’s terms, and the signed contract was in his hands.", "She could no longer conspire against Valhalla, at least in Paradise.", "Still, he just couldn’t put his mind at rest.", "After pondering for a while, Seol Jihu concluded that the reason he was anxious was because of his preconceptions about Yun Seohui.", "Come to think of it, Kim Hannah wasn’t the only one who warned him about her.", "[Be careful of Yun Seohui.]", "Black Seol Jihu had said the same thing.", "There must have been a good reason for such a strong-minded and cautious man to say such a thing.", "He also recalled the time he looked at Yun Seohui with Future-Gauging Nine Eyes during the opening ceremony.", "[What’s your reason?]", "[Why does our mighty Spear Demon—why does he hate me so much?]", "[I know you have a grudge against Sinyoung. But don’t you know how hard I tried to ease your heart?]", "[How could you do this to me?]", "[Kill me. Just kill me instead!]", "The words Yun Seohui screamed at Black Seol Jihu….", "[You didn't do anything for me. It was for Sinyoung.]", "[You used my strength to protect your company, and I used you to achieve my goals.]", "[That’s why you threw away everything and desperately clung to me.]", "[Sung Shihyun told me you were a crazy bitch right before he died at my hands. He was right.]", "The words Black Seol Jihu said to Yun Seohui….", "[You got discarded, didn’t you?]", "[I guess you couldn’t enter his fence~]", "[What did I tell you? He’s an uncontrollable lunatic.]", "[You want to, what, break it if you can’t have it? Is that it?]", "And the words Kim Hannah spat at Yun Seohui. He remembered them one by one.", "In Seol Jihu’s opinion, Yun Seohui was definitely not normal.", "She was unpredictable and totally uncontrollable, as evidenced by the fact that she once switched sides to join the Parasites.", "But that was in the past.", "Knowing her present self, Seol Jihu was reluctant to draw conclusions.", "Because….", "‘Yellow, Green, Blue, Indigo, Violet.’", "Yun Seohui was a woman of five colors.", "He had seen her become an enemy. But he had also seen the exact opposite of that.", "The future in which Yun Seohui, standing beside him as the Executor of Invidia, the Star of Envy, waving her hand at the crowd as they cheered her name.", "‘Maybe.’", "Maybe it was already too late.", "Seol Jihu had forced Yun Seohui to sign the contract and Yun Seohui accepted it.", "The contract basically specified that he chose Yun Seora over Yun Seohui.", "‘…I don’t know.’", "“What’s wrong with you? Are you okay?”", "As Seol Jihu rubbed his forehead, Phi Sora leaned closer and asked.", "Seol Jihu shook his head without a word.", "“Now this is a rare sight. You must really be tired. Do you have a headache? I think the carriage will leave soon. Maybe you should get some sleep, or…. Do you want to lean on me?”", "Phi Sora tapped her shoulder lightly and Seo Yuhui, who was sitting across from them, got up in a hurry.", "It was then.", "“We’re leaving!”", "Just as the wagoner lifted the whip, a hurried knock was heard and the carriage door swung open.", "Not only Seol Jihu but also Phi Sora, and Seo Yuhui, who was forcibly pulling up Phi Sora from her seat, widened their eyes.", "There, a stranger stood, dressed in an oversized cloak with a hood, fidgeting nervously.", "The stranger looked at Seol Jihu and spoke in a hurry.", "“Excuse me, but could you….”", "A thin but low voice escaped the stranger’s lips.", "A moment later, the carriage set off.", "*", "The carriage pulled by four Horuses passed through the eastern gate.", "Half an hour later, the wagoner suddenly changed the direction of the carriage.", "The carriage spun around to the left and headed back towards the city where it had just left.", "This time it moved towards the western gate, instead of the southern gate.", "Soon the carriage stopped at a secluded spot near the gate, and two people in hooded cloaks got off the carriage and began walking towards the city.", "“…Hold on.”", "As Scheherazade neared, Seol Jihu stopped the hooded figure in front of him.", "“Pardon?”", "“Sorry. I just think this will be better.”", "“What do you m…. W-Wait!”", "Seol Jihu literally swept the stranger off her feet, and the stranger wriggled in response.", "“Hold tight.”", "He wrapped his arms around her and raised his mana.", "Tong!", "With the sound of air exploding, Seol Jihu’s body scattered like the wind.", "Tong, tong, tong, tong!", "The wind climbed the castle wall and blew into the city, towards the back gate of the Scheherazade Palace."]}