{"cid": "278", "title": "Chapter 278. Winter’s Struggle (3)", "content": ["As Kim Hannah guided a person into the reception room, Seol Jihu got up from his seat delightedly.", "The guest was a thin, brown-skinned man wearing a white turban.", "“Mister Tong Chai!”", "“It’s been a while.”", "The man was Mister Tong Chai.", "“This building sure is huge. Are you really the owner of this place?”", "“It somehow ended up that way.”", "“Well, you distinguished yourself from the rest even when you were in the Neutral Zone. It feels like it was just yesterday that I was completing the missions with you. This is bringing back old memories.”", "The two men sat down around a table and caught up.", "“I was greatly surprised hearing that you personally visited our branch in Eva.”", "“We needed an intelligence agency in the city.”", "“Isn’t there Red Hwaru? Seeing as how you kept them alive, we thought you would use them to gather information.”", "“The intelligence group I want is one that will easily encompass a district. Red Hwaru will step down soon and go under Dongchun Merchants.”", "In other words, the Assassination Guild was an organization that fit Seol Jihu’s criteria. A joyful smile spread on Tong Chai’s face.", "“But still, asking if we would be interested in being in charge of a district. Do you know how shocked the branch head was when he heard that?”", "Tong Chai guffawed, saying that Seol Jihu was just as generous as ever. Seol Jihu also smiled faintly. Just like Tong Chai said, the branch head had quite a face when he heard the news.", "Although the Assassination Guild had branches in all cities, their branch in Eva was no different than a small candy shop. Because the Eva Alliance suppressed them thoroughly, they were only barely managing to sustain themselves.", "Then one day, a golden pumpkin, the size of a house fell from the sky. How could he not be surprised?", "The astonished branch head relayed the message to the guild’s headquarters, telling Seol Jihu to hold on just a moment, and the Assassination Guild HQ rejoiced and accepted the offer with open arms.", "Although they had to agree to the condition that Eva’s branch would be under Valhalla’s influence, that was an obvious thing. Given the scale of the operation, the branch would basically assume the same role as an organization, so there was no reason for them to refuse.", "Just like that, Valhalla and the Assassination Guild formed a cooperative relationship of mutual dependence.", "“Thank you for mentioning me. My status rose because of it, and I can finally live standing tall.”", "“Though it’s late, I should thank you too. When the baseless slander was made against us in Haramark, the Assassination Guild was the only place that defended us.”", "“There’s nothing to thank about. We only wrote the truth as is.”", "Tong Chai spoke as if it wasn’t a big deal, but it wasn’t as easy as it sounded. With a mysterious organization clearly responsible for the incident, only an entity with strong backing would be able to publicly issue a rebuttal article.", "In truth, it wasn’t so easy to form a relationship with an organization of the Assassination Guild’s caliber.", "“Ah, by the way, can we talk about the task you commissioned us?”", "“Of course. I’ve been waiting to hear back.”", "“Then we will begin with the basic info. Eun Yuri, a March 2016 trainee from Area 1. The Neutral Zone back then took part in two different places between the 17th and the 18th, and although Eun Yuri failed to enter Paradise, she was invited by Nur’s White-Haired Witch organization and participated in the 17th’s Neutral Zone.”", "Tong Chai continued without taking a breath in between.", "“She supposedly did not do anything to stand out during the Tutorial. It was the same in the Neutral Zone. Up until this point, she sounds like a trainee that can be found in any Neutral Zone… but there is one noteworthy thing.”", "“And what’s that?”", "“The day the Awakening Chamber opened.”", "Although sandalwood was fragrant even as a seed leaf, Earthlings were different, and the value of trainees could not be determined from just the Tutorial.", "Like Shin Sang-Ah, there were many cases where an Earthling would turn their lives around after obtaining their class.", "“According to witness testimony, Eun Yuri was extremely tired after leaving the Awakening Chamber. While she was not sweating, her hair and clothes were drenched, and her legs were shaking profusely as if she was struggling to continue walking.”", "Tong Chai described the situation back then in detail. Seol Jihu rubbed his chin as well.", "‘It was hard for me too.’", "Odelette Delphine, who was given the Magician class, said she felt like she was impregnated. However, not everyone shared the same experience. Those with low mana levels came out comparatively unfazed.", "“Although there is no way to confirm, we believe Eun Yuri received the Priest or the Magician class.”", "“And she abruptly died the day she got her class?”", "“Mm, it’s common for trainees to die during the Neutral Zone’s missions, but it isn’t as if there aren’t strange points. Think about it. Once the trainees receive their class, they form teams and challenge a higher difficulty mission.”", "“Yes, we did the same.”", "“Of course, we have to consider the fact that Eun Yuri did not have teammates before her awakening, but what is strange is that she died that night challenging a Normal-difficulty mission alone.”", "It would be a different story if she were a Warrior, which were a dime a dozen. A Magician or a Priest were highly desired even by Paradise’s veterans. As long as she revealed her class, every team would have lined up to recruit her.", "Tong Chai took a small pause before continuing.", "“We tried to contact the Earthlings who served as the manager and instructors at that time. We managed to find an involved party.”", "“Oh? Who?”", "“She participated as the Neutral Zone’s instructor.”", "“What did she say?”", "“I asked, but she set two conditions.”", "Tong Chai continued lightheartedly.", "“The first is to see Valhalla’s representative and talk to him directly.”", "“Directly?”", "“She seemed hesitant to let others know. Furthermore, she said she does not know the whole truth, only something that she found suspicious. In other words, she cannot guarantee that her information is the truth.”", "“…What is the second condition?”", "“She asked for 20 silver coins in exchange for the info. Though she called her info a rough guess, she said it was a fair price given that she heard and experienced them herself.”", "10,100,000 won. Though it seemed a little expensive for a few words, Seol Jihu could easily pay that amount.", "“What do you think, Mister Tong Chai?”", "“It’s not really credible, but if you have time, I think it will be good to meet and talk to her.”", "“Can I know why you say that?”", "“Because this person might not be who you expect. Of course, in your perspective, Valhalla Representative.”", "Seol Jihu tilted his head in curiosity, but Tong Chai only laughed.", "“I apologize, but I cannot reveal her identity until you give the confirmation that you will meet her. For organizations dealing with intelligence, trust is akin to life.”", "Seol Jihu clicked his tongue.", "“I guess there’s no other choice then. When can I meet her?”", "Tong Chai grinned.", "“If you’d like, today.”", "*", "Just like Tong Chai said, the mysterious involved person visited Valhalla that night.", "Seol Jihu, who was waiting alone in the reception room, saw Marcel Ghionea guiding a beautiful woman inside. Judging by her tall height, blonde-hair, and Western appearance, she looked to be European.", "“Hello…”", "Hearing her somewhat timid greeting, Seol Jihu replied with a bright smile.", "“Welcome. I’m Seol Jihu. And you must be…”", "“Yes, as you must have already heard, I’m Evangeline Tonya.”", "Evangeline Tonya.", "He was suspicious when he heard the family name, but as he thought, she was Evangeline Rose’s younger sister.", "Hearing Evangeline Rose’s name again made him feel a little strange. Ever since he came to Eva, he was getting involved in things related to her either directly or indirectly.", "She wasn’t even alive as she had died in the Banquet.", "“I didn’t think you would ask to see me directly. It might be awkward for you, after all.”", "“If you are talking about Evangeline disbanding, I’m perfectly fine with it.”", "Tonya said quietly.", "“In fact, I want to thank you for it. Though it’s a shame to see my older sister’s organization disappear, that’s a hundred times better than seeing it get dirtied. I’m especially happy with Jung Sua losing her position. I’d like to give you a standing ovation for that. Bravo.”", "Seol Jihu wouldn’t blame her if she resented Valhalla, but it didn’t sound like she was hostile toward them at all.", "“I’m glad to hear that.”", "Then, Seol Jihu suddenly tilted his head.", "“Um… have I seen you before…?”", "“You might have seen me fleetingly during the Banquet.”", "“The Banquet… Ah, in Stage 2.”", "“Yes.”", "Tonya smiled feebly.", "“Unni sent me out in exchange for going into the Plaza of Sacrifice for reconnaissance.”", "“Yes, what a shame. She’s doing well though, right?”", "Hearing this, Tonya’s complexion became noticeably darker.", "After a moment of silence, she said in a barely audible voice.", "“She’s dead.”", "“…Pardon?”", "“Unni committed suicide on Earth immediately after she died in the Banquet.”", "Seol Jihu doubted his ears.", "“It was my fault.”", "Tonya bit her lips and scowled.", "“I know it’s an excuse, but I never thought Unni would commit suicide. She was an outstanding person. I thought she would clear the stage like a walk in the park and return home. Just like always.”", "The edges of her eyelids reddened as well.", "“Although I hurried back home after stage 2 ended and heard the news, but…”", "Eventually, she sniffled and covered her face with her hands.", "“It was a nightmare. The house reeked, her feet were hanging in midair, her tongue was out all the way to her chin…”", "She began to weep, unable to finish her recollection.", "Seol Jihu became speechless. Evangeline Rose had hung herself?", "Though he found it hard to believe, he didn’t think Tonya was lying, judging by how agonized she was.", "“I knew Unni was overly obsessed with Paradise. I should have gone back to Earth as soon as I left the Banquet just to be safe…”", "Excessive obsession.", "Hearing this phrase, Seol Jihu’s heart sank. He opened his mouth with an awkward look.", "“I’m sorry, I shouldn’t have asked.”", "“No, it’s fine.”", "Tonya wiped her tears and shook her head.", "“I’m actually happy that you asked. Other than Charlotte Aria-nim, no one asked what happened to Unni on Earth… cough.”", "Tonya suddenly coughed, then shut her eyes. Seol Jihu patiently waited.", "“…Excuse me.”", "Only after a long while did Tonya seem to have calmed down a bit. She spoke while breathing roughly.", "“Before I answer, I want to reaffirm the conditions I made.”", "“Of course, I remember it well.”", "Seol Jihu took out 20 silver coins and placed them on the table.", "“All you have to do is answer a few questions and go back with the reward.”", "Tonya relaxed. She finally looked ready to talk.", "Seol Jihu spoke straightforwardly.", "“Is Eun Yuri’s death related to some kind of tampering?”", "“I’m not sure.”", "Tonya replied calmly.", "“But as someone who was involved, I can say with 90 percent certainty that, that is the case.”", "“But you aren’t completely sure.”", "“No. I only did as I was told. I wasn’t told what was going on in the background.”", "‘As she was told?’", "Seol Jihu furrowed his brows. Tonya sighed.", "“Unni’s personality was like that. She didn’t trust others easily and always tried to do things alone.”", "“Wait, by Unni, you mean…”", "“Yes, I’m talking about my older sister, Evangeline Rose.”", "Tonya cleared her throat.", "“She must have entrusted me with this task because she trusted me as her young sister. It wasn’t anything important though.”", "“You make it sound like Miss Evangeline Rose made contact with Eun Yuri for the purpose of tampering.”", "“I won’t defend her.”", "Tonya said in a gloomy tone.", "“Tampering was something that everyone did back then. Although it is no longer possible, the White-Haired Witch organization was suspected on multiple occasions to have tampered with the Neutral Zone’s trainees.”", "In a way, this was unexpected. However, Seol Jihu quickly regained his calm.", "“What role did Miss Tonya play in the Neutral Zone?”", "“I worked in the cafeteria. Many trainees came in and out every day.”", "“You said Miss Evangeline Rose entrusted you with a task. What task was it?”", "“Just a minor matter. She asked me to secretly hand Eun Yuri a message. Because she came near the end of the dining hours, it was nothing difficult.”", "“Did you see the contents of the message?”", "“No, I didn’t. Unni strongly emphasized that I do not look at it.”", "Just like Tonya said, she had the evidence to back her conjecture. Seol Jihu asked another question.", "“Why do you think Miss Evangeline Rose was interested in an insignificant trainee like Eun Yuri?”", "Tonya went silent for a little while before saying.", "“I think it was because of her discerning eye.”", "“Discerning eye?”", "“Unni was an Archer. It isn’t strange for her to have a discerning eye ability. But I would like to tell you that Unni’s senses were very special.”", "“She was good at recognizing major talents. Was it something like that?”", "“Mm, I don’t know….”", "Tonya tilted her head.", "“How should I say this, rather than seeing people or objects and categorizing them, she could pick out whether they were good or bad… I guess you could say she had good intuition.”", "“Intuition, huh.”", "“She was like that ever since she was little. But her senses developed even more when she entered Paradise. It isn’t just once or twice that we benefited by trusting her intuition.’", "‘An Innate Ability!’", "Seol Jihu naturally thought this after hearing Tonya’s explanation. He couldn’t deny the possibility. After all, he himself had a similar ability.", "Although Tonya said she never thought her older sister would die, Seol Jihu felt like he knew why. He had also almost gotten himself killed after seeing the Attention Required color and rushing in.", "‘Maybe she trusted her intuition too much.’", "The Nine Eyes was also a matter of choice and probability. It was not omnipotent.", "“So because of those two reasons, you’re saying that…”", "“No, there’s one more.”", "Tonya spoke.", "“All I know for certain is that Eun Yuri died shortly after I gave her the message. I do not know what happened in between. But, I was suspicious of Unni back then, and because I was so curious, I asked her.”", "“Based on what you’ve told me so far, I doubt she said anything.”", "“You’re half-right and half-wrong. She normally wouldn’t have said anything to me, but that day, she actually said one thing.”", "“What did she say?”", "“She said, ‘I knew my intuition wasn’t wrong.’”", "Seol Jihu unwittingly stopped breathing.", "“She also looked really happy. Unni limited revealing her emotions, so I remember it clearly.”", "Tonya spoke with clarity.", "Seol Jihu gulped. Although there was no physical evidence, the circumstantial evidence made it clear that there was something between Evangeline Rose and Eun Yuri.", "‘It really is a fair price.’", "Seol Jihu didn’t think the 20 silvers were wasted at all. However, what she said was also circumstantial evidence that could not be verified.", "20 silver coins were the perfect price, and that’s what made it more credible.", "“With that, I told you everything I know. Do you have any more questions…?”", "Hearing Tonya, Seol Jihu snapped out of his daze.", "“No, that’s good enough.”", "“Then…”", "“Yes, you can leave. Thank you for your assistance.”", "“No problem. I’m glad to have helped.”", "Seol Jihu pushed the money pouch on the table forward.", "Tonya bowed before taking the pouch and getting up.", "*", "Seol Jihu remained in his seat even after Tonya left.", "‘Eun Yuri, Eun Yuri…’", "There was only one reason Seol Jihu was thinking so hard. He wasn’t sure Eun Yuri was someone worth bringing by using a Divine Wish.", "Seol Jihu was also human. He didn’t want to spend the contribution points he worked so hard to gather carelessly.", "There was less than a fifty percent chance. If she was a Priest and not a Magician, then he really would have wasted his time, effort, and money.", "Even if she was a Magician, he would feel bitter if her aptitude was subpar.", "He would feel much better if he could find Eun Yuri and view her through his Nine Eyes, but unfortunately, General Observation did not work properly on Earth.", "He had tested it out before on a few random passersby, and perhaps because they had not gone through the Tutorial, he could not see any Status Windows.", "It wasn’t as if he could make judgments based on her color either.", "‘Let’s suppose we invite her. What are the potential benefits…?’", "It was then. Just as he was in deep thought…", "‘Eh?’", "A single thought flashed through Seol Jihu’s mind like a ray of light.", "‘Wait.’", "His eyes widened, and his jaw dropped.", "“Right… Why didn’t I think of this…?”", "Murmuring to himself with a dazed look… Tang! He slammed down on the table and got up.", "“Argh, damn it, Kim Hannah!”", "Then, he quickly left the building, blaming Kim Hannah, who wasn’t even present, for some reason."]}