{"cid": "29", "title": "Chapter 29. Looking Back (1)", "content": ["When Seol returned to the Neutral Zone's plaza, he was met with the sounds of people taking huge gulps. They looked like they had just seen a ghost.", "That was quite understandable. The longest he took to clear a mission was only around five minutes. Yet, he took several hours this time, so people were thinking that maybe he met an accident and got killed, whether through carelessness or by a mistake.", "But, here he was, unharmed and healthy as if to taunt everyone looking on.", "“Ha, ahahahaha!!” ", "Seol tried to clarify what happened, adding that it was all just a misunderstanding. That only caused Hyun Sangmin to beat the floor while laughing his head off.", "“The s, skeleton k, killed itself…. Ahahaha….” ", "Even Shin Sang-Ah was in tears as she joined in on laughing, her breaths eventually running ragged and short.", "Seol found this scene a bit mystifying. Only two months had passed since the ending of the Tutorial. Yet, these two seemed to have gone through a rather remarkable transformation. ", "Perhaps it was their new outfits, but even their aura seemed to be different. ", "Shin Sang-Ah and Hyun Sangmin laughed their hearts out and then complained how difficult it was to talk to him for the last couple of months, never mind even seeing his face. So, the three of them chatted for a long time.", "Hyun Sangmin's class was 'Archer'. His quick wits and that active personality of his combined to make the decision to not hold back on spending his SP as soon as the Awakening was completed. ", "As a result, he got a head start over his peers in earning more Survival Points, and now he was known as a quite skillful survivor.", "Although the team he worked with wasn't as amazing as Odelette Delphine's, Hyun Sangmin said they were steadily clearing missions.", "As for Shin Sang-Ah, her life turned for the better after the Chamber of Awakening opened up. Her Priest class was a highly sought-after rare class, only losing out to that of the Magician. Thanks to that, the moment her class was revealed, the number of teams that tried to court her couldn't be counted. Some even tempted her with the promise of advance SP payment.", "Shin Sang-Ah entered the team that offered her the most amount of signing fee.", "She was very proud of herself, saying that she was finally living like a normal human being now, only to be promptly shot down by Hyun Sangmin. He mocked her for showing off in front of Seol, who had far more points than she could ever dream of.", "Seol simply smiled while listening to their banter. Realizing that these two had adapted well and were carving out their own paths now put his mind at ease.", "“Ah, right. What about Miss Yun Seora?”", "Seol suddenly remembered about her in the midst of listening to the duo's antics and asked them offhandedly. He met up with Yi Seol-Ah and her brother, Yi Sungjin, a few times in the last couple of months, but he hadn't seen Yun Seora once.", "Hyun Sangmin stopped talking for some reason. Shin Sahng-Ah's complexion darkened at the same time. Seeing their reactions, Seol felt his heart skip for a moment.", "“….Did she die?” ", "“No, she's… more or less alive.” ", "Hyun Sangmin corrected Seol. But what he said sounded far more ominous. She was 'more or less' alive?", "“Well, she…. I think it's really tough for her. With her right arm in that state….”", "Shin Sang-Ah's voice was full of pity.", "Seol inwardly went, ‘Oh, crap.’", "Now that he thought about it, she lost her right arm's mobility for good during the treasure hunt, all thanks to Kang Seok and his cronies ambushing her. The image of her silently shedding tears next to the item draw machine floated back up to the top of his head.", "Yun Seora received around 300 SP at the end of the Tutorial. That amount was way too short to endure two months of stay in the Neutral Zone. Even if she saved up like a madman and lived frugally, she couldn't have enough to endure for more than a fortnight, at most.", "“I think the Yi siblings have been constantly helping her out until now. Ah, that's right. You also gave out some SP, didn't you? Miss Shin Sang-Ah.” ", "“It was only once, though.” ", "Shin Sang-Ah averted her gaze and hesitated slightly.", "“I couldn't heal her arm, maybe because my class level is still too low…. I tried to give her some of my points, but Miss Seora didn't want to take them. And it feels like she's been avoiding me for a little while now, too….”", "Listening to her voice getting progressively smaller, one got the impression that she was trying to come up with excuses. Actually, she was feeling ashamed for bragging about living pretty well nowadays.", "Hyun Sangmin waved his hand about and said that there was no need to act like this. It was understandable for someone like Yi Seol-Ah, who was indebted to Yun Seora for her life. However, there was no reason for someone with a self-centered personality like him to go out of his way to help Yun Seora.", "Even Seol had nothing much to say in this regard. Quite frankly, he had completely forgotten about this matter as he was too busy with the training regime until now.", "After a lengthy bout of silence went by, Hyun Sangmin slowly got up from his seat.", "“You shouldn't worry about her too much. Sure, you can help her out if you've got some wiggle room yourself, but you know this too, don't ya? That we're all equally having a rough time trying out there, trying to fend for ourselves.” ", "That was also true. It could get pretty hectic trying to survive within the Neutral Zone. Looking after someone else in this place was basically a luxury very few could afford.", "“Well, I should get going now. If we have a chance later, why don't we do some missions together? I'm confident of being more helpful to you now, you see.” ", "Hyun Sangmin lightly tapped on his crossbow and grinned.", "“Me too. If you need any help, you can call on me anytime, regardless of when. I'll cancel everything and run to your rescue.” ", "Shin Sang-Ah waved her hand goodbye as well and walked away.", "*", "After separating from the two, Seol returned to the plaza. He was planning to have a go at the remaining untouched 'Hard' mission types right away. However, he was feeling a bit restless inside. So, he figured that, by immersing himself into clearing missions, he'd be able to forget about everything for a while.", "The number of different Hard difficulty mission parchments found on the noticeboard was 11. All of them were combat missions, while the SP completion reward on offer varied greatly from 500 to 1000.", "The 'escape from encirclement' mission Seol ran to the ground just so happened to be one of the most dangerous available among the Hard difficulty. Since he didn't encounter any hardship completing that, he was confident of blitzing the remaining ones in no time.", "Some time later….", "The remaining attempts for the missions were 15 for every single type, but he only did six times each before moving on to the next one. Even still, he got to earn another 43500 Survival Points.", "'This should be enough.' ", "He could probably do more, but, after chatting to Shin Sahng-Ah and Hyun Sangmin, he decided not to monopolize. Their stories taught Seol of the harsh reality that, although completing missions became easier than before, there were very few who could afford to live as good a life as him among the survivors, even now.", "For example, if four people cooperated and completed a mission rated 'Slightly hard' worth 300 SP, the reward would be split evenly according to the number of participants. Of course, the individual survival rate would go up, but at the same time, all their hard work would only result in a measly 75 points per participant.", "The truth could be seen from the way Shin Sang-Ah described her situation – someone as in demand as her didn't say that she was rich, but merely that she was “living like a human.”", "Seol wasn't too worried about others criticizing him for hogging all the high-paying missions. But, there was this one thing he came to realize during the treasure hunt. Because he got too enthusiastic and swept away every coin he could find, Shin Sahng-Ah and Hyun Sangmin had to go through so much trouble. As for Yi Sungjin, the boy had to search throughout the night too, without rest.", "As time went on, more and more teams would start attempting the Hard missions. Since he left behind more than half of each mission types, the survivors should not complain. Not too much, at least.", "Besides, it wasn't as if there were no harder difficulty missions, either.", "[You have successfully completed a 'Hard' difficulty mission.]", "[950 Survival points have been added to your tally.]", "[Current SP: 128,780 SP]", "Seol clenched his fist tightly.", "He decided to stop doing the missions for now. There was something else he needed to do first before moving on to the next difficulty.", "The 'Very Hard' difficulty had a total of six missions. The lowest point payout was 10,000 points. That was ten times the reward of the most dangerous Hard difficulty missions. When he skimmed through the mission detail, it sounded rather challenging, as well.", "Clearly, he would need to make thorough preparations to challenge them. Not only would he need to acquire a set of armor and potions but also capable comrades.", "Right on top of the noticeboard, there was the lone 'Impossible' difficulty mission, but he didn't pay that any attention whatsoever. \nAlthough its payout was a humongous 172,800 points, the mission goal was completely, utterly absurd that no one would be able to clear it.", "Seol turned around to leave.", "There were several things he needed to prepare. But he already knew what needed to be bought first.", "*", "The eighth floor.", "As Seol stepped outside the VIP store, he had to do everything in his willpower to calm his wildly beating heart. Within his grasp were two small medicine vials.", "They were Ambrosias – the mysterious liquid that would evolve one's already awakened abilities.", "He didn't stop at that though. Even after he bought both of the available vials of Ambrosia, he still had a fair amount of SP left, so he bought a bottle of Divine Elixir, which would raise his Mana stat by one stage.", "With this, the VIP store no longer had Ambrosias or mana-boosting Divine Elixir for sale.", "All thanks to their enormous price tags, Seol's Survival Points tally dropped all the way down to 38,780 in a single breath.", "With the remaining points, he could have bought another bottle of Divine Elixir. However, he held back with what could only be described as superhuman patience. He still needed these points to purchase his equipment, after all. He thought that, after getting himself the best equipment on sale, he'd be able to earn back the points in no time.", "“Ehem.”", "However, no matter how hard he tried to restrain himself, he couldn't prevent a foolish grin from bursting out of his lips. He even momentarily thought that the entire world was blooming in a rosy color.", "'I should wait until I get to my room first…. No, no. Waiting around might invite a disaster.'", "He only had to climb up two flights of stairs, but Seol couldn't wait anymore. He drank both vials of Ambrosias in one go. Fearing that his other abilities might evolve instead, he fervently thought of 'Nine Eyes' and nothing else.", "[Your Innate ability, 'Nine Eyes' is evolving.]", "[The lower direction (1) of your Innate Ability – Nine Eyes, Black color: Escape Immediately, has been unlocked.]", "[Your Innate ability, 'Nine Eyes' is evolving.]", "[The upper direction (1) of your Innate ability – Nine Eyes, Gold color: Golden Commandment, has been unlocked.]", "Finally, he got to pull back the two layers of veil covering his ability. With this, he unlocked four out of five directions. The only one remaining was the 'right'.", "Seol activated his ability right away and fell into deep contemplation.", "Yellow was 'Attention Required'.\nOrange was 'Do Not Approach'.\nRed was for 'Immediate Retreat Recommended'.\nBlack was ‘Escape Immediately’.", "Judging from this, the newly unlocked color, Black, was an extension of already available emergency warning signals.", "'I get what's up with Escape Immediately, but… Golden Commandment?'", "He pondered for a while, but he couldn't quite grasp what it did. That wasn't the only riddle he could not solve, however.", "The 'lower' direction only opened up after he had unlocked the 'left' direction first. So, he thought that the 'upper' direction would also open up only after he unlocked the 'right' direction. The order of the things had been changed, as far as he could tell. Was it because the colors were on opposite directions?", "'How can I use it without knowing what it does….?'", "Seol began walking again and climbed up the stairs, all the while shaking his head slightly.", "But then….", "'Gold color?!'", "His eyes shot open abruptly.", "Beyond the tenth floor railing, he could see a clear and radiant golden glow, coming from a spot right in front of his quarters.", "He hurriedly ran up and found a person quietly waiting there. Seol's thought process dimmed just for a bit when he confirmed who it was from her back. She was certainly one of the last people he expected to see in the Neutral Zone.", "“You're finally here.”", "As if she sensed his approach, the business-suit wearing woman turned around to greet him.", "“You’re…” ", "It was none other than Kim Hannah.", "“It’s been a while.” ", "She smiled refreshingly. And sure enough, her entire body was bathed in a golden hue.", "Seol couldn't help but be confused. For one, he was curious why she was here, and two, why was there a golden color coming from her….?", "“Can we go inside? It's a bit awkward to talk out here and all.” ", "Her friendly voice brought Seol back to reality. As soon as they entered his room, Kim Hannah couldn't hide her astonishment.", "“Wow~. It really is nice here. Honestly, I never dreamed that you'd end up using this room.”", "Kim Hannah's facial expression implied that she wasn't sure where to park her rear as she stood around before she chose a spot on a comfy couch and settled down. Seol quickly sat on the opposite side. Seeing this, she burst out a fit of giggles.", "“Why are you in such a hurry? What, are you that surprised to see me?” ", "“Obviously.” ", "“Hmm…. Before we get started, I guess I should appease that curiosity of yours. Fine. What would you like to know?”", "Seol almost blurted out 'Why is your body glowing in a golden hue?', but somehow was able to change his words at the last second.", "“How did you get here?” ", "“Well, because I know how to?” ", "“Hey.”", "“Just kidding. Of course, the Neutral Zone isn't a place that anyone can just come and go as they please. However, I'm an exception, you see.”", "Seol stared at her without saying anything.", "“You idiot. Didn't you read the Invitation letter?”", "‘The Invitation letter? What about it?’ Seol was about to ask her, before going “Ah.”", "He just remembered that, in the gold stamp Invitation letter, there was a clause about him being able to bring along one 'helper'.", "“You don't have to fret, okay? Miss Cinzia knows about me being here. I went through the proper procedures, so there’s no problem.” ", "“That’s a relief…” ", "Suddenly, Kim Hannah raised her hand.", "“Hold on, it’s my turn to get an answer.” ", "“?”", "“It's about Miss Cinzia and Miss Agnes. Especially Agnes – she seems to be particularly interested in your growth for some reason.” ", "“Is she?”", "“Yes. Just what underhanded tricks did you use to flip those violent Sicilian gangsters over to your side?”", "Seol couldn't help but doubt his own hearing just then. Violent? Gangsters?", "Kim Hannah's eyes went round when she saw his expression.", "“Oh my, you didn't know?”", "“….”", "“You really had no idea? Those two are pretty infamous as the Battle Maniacs of the South.”", "“A battle maniac? Miss Agnes is…?” ", "“Yeah. She's the direct subordinate of Boss Cinzia and Sicilia’s top executive. She's even known as the demonic drill instructor. Almost everyone in Paradise knows about them.”", "As the explanation continued on, a certain sense of chill crept up on Seol's backside. He had no idea that Agnes was such a big shot.", "'Maybe I, uh, I shouldn't have teased her.' ", "“If you're done asking me about stuff, shall we get to the main topic of my visit?” ", "Seol nodded his head.\nHe was indeed curious as to know why she came here in the first place. There was still a month left to go before the Neutral Zone's deadline, after all.", "“Well, I came to cheer you on, and…. I wanted to give you advice. Also, there's something I need your help with.” ", "Kim Hannah took her glasses off and stared at Seol. Compared to how it was like back on the riverbank, the way she looked at him had softened considerably.", "“First of all, I gotta praise you. You've exceeded all of my expectations. I honestly would never have guessed you were this excellent.” ", "“I thought you were unhappy about using the golden stamp on me.” ", "“That was back then. But, not anymore. The stamp wasn't wasted on you. At all. Honest.”", "Seol felt an itch creeping up on his face hearing the constant stream of praises.", "“Okay, so that's the cheering bit done. What advice do you have for me?” ", "When Seol sheepishly scratched his cheek, Kim Hannah grinned slyly.", "“You did the right thing by stopping at the 'Hard' missions. You see, the difficulty spike in the 'Very Hard' missions is nothing to laugh about. You have to prepare yourself properly first.” ", "But of course – Seol was expecting as much as well. Seeing that the rewards on offer jumped by ten times in value, the difficulty should rise just as much, too.", "“And, you should find yourself reliable comrades. If I have a complaint to make, then you just stick to yourself too much.” ", "“Comrades, huh….” ", "“That's right. Odelette Delphine, Hao Win – I recommend these two people. I'm telling you this before you get the wrong idea – my suggestion isn't solely because of their skills.” ", "“Then why?”", "“They will certainly become a big help to you in the future, that's why.” ", "It was rather clear what Kim Hannah was implying here.", "“Are you telling me to form a personal connection with them?” ", "“That's one way of looking at it. In any case, you already have a link called 'fellow survivors from the same time period' going for you. I mean, there's nothing to lose by getting friendly with them, right?” ", "“I get it with Delphine since she's a Magician, but what about Hao Win?”", "“He's a big player in the darker side of the society; I heard that he's a top level executive in the biggest Triad in China.”", "Seol slowly facepalmed. Not only the Sicilian 'Battle Maniacs,' he had to deal with a man from a damn Chinese Triads, too? He would've never imagined getting mixed up with these sorts of people in his old life.", "It was here that a thought popped up in his head.", "“If I work together with those two, then could I challenge the Impossible mission and….”", "“No. Do not even think about challenging that one.” ", "He was just blurting out the possibility, but Kim Hannah promptly cut him off before he got anywhere with the idea. Seol could only smile bitterly.", "“It's that difficult, huh.” ", "“Even I’m not confident with that mission. At a bare minimum, only a mid to large-sized team of Level 4 or above Earthlings would be needed to have a chance of clearing it. Really, I don’t know why the gods would have such a mission here in the first place.”", "She complained bitterly before turning her sharp gaze on him.", "“Wait a minute. You are not thinking of trying your luck on that one, just because you've heard of someone clearing it in the past, right?” ", "“Someone cleared it before?”", "Now this was the first time he heard of it.", "“Yeah, sure. In the entire history of the Zone, one guy did pull it off.” ", "“But, how….?”", "Seeing Seol's shocked expression, Kim Hannah simply snorted.", "“Only a few know about this. But that guy, he didn't clear the mission in what you'd call a 'proper' fashion. He just got lucky, that's all.”", "“Even if it was down to luck, it still counts.” ", "“That's true, too. But whatever, do not ever attempt that mission. Got it? It'd be better to fight a monster from the world of the dead with your bare hands rather than attempting that mission.” ", "Kim Hannah passionately voiced her opposition and slowly regulated her breathing. She shook her head, causing her ponytail to sway this way and that.", "“I'm sure you'll do what's best for you, anyways….” ", "She sneakily raised the end of her sentence and glanced at him.", "Seol ignored that and asked her once more.", "“Didn't you say you need my help? What's that about?” ", "“….Well, it's nothing big, really.” ", "Kim Hannah hesitated slightly, which was unlike her, before opening her mouth.", "“Again, let me make this clear. What I'm about to say from here onwards isn't coming from me.”", "“Okay, so from who is it, then?” ", "“One of my superiors.”", "“One of your superiors…. You mean from Sinyoung?” ", "Kim Hannah nodded her head and continued.", "“Anyways. What I'm trying to say is, someone else other than me is asking you for a favor. If you don't wanna do it, fine. You don't have to. But if you do decide to go for it, there are plenty of benefits for me. You might also get to share in the loot, too.”", "“What's the favor?”", "“You know Yun Seora, right?” ", "Kim Hannah got to the main topic right away. Seol was taken back somewhat, though.", "“You see, the person who invited Yun Seora is the person asking you for the favor. From Sinyoung.” ", "“Hold on, let me get this straight. You’re saying that your superior officer from Sinyoung invited Miss Yun Seora?”", "“That's right. That person is known for having a discerning eye. Everyone he invited all turned out to be big hits, you see. He even resorted to using a silver stamp and invited her this time, so the company’s expectations are high.”", "“But….” ", "“Right. You know this too, don't you? At this rate, Yun Seora is going to fail. Understandably, my superior officer is a nervous shell of his former self.” ", "Only then did Seol get the rough idea of what the favor could be.", "“Let me get straight to the point – that person would like you to look after Yun Seora.” ", "“That's too unspecific, isn't it? Do I need to give her 1000 Survival Points and be done with that? After all, she'd be able to leave the Neutral Zone with that.”", "“That would be worse than failing, actually. Okay, if I were to get more specific, he wants to see Yun Seora develop normally in the Zone, just like everyone else. Heal her arm if it's possible, let her tag along when you go around clearing missions, etc, etc. Basically, I want you to carry her.”", "Carry… Seol inwardly let off a long groan. ", "Coincidentally, he got to hear about Yun Seora twice in one day.", "Seol understood that her life in the Zone was fraught with extreme hardship. It wasn't as if he had no plans of helping her out.", "However.", "[You know this too, don’t you?]", "He also thought what Hyun Sangmin said back not too long ago wasn't wrong, either.", "Kim Hannah was waiting for Seol's reply. She was still emitting the golden hue.", "“….What do you think I should do?”", "“Me? As I said this before, I didn't invite her….” ", "“I know that. I’m asking the person who invited me what her opinion is.”", "Perhaps she didn't expect to be questioned, her expression became somewhat dazed and lost. Soon enough, though, the corner of her lips arched up ever so slightly.", "“Of course, I'll be very happy if you do this one thing for me. I'll be owed a debt.”", "There was a slight grin etched on her face as she spoke up, clearly enjoying herself.", "“I understand. I can't give you a definite answer, but I promise I'll look into it.”", "“Hng. Not bad, you even know what to say to make me feel better, too.” ", "She muttered to herself, ‘Are you even the same gambling addict from back then?’ and continued on with what she wanted to say to him.", "“In any case, consider it carefully. Yun Seora's supposed to be a rising star invited by Sinyoung's greatest talent scout. Making him owe you a favor would be a good thing for you, too.” ", "“A favor, huh….” ", "He hadn't given much thought over the notion of Yun Seora being a potential rising star, but that did make sense. Back in the assembly hall, when he inadvertently spied on her Stats, he saw 'Brilliant' appearing on the 'Personality' column, after all.", "Having finished what she wanted to say, Kim Hannah began standing up.", "“That's right, a favor. Well, there's that saying, right? The Golden Rule.”", "“Take ca…. What did you say?” ", "Seol was taken by surprise again and stared at her.", "“You know, the Golden Rule.” ", "She winked at him and walked towards the exit of the room.", "“Therefore whatever you desire for men to do to you, you shall also do to them; for this is the law and the prophets.” ", "“Is that…. the Golden Rule?” ", "“It's a verse from the Gospel of Matthew. Verse 7:12. I never really thought of those words as altruistic babble, though. No, it's much more closer to 'give-and-take', don't you agree?” ", "“….”", "“Who knows? If you appear before her like a prince riding on a white horse and rescue her, she might just fall hard for you. I mean, she's pretty cute, right?” ", "Of course, she was only joking.", "However, Seol's mute response seemed rather suspect. Feeling a bit embarrassed now, she fixed her high heel, lightly tapped on the floor with her feet, and opened the door. Before she slipped through the door, she turned around one more time.", "“No need to see me off. Oh, and don't forget the deal we have. You negotiate with me before anyone else when you leave the Neutral Zone.” ", "“Oh, uh…. Right.”", "“Don't get killed. I'll be here in a month's time to fetch you.” ", "She closed the door.", "Although Kim Hannah was gone, Seol didn't show any sign of movement. For a long time, he stood there and dwelled on everything she said. And then, dwelled on them some more.", "….Even as the sounds of high heels getting further away disappeared altogether."]}