{"cid": "364", "title": "Chapter 364. Level 7, and (1)", "content": ["He returned to Paradise.", "He felt fresh as he walked out of the temple.", "In the past, he would indulge in a feeling of liberation whenever he returned.", "But this time, well… he was happy, but something was different.", "Instead of feeling relieved, his heart fluttered with anticipation, just like the first time he came to Paradise.", "Basked in a sense of unfamiliarity, Seol Jihu descended the stairs.", "The Valhalla building was more or less empty.", "The workshop had ended, but most of the members were still on leave for personal vacations.", "But it wasn’t like nobody was there. Their trip ended days ago, so of course, there was someone who came earlier than Seol Jihu.", "“You’re early.”", "“I arrived this morning.”", "Kazuki answered in a monotonous voice.", "“I was going to come earlier… but I had to look after my sister.”", "“Your sister…. Ah.”", "Seol Jihu remembered the Delphinion Laboratory invasion mission.", "Kazuki had to be referring to the Earthling he rescued by beheading.", "“Is she alright?”", "“As much as I’d liked to say she is….”", "Kazuki’s voice thinned and he let out a sigh.", "“She suddenly had a seizure. But she’s alive and doing much better than before.”", "“I’m glad she’s doing better. You know, it’s okay if you want to stay on Earth a little longer.”", "Seol Jihu remarked worriedly, but Kazuki shook his head.", "“She has doctors and nurses looking after her around the clock. My presence there won’t help her.”", "“…”", "“So I have to do what I can to help my sister.”", "Kazuki declared resolutely and turned his eyes to Seol Jihu.", "“I thought about it on my way to Paradise. I’m glad I joined Valhalla.”", "“?”", "“It’s all thanks to you that I was able to gather enough contribution points to gain a level. There’s a big difference between Level 5 and Level 6. Now that I’m Level 6, collecting contribution points will be much easier.”", "Only then did Seol Jihu realize what Kazuki was after.", "“Are you aiming for her resurrection?”", "“Yes. Either that or a medicine that can cure her mind…. Anyway, thanks. I was going to tell you this right after the war, but I never got a chance.”", "“Thank you for your help as well. I couldn’t have defeated Raging Temperance without you, Mister Kazuki.”", "“I was just lucky. I never imagined that a Parasite Army Commander could be so stupid. I actually regret it a little.”", "“Regret it?”", "Kazuki smiled softly at Seol Jihu’s reaction.", "“If we had sent the Fourth Army Commander back alive… he could’ve become a Mutaguchi Renya for the Parasites. I keep thinking about that.”[1] ", "Seol Jihu burst out laughing.", "It was true. Considering all the things that Raging Temperance did in the Spirit Realm, the Federation and humanity could have definitely benefited from his stupidity.", "“No way. Even if we sent him back, I doubt the Parasite Queen would’ve let him live.”", "“You’re right.”", "“But it’s true that he did us good. I’ll have to pay tribute to him later.”", "“That’s not a bad idea. Why don’t you prepare a medal and deliver it to the Parasites, as an homage to one of the greatest commanders of all time?”", "“Good idea. I wonder how the Parasite Queen will react.”", "The two men broke out in laughter at the same time.", "“That’s right, Mister Kazuki.”", "Suddenly, Seol Jihu stopped as if he had just remembered something.", "“Do you have time to talk? It’s kind of important.”", "“Right now?”", "“No, a little later. I have to get ready.”", "“Should I go to your office?”", "“Yes. I’ll meet you there in 10 minutes after I stop by the warehouse.”", "Kazuki’s eyes brightened at the word ‘warehouse’.", "*", "Time quickly passed and 10 days went by in a blink.", "During that period, members of Valhalla began to return from Earth one after another, and after two weeks in Paradise time, all members had arrived.", "With everyone gathered, the first thing Seol Jihu did was to hold a meeting.", "The purpose of the meeting was to establish a collective internal system that had been delayed for a long time because of the war.", "“We can’t delay it any longer. We are no longer the team Carpe Diem. From today, Valhalla will be reborn as a fully-fledged organization.”", "Seol Jihu announced at the end of the meeting.", "It was a declaration of reform, a display of firm determination to initiate an effective and systematic approach to dealing with matters instead of the state of unruly chaos that was now in place.", "Seol Jihu embarked on reforming Valhalla on that very day as if to prove his seriousness.", "The first thing he did was to recruit Hoshino Urara as a new member of Valhalla. She had done quite a good job in the Spirit Realm.", "Of course, recruitment was not a one-sided process. However….", "“I accept!”", "Hoshino Urara accepted right away without giving it any thought.", "“I love having fun. Like, REALLY love it!”", "Hoshino Urara threw a mischievous smile at Seol Jihu’s puzzled eyes.", "“Money? Fame? I don’t care about either of them~ Fun. That is the most important thing. I’ll do anything as long as I can have fun. Do you understand!?”", "She screamed, emphasizing ‘fun’ repeatedly.", "“Aaand… it was fun. The anal-something expedition and the war, I mean. Especially the time I escaped from Twisted Kindness’ grip by a hair’s breadth… Uuuu!”", "Hoshino Urara shuddered, as if she was having an orgasm.", "“So, I accept. This place seems like fun, and you look like someone who knows how to have fun. So If I’m with you, I can have a lot more fun, right?”", "Her eyes smiled as she revealed that she had planned to stay even if he hadn’t invited her.", "Seol Jihu gave a forced smile.", "He couldn’t help but worry.", "[Hoshino Urara’s Status Window]", "[1. General Information]", "Summoned Date: 2013.09.20Marking Grade: RedSex/Age: Female/ 25Height/ Weight: 160.2cm/ 46.4kgCurrent Condition: HealthyClass: Lv. 7 SicarioNationality: Japan (Area 5)Affiliation: N/AAlias: Crazy, Six Crazies, Runner-up Graduate", "[2. Traits]1. Temperament—Maniac (A crazy person)—Deranged (Symptoms of crazy are expressed outwardly; acts in an abnormal and violent way)—Intemperate (Cannot willingly control impulses)", "2. Aptitude—Balance (An innate ability to remain upright without inclining to one side)—Audacity (Proceeds without compromise)—Hand Dexterity (Good at making or handling something with hands)—Flexibility (Body bends easily like mollusks)", "[3. Physical Level]Strength: Intermediate (High)Endurance: Intermediate (Intermediate)Agility: High (High)Stamina: High (Intermediate)Mana: Intermediate (High)Luck: Low (Low)Remaining Ability Points: 2", "[5. Level of Cognition]—Madwoman (A crazy woman)—Enthusiastic—Intrigued—Chaotic (Many things are jumbled up and is impossible to unravel)", "Hoshino Urara’s information that he checked with Nine Eyes was just unbelievable.", "Seol Jihu had never seen such a simple, direct status window before.", "But he was the one who took her out of prison.", "It would be better for everyone if Valhalla dealt with her than let her go.", "Level 7 Archers were rare, especially since the Star of Pride was now gone. Besides Hoshino Urara, Agnes was the only one. Agnes used to be level 6 but leveled up after the war, like Hoshino Urara.", "“Please keep up the good work.”", "“Don’t worry! All you have to do as my employer is provide me with fun and entertainment! I’ll be following you around like hop, step, and jump~ And I’ll have all the fun in the world! It’s that simple!”", "Hoshino Urara cackled and high-fived Seol Jihu.", "After he finished speaking to Hoshino Urara, Seol Jihu immediately moved on to the next agenda.", "As discussed earlier, Jang Maldong became an advisor and official trainer of Valhalla based in the Haramark Building. Kim Hannah became the information team leader as she wanted.", "Seol Jihu also decided to select team leaders to manage the two newly formed teams.", "Members with experience in leading a team, including Kazuki and Oh Rahee, were named possible team leaders. Seol Jihu took the time to interview them one by one.", "Of course, he didn’t just focus on internal affairs. Now that some time had passed since the end of the war, he made efforts to strengthen ties with outside forces.", "And so….", "*", "“Our representative is super busy these days.”", "Chohong mumbled in a disheartened voice, her body sinking into the couch inside the first-floor lounge.", "Her eyes were fixed on Seol Jihu, who had just returned from Eva and was now arguing with Kim Hannah.", "“Representative. You have to reconsider this agenda…. Two are too many.”", "“Too many? I think it’s too few.”", "“I understand Sicilia and the Magician’s Guild. They helped us with all their might during the Spirit Realm Expedition and during the defense of Tigol Fortress. But the rest—”", "“Don’t be ridiculous. How can I discriminate when they've all done what they can in their respective positions? If we gave two here and one there, what would those who got one think of us? Remember, these people know who I’m interacting with.”", "“But considering the value of the enhancement stones… and the money we could make by selling them….”", "“No. Think of all they’ve done to help us. Send two each to the Triads, Assassination Guild, Eva Royal Family, and Haramark Royal Family. And don’t forget to send the fruit of the World Tree with them.”", "“…I understand.”", "Finally, Kim Hannah raised a white flag at Seol Jihu’s obstinacy. She bowed her head down slightly and left.", "Oh Rahee, who had been watching them all along, seemed surprised.", "“Now that’s surprising. Who knew that vixen could stand down?”", "“Hmph. That’s the way it should be.”", "Chohong sneered.", "“Who does she think she is? She’s just an administrator, not a representative. I didn’t like her from the start, crawling in here like a cat burglar and doing whatever she wanted. I know she has good intentions, but why does she do everything her way?”", "Chohong criticized. She still held a grudge against Kim Hannah for going behind Seol Jihu’s back.", "“Well, a representative needs to know when to stick to his guns.”", "Phi Sora shrugged her shoulders.", "“Say what you want, but he’s a pretty good representative, though at times he can be a bit volatile. That is, as long as he’s in Paradise and not near Lust Unni.”", "She added two conditions.", "Her words were hard to refute, and Chohong hesitantly agreed.", "“Anyway….”", "Phi Sora spoke again.", "“It’s good that he’s working hard. But don’t you feel a little nervous?”", "“About what?”", "“Remember, he was like that before the Spirit Realm Expedition. The fact that he’s acting like that again makes me think that something big is going to happen….”", "“I don’t think it’s war.”", "Eun Yuri’s voice rang out.", "“It probably has something to do with the Federation. He was contacting them through Eva.”", "“Are you sure?”", "“Yes, he invited me to his office last week. He thanked me for summoning Master and gave me a piece of the fruit of the World Tree. That’s when he told me about Eva.”", "“Aha. I suppose that’s good news… Hmm? Wait a minute. The fruit of the World Tree?”", "“Yes. I heard that most of you had a bite when you split the enhancement stones…. You didn’t eat it?”", "Eun Yuri replied calmly and looked around.", "Oh Rahee and Chohong nodded.", "Phi Sora furrowed her brows.", "“I mean, I got the enhancement stones… but not the fruit….”", "Muttering, Phi Sora turned her eyes and stopped.", "‘Speak of the devil.’", "Seol Jihu was looking in their direction. More specifically, he was looking at her.", "“Miss Phi Sora!”", "Seol Jihu raised his hand.", "“Can we talk for a moment?”", "“Euk!”", "Phi Sora groaned.", "He seemed at last determined to give her the fruit of the World Tree.", "Half of Phi Sora wanted to go, but the other half didn’t.", "“Come to my office, please.”", "In spite of her anguish, Seol Jihu called her, and Phi Sora dragged her feet behind him like a cow being forcibly taken into a slaughterhouse.", "“Have you thought about what I said in Hawaii?”", "Seol Jihu asked as soon as Phi Sora sat down.", "“Pardon?”", "“Stop pretending like you don’t know. You should know that I have that tactic copyrighted. Remember what I said in Ala Moana?”", "Phi Sora gave a sigh instead of an answer.", "“…Do I have to do it?”", "“I’m not going to force you, but I think you’re the right person for the job.”", "“What about Miss Chung Chohong and Mister Hugo?”", "“Chohong and Hugo both admitted they’re not suited for the job. They don’t have any experience leading a team.”", "“What about Mister Kazuki and Rahee?”", "“Mister Kazuki has already decided to take the second team. Miss Oh Rahee will be in Team 2 for now, but if the number of members increases in the future, she will be put in charge of Team 3.", "Seol Jihu answered fluently, and Phi Sora could no longer find words to refute him.", "“Miss Phi Sora.”", "Seol Jihu clasped his hands and leaned forward slightly.", "“There are currently 16 official members of Valhalla. 18, Including Flone and Little Chick. If we count the guests, the number goes up to 22.”", "“…Yes.”", "“That number isn’t small, but it isn’t big either. In a way, this could be the best time to form new teams and strengthen our basics.”", "“I know. I know what you’re trying to say, but—”", "Phi Sora waved her hands.", "“But… dear, you know why I don’t want to be a team leader.”", "“I think it’s a shame.”", "“Do you pity me?”", "“It’s not pity. I’m asking you for a favor.”", "Seol Jihu stared at her with unwavering eyes.", "‘Haaaa.’ Phi Sora let out a sigh again.", "“Okay, let’s say I take the position. Doesn’t that scare you? What if I lead the team wrong and kill everyone? Then what are you gonna do?”", "“What happened back then was an accident.”", "“An accident caused by my mistake.”", "“The Phi Sora I know isn’t the kind of person to repeat the same mistake again.”", "“…Well, I’m honored you feel that way.”", "Phi Sora smiled bitterly.", "“But why, dear? Why do you think so highly of me?”", "“You made me think that way.”", "Seol Jihu continued slowly.", "“To be honest, I didn’t like you very much in the beginning. But you already knew that, right?”", "“Well, yes. So did I.”", "“But spending time with you changed my mind.”", "Looking back, it was Phi Sora who always took the lead whenever something big happened, such as during the Arden Valley War, or when they collided with the Eva Alliance.", "She did complain from time to time, but she always took the initiative in battles and never disobeyed Seol Jihu's orders.", "Furthermore, she’d remained loyal during their fight against Undying Diligence and throughout the recent expedition and war.", "As a result, Phi Sora became one of his most trusted comrades.", "“There’s something I realized during the war.”", "Seol Jihu spoke.", "“The people around me are just as important as I am. Right now, I need someone who can serve as my hands and feet, who can help and guide me in any way possible. I need someone who’s both capable and reliable.”", "“…”", "“For example, a person who used to be the ace of a guild and has experience leading a group of people.”", "“…”", "“But those aren’t the only reasons. Personally, I….”", "Seol Jihu swallowed his saliva.", "“I want one of the founding members of Valhalla to be in charge of Team 1.”", "Phi Sora lowered her head.", "She folded her arms, crossed her legs, and sighed for the third time today.", "If Seol Jihu had been playful as usual, she would’ve turned him down in a blink of an eye. But he was very serious, and, to be honest, it felt good that he recognized her ability.", "“…Give me some time to think.”", "“Again?”", "“This will be the last time. And it won’t take long.”", "“As long as I can get an answer soon, anything.”", "With a smile, Seol Jihu picked up a knife and sliced a thin layer of the fruit of the World Tree on his desk.", "Phi Sora threw a glance at the fruit and clenched her teeth.", "“You’re not gonna use that as a bait, are you?”", "“Of course not.”", "Seol Jihu reached under his desk.", "“The fruit is yours, and rightly so. The bait is this.”", "Tak.", "He placed a pair of boots on the desk.", "Faint blue light emanated from the delicately designed boots.", "“Pneuma’s Sky Boots. I got this from the VIP shop in the neutral zone.”", "Phi Sora’s eyes widened.", "“Once you infuse it with mana, you can use it to walk on air. There’s a 30-minute time limit and a 24-hour waiting period, but…. With this, even a warrior could fight in the air.”", "“You— You’re giving that to me?”", "“I was going to give it to either Mister Kazuki or Seol-Ah… but if you take the position of team leader, I’ll give it to you as a gift.”", "Seol Jihu winked at her.", "Phi Sora scrutinized the boots before turning her eyes back to Seol Jihu’s smiling face. Again, she let out a groan.", "“Auuu— You’re such a bully!”", "She wrapped her head in her hands in agony.", "Seol Jihu waited patiently, rubbing his palms together.", "A little later….", "“…”", "Phi Sora opened her eyes silently.", "Her eyebrows slanted upwards, making her appear a little angry. But her face showed no further signs of hesitation.", "“I want you to know that I’m not doing it for the boots.”", "“I know.”", "“You asked me three times. First in Paradise, second in Hawaii, and third, now. You’ve been persistent despite my… well, whining, so now I want to repay you for your sincerity.”", "“Well, aren’t you sassy!”", "“Shut up. Anyway….”", "Phi Sora cleared her throat.", "“Sure, I’ll do it. I’m starting everything over anyway. But if you’re going to name me team leader, I want you to do it right.”", "“What do you mean?”", "“Do you think I’m stupid? You said you wanted one of the founding members to be the team leader. I know you’re just preparing for the worst, and I promise to play the role of a hound when necessary. But you have to back me up. Honestly, I can’t deal with both Miss Kim Hannah and Mister Kazuki at the same time.”", "A corner of Seol Jihu’s lips drew up.", "“Tell me what you want.”", "“So you picked the team leaders, but you haven’t picked the team members yet, have you?”", "“No.”", "“Good.”", "Phi Sora straightened her body and leered at Seol Jihu.", "“Never mind your team, but don’t you think Team 1 should be stronger than Team 2 or 3?”", "Seol Jihu wasn’t stupid either. He immediately understood what she wanted.", "“I’ll make sure Team 1 gets priority over other teams when it comes to selecting team members.”", "1. Mutaguchi Renya was a Japanese Military officer. Wiki link here— https://en.wikipedia.org/wiki/Renya_Mutaguchi "]}