{"cid": "472", "title": "Chapter 472. The Crumbling Line of Defense (2)", "content": ["—Kyahahahahaha!", "Shrill laughter resounded in the sky. With her divinity released, Vulgar Chastity was truly a force to be reckoned with. She swung her fluttering cloth, creating storms of blades that ripped her enemies to shreds.", "That wasn’t all. She spun in a circle and shot out a toxic mist from her mouth. Fallen Angels that met her bloodshot eyes either lost their strength and fell, or turned around and aimed their tridents at the allied force.", "Then, when more pillars of fire erupted from the ground, the already chaotic battlefield turned into a living hell.", "There was no tactic or strategy to speak of. Vulgar Chastity simply bombarded the enemies with sheer power.", "But ironically, this was the best tactic in the current situation. With Vulgar Chastity leading the way in pushing the allied force back, the morale of the allied force faltered.", "On the other hand, Vulgar Chastity’s army and the Parasite forces were advancing forward for the first time.", "[Who’s next!? Where did everyone go, hmm?]", "Vulgar Chastity looked around with gleaming eyes before fixing her gaze in one spot.", "A robed Magician was opening a thick book.", "It was the Star of Avarice.", "[What are you planning to do?]", "Vulgar Chastity harshly stretched out her left arm. Then, when she clenched her fist…", "“Euk!”", "Philip Muller spat out a grunt and frowned. Next, his head and shoulders began to shrink, almost as if a large hand was squeezing him.", "He tried to resist as much as he could and chanted a spell, but it was not enough. When terrifying power blocked his mouth and crushed his mudra-drawing fingers, he had no choice but to drop the book in his hand.", "At that moment, as if to save Philip Muller, a bright light descended on him.", "[As if I’d let you!]", "Vulgar Chastity snorted and stretched out her right hand.", "Seo Yuhui, who was chanting a spell from a distance, suddenly spat out blood and fell backward.", "Vulgar Chastity clenched her right fist and raised her hand, and Seo Yuhui shot up into the air forcefully.", "[Don’t get in my way!]", "Vulgar Chastity shook her head strongly. Seo Yuhui drew a 180 in the air and began to spiral downward.", "Kwang, kwang, kwang, kwang!", "As she was flung to the ground, countless explosions erupted in her surroundings.", "Eun Yuri narrowly saved Seo Yuhui before her head hit the ground, and then gritted her teeth while watching the chaos breaking loose in the allied force’s camp.", "Though she had her own mission to perform, she could not stand by and simply watch when Seo Yuhui was in a perilous situation.", "Meanwhile, as if to pay back her pent-up anger a thousand-fold, Vulgar Chastity began to run wild like a crazy woman.", "Because of her, the allied force’s left-wing shook, and the main camp naturally fell into disorder.", "—Save your strength, everyone.", "Roselle transmitted a mental message to Gabriel, Philip, and Seo Yuhui.", "—I’ll deal with this prostitute, so stand back and wait so that you can deliver an attack when the time is ripe.", "Roselle moved her broom and approached Vulgar Chastity, who was still spinning and slashing with her cloth.", "[Iya, look who’s here?]", "Vulgar Chastity’s eyes lit up upon discovering Roselle.", "Roselle glared at her without saying anything.", "[What happened? Cat’s got your tongue? Why don’t you babble on as you did before?]", "Vulgar Chastity sneered excitedly, seemingly enjoying Roselle’s anxious expression.", "[Come on! Say something!]", "She stretched out her hands roughly, and the fluttering cloth straightened out and came hurling forward.", "Roselle completed a defensive spell she had prepared beforehand and soared up. Vulgar Chastity chased after her with a burst of shrill laughter, not knowing this was all a part of Roselle’s plan.", "Having experienced all sorts of hardships, Roselle was not the type of person to reveal her emotions easily. The reason she displayed a scared expression was to trick Vulgar Chastity into believing she was impervious.", "A recklessly charging boar that only believes in its strength and has no regard for its surroundings was bound to trip on a pebble and fall.", "The question was whether Roselle could last until the boar hit the pebble.", "Same time.", "While the battlefield had gotten rowdy, one place, in particular, was extremely silent. No, there definitely were sounds of metals and screams nearby. It was just that the air carried an eerie silence.", "Marcel Ghionea, who had one eye opened and the other closed, slowly breathed in and out.", "What was the most important factor for a sniper to hit his mark?", "The past Marcel Ghionea would have given several factors, but the current Marcel Ghionea was different.", "Setting aside one’s skill and experience, there was now one thing that he considered most crucial.", "Will.", "To imbue the arrow with the desire to hit no matter what.", "Some might call it nonsense, but this was what Marcel Ghionea concluded while walking on the Path of the Soul.", "He suddenly remembered a conversation he had with Black Seol Jihu.", "[…What? You want to hit whom?]", "[Yeah, no. Keep dreaming. In your current state, you can shoot a hundred arrows without hitting a single one. You can’t do it.]", "[Don’t try to do more than you can handle. Just stay in the back and shoot quietly.]", "Black Seol Jihu had snorted at him when he asked what he had to do to shoot down Vulgar Chastity.", "[Your skills? I know you’re pretty competent. But when did I say it was your skills that were the problem?]", "[It’s your mindset, you retard.]", "[What do I mean by that? Alright, let’s think. Our Archer of Steel just received a wonderful class name, Der Freischütz, right?]", "[The Marksman of the Magic Bullet[1]. Why do you think Superbia gave you that name?]", "Marcel Ghionea had never thought about it until then.", "[I’m sure you know where Marksman came from. Explain to me what Magic Bullet means.]", "[Mana arrow…? Do you really think I’m asking you this question just to hear that? Do you think this is a job interview?]", "[Explain to me what mana means. Mana.]", "[I’ll tell you. Mana is… your will.]", "Truth be told, Marcel Ghionea had cringed a little when he first heard this.", "[Hah? What’s up with that face?]", "[Do you have mana or not? Mana always moves the way you want it to, and it becomes what you want it to be. Am I wrong?]", "[Mana, in essence, is energy imbued with your will. Do you get it, you idiot?]", "Once he heard Black Seol Jihu’s explanation, he began to think it made sense.", "[I’m saying you can’t because you don’t know that.]", "[You were suuuper far away when you shot the World Tree in the Spirit Realm, right?]", "[Think about it. If the shooter’s shaking like a little rabbit from pressure, would his arrow hit its mark correctly?]", "[You still don’t get it? What happened when you shot the arrow back then?]", "…Right.", "[If you have a conscience, you shouldn’t say you hit the World Tree.]", "[Because you didn’t. Am I wrong?]", "He was right.", "Strictly speaking, Marcel Ghionea had failed to hit the World Tree. Had the Spirits not sacrificed themselves to stab it in, it would have been sent flying away.", "Recalling this, a thin smile spread across Marcel Ghionea’s face.", "However, his smile soon disappeared.", "To be honest, it wasn’t as if he didn’t feel any pressure.", "However, Marcel Ghionea believed.", "He believed in himself, who shot a thousand arrows every day in the Path of the Soul.", "How much time went by?", "After letting loose a long breath, Marcel Ghionea’s body no longer moved. It was as if he was in a painting.", "It was a strange scene. No one was paying attention to the man inside the chaotic battlefield.", "Air, scent, wind, sound… everything seemed to vanish when they entered his vicinity.", "Soon, with the sound subsiding as the beginning, everything in his surroundings drifted apart, and the feeling of complete solitude overtook his body. It was then. A single thought filled Marcel Ghionea’s head.", "‘I can do it….’", "An opening wasn’t something to wait for. It was something to be created.", "Thankfully, Roselle was performing that role for him.", "‘I can do it….’", "Once his mindset changed, so did the way he looked at the situation.", "Each moment that Vulgar Chastity further drove Roselle into a corner looked like an opportunity.", "‘I….’", "It was then.", "Though he did not know whether it was done intentionally…", "“Aaaaaack!”", "Roselle was sent flying with a scream after being struck by Vulgar Chastity’s cloth.", "In Vulgar Chastity’s perspective, this was the perfect opportunity to get rid of one of the main fighting powers of the allied force. Vulgar Chastity chased after the incapacitated Roselle.", "The moment she disregarded everything else and charged in… the moment Marcel Ghionea spotted Vulgar Chastity reaching for Roselle’s neck, the moment Roselle’s sideways glance met his eyes…!", "The Archer of Steel no longer hesitated.", "‘I…!’", "His eyelids, restless with sweat, shot open.", "‘I can hit her…!’", "And he finally let go of the tightly-pulled bowstring.", "Chweeeeek!", "An intense desire to kill the target. An arrow carrying an even bigger will to hit the mark no matter what, cut through the sky like a beam of light.", "It really happened in an instant. Vulgar Chastity, who finally succeeded in grabbing Roselle’s slender neck, flinched.", "[Ah…?]", "She abruptly turned her head and looked back.", "She didn’t feel any killing intent.", "She didn’t even hear a sound.", "She couldn’t tell why she did so either.", "It was just that her body reacted on its own.", "Next, sensing that something was flying toward her, Vulgar Chastity swung her cloth reflexively.", "No, she tried to.", "She would have swung her arm if a chilling blue light didn’t brush past her sight.", "However…", "‘Thunder!’", "When she realized that the arrow shone with a blue light from the arrowhead to the fletchings, Vulgar Chastity waved her hand instinctively.", "The cloth suddenly circled back.", "There was no time to wrap around it. The cloth gently touched the arrow shaft that had come under her nose, changing its course ever so slightly.", "At the same time, Vulgar Chastity moved her neck to the side.", "Chwak!", "A blue flash brushed past her neck. A thin, red line was drawn on her neck, and a chill ran down her spine.", "It did not take even three seconds for all of this to happen.", "Soon, Vulgar Chastity gave a delighted smile. In her hand was the witch that she wanted to tear to pieces.", "Being shot by her ally’s arrow.", "[Haha!]", "Vulgar Chastity cracked up just thinking about it. However, when she turned forward again…", "[?]", "Roselle’s face was strange.", "Her eyes and nose were distorted, but a cold sneer was hanging on her lips.", "[…You…?]", "It was only then that she felt something was off. She even had a strong sense of déjà vu.", "Something was strange… but she couldn't quite put her finger on it….", "‘Wait.’", "Come to think of it, she couldn't’ see the arrow. Since it was aiming at her from her back and brushed past her, it should naturally hit Roselle, who was on the other side.", "However, the arrow had vanished like it never existed.", "Chak!", "It was then that Roselle raised her hands and clapped.", "Vulgar Chastity blinked. She felt like she just woke up after having fallen asleep for a few seconds.", "Nothing had changed.", "Everything around her was the same. Roselle was still in her hand, and…", "And the arrow… where was the arrow?", "‘What? Where did it…’", "—What’s wrong?", "A lilting voice rang out.", "—Did you have a nice dream?", "Vulgar Chastity became dazed. Next, she turned around in a hurry, just like she did before.", "N-No, that wasn’t where the arrow was coming from….", "Chweeeek!", "Right side.", "At that moment, just as Vulgar Chastity turned to the right, her head suddenly dropped down.", "Just like how a wolf throws itself at its prey when given the opportunity and subdues it in an instant, the sure kill arrow was already digging into its mark.", "Vulgar Chastity’s jaw dropped, and a smile bloomed on Roselle’s face. Their expressions had swapped.", "Puk!", "A chilling sensation akin to a winter beast’s fangs dug into Vulgar Chastity’s heart.", "The blue wolf…", "Flash!", "…had bitten off the heart of the corrupted goddess.", "1. This is the Korean version of his class name. Der Freischütz is the German name that the author gave, which isn’t a literal translation of the Korean version. "]}