{"cid": "334", "title": "Chapter 334. Promise (4)", "content": ["Let’s rewind time by 30 minutes to when Marcel Ghionea was preparing to shoot and Seol Jihu and the rest of the expedition team were stalling for time against Twisted Kindness.", "The great war in the Middle World was momentarily in a lull.With the unexpected arrival of humanity’s reinforcements, a tense silence descended on Tigol Fortress.", "Gabriel moved slowly, with much caution. She placed her hands on the fortress wall and stared into the distance.", "She blinked, yet the distant scenery did not change. In front of her eyes were undoubtedly humanity’s mounted troops.", "It really was happening.", "Whatever their reason may be, humanity had decided to abandon its long-standing impartiality.", "Frankly speaking, she was not expecting the current situation to suddenly change due to the arrival of humanity’s reinforcements. She knew that the Parasite’s main force was still strong and that the Federation’s and humanity’s forces were weaker in comparison. This was no secret.", "However, she couldn’t care less about this.", "What really mattered was the fact that before it was too late, before the train reached its final destination called despair, humanity had responded to the Federation's request for help.", "“…They really came.”", "Gabriel whispered under her breath and clenched her fists. At the same time, a sudden roar of cheers erupted from Tigol Fortress.", "“Waaaaaaaaaaa!”", "Sky Fairies raised their bows, and Cave Fairies lifted both arms above their heads and cheered. Even the Beastmen joined in, waving their arms up and down.", "Help that arrived when one needed it the most, always felt more personal. With the fortress on the verge of collapse, they were happier than ever to see reinforcements.", "“Waaaaaa! Waaaaaa!”", "Their cheers and chants echoed endlessly throughout the silent battlefield.", "Meanwhile…", "Teresa, who was standing on the mountain ridge, slowly shifted her gaze downward.", "“…”", "Though her initial intention was to assess the situation, when she saw the battlefield, she became speechless.", "She couldn’t be blamed as the first thing she saw was a pile of corpses beside the fortress wall. The mountain of bodies helped her gauge the brutality of this war. And there were more such mountains scattered across the battlefield.", "Moreover, the ground was completely charred black from the inestimable number of Thunders that must have been detonated.", "The wind brought along a heat mixed with the smell of blood. All of these traces gave her a good idea of how fiercely the Parasites attacked and how desperately the Federation defended the fortress.", "“Cough.”", "Teresa coughed lightly. Suddenly, she noticed a change in the atmosphere.", "Murmurs of the soldiers buzzed out as they looked up at the sky. Turning her gaze upward, she saw underneath the dark clouds covering the sun, a giant holographic figure floating across the dark sky.", "Teresa’s eyes narrowed behind her helm.", "“Parasite Queen….”", "The flickering hologram showed a giant figure sitting in a chair, resting her chin in her hands. Evidently indifferent to the arrival of the reinforcements, the Queen kept her eyes fixed on Tigol Fortress.", "Looking at the scenery below, Teresa could understand the Parasite Queen’s confidence, which might have been interpreted as arrogance under different circumstances.", "“Oho, she’s really going all out.”", "Suddenly, Teresa heard a languid voice.", "From out of nowhere came Cinzia. She was looking up at the sky, admiring the enemy.", "It appeared she had used the Teleport spell to appear next to her.", "“So that’s the Parasite Queen…. This is my first time seeing her in person. For her to show her true self even as a hologram… she must be dead serious about this war.”", "Teresa couldn’t agree more.", "The size of her army proved just how determined the Parasite Queen was. An army of corpses, parasites, Nests, and five armies led by Army Commanders… the grayish-black things swarmed all over the earth as if pandemonium had befallen the Middle World.", "There were so many of them that it was no exaggeration to say that they could swallow the majestic Tigol Fortress without much difficulty. What was important was that Teresa would have to go in there soon, knowing that all her efforts could be in vain.", "The fear of death caused the Horuses to growl softly. Teresa bit her lips, stroking the neck of the frightened Horus. It would be a lie to say that she wasn’t afraid.", "And it wasn’t just her.", "Fear was pervasive in the faces of every soldier facing the Parasite Army.", "‘There’s no way we’ll win….’", "Suddenly dizzy, Teresa lowered her head. Intense nausea caused by overwhelming pressure almost frightened her into falling off her horse.", "It was then.", "“!”", "Feeling a sudden heat on her chest, Teresa hurriedly put her hand inside her cloak. She then took out a piece of paper and frowned.", "“Ah…”", "Observatio Vitae. This piece of paper was a god’s contract that represented the life of its contractor.", "“Again…”", "The contract was burning. More than half had already been burned, and what remained was quickly disappearing.", "This could only mean one thing— Seol Jihu’s life was in danger.", "“No….”", "Teresa murmured blankly.", "“No…!”", "As if to respond to her desperate cry, the fire finally stopped. All that was left now was a small piece that could barely be grabbed between two fingers.", "In truth, this wasn’t the first time this happened. She had already experienced many moments like this while advancing. The latest incident was a close call, but the contract was still alive. Although what just happened was the most serious of all those instances, the contract did not disappear in the end.", "It was resisting even as a tiny piece.", "The tenacity of the contractor shook Teresa. Seeing the desperately struggling contract, Teresa collected her thoughts.", "Now was not the time to let fear consume her.", "Seol Jihu must be out there, fighting, even as she hesitated. He must be risking his life, crossing the boundary between life and death again and again, and having a bloody battle.", "All for a single purpose, believing in the people left behind in the Middle World.", "Teresa’s heart sank when she saw the piece of paper flickering like a candle that was about to go out. In the end, she closed her eyes.", "“…Well, it’s only natural.”", "Cinzia threw a glance at Teresa, who had her head down.", "“This is the first time that humanity has witnessed the Parasite Army of this size. Even I’m a little afraid.”", "This was her way of consoling.", "However, Teresa remained silent. She opened her mouth wide and exhaled deeply, then held out the paper in her hand to Cinzia.", "“Hmm?”", "Cinzia grabbed the paper nonchalantly. Suddenly, a light flickered in her eyes.", "“This is….”", "“Observatio Vitae, a contract that allows one to observe life.”", "“….”", "“The contractor is….”", "“The representative of Valhalla.”", "Cinzia raised her head and lightly waved the paper.", "“So? Why are you giving me this?”", "Teresa sighed again.", "“I just wanted you to know…”", "She continued with her head still down.", "“That is the only hope we have left.”", "Cinzia raised one eyebrow. She said nothing and turned around with the paper still held in her hand.", "“We’ll join in as soon as the contract is implemented…. I wish you luck.”", "A magic circle surrounded Cinzia, and she disappeared in the next instant.", "Teresa slowly raised her head. She opened her eyes and stared into the distance. The Parasites were on the move. There was no time to waste.Teresa pointed her sword at the sky, relying on the heat of the contract remaining in her hand.", "“Ooooooh! Ooooooh!”", "The soldiers erupted into fierce battle cries. Trying to suppress their fears, they slammed the flat ends of their weapons on to the ground, yelling.", "Teresa recalled her last meeting with Seol Jihu, her back against the wave of the soldiers’ roars.", "He had promised to return safely.", "She had also promised to buy him time.", "Teresa clenched her teeth.", "“….”", "The view in front of her remained the same. She still felt fear in her heart. The fact that her hand holding the sword was shaking proved this.", "‘Can I do it…?’", "Doubt crossed her mind again, but she suppressed it. She didn’t have a choice. This was something she had to do.", "Seol Jihu would surely keep his promise. Therefore, she had to keep her side of the bargain. And now was the time to do just that.", "PPOOOOOO—!", "It was then that the trumpet blared. Teresa’s eyes brimmed with determination.", "“….”", "…Right, it would be okay even if she was reduced to a meat shield. It would be okay even if she died in vain without being able to swing her sword a single time.", "As long as she could do one thing.", "The one thing that Seol Jihu dearly wished.", "To buy the time that she promised Seol Jihu…!", "PPOOOOOO—!", "Her silver longsword, reflecting the light of the sun, slid down and pointed straight at the Parasites. At the same time, she dug her spurs into the Horus and opened her mouth wide.", "And then….", "“ATTENTION…!”", "Teresa yelled as she rode her Horus down the ridge.", "“ADVAAAAANCE!”", "“““WAAAAAAAAAAH!”””", "Countless voices united into a single large roar that chased after her.", "Finally, humanity's cavalry began to rush towards the Parasite army!", "**", "Seol Jihu couldn’t understand what was going on.", "Why did Raging Temperance stop attacking? And why was his pendant glowing?", "What was clear, however, was that a change had occurred inside Raging Temperance.", "It was undeniable. As the light flowing outside settled down, the darkness filling up the inside became more and more confused.", "Seol Jihu could tell how confused Raging Temperance was.", "[That’s right. Temperance…!]", "At that moment, a mass of black smoke came flying at Seol Jihu.", "It was Flone.", "[Right. Temperance… It was Temperance!]", "“…Flone?”", "Seol Jihu murmured, staring vacantly at Flone, who was shifting her gaze between the giant and the pendant. However, Flone wasn’t listening.", "[O Venerable Temperance!]", "She put her hands together in prayer and looked up at the giant with desperate eyes.", "[Please answer me if you can hear my voice!]", "“Keuu….”", "[Although the Rothschears did not serve you, you must remember that Rhetinhen transferred the Promise of Temperance to us!]", "‘The Promise of Temperance?’", "Seol Jihu frowned, trying to remember where he’d heard that phrase before.", "[A long time has passed, but the Promise still stands! And not long ago, the owner of the Promise handed over his rights to another man!]", "Flone pointed at Seol Jihu.", "[This is that man!]", "“Keuuuu…!”", "[My grandfather acknowledged this man as the rightful owner of the Promise! He is the man to whom you must keep your promise!]", "Flone continued passionately. Although Seol Jihu didn’t know what she was talking about, its effect was clear to see.", "Each time she mentioned the promise, the light became brighter. Seol Jihu’s pendant also began giving off a strong glow.", "That wasn’t all. The giant had also withdrawn his arms before he noticed. Slowly, it raised both hands and wrapped them around its temple.", "“Keeuuuak! Keeuuaaaaak!”", "All of a sudden, he began screaming, wriggling his body side to side. He was clearly in pain.", "Seeing this, Seol Jihu suddenly remembered the time he visited the ancient emperor’s villa.", "There, he met Flone’s grandfather, and….", "[Favor…. Necklace…. Oath…. Change….]", "[Promise with the Seven Virtue’s Temperance… in other words… on par with the Imperial Oath….]", "‘Could it be…?’", "Seol Jihu shifted his gaze.", "“Flone, what do you mean by Promise?”", "[It refers to the covenant that each family of the Empire made with a god. Remember, Rothschear served Castitas, the goddess of chastity?]", "Flone explained quickly, and Seol Jihu nodded.", "“So this Promise is a kind of wish?”", "[It’s not a mere wish.]", "Flone shook her head.", "[It’s a blessing and an oath that a family receives in exchange for devoting their lives to serve a god. As long as they remain loyal, not even a god can break this Promise!]", "Flone looked up at Raging Temperance.", "[Hurry! My yelling will have no effect on him! Right now, you’re the rightful owner of the Promise…!]", "At that moment, Seol Jihu instinctively knew what he had to do. He still had a few questions left, but those were for later.", "‘A promise that even a god cannot break…!’", "Seol Jihu clutched his pendant. Looking up at the howling Raging Temperance, he strongly wished in his heart.", "“…What is he doing?”", "Twisted Kindness furrowed her brows. She had set the stage for Raging Temperance in respect for his unsealing of divinity that disregarded its side-effect. However, rather than finishing off the expedition team, it was rampaging by itself.", "Twisted Kindness clicked her tongue and made adjustments to her plan. Although she did not want to get close to an unhinged divine being, something seemed to be going wrong.", "“What are you doing?”", "She drew closer and shouted, but Raging Temperance was unresponsive.", "“I asked what you are doing! Hurry up and…?”", "At that moment, Twisted Kindness noticed a change.", "Raging Temperance was in a strange state. As the outside light was restrained, the darkness stopped seething up and quickly subsided. It was as if the energy was being controlled.", "Raging Temperance was controlling his divinity?", "That was impossible.", "Hurriedly looking back at the expedition team, Twisted Kindness’ gaze fixed down on Seol Jihu.", "“That’s…”", "His glowing pendant immediately caught her attention. It was only a simple necklace when he was fighting her.", "‘Wait.’", "Twisted Kindness blinked.", "That wasn’t an ordinary pendant. Now, she could feel a powerful link between the pendant and Raging Temperance. An irresistible law of causality that even a god could not defy was restraining the giant’s mighty body!", "‘Don’t tell me!’", "Remembering the reason that the Parasite Queen could not leave the Corrupted Throne, Twisted Kindness gave a low groan.", "That wasn’t the only problem. The current Raging Temperance had lost his reason, only having his instincts remaining.", "So what if the enemy could forcefully control this instinct too?", "‘Now isn’t the time to be making petty schemes!’", "Despite not knowing what was really going on, Twisted Kindness made a cool-headed judgment.", "The pendant had to be destroyed. If she didn’t, she had a strong feeling that something unimaginable would happen.", "However, just as she was about to make a move, she flinched.", "Raging Temperance stopped its growling.", "“….”", "Turning its head, it looked straight at Twisted Kindness, who was floating in the air.", "At the same time that Twisted Kindness felt a subtle killing intent from its fixed gaze—", "Raging Temperance’s mouth gaped open.", "From its widened mouth, a blinding light erupted out.", "Twisted Kindness’ eyes shot open.", "An unexpected attack shot forward without a single warning!", "Kwaaaaaaaaa!", "In a split second, a beam of light tearing through the air swept past Twisted Kindness!"]}