{"cid": "155", "title": "Chapter 155. Extravagant Meals (3)", "content": ["Seo Yuhui was waiting in the back of a cave in front of a small bonfire.", "He could see a white pot with a closed lid hanging over the fire, along with dishes and eating utensils.", "“Aren’t you hungry?”", "He had honestly been slightly nervous since she asked him to secretly follow her in the middle of the night. This was unexpected.", "Seo Yuhui tilted her head before gathering her hands and gently speaking.", "“You’re always training until late at night every day. I figured you would be hungry around his hour… It’s not much, but I prepared a late night snack for you.”", "Seol Jihu was at a loss for words. It was because the light from the bonfire suddenly looked like a halo behind her back.", "'An angel?'", "Could a person make such a warm and gentle smile?", "Just the sight of her made him lose his wits, so Seol Jihu didn’t realize that his mouth was wide open.", "Finally coming back to his senses, he scratched his head and fidgeted with his hands.", "\"Ah… You even prepared a snack for me… I’m so sorry…”", "\"No, no. You pause your training to protect me, don’t you? I felt like I was taking your valuable training time, so I should be sorry instead.”", "Strictly speaking, she was right, but Seol Jihu had never thought of her as a bother. Not even once. Rather, the time he spent with her was close to healing.", "Even Agnes emphasized that eating well and sleeping well was an inseparable part of training, hadn’t she?", "He was forced to train to his limits the last time he came because he had to earn his qualifications of attending the Banquet. But since he wasn’t in a hurry this time, he was free to rest in the middle, rather, he had to rest. Jang Maldong, too, emphasized ample amounts of rest.", "“It’s almost done. Can you sit there and wait a bit?”", "Even so, hearing her politely speak to him in a way that he wouldn’t feel burdened made him feel thankful and all the more apologetic.", "He felt blessed.", "‘Who am I to receive all this?'", "Of course, Seol Jihu knew that Seo Yuhui wasn’t giving him special treatment. But even so, his feelings were way up on cloud nine, causing him to nervously glance back and forth while waiting.", "Seo Yuhui looked at Seol Jihu giggling to himself and glancing around, finding him extremely cute, before focusing her gaze back on the pot.", "Under a quiet night sky. The face glowing by the bonfire light looked so beautiful and noble that Seol Jihu spoke up even when he had nothing to say.", "\"Umm….\"", "\"Yes?\"", "\"Should I wake the others? I think it’ll be better if we all ate together.\"", "\"N-no.\"", "Seo Yuhui quickly turned her head.", "“No, absolutely not.\"", "She spoke firmly.", "\"Absolutely not?\"", "Seeing Seol Jihu surprised by the adamant refusal, she explained with a troubled face.", "“It’s embarrassing to wake them up over such a small thing… and the siblings were so tired that they fainted the moment they came.”", "\"Ah….\"", "“There’s nothing more delicious than a good night’s sleep for the three of them. To be honest, I made a fire here to not bother their sleep with the smell.”", "As a person who survived Jang Maldong’s hellish training, he could completely sympathize with the statement that nothing was more delicious than sleep.", "Seo Yuhui who had been feeling troubled, let loose a sigh of relief after seeing him nod in understanding.", "After a while, at the sound of bubbling, she hurriedly lifted the pot over a dish.", "Upon slightly opening the lid, a stream of white smoke flew up.", "\"Whoa…\"", "She had said it was simple. But seeing a dish beyond his expectations made him cry out in surprise.", "Inside the boiling soup was a neatly prepared chicken with its legs crossed.", "'Yeonggye baeksuk?'[1]", "But if there was a difference between this and the chickens he had seen on earth, it would be that this chicken’s skin and meat shined with a golden light.", "Not to mention the Golden Commandment, his Nine Eyes weren’t even activated, but he could still see golden light spill out. Even the soup was a shining yellow color.", "“What… what is this?”", "\"Oh, it’s nothing big. You know chickens, right?\"", "Seol Jihu who had been staring while drooling, nodded in a dazed manner.", "“There’s a similar breed of birds in Paradise as well. I saw them wandering around near the cave, and I luckily caught one and boiled it. I seasoned it with dark soy sauce and liquor so it should taste good enough to eat.”", "She continued to gently explain, but all her words did were to go in from one ear and out the other.", "It wasn’t for any reason other than the fact that it looked too delicious.", "The soft-looking skin, the meat oozing with juice, and the soup bubbling like lava…", "Seo Yuhui giggled before handing him a spoon.", "\"Please eat before it gets cold.\"", "\"Thank…\"", "'…you for the food.' Before he finished saying thanks, Seol Jihu dipped his spoon into the soup. And as soon as he took a sip, his eyes immediately widened.", "The sweet and savory taste of the soup seemed to gently embrace his tongue. The soup was so thick that even one spoonful filled his mouth with a savory fragrance.", "And the soup easily flowed down his throat like water.", "\"Have some of this too.\"", "Seo Yuhui had crouched next to him at some point and passed him a chicken leg. Seol Jihu brought it up to his face with trembling hands before taking a large bite.", "Biting into the tender meat, a clear liquid exploded out and spilled down his chin.", "The texture of the chewy meat dissolving into hot meat juice and transforming into a viscous cream that was sweet as honey was simply indescribable.", "Gulp.", "He could vividly feel the heat traveling down his esophagus after swallowing.", "'What on earth….?'", "Who knew such delicious food existed?", "Seol Jihu could swear that he had never tasted such delicious food ever since his head first sprouted hair.", "It tasted so good that there were faint tears in his eyes.", "‘Keuk keuk.", "He heard a laugh beside him.", "\"Is it that good?\"", "\"Yes… It’s absolutely delicious…\"", "“I’m glad it suited your palate. Hurry up and eat. The taste drops when it cools.”", "Getting back to his senses at those words, Seol Jihu heartily started to eat. There was nothing stopping him from good food.", "Nom, nom.", "With both hands supporting her chin, Seo Yuhui carefully observed Seol Jihu vigorously eating away. She let out a grin here and there while watching.", "\"You have to finish the soup as well….\"", "\"Gulp, gulp.\"", "\"Good boy, good boy. There you go.\"", "After lifting up the entire pot to drink all the soup, Seol Jihu sucked his fingers while looking at the clean set of bones left in the pot.", "He had slowed down in the middle to savor the taste, but it didn’t take him long to finish everything.", "'I wish there was more.'", "But it wasn’t the end yet. Seo Yuhui broke the leftover bones and handed them to Seol Jihu who was sucking his fingers.", "\"Try these too.\"", "\"…The bones?\"", "\"The bones of this bird are edible.\"", "She strongly recommended him to try it, saying that this precious beast, no, this bird had no inedible parts from head to toe.", "It didn’t seem like she was joking, especially when he saw her making a serious face that betrayed her determination of feeding it to him no matter what, so Seol Jihu hesitantly put it inside his mouth. And he flinched.", "A warm liquid had spilled out from the broken bone.", "'Bone marrow?'", "Or that’s what he thought it was until it started to taste like corn porridge, causing him to enthusiastically start sucking on the bone.", "And after a while, the bone itself started to dissolve, letting out a strong umami flavor. It was a highly addictive texture that made him want to keep it in his mouth.", "'Delicious.'", "After clearing the bones and licking the pot clean, the existence of a bird disappeared from the world.", "The pot was so clean that Seo Yuhui remarked that she didn’t even have to wash the dishes.", "'I’m full.'", "Seol Jihu who had been enjoying the lingering taste in his mouth, scrunched his shoulders and shivered.", "His body was burning hot as if there was a tiny sun inside him, so the cold night breeze that enveloped him and cooled him down felt so good that he shuddered.", "‘This is happiness.'", "‘Heh.’ The brightly smiling Seol Jihu began to nod his head off.", "He had trained hard, had washed off with cold water, and had eaten warm food.", "His tense body relaxed.", "'Sleepy….'", "Back when he had lived with his ex-girlfriend, Yoo Seonhwa had engraved a habit into him. Every night, she had always given him food to eat until he was full before making him sleep early. Because of this, Seol Jihu began to succumb to the beckoning of sleep.", "\"Huhu.\"", "The last thing Seol Jihu saw was Seo Yuhui extending her hand towards him with an ambiguous smile.", "\"I caught you, my little rabbit.\"", "*", "Seol Jihu opened his eyes when the sun was high in the sky.", "After raising his body from the soft sleeping bag, Seol Jihu looked around. He could see neatly folded sleeping bags in one corner and breakfast laid out on a table in front.", "He couldn’t find Jang Maldong and the siblings, so they must have gone out to train.", "After staring at blank space for a while, Seol Jihu suddenly started sniffing.", "He wondered where the smell was coming from before he realized that his whole body had traces of the fragrance.", "'This smell….'", "He had smelled this scent two times before.", "Once at Seo Yuhui’s house… and was the other time when they were returning back to Haramark after the Banquet was over…?", "'?'", "Looking around his body, his gaze was fixed on his arm. Only one area was pale.", "Staring at it with drowsy eyes for a while, Seol Jihu brushed off the thought, thinking that it was because he had spent too much time under the sun, before scratching his arms and standing up.", "After eating the delicious breakfast Seo Yuhui had made for him, a refreshing feeling suddenly rushed throughout his body while he was outside stretching. It felt as if his vitality was exploding out like a violent storm.", "Not only that. Ddududuk. Seol Jihu cracked his neck before tilting his head, realizing that he could suddenly see farther.", "Seol Jihu’s eyesight was 1.2 for both eyes. But today, his field of vision seemed to be far clearer than before.", "With a bit of exaggeration, he could clearly see a flower on the road up to the first peak if he concentrated a bit.", "‘Were my eyes always this good?’", "His eyes that were darting around rested on Phi Sora who was lying down on a place not far away.", "'Hah!'", "Black sunglasses and a red string bikini. On a mat. He didn’t know where she got it, but he could also see a parasol.", "No matter how he saw, Phi Sora who was enjoying the sun with her hands clasped behind her head, looked like she was on a beach.", "'She came to play, huh.'", "Seol Jihu clicked his tongue, but he didn’t realize that his gaze was stolen by Phi Sora’s undeniably sexy figure.", "A healthy skin tone, and a cute belly button that made him want to poke it.", "And because his eyesight became better, he could make out a mole hidden between the valley of her breasts…", "The black sunglasses suddenly turned to look at Seol Jihu. Phi Sora smirked and elegantly rose from her seat. With her firm thighs, she strode towards Seol Jihu, catching him off guard, before suddenly asking.", "\"Why are all men like this?”", "\"Huh?\"", "\"You have such a graceful and elegant girlfriend. Yet you still have eyes for other women?’", "\"What on earth are you suddenly going on about?”", "\"Stop pretending you don’t know what I’m talking about. I saw it all, you know.”", "Extending the last word provokingly, Phi Sora slightly raised her sunglasses and smiled with her eyes.", "But suddenly noticing that the other person’s gaze was directed towards a specific part of her body, Phi Sora frowned while covering her chest.", "\"H-Hey! Aren’t you staring a bit too directly? It’s embarrassing.”", "\"….\"", "\"No. I didn’t stalk you on purpose. It’s just— I couldn’t sleep last night. I wanted to take a morning stroll, and when I was walking around the cave, I coincidentally…”", "Phi Sora trailed off her words before suddenly sticking her body up close to him. Seol Jihu started, his nose simulated by the faint rose scent.", "“You know. I’ll keep your secret to the grave, so can’t you tell me? You know I’m tight-lipped, right?”", "She snorted and gulped, showing her extreme interest. But Seol Jihu made a confused face.", "\"Tell you what?\"", "“That Unni is famous for being an iron wall to men, so how did you get her heart? Just when did you two start going out?”", "\"What do you mean go out?\"", "“Oh please! I’ve seen everything. What are you trying to hide?”", "Thinking that Seol Jihu was playing dumb, Phi Sora pouted.", "“The two of you just…. Especially you. What, you think I didn’t see you dig your face into her chest like a puppy”", "“Miss Phi Sora. I don’t know what you’re talking about.”", "\"Hah!\"", "Phi Sora crossed her arms, making an indifferent expression.", "\"Liar…. Fine then. Don’t talk if you don’t want to. All secret relationships are like this anyways.”", "After shooting him a glare, she stuck out her lower lip and turned away.", "“Don’t worry. I don’t have a hobby of gossiping around.”", "Phi Sora walked away, waving her hand.", "'What?'", "Seol Jihu shook his head, thinking that weird people came up with all sorts of provocations.", "He then finished up stretching his body before tying the rope attached to several logs and starting his training.", "'I feel good today for some reason.'", "Whether it was because he had eaten something good before taking a good night’s rest or not, his whole body felt light and full of energy.", "This was it! This feeling of energy boiling up the more he ran. This feeling of being refreshed while sweating buckets!", "However…", "Feeling what he thought was a placebo effect not disappear after several hours, Seol Jihu couldn’t say that it was just a delusion anymore.", "Soon, it was time for the sun to set. It should have been normal for him to collapse if he had trained without rest until now.", "But instead of feeling exhausted, Seol Jihu only felt his breath becoming a little rough.", "It wasn’t a lie, but the more he trained, and the more he sweated, something inside his stomach seemed to be digested, forcibly making his body healthier and healthier.", "And when he was training while ignoring this weird feeling…", "[Your Endurance stat increased from ‘Low (High)’ to ‘Intermediate (Low)’.]", "Seeing the message appear with the notification sound, he finally stopped his training.", "‘What?'", "He was stupefied.", "Excluding the Mana stat and the Luck stat, the Endurance stat was the hardest physical stat to raise.", "Well, while of course he deserved it, getting beaten black and blue by Agnes did make it rise by quite a lot.", "No. In the first place, one’s physical level could not be raised with just repetitive training unless one exceeded his or her limit.", "Seol Jihu carefully examined his body in the midst of his bewilderment.", "'Again?'", "His skin was unnaturally white. Picking at it with his fingers, a layer of skin came off like he was shedding.", "Whether it was because he was under the sunset or not, it looked like the new skin underneath was shining in a very subtle gold color.", "'Huuuuh?'", "It felt like his muscles grew more elastic while his body became twice as flexible as before.", "There weren’t just one or two strange things, so Seol Jihu finally grew suspicious and sat down.", "He sat cross-legged with his eyes closed and peered inside himself through the Mana Cultivation technique.", "Pong, pong, pong, pong!", "Observing it like this made him realize that his heart was unnaturally active. His blood was being powerfully pushed through his arteries with every pump.", "Yes. His body was signaling a green light more than any other time.", "That wasn’t all.", "While concentrating, he found that his senses had also become much more sensitive than before…", "Tiirinng!", "[The Miscellaneous Ability, ‘Intuition (Low)’ has evolved to ‘Intuition (Intermediate)’.]", "\"Whaaaaat?\"", "He was so surprised that he shouted out loud and popped opened his eyes.", "‘Now why did you suddenly evolve?’", "His intuition obviously did not reply. Only, the new notification message was there right in front of him.", "'What did I do?'", "He didn’t even do the log-avoiding exercise. Seol Jihu held his head.", "But he only worried about it for a brief moment. He hastily stood up.", "He didn’t know what exactly happened, but he was sure about one thing.", "In his current situation, the once static abilities in his Status Window were suddenly moving like a rapid stream.", "No. This was on the level of a violent storm rather than a rapid stream.", "The wind, the water. Everything was pushing him forwards.", "To develop.", "To become stronger.", "Seol Jihu wasn’t someone who would miss this opportunity. He would only become satisfied after he completely digested this unknown source of power and exhausted himself before it disappeared.", "And so after doubling the number of logs and putting on twelve sandbags, Seol Jihu resumed his training again.", "1. Korean chicken soup. "]}