{"cid": "170", "title": "Chapter 170. Crushed Petal", "content": ["The change was quick to occur. As soon as the Medusa was killed, its control over the Parasites had been released, causing the hundreds of Parasites filling the land to run amok.", "Some stopped moving completely, while others collapsed or struggled violently. Overall, having lost their mother, the Parasites were like fruits ready for picking. The human warriors only had to pick and choose which ones they wanted to eat.", "Chohong tore through a group of enemies that were now weakened to the point of being pebbles on the side of the road, and quickly ran up to Seol Jihu. She put down her mace, its thorns dripping with reddish-black blood, and called for an explanation.", "“You… What happened?”", "Seol Jihu looked around the area quietly. Most of the Parasites were still convulsing on the ground, but he could also see some that managed to prop themselves back up.", "The Hydra seemed to have realized what was going on and made its move. But since Hydras were supposed to have underdeveloped intelligence and control ability, there had to be a limit to how much control they could exercise over the Parasites.", "Thinking this far, Seol Jihu stopped and opened his mouth.", "“I’ll tell you later. For now—”", "When Seol Jihu pointed at another Medusa in the distance, Chohong clicked her tongue.", "“You better give me a proper explanation. When this all ends.”", "She glared at him with a somewhat displeased look, but she was only worried because of his unexpected action.", "Seol Jihu also knew Chohong would ask for an explanation about this matter. So he turned to the soldiers who quickly arrived and spoke.", "“Let’s go.”", "“…Pardon?”", "“Isn’t it more efficient to take care of the Medusas than to focus our attention on the small fries?”", "“Ah, yes!”", "The soldier standing at the front had a disbelieving look, but he replied sonorously once he looked where Seol Jihu’s finger was pointing.", "Phi Sora, who had led the fight like a fierce lioness, chuckled bitterly. She couldn’t reach the Medusa even after toiling away until both her armor and flesh were covered in blood, so she couldn’t help but feel a little dispirited when Seol Jihu had taken care of the Medusa so easily.", "Of course, since she knew that Seol Jihu had the ability to fly and the power of Soma’s Essence, she wasn’t exactly surprised by this.", "“Don’t be too surprised.”", "Oh Rahee shook off the blood on her longsword and snickered.", "“That’s the kind of guy he is.”", "Phi Sora glanced back at her.", "“You say that like you know him.”", "“I do.”", "The corner of Oh Rahee’s mouth curled up.", "“He was like that during the Banquet too.”", "The march continued. Not forward, but sideways.", "The first attempt might have been nerve-wracking and unfamiliar, but things got easier the second time around.", "The central army of the Parasites had been dispatched to the frontlines to fight the soldiers sent out from the fortress. Naturally, the sudden ambush had caught the Medusas off guard.", "Seol Jihu waited for his comrades and soldiers to drive the guards away before flying with Flone and cutting the Medusa apart.", "It wasn’t as if there weren’t any Parasites staying by their mother’s side to protect her. However, they were only minor obstacles with Marcel Ghionea, Maria, and other Archers and Priests from the fortress focused on supporting Seol Jihu.", "Koong! When the severed halves of the Medusa struck the ground, it rumbled with a heavy thud.", "Seol Jihu let out a deep breath while rolling his ankles to calm the electrifying sensation in his feet.", "This was the third one.", "By now, the seven remaining Medusas had realized what was going on and were struggling. Setting aside the fact that others of its kind were being slaughtered easily, the human soldiers pushing forward from the front would increase with the fall of each of their comrades. Now, it was getting harder and harder to ignore how big the human forces were getting.", "The Medusas had purposely separated their guards and a small number of the main combat force to form a police line, but there was one thing they had overlooked.", "And that was that Seol Jihu wasn’t the only human who could ambush and kill them given the opportunity.", "With the enemies’ defense line weakened, one woman quietly flew into the air.", "This woman, with her lemon-colored hair fluttering behind her, stepped through the air as though she was using the legendary Flight Steps. Approaching a Medusa facing the left, she spread her hands open.", "Threads shot out from her ten fingers, multiplying in the air and forming a spider’s web that pounced on the startled Medusa.", "As Seol Jihu began his fourth flight, he could see Agnes flicking her hands like the conductor of an orchestra and a Medusa being dismantled into dozens of pieces.", "And when blue flames suddenly flared up from the threads, the Medusa burned to ashes.", "Seol Jihu landed on the ground at the same time as this woman.", "“Miss Agnes!”", "Other than the tiny bloodstain on the hem of her skirt, she was clean and spotless. It was hard to believe she was in the middle of a war.", "When Agnes saw the young man running towards her, she made a slightly surprised expression.", "“You defeated… three?”", "Just as Seol Jihu was about to nod his head with a bright smile, the man and woman simultaneously turned their gazes.", "Seol Jihu immediately activated the Blessing of the Circum, and Agnes grabbed onto Seol Jihu before hastily jumping off the ground.", "Chieeeek! Several black streams of water struck down where the two of them had been standing a moment ago.", "Seol Jihu became dazed. A few drops of the unknown liquid must have splashed as the tri-circular shield on his left arm was melting.", "Agnes informed calmly.", "“A Hydra.”", "A hole appeared in the ground as if the earth was opening its mouth. Seol Jihu watched this sight before turning his head when he heard Agnes’s voice.", "Just as she said, the mammoth, no, the Hydra was facing them.", "With four of its heads standing straight and some sort of fluid dripping from its mouths, it looked enraged.", "This was to be expected. It was already working hard to control the Parasites that had lost their mothers, but with more Medusas being slaughtered, it could no longer bear the burden of controlling all the rogues.", "In the end, it had given up on controlling the Parasites and targeted Seol Jihu who was the cause of all this trouble.", "The Hydra puffed up its cheeks as if to say it wouldn’t fail to kill the young man a second time. However, it suddenly staggered greatly.", "Next, each of its heads let out a scream and vomited out its vicious fluid.", "“GUAAAAAA!”", "Koong, kwang! It flung its nine heads in the air and stomped on the ground indiscriminately. When Agnes spotted smoke flickering above the Hydra that was running amok like a runaway elephant, she opened her eyes wide.", "“Mental interference.”", "Seol Jihu still looked befuddled.", "“I heard that the Haramark Royal Family spent an exorbitant amount of money to hire a mental attack-type Magician. This must be his handiwork.”", "Unbeknownst of Agnes and Seol Jihu, this Magician had originally planned to use a wide-array mental interference magic on the Parasites but changed his target to the Hydra instead.", "Now realizing this, Agnes snatched Seol Jihu back as he was getting ready to rush forward.", "“Miss Agnes?”", "“Don’t.”", "Agnes raised her glasses.", "“Even though the Hydra might be a battle-frenzied fool, it is still a high-ranking species. The mental interference should only work for 20 minutes at most.”", "“But 20 minutes is more than enough!”", "“The reason it is struggling so hard right now, is so that it can shock itself into snapping out of its dazed state. The mental interference will be cut short the more it is stimulated from the outside.”", "Seol Jihu shut his mouth. He understood what Agnes was getting at.", "“You’re saying it will be better to defeat more Medusas in the meantime.”", "“Yes, unless you have the means to defeat that huge monster in one blow.”", "Seol Jihu turned around without a word of complaint. He couldn’t be sure until he fought the Hydra directly, but he had no confidence in killing a monster that was several times the size of a Medusa. Furthermore, he didn’t see the need to be so adventurous.", "Soon, the duo began to run in the same direction.", "“It’s possible—”", "Agnes muttered as she ran.", "“That this war will end earlier than we think.”", "And hearing this, Seol Jihu smiled. Almost as if he was certain things would turn out this way.", "*", "“Great!”", "When Seol Jihu and Agnes joined up to take down another Medusa, Ian raised his fists triumphantly. With this, five of the ten Medusas had fallen. As a result, the tide of battle had changed to the point where it was noticeable from the fortress wall, and it was continuing to change for the better.", "The gale of change Seol Jihu brought forth had transformed into a storm that had taken over half the battlefield.", "Ian continuously stroked his beard to calm himself down.", "On the other hand, Teresa said she couldn’t hold back her boiling blood and went down to lead her own cavalry.", "‘Thinking about it now….’", "Has there ever been a time since the domination of the Parasites that the Kingdoms have had the edge in war?", "No, there for sure wasn’t. In Paradise, humanity had always been on the losing side of the war against the Parasites.", "In fact, there were times when people participated, fully knowing they were heading towards their own deaths.", "This was the first time. That humanity was overwhelming the Parasites in such a large-scale battle….", "Chills ran down Ian’s back the more he analyzed the situation. As he surveyed the battlefield in a trance, a visage of a person surfaced in his mind.", "‘Are you seeing this, Maldong?’", "A smile of satisfaction appeared on his wrinkly face like a blooming flower bud.", "‘Our choice wasn’t wrong.’", "Ian let out a hearty chuckle.", "Then…", "Without any warning or an omen, an unexpected change struck like a bolt of lightning from a clear sky.", "The first change was the Parasite army halting all movement simultaneously. Then, as if they had all promised beforehand, they turned around and began to retreat. They didn’t stop even when the humans beat them down or chased after them and only put all of their efforts into retreating.", "The second change was a strange sensation that all humans on the battlefield felt. This odd sensation crept up their skin. It was hard to describe, but something about it felt… twisted.", "Everyone present felt this unknown ominous feeling shake their bodies.", "It was the same for Teresa who was riding her white warhorse. She stopped just as she was about to command the soldiers to chase the fleeing Parasites and instead raised her binoculars.", "However, her eyes narrowed only for a moment.", "When her expanded vision caught sight of the source of the change, Teresa’s arms drooped down helplessly.", "Clang!", "The crystal binoculars fell to the ground with a loud ring, and Teresa’s body wavered dangerously.", "“Are you okay?”", "A knight asked in a startle, but he didn’t have to help her stand.", "“What’s wro—”", "In the next instant, the knight’s mouth convulsed before freezing stiff. He had felt the aura encroaching the battlefield – an overwhelming, immeasurable pressure that seemed to want to devour the fortress and the entire valley.", "“R-RETREAT!”", "Teresa roared.", "“The retreat signal! Hurry!”", "Even in a flurry, the knight hastily took out a communication crystal.", "BOOOOO—! The sound of a warhorn rang out three times.", "Hearing the note resounding in his ears, Seol Jihu looked to his left and right. He could see soldiers busily moving around.", "“Excuse me….”", "“Please, go ahead and retreat to the fortress.”", "Before Seol Jihu could say anything, the soldier replied solemnly.", "“There’s something we need to do.”", "From his pocket, the soldier took out a pouch filled with oil and scattered it all over the corpses of the Parasites. Contrary to how calm he sounded, his hand was shaking nervously, causing the oil to splatter.", "While Seol Jihu blankly watched the soldier set the corpses on fire, Chohong placed her hand on his shoulder.", "“…Let’s go.”", "She had only said two words, but Seol Jihu had a strong feeling that he had to listen to her no matter what.", "The essence inside him seemed to get hotter, and the mysterious energy emanating beyond the retreating Parasite forces seemed to make his body sticky.", "Seol Jihu followed his comrades and returned to the fortress. Those inside the fortress seemed to have understood the situation as countless murmurs rang out.", "When Seol Jihu climbed up to the top of the fortress wall, he could see Teresa clutching onto the edge of the fortress wall and peering forward with her eyes wide open.", "It wasn’t just Teresa either. The Earthlings around her were all showing similar reactions. As for the soldiers, their expressions were undecipherable as though they were calm from having accepted their fate.", "Acrid smoke rose up from several parts of the battlefield. Soldiers who had not immediately retreated were busy setting the Parasite corpses ablaze.", "The new army stopped their march and didn’t move past a certain distance.", "At that moment, a shadowy figure flew up from the right wing of the army. This figure adorning a pair of bat wings circled in the air before flying toward the fortress.", "As the figure approached, everyone on the fortress wall could see its true form.", "The figure was a woman with blood-red eyes and deep violet hair that reached down to her hips. Other than the two goat horns and bat wings she had, the woman looked no different than a human being.", "“Hnnnng.”", "When a coquettish hum rang out, people above the wall seemed to have woken up from their trances. It was then that Seol Jihu realized he had been staring at her dazedly. Everyone was looking up as if they were all affected by charming magic.", "“This fortress….”", "Surprisingly, this woman had flown until she was right above the fortress wall.", "She lay down on her stomach using the air as a mattress. With her chin resting above her interlocked fingers, she looked down with an arrogant gaze.", "From the way she repeatedly moved her legs up and down, it looked like she was here as a spectator.", "“Well… it’s pretty well-made. Considering it was you guys.”", "She even clapped her hands sarcastically.", "‘What….’", "Inwardly, Seol Jihu was shocked speechless.", "It was crazy enough that she flew all the way here by herself. But what was with her attitude?", "Kirik, kirik! The Archers nocked their arrows. However, she opened her mouth without the slightest change in her expression.", "“Don’t~”", "She spoke like a whining child.", "“I’m just here to spectate. Plus, you already know… that it’s futile.”", "When her tone went up playfully, the Archers all froze up as if a spell had been cast on them.", "“It’s not like this is the first time you guys from Haramark are seeing me. Don’t be like that, geez.”", "The ends of her eyes curled to crescent moons before she fixed her posture and sat relaxedly with her legs crossed.", "With a black see-through dress that fully revealed her skin and clothing that barely covered her private parts, her voluptuous figure was fully on display.", "She stuck out her long tongue and licked her lips seductively.", "Seeing this practically naked woman, Seol Jihu furrowed his brows.", "It wasn’t just because of the way she was dressed. Judging purely by her voice, clothes, and attitude, she looked like a prostitute who had worked at a bar for at least 10 years.", "However, the silvery light coming off from her body felt immeasurably pure and noble.", "This indescribable difference confused Seol Jihu even more.", "It was then.", "Turrruk! With a harsh scratching sound, twelve arrows shot up to the sky.", "Each and every arrow was as powerful as a spear, and they hurled towards a single enemy.", "However, when the woman shook her head lightly, her hair strands moved as if they had a mind of their own and caught the arrows completely.", "This superhuman display caused gasps of shock to ring out.", "“I…”", "She let out a deep sigh before continuing.", "“I told you not to— Hm?”", "When her seductive, scintillating eyes looked down, they widened to a circle. She blinked repeatedly, and when she saw the grey-haired Archer sending her a deathly glare, she spread her lips just slightly.", "“You’re… him, right? The guy who was crying his heart out in front of me.”", "Marcel Ghionea’s eyebrows twitched.", "“You are! Right, I remember now. You cried like your whole world came crumbling down just because I took away one girl. You were bawling so hard that even I started to feel bad—”", "“I’ll— kill you!”", "Unable to listen to her any longer, Marcel Ghionea growled like an enraged beast. In response, the woman burst out into laughter.", "“Ohohohohoho!”", "Her laughter carried terrifying potential energy that caused the entire fortress to rumble.", "Those who were weak-hearted staggered as if they were about to collapse, and those who were High Rankers and above closed their eyes and clenched their teeth.", "Seol Jihu followed his instincts and roused the anti-evil attribute within him, holding back the mind-shaking laughter.", "Then, the laughter stopped. She had laughed so hard that she continued to snicker while she used her hand to wipe away her tears.", "At the same time, her hair unraveled and dropped the arrows it had stopped.", "“Right… I’ll specially acknowledge you. You must have been so bitter and resentful. I still can’t forget the emotion I felt from you back then.”", "“You…!”", "Marcel Ghionea gritted his teeth while panting with one knee on the ground.", "The woman slicked her hair up and continued her teasing voice.", "“So, what do you want to do? Do you want to say hello to her? I can bring her here if you want. Ah, but you might not want to see her. She’s a lot different than what she used to be. You might even cry if you see her now.”", "‘Say hello?’", "Seol Jihu glanced at Marcel Ghionea before looking back at the woman.", "The reason Marcel Ghionea was so enraged and the reason the entire fortress was frozen stiff. There had to be only one way to explain it all.", "One of the leaders of the Parasite’s Seven Armies had appeared. To be precise, Vulgar Chastity had made her appearance in Arden Valley.", "The possibility was always there, but now that things had turned out this way, Seol Jihu felt as if a hammer had struck the back of his head.", "The problem was that there were two more existences emanating the same level of power as Vulgar Chastity.", "With each of them leading their own armies."]}