{"cid": "310", "title": "Chapter 310. Preparations (3)", "content": ["“As a frontline city, Haramark will have difficulty joining the battle. Plus, Taciana Cinzia is someone I don’t feel comfortable dealing with…”", "Philip Muller trailed off as he glanced at Seol Jihu.", "“You probably cannot guarantee anything either. But I would like you to ask them anyway. The Star of Sloth is a Magician like me. If she helps, she will become a huge part of our battle power.”", "Seol Jihu nodded in agreement. If Philip Muller would go out of his way to talk to two other Executors, talking to Cinzia was the least he could do.", "“Alright, I’ll give it a try.”", "“Good.”", "Philip Muller let out a short sigh before taking out a crystal orb and putting it on the table.", "“Contact me when you get Haramark’s reply. We can share each other’s progress then.”", "Seol Jihu took the communication crystal as if it was a precious treasure.", "“I’m sorry for visiting you out of the blue. I enjoyed talking with you. It was a very hopeful time.”", "Seol Jihu felt a strange sense of déjà vu.", "Hopeful time. He felt like he heard the same phrase before.", "Was it King Prihi?", "“I should get going.”", "Philip Muller got up.", "“It looks like things are going to get busy.”", "*", "The meeting ended.", "Philip Muller said he didn’t need to be sent off, but Seol Jihu replied he would at least see him out to the door.", "“You don’t have to be so polite. To be honest, I debated talking to you casually several times during our conversation.”", "“I’m more comfortable doing this.”", "The Star of Avarice spoke discontentedly before hurriedly leaving the building. Seol Jihu, who was talking with Odelette Delphine, suddenly shouted.", "“Mister Philip Muller!”", "Philip Muller stopped, his head turning around and showing his clear eyes.", "“What’s up?”", "“Thank you.”", "Seol Jihu expressed his thanks. To be honest, that was all he could think of.", "He felt reassured for some reason. It was like someone appeared out of nowhere to hold him up when he was wandering around in the darkness with a body that could collapse at any moment. And he was saying, ‘Don’t fall. You got this. You can lean on me if you’re tired.’", "“About what?”", "“Just, everything. Take good care of me.”", "Philip Muller blinked rapidly, taken aback by Seol Jihu’s gratitude. He stared for a moment before grinning.", "“Well… Don’t be chummy with only Luxuria.”", "He turned back to the front.", "“And get a little closer to Avaritia too.”", "He left, leaving behind those ambiguous words.", "Seol Jihu drew a heavy breath as he stared at the backs of Philip Muller and Odelette Delphine as they walked away.", "Finally. He finally felt like he was making some progress.", "*", "Seol Jihu prepared to leave for Haramark that very day.", "What Philip Muller said wasn’t wrong. No one knew what would happen to the Middle World while they were in the Spirit Realm.", "They needed to prepare as much as they could before leaving so that the Middle World would hold out until the World Tree’s revival, even if that only meant a futile struggle.", "“Jihu~”", "While Seol Jihu was busy packing his bags, Seo Yuhui walked into the office.", "“Ah, Noona, you’re here.”", "“Mhm. I heard from Miss Kim Hannah. You’re going to Haramark?”", "“Yes.”", "Seol Jihu didn’t forget to share how things were progressing. To be more precise, Seol Jihu told Kim Hannah, and Kim Hannah relayed the message to the members.", "Given the scale of the operation, he had to tell them early on so they could accept it more easily later.", "In truth, most of them had known Seol Jihu’s goal since the moment the Halep siblings and Hoshino Urara came.", "Perhaps because of it, clouds of war were beginning to swirl around Valhalla. Some of the sharper members had already gone into intense training or equipment inspection.", "“Oh right, have you fully recovered?”", "“Mmmn, I’m still holding onto Moirai’s Souvenir.”", "“Ah… You haven’t used it yet?”", "Seo Yuhui gave a bitter smile.", "“To tell you the truth, there’s something I want to do… but given the circumstances, it looks like I should recover my strength.”‘Something she wants to do?’", "Seol Jihu tilted his head.", "What did she want to do with Moirai’s Souvenir?", "“Anyway, look at your face! Jeez. The Neutral Zone’s over, yet it’s become so thin again.”", "Seo Yuhui reached out and carefully grasped Seol Jihu’s emaciated face. The soft, warm touch almost made Seol Jihu fall asleep, but he barely held himself together.", "Seo Yuhui was truly a devilish woman. If he loosened his focus and went into her arms, he would forever be unable to escape.", "“What a pity.”", "“No, I’m fine.”", "“Fine? I don’t think so. Say, is there anything this noona can help you with?”", "Hearing this, Seol Jihu flinched. He would have said he was fine if it was at any other time. But maybe because he met with Philip Muller, a certain thought crossed his mind.", "That they had to gather all of humanity’s battle power.", "And this naturally made him recall one particular person.", "“Um….”", "“Mhm, anything is okay, so tell me.”", "Seeing Seol Jihu hesitate, Seo Yuhui consoled him by gently caressing his cheek.", "Seol Jihu asked with difficulty.", "“Can you bring someone here?”", "“Hm?”", "“During the valley war, there was someone who saved me before I was killed by Undying Diligence. I heard later on that she was one of the strongest fighters in Paradise.”", "Seo Yuhui’s hand froze.", "“Are you talking about Miss Baek Haeju?”", "“Yes, that’s the name. The Sacred Empress, right?”", "Paradise’s first Level 8 Earthling, the Sacred Empress.", "In truth, Seol Jihu did not know much about her. All he knew was that she used a spear just like him and that she played an active role in the valley war.", "Although his memories became hazy whenever Future Vision activated…", "[I don’t know why you’re here….]", "But he clearly remembered the words she said when she saved him from the brink of death.", "“Don’t you know her, Noona?”", "Seo Yuhui’s face was faintly stiff.", "“I do, but…”", "Her voice fell to a crawl as she showed signs of being reluctant.", "‘Is this related to the argument she had with her back then?’", "“…Do you really need her?”", "Seol Jihu had a reason for asking.", "[If you’re talking about the spring, don’t even mention it. Are you running your mouth off because you don’t know the military strength needed to ward off a single Commander?]", "[I know that the method of using the spring is limited. But if we unite with the remaining forces of the Spirit Realm, we might just be able to…]", "That was what the future Eun Yuri said. That the method of using the spring was limited.", "Although he would have to go there to be sure, it sounded like there was a limit to how many people could enter through the spring.", "This meant he needed to form a powerful team with a small number of people.", "“Yes.”", "And so, Seol Jihu made this shameless request.", "“I’m sure she will be of great help to my plan. I’m positive.”", "Seo Yuhui bit her lower lip. Thinking about it, it was entirely possible for them to face an Army Commander. She knew how busily Seol Jihu was working in preparation of this plan.", "More importantly, there was simply no way she could refuse an earnest request from her cutie pie.", "“…Okay.”", "In the end, she agreed.", "Seol Jihu’s complexion brightened instantly.", "“I’ll talk to her. But I don’t know how she will respond, or whether she will even come… I used the chance I had last time.”", "“Chance?”", "‘Did the Sacred Empress make a pact with the Daughter of Luxuria to help out just once?’", "As Seol Jihu was thinking this…", "“But, mm…”", "After debating whether to say this or not…", "“If I say it’s your request, she just might accept it.”", "Seo Yuhui said with a meaningful smile.", "*", "Seo Yuhui left Paradise after accepting Seol Jihu’s special command.", "Seol Jihu also left Eva that day and arrived at his destination five days later.", "He had come home after a long time.", "Walking through the streets of Haramark that he was so familiar with, he felt a refreshing feeling spread out inside him.", "Eat, Drink, and Enjoy was just as clamorous as always, and the house Seo Yuhui stayed in was still the same.", "Seol Jihu stopped in front of the building that used to be Carpe Diem’s office. Looking at the worn-down place, he was reminded of the past.", "He wanted to enter but forced himself to turn away. Even if he went in, there wouldn’t be anyone inside.", "Jang Maldong was training the three newbies in Huge Stone Rocky Mountain, and it wouldn’t be until late tonight that he would come back.", "On the other hand, he didn’t have time to be engrossed in his sentiments. He had to go on this expedition as soon as possible and hasten the World Tree’s revival.", "Every minute was of utmost importance.", "‘I don’t have the faintest clue how Miss Cinzia will respond.’", "He had already called Teresa on his way and let her know. Although she didn’t hesitate to accept his request, just as he expected, she couldn’t give a definitive answer when it came to mobilizing Sicilia.", "This wasn’t a matter of another city, but a matter of another organization. So even if the Haramark Royal Family issued a conscription call, there was a chance Cinzia would not comply.", "Seol Jihu thought the same way.", "‘I doubt she will mobilize so easily.’", "He needed a way. A method to make the Star of Sloth move.", "Soon, he began to see the fluttering flag of Sicilia’s building in the distance.", "Feeling parched, Seol Jihu swallowed hard.", "*", "“What a surprise, what a surprise.”", "Taciana Cinzia, boss of Sicilia and the head of the southern war hawks, was the same as always — a thick crimson coat draping over her shoulders like a cloak, the red hair flowing down like the mane of a lion, and a voice tinged with boredom.", "“It feels like it was just yesterday that you came to Haramark. Now you’ve gone beyond the position of Carpe Diem’s leader and risen to be the representative of a city. Purely based on position, we are on equal levels.”", "“I just got lucky.”", "“I see you’re still needlessly modest. Well, you were a peculiar one since the Neutral Zone.”", "As Cinzia put a cigar in her mouth and bit down, Agnes, who was standing straight next to her, lit it in a smooth motion.", "“I wonder how you’ll be the next time we meet. What do you think, Agnes?”", "“I do not have an opinion.”", "Agnes retorted bluntly while retracting her hand.", "A languid smile hung on Cinzia’s face.", "“My, it’s been a while since you’ve met this child of yours. Aren’t you being a bit cold?”", "“I did not mean I had nothing to say. It is just that he is doing fine by himself.”", "“But can’t you say something as his mother? Like encouraging him to aim for the position of an Executor.”", "“Mother? I’m a maiden who is yet to marry.”", "Cinzia cackled at Agnes’ flat denial.", "“Try to understand. She might be acting cool, but I’m sure she’s sulking on the inside.”", "“Huh? Miss Agnes is sulking?”", "“Mm, who can blame her? You left Haramark without saying a word to her. Agnes was quite heartbroken at the time.”", "“Just to be clear—!”", "Agnes raised her voice in a flash.", "“I was not ‘heartbroken’ in the slightest. I did not care much.”", "“Hmm, I thought I saw someone snooping around the empty building that night.”", "A short ‘keuk’ rang out. Agnes clenched her teeth as her face began to turn red.", "Cinzia burst out into laughter, clapping her hands.", "“Sorry, sorry. It’s just that the two of you make for a good picture. I almost want to force you two to marry, just so I can watch your married life.”", "“Please spare me the nonsense.”", "“Alright, alright.”", "Cinzia waved her hand.", "“That’s enough joking around for me too. Now, let’s go back to the reason the renowned Valhalla Representative has visited Sicilia.”", "Ssp. The sound of air being sucked in rang out, and a white smoke flowed out from between Cinzia’s red lips.", "As Seol Jihu was preparing to give the speech he prepared—", "“Well, I can take a guess.”", "Cinzia seized the initiative.", "“The Federation’s visit and the recent visit of the Star of Avarice. Just these two is enough information. Though, I still don’t understand why the Eva Royal Family released Hoshino Urara.”", "Seol Jihu didn’t show it, but he was surprised on the inside. His recent activities seemed to have spread to Haramark.", "Considering how Philip Muller knew of these matters too, Paradise’s titans seemed to be paying careful attention to him.", "“Don’t misunderstand. It’s not like Sicilia stalked you. You see, the Star of Avarice has been poking around a lot recently.”", "Cinzia clicked her tongue.", "“It’s obvious why a couch potato like him would be moving around so busily.”", "Cinzia looked up as she tapped the ashes of her cigar into a wine glass. At the same time, Seol Jihu felt his nervousness rear its head.", "In that split second, the atmosphere around Cinzia changed completely. Previously, she had languid eyes that liked to joke around. Now, her eyes were flashing like a predator in front of its prey.", "Seol Jihu could feel an indescribable pressure that would make even Hoshino Urara shut up.", "“…Come to think of it, I was the manager when you entered the Neutral Zone.”", "“Yes.”", "“Do you remember what I said back then in front of everyone?”", "“‘It was a real chore to look after you lot. Let's not meet ever again?’”", "“No, not that.”", "Cinzia locked her fingers together and leaned back against the couch. With her chin slightly tilted, she said arrogantly.", "“I don’t know how to speak in a roundabout way, nor do I know how to hide true intent behind false words.”", "“Ah.”", "“Since Representative Seol has taken the time to visit despite his busy schedule, I will answer right away. So that neither of us wastes any time.”", "Cinzia then spoke without dragging on any longer.", "Seol Jihu had a suspicion—", "“We refuse.”", "Which quickly came true.", "“Sicilia has no intention of joining hands with Valhalla and the Magician’s Guild to participate in the plan to rescue the Federation. Thus, we have no plans to interfere in this matter in any way.”", "Taking out the cigar in her mouth and flicking it into the wine glass, Cinzia finished clearly.", "“This is my answer.”"]}