{"cid": "297", "title": "Chapter 297. An Unexpected Clue (4)", "content": ["The awakening of all the individuals inside the Neutral Zone ended.", "Some changes were made to Eun Yuri’s training regime after her class was determined. She couldn’t just train all day since she had things to accomplish in the Neutral Zone. From now on, she had to start doing missions for the sake of building experience.", "As such, Eun Yuri was introduced by Kim Hannah to a team of six people which included the one and only Priest who awakened this time. It was needless to say, of course, that Park Woori and Yoo Yeolmu were among them.", "Missions in the morning, physical training in the afternoon, and mana training during sleep.", "It wouldn’t have been strange for her to complain at this point, but Eun Yuri didn’t utter a single word in objection. On the contrary, the smiles that were rarely seen on her face before became more common by the day, making it seem as if she was growing livelier each day.", "She even separately requested Seol Jihu to help her train.", "\"Oppa, can you help me with training?”", "\"…Training?\"", "Seol Jihu asked back while he gazed down. For reference, the two were in the middle of eating at a restaurant.", "\"What are you talking about when we’re in the middle of a meal?”", "\"Please. There’s this homework that Teacher assigned me to do, and I don’t have enough time.”", "\"Even so.\"", "\"Master Jang Maldong upped my training intensity recently, so it’s obvious that I’ll be knocked out the moment the evening training ends. I need to make use of any spare time before that.”", "Eun Yuri repeatedly pleaded with him, saying that Roselle would severely punish her if she couldn’t follow the pace of her lessons. Seol Jihu, unable to ignore her plea, let out a sigh and nodded.", "\"How do you want me to help you?”", "\"It’s nothing hard.”", "Eun Yuri held out the spoon she was holding to Seol Jihu.", "\"Please feed me.”", "\"?\"", "Seol Jihu doubted his ears. She wanted him to do what?", "\"You just have to feed me and talk to me about different things.”", "He wasn’t sure whether she was asking him out on a date or whether she wanted him to help her train.", "Seol Jihu stared at her with a serious face.", "\"Miss Eun Yuri.\"", "He was suspicious no matter how he thought about it, so he had to ask.", "\"By any chance, do you like me?”", "\"What!?\"", "Eun Yuri leaped up.", "\"What are you saying!? Aren’t you the one who likes me instead?”", "As she frantically waved the ring sitting on her left ring finger, Seo Yuhui, who happened to pass by at that moment, suddenly stopped in her steps.", "\"Unni! Come quickly! Another order just came in!”", "Phi Sora, who was in the kitchen slicing slabs of meat, shouted in a loud voice, but Seo Yuhui stood in place, holding a tray full of empty plates while rapidly looking back and forth between the two.", "\"What do you mean—\"", "\"Anyway, hurry up. I don’t have much time. Come on.”", "Eun Yuri urged him on and opened her mouth as she said, ‘Aaah.’", "\"Pyak.\"", "As she did that, Little Chick suddenly appeared from who knows where and stood next to her while opening its beak.", "\"Hey, where did you come from… Ah, damn it. Fine. Let me ask first though.”", "Seol Jihu felt his head become dizzy as he grabbed a spoon in each hand.", "\"Just what training are you doing?”", "He asked while feeding a baby kitten and a baby chick.", "\"It’s called Roselle Recital, an important ability that I’m learning.”", "Eun Yuri replied while chewing.", "\"Roselle Recital?”", "\"Yes. It’s one of Teacher’s signature ultimate moves.”", "\"Mmm… okay, but what does learning that move have to do with me feeding you?”", "\"Because that way, I’ll be able to use both my hands.”", "As Eun Yuri explained, she had been busy moving all ten fingers while holding her hands in the air ever since she passed over her spoon.", "One finger flicked up and down while another drew a circle in the air before making a dot.", "\"What are you doing?”", "\"Practicing mudras.”[1]", "Eun Yuri swallowed her food.", "\"In the past, more specifically, during the reign of the Empire, there were two major methods that Magicians used to materialize mana. One was chanting a spell using their mouths. The other was signing mudras with their hands. Ah~”", "She opened her mouth again. Seol Jihu attentively listened as he mechanically fed her.", "\"So in theory, it becomes possible to simultaneously cast three spells at once. Of course, it’s only under the condition that you can chant a spell while casting separate mudras with each hand.”", "As Eun Yuri quickly explained, Seol Jihu was shocked.", "\"That’s possible?”", "\"It’s difficult. Not only do you need to do three things at the same time, but you also have to split and operate your mana circuit into three separate branches.”", "Eun Yuri diligently chewed while zealously moving her fingers and continuing to explain.", "\"For the record, there was no one besides Teacher who could pull it off in her era. Triple Casting had only been possible in theory, but she accomplished it. That’s why it’s been coined the name Roselle Recital.”", "Now that he thought about it, chanting a spell would sound like singing while the movement of all ten fingers would look like playing the keys on a piano.", "A harmonic trio played by the mouth and two hands.", "'I guess that’s why it’s called a recital…'", "\"Teacher said that I have to be able to automatically sign mudras without thinking in order to learn this technique. That’s why I asked you to talk to me— Ai!”", "Eun Yuri cried out in the middle of speaking.", "\"Aauuuu—”", "She grabbed her hair in frustration. It seemed that she made a mistake while signing her mudras.", "\"T-Take it easy. It doesn’t seem easy.”", "\"No.\"", "Eun Yuri spoke while being chagrined.", "\"There’s no way I can only do this much when I have such a great teacher and am drinking the Special Competence potions.”", "She went so far as to grind her teeth while declaring she would register the ability in her Status Window within a week, muttering that it was now a matter of pride.", "Seol Jihu was worried for her as he almost saw a hint of madness in her.", "'Will she be okay…?’", "While it was good for her to be so motivated, the consequences would be more severe if she failed.", "However, Seol Jihu’s worry turned into shock a week later.", "It was because…", "[4. Abilities]2. Class Abilities (0)3. Other Abilities (2)—Roselle Recital (Lowest)—Mana Circuit Application (Intermediate)", "…Eun Yuri had really upheld her promise.", "Although it was of the lowest rank, she had gone beyond just having a feel for it to succeeding in learning the ability by herself.", "However, her acquisition of Roselle Recital was just the beginning.", "2. Class Abilities (1)Path of Mana (Lowest)", "3. Other Abilities (2)—Roselle Recital (Lowest)—Mana Circuit Application (Intermediate (High))", "In the 6th week…", "2. Class Abilities (2)—High-speed Chanting (Lowest)—Path of Mana (Lowest)", "3. Other Abilities (3)—Roselle Recital (Lowest)—Mana Circuit Application (High)—Final Solo (Lowest)", "In the 7th week…", "2. Class Abilities (3)—High-speed Chanting (Low)—Path of Mana (Low)—Incomplete Truth (Lowest)", "3. Other Abilities (3)—Rosel’s Recital (Lowest)—Mana Circuit Application (Highest)—Final Solo (Lowest)", "And finally, in the 8th week.", "At the end of each week, Eun Yuri appeared before him with higher skill masteries and new abilities.", "\"….\"", "Seol Jihu sat in the head manager’s room with his eyes fixated on the screen. Nowadays, he spent most of his time observing Eun Yuri.", "Like a seedling breaking through the soil to greet the warm sunlight before eventually blooming into gorgeous flower buds, the scene where a person’s talents were blooming after being supported by her own efforts and the right environment couldn’t be more beautiful.", "'…Amazing….'", "Eun Yuri, who was immersed in training, not wasting even a second under her firm conviction of walking her own path, looked truly amazing.", "He was almost jealous.", "Perhaps it was because of this that Seol Jihu could not take his eyes off of her for a while.", "And while he was absent-mindedly staring at her…", "[As you might have already experienced, Paradise attracts all sorts of people.]", "He suddenly recalled Jang Maldong’s words.", "[You can tell just by what goes on in the Neutral Zone. Among the dozens of newbies, there are always one or two special ones. The so-called gifted ones.]", "[But the funny thing is, there are differences even among the gifted ones. The one who’s more talented, the one who’s more special.]", "[You can go on and on, and eventually, you’ll find someone who’s unrivaled among the gifted.]", "[People like that will go above learning skills on their own and will tread their own paths.]", "[They will enter unique realms no one else has ever reached. I call that Enlightenment.]", "That was right. Eun Yuri was a genius.", "She was a genius among geniuses where magic was concerned, not to mention that she was a hard-working genius.", "With the addition of nutrients called Special Competences that increased training efficiency by eight times and fertile land in the form of a wonderful teacher, she was growing at a tremendous rate every day.", "No, she wasn’t just growing. Eun Yuri was already treading her own unique realm called the ‘Incomplete Truth.’", "She had already taken a step into a realm that most people could not conceive no matter how much they tried.", "[Is it supposed to be hard?]", "She had said so as if this much was only normal, like eating rice.", "When he thought this—", "'….'", "A flame lit up inside him.", "His face felt surprisingly hot when Seol Jihu subconsciously felt his cheek with his palm. It was as if a massive lump of fire was blazing in his body.", "He knew it wasn’t a bad sign. He even knew it was something to be congratulated for.", "Right… he knew.", "He knew, but…", "\"…\"", "Childish emotions that couldn’t be said aloud kept threatening to erupt from inside him like boiling magma.", "'I…'", "He had toiled a little hard as a representative.", "He had worked a little harder during the tutorial.", "'…Just what have I been doing?”", "He felt ashamed of himself for being determined to rest during the Neutral Zone. Seol Jihu stared at Eun Yuri with burning eyes before clenching his teeth.", "[Trait ‘Competitiveness’ has been created.]", "Seol Jihu jumped out of his chair in the next moment. He tightly clenched onto the Spear of Purity and a long sword that was lying around before exiting the administrator’s room.", "'Back then…'", "Seol Jihu headed for the training room while trying to remember his battle with the Homunculus.", "He had clearly felt it that time. The feeling of his body moving separately when he fought with the unfamiliar machete and his fists and legs.", "‘I’m certain.'", "And the feeling of everything becoming one as soon as he grabbed the Spear of Purity.", "*", "\"Ehew. This is killing me.”", "Phi Sora cracked her neck left and right while walking towards the training room. In the Neutral Zone, she acted as the cafeteria assistant. To be more precise, she assisted Seo Yuhui, who was in charge of the restaurant.", "Since the restaurant had to serve almost 400 people, it was at a level that Seo Yuhui couldn’t manage alone, so Phi Sora worked there part-time as an assistant.", "While it was decent for steadily earning a bit of Survival Points, she felt sore from being holed up in the kitchen preparing food ingredients.", "This was why she came to the training room to stretch her body…", "'Huh?'", "However, Phi Sora stopped in her tracks when she finally arrived at the training room. There was someone already there.", "Seol Jihu was heavily swinging a weapon.", "'What’s he doing here…?’", "Phi Sora tilted her head before jumping internally in a startle.", "Seol Jihu’s face was strange. His usual smiling face had disappeared to God knows where and was replaced by a menacing glare. The way he was crazily swinging his weapon, it was as if he was going to eat someone alive.", "'Again, there it is again!’", "From her long experience with him, Phi Sora immediately noticed what kind of condition Seol Jihu was in.", "He was in what Phi Sora had named, ‘dual personality mode’. She didn’t know who provoked him this time, but his switch was completely flipped.", "That wasn’t all.", "'Oh? Ohhh?’", "Phi Sora mentally screamed after confirming the weapon Seol Jihu was using. Gone was his spear and instead, a long sword was in his hands.", "'What’s wrong with him all of a sudden?’", "No matter how she looked at him, there weren’t just one or two strange points.", "Judging that another incident like Eva’s night might happen again, Phi Sora ran out to inform a person of this matter.", "Meanwhile, Seol Jihu was so focused that he was unaware of anyone’s presence. He suddenly flung away the sword he had been swinging for a long time before grabbing his spear and unleashing his spear arts in full force.", "And he repeated this process indefinitely.", "How much time had passed?", "Just as his breath had gradually quickened and his sweat began pouring like rain, Seol Jihu stopped his actions.", "\"Fuu—\"", "As he was steadying his breath…", "\"Oho. A long sword, huh.”", "He suddenly heard a familiar voice in his ears.", "When he looked around, he found Jang Maldong leaning against the door with a subtle smile on his face.", "\"Master.\"", "\"I don’t think you’re trying to switch class to a swordsman after all this time.”", "\"…\"", "\"Certainly. Grabbing your main weapon after using an unfamiliar weapon does make it feel a little more familiar. Just like how you feel happier when you meet a close friend after only being with your everyday friends.”", "Jang Maldong twirled his cane in a circle.", "\"Well, I don’t know if it’s a placebo effect or not, but— in any case, are you trying to achieve harmonization of the mind, technique, and body using this method?”", "When Seol Jihu was about to lower his weapon after being discouraged by his questioning tone, Jang Maldong raised his brows.", "\"Why are you lowering your arm?”", "\"Huh?\"", "\"I only asked. I never said that your method was wrong.”", "At those words, Seol Jihu tightened his grip again on his spear.", "\"Yes. Try whatever you can. What’s important to you right now is getting new experiences. In that respect, it’s not bad to try anything, even if it ends up being a fruitless struggle.”", "Jang Maldong continued with a slight smile.", "\"If I had to give you another piece of advice, it’d be better to do shadow training rather than to aimlessly swing your weapon around.”", "\"Shadow training?”", "\"Didn’t I tell you before? That training is a battle.”", "\"Yes.\"", "\"Try to carefully recall the situation at the time. The feeling won’t easily come to you when you’re being conscious of it. Won’t you feel happier if you met a friend who you haven’t seen for a long time without knowing in advance?”", "At those words, Seol Jihu’s eyes lit up in understanding.", "1. Mudras are seals or signs usually performed using hands. It is used in a wide scope such as religion, dance, yoga, and even meditation. If interested in more info, please read the Wikipedia article. "]}