{"cid": "98", "title": "Chapter 98. Great Fortune Within Hardship (2)", "content": ["Whether it be studying or training, just putting in effort wasn't enough. To put it bluntly, one had to put in effort well.", "Knowing their weaknesses, knowing what to do, knowing how to distribute their time efficiently…. One had to get their priorities straight for systematic training to be possible and for that training to be efficient.", "Thus, Seol Jihu decided to first reaffirm his current potential. And to do that, he needed to visit a temple to check whether he could level up. Although he wasn’t sure, he felt like the previous rescue mission had earned him enough merit to level up.", "But disregarding everything else, was it right to level up in his current situation? Most people would be ecstatic to do so, and to be frank, Seol Jihu was no different. There were moments in the past when he was thirsty for levels. But this thought changed as time passed and he joined Carpe Diem.", "In truth, this problem had to do with the unique circumstance he was in. Excluding external factors, there were two benefits an Earthling received by leveling up - the stat points and the ability to acquire new skills.", "However, Seol Jihu put restrictions on these benefits to achieve success himself. Going from Level 2 to Level 3 would give him 3 stat points. But since he vowed to increase his stats only through training until he became a High Ranker, this benefit was irrelevant.", "He could acquire Class Abilities that became available after leveling up, but he promised Agnes that he would not learn them by using his contribution points. In other words, leveling up would not give him a boost in power.", "Plus, Seol Jihu had yet to learn any of his Level 2 skills. This was the biggest factor in why he hesitated to go to the temple.", "[I understand why you’re amassing your stat points, but skills are a different story. If you’re not using your points and not learning new skills, what’s the point in leveling up?]", "Kim Hannah pointed out his problem perfectly. Of course, becoming Level 3 wouldn’t pose any problems, but….", "‘It’s not normal.’", "He was afraid. Never mind the Class Abilities, he feared that his physical stats would remain the same with only his level going up. In the worst-case scenario, he might end up achieving only a third of his maximum potential.", "‘Don’t be rash.’", "As such, Seol Jihu decided to add another restriction - to not visit the temple until he learned his Class Abilities and could use them proficiently.", "In other words, he would wait until he mastered Mana Spear and Mana Circulation before seeing Gula again. He didn’t regret his decision. In fact, he considered this moment the perfect opportunity. Since neither Chohong and Hugo had returned, now was the only time he could focus on training.", "‘Let’s start right away.’", "Like the saying, strike the iron while it’s hot, now that he made up his mind about focusing on training, he immediately got up from his seat.", "*", "[Do you know the origins of javelin throwing?]", "That was what Agnes asked him. Although he nodded his head at the time, he didn’t fully understand her in his head. He acknowledged that he needed to learn the correct postures and techniques, but was there a need for him to learn its history?", "Seol Jihu realized why this was necessary during his studying of Mana Circulation. To be more precise, he arrived at the answer after asking himself, ‘What is the difference between Mana Application and Mana Circulation?’", "If it was just moving his mana, he could do it even now. But Mana Circulation was one of the skills revealed when he reached Level 2. There had to be a difference.", "One thing he could be sure of was that Mana Circulation had something to do with training the mana rather than the body. As for the details, he had to figure it out starting from now.", "He sat cross-legged in a quiet room and closed his eyes. First, he breathed through his lower core. He forgot about breathing through his nose and only breathed in and out using the inner core of his lower stomach.", "‘Take a deep breath, then slowly let it out….’", "He began to move his mana while focusing on his breathing.", "‘From the Sauce Receptacle to the Celestial Chimney, from the Celestial Chimney to the Chest Center, from the Chest Center to the Turtledove Tail, from the Turtledove Tail to the Central Venter….’", "From the top of his head to his neck, from his neck to his chest, from his chest to his abdominal region, from his abdominal region to his perineum….", "‘Following the concept vessel meridians and the governing vessel meridians…. Circulating the internal energy as if to create a whirlpool in your body….’", "His mana moved inside him like flowing water following an irrigation channel. Not long afterward, he noticed a few oddities.", "The first was that the mana circuit was indeed similar, if not the same, as the qi pathways.", "‘I didn’t feel anything blocking the movement.’", "After he started circulating his mana around his body, it flowed smoothly and rushed to its destinations without ever coming to a halt.", "Different people possessed different amounts of mana. Likewise, their mana circuits were unique. How wide, numerous, elastic, and tough their circuits were was determined by their innate talent and training.", "If a Level 1 Warrior’s circuit was like a straw, then a Level 5 Magician’s circuit was like an intricate spiderweb. However, the mana circuit Seol Jihu observed in his body was like the map of a subway system.", "It was normal for one or two pathways to be blocked, but never mind the pathways he frequently used, even the pathways in the remote corners of his body were pierced clean!", "‘Psychi’s Tears!’", "It was at this moment that he remembered Psychi’s Tears - the miraculous item that eliminated the body’s impurities and strengthened it exponentially!", "As expected of the item that ate up hundreds of thousands of Survival Points, it had duly done its job. That wasn’t all. What truly surprised the young man was something else.", "‘The speed… no, even the mana…!’", "As he continued circulating his mana, its speed rose drastically. Although he looked fine from the outside, a fierce gale strong enough to sweep away his consciousness was blowing inside him.", "‘What’s going on?’", "Once he observed his body more carefully, he could figure out the cause. Energy was bubbling up from every vein in his body. The energy his body was unable to digest and had thus stored away was reacting to his mana circulation.", "Was this what it felt like to suck in water with a vacuum cleaner? Seol Jihu felt the energy hidden in nooks and crannies of his body seep out and join the flowing mana. This was, of course, a whole new experience for him.", "For now, he held onto his consciousness and, like a starving shark seeing a school of fish, he concentrated on controlling the wild energy. It almost felt like his mana was complaining why he started circulating it so late.", "How much time went by? After barely managing to suppress the roiling energy inside him, he was able to confirm that the strange phenomenon wasn’t his imagination. His lower belly feeling heavy was a telltale proof of it.", "‘My mana… increased?’", "Although it might be minuscule, the amount of mana he had indeed went up.", "‘Mana Circulation can increase the amount of mana in your body?’", "He tilted his head and pondered for a long time before eventually deciding not to worry about it. No matter the case, it wasn’t a bad thing for him.", "When he opened his eyes, he finally let out the breath he was holding in.", "“HUA!”", "He only now realized that he was soaked in sweat. His body was also burning hot, and his breathing was rough.", "‘So this is what it feels like.’", "He remembered reading about qi circulation from novels and manhwa but experiencing personally made him see it a new light. His body felt light and his mind felt refreshed. He was more relaxed than ever before, almost like he just left the most luxurious sauna.", "‘This…. If I feel the same way every time, I might get addicted to it.’", "Seol Jihu wiped off the sweat dripping from his forehead. It was then that he saw several messages in the air.", "[The Class Ability, ‘Mana Application (Intermediate)’, has evolved to ‘Mana Circulation (Low)’.]", "[Your Innate Ability, ‘Future Vision’, is responding to the creation of a new ability!]", "[The Class Ability, ‘Mana Circulation (Low)’, evolves to ‘Mana Circulation [Intermediate (High)]’.]", "[Please confirm your Status Window.]", "When? I didn’t hear any alerts. It seemed like they popped up while he was in that transient state of having no thoughts and ideas.", "‘Wow.’", "After reading the messages with an entranced look, he spread his arms out in an expression of joy. He had finally learned one of the two Level 2 Class Abilities. Although Future Vision and Psychi’s Tears played a huge role, it was a good start nonetheless.", "‘I feel like a martial artist or something.’", "With a bright smile, Seol Jihu went back to circulating his mana.", "*", "Seol Jihu prioritized obtaining his Class Abilities, but that didn’t mean he was lax in training his physique. Since he was leveling up at an unprecedented rate, he also wanted to bring his physical body up to par. As such, just like in the past, he spent most of his morning training his body.", "His day started with running around Haramark. Since the day Yi Seol-Ah taught him the joy of running, he never skipped his morning run except under inevitable circumstances like being injured or participating in an expedition.", "Huu, haa, huu, haa.", "With new sneakers and new workout clothes, he was running through the streets of Haramark while breathing regularly when his eyes suddenly opened wide. A familiar face was walking toward him from the other side.", "Carrying a large paper bag filled with bread and vegetable, the woman wearing a maid outfit was….", "“Miss Agnes!”", "Seol Jihu slowed down as he waved his hand happily. The sharp-eyed, bespectacled woman passed by him indifferently with only a glance. However, the young man chased after her like a duckling that met its mother.", "“…Huu.”", "Agnes let out a soft sigh and paused.", "“Didn’t I tell you not to get sidetracked while you’re training?”", "She chastised him in a serious tone, but….", "“Miss Agnes, Miss Agnes, I did it!”", "Seol Jihu rambled on.", "“I learned Mana Circulation!”", "“?”", "That was… unexpected. However, Agnes quickly regained her calm. She had already experienced this young man’s irregularities several times in the Neutral Zone. Him learning Mana Circulation was nothing to be surprised about now.", "It was undoubtedly a cause for a celebration, but Agnes was the type of person who rarely praised someone. Her teaching style dictated that she set a new goal for her disciples rather than praising them and making them arrogant.", "Agnes fixed her grip on the paper bag and opened her mouth.", "“From now, you should be able to train your mana too. I recommend practicing Mana Circulation for at least four hours every day.”", "“For four hours?”", "“Why are you surprised?”", "Agnes snorted.", "“Your mana and mana circuit should be like an iron ore mixed with impurities. You need to constantly refine it in order to increase its purity. As I’m sure you know, mana becomes stronger the purer it is.”", "Seol Jihu nodded. Now that he experienced Mana Circulation, he understood what she meant.", "“Mana Circulation might seem like a simple ability, but it has the effect of strengthening your circuit and even purifying your mana. There is no reason not to invest your time in it.”", "“It makes sense if you put it that way. Since it also increases the amount of mana in your body, I guess I should really make it my main training method.”", "“…Pardon?”", "Agnes’s eyebrows twitched.", "“What did you just say?”", "“Ah, that I’d make it my main training method.”", "“No, before that.”", "“Uh… that it increases the amount of mana in your body?”", "“Is that what happened to you?”", "“Yes, though it wasn’t much.”", "Seol Jihu raised his hand and formed a fist to give her an idea of how much it increased by. However, Agnes looked confused.", "“That can’t be. To my knowledge, Mana Circulation doesn’t have the effect of increasing your total pool of mana.”", "“Huh? But…”", "The young man argued and said he wasn’t lying. Agnes had a rare concerned look on her face.", "“Hm, I doubt you raised it with your stat points. I know of a few instances where someone’s total mana pool increased after risking his circuit and squeezing out every ounce of mana, but….”", "Agnes muttered to herself before asking half in doubt.", "“Does your mana increase every time you practice Mana Circulation?”", "“No, it went up for the first three, four days but stopped going up afterward.”", "Agnes finally understood.", "“It must be the effect of consuming precious medicine.”", "“Medicine?”", "“Yes, when someone consumes a precious herb or medicine, he is usually unable to absorb all of its energy, causing it to get stored in parts of his body. And when he practices Mana Circulation, his body will absorb that indigested energy.”", "“But I don’t remember eating anything like that.”", "“Think about it carefully.”", "Seol Jihu fell in thought. But soon, he shook his head. No matter how much he scanned his memories, he had not even seen a precious medicine, much less eaten one.", "“Ah, I ate something called a dulce while I was being chased.”", "“…Dulce isn’t a medicine. It’s one of the most flavorless fruits in Paradise.”", "“O-Oh.”", "“Unless someone is desperate or is on the verge of starving to death, no one will eat such a thing.”", "Agnes raised her glasses and continued.", "“Anyways, you might not understand the cause… but it’s not a bad thing. First, raise your Mana Circulation rank to Intermediate. When it evolved from Mana Application, its rank should have dropped as well.”", "The young man stared at her fixedly. Although it fell to low when it first evolved, Future Vision had quickly changed it to Intermediate (High).", "“Once you reach Level 4, Mana Circulation can be evolved again. It’s called Mana Cultivation.”", "“Mana Cultivation?”", "“An ability isn’t something you learn once and forget about.”", "Agnes continued.", "“Mana Application becomes Mana Circulation, Mana Circulation becomes Mana Cultivation, Mana Cultivation becomes Mana Technique….”", "“Ah, so Mana Circulation will evolve to Mana Cultivation next.”", "Agnes paused for a moment.", "“…Of course, it’s best to learn it directly with your own understanding.”", "She continued only after a certain amount of time went by.", "“But with Mana Cultivation, I recommend you use your contribution points to evolve it.”", "“Huh? You want me to learn them with my contribution points?”", "“Not learn, evolve.”", "Agnes denied it immediately. Although there was a difference in the meaning behind the two words ‘learn’ and ‘evolve’, Seol Jihu looked confused about such a minute difference.", "Agnes explained slowly.", "“Mana Application and Mana Circulation are fundamental skills. Because of this, they are fairly easy for an average person to acquire. But starting from Mana Cultivation, the difficulty skyrockets.”", "“Mm… right, I guess it’ll be hard to find a cultivation manual for something like that.”", "“Right. Even if you find an ultimate mana technique through all sorts of hardship, it will be useless if you can’t learn it. Even a genius needs dozens of years to master such techniques, but an average person might not even be able to stand on the starting line after hundreds of years.”", "“You mean it’s a matter of efficiency.”", "“Yes. If it seems too difficult, you need to be decisive in giving up. You can be more than happy with having learned Mana Application and Mana Circulation on your own. Since the gods’ divine providence gave this world a game-like system, there is nothing wrong with making use of it.”", "Seol Jihu thought for a moment before opening his mouth.", "“So it’ll be important to learn the fundamentals of any ability on your own.”", "A thin smile emerged on Agnes’s face. The young man had pointed out the core of the matter. She was worried he might get obstinate, but she was happy seeing how intelligent her disciple was.", "“You’re absolutely right. What matters is knowing the fundamentals. No matter what the ability is, it’s important to master its fundamentals. That is one thing you cannot yield.”", "Seol Jihu nodded his head in agreement before asking again.", "“How far did you get, Miss Agnes?”", "“If you’re talking about the use of mana, I learned up to Mana Cultivation on my own.”", "Agnes revealed a coy look.", "“I managed to find a Mana Technique… but it was too complicated. It simply wasn’t something I could learn on my own, so I chose to use my contribution points.”", "She smacked her lips as if it wasn’t a good memory.", "“Anyways, that is still far off for you. Take your time to think about Mana Cultivation. And like I always say, when you’re training, focus only on training.”", "Having learned new knowledge, Seol Jihu nodded his head with a bright smile. Something Agnes didn’t know was that his Mana Circulation had already surpassed the Intermediate-rank. In other words, he could learn Mana Cultivation as soon as he reached Level 4.", "Of course, he would need to wait and see to know if he would learn it on his own or acquire it with contribution points, but just the fact that he had a new goal made his heart race.", "‘She helped me again.’", "He was grateful that he had someone to explain things to him in such detail. After staring at her fixedly, Seol grinned happily. Agnes’s eyebrows twitched at that moment, but when he tried to talk without having realized it….", "“Thank… kuk!”", "Thwack! His back bent over. From his stomach, a surge of pain spread through his body.", "‘W-When…?’", "He couldn’t even see her fist. He felt wronged, thinking he did nothing to deserve this.", "“Why…”", "“Are you really asking me that?”", "Agnes glared at him with icy eyes.", "“I just… wanted to thank you for the advice….”", "“Oh, really? I’m sorry.”", "Hmph. Agnes snorted and turned around.", "“T-That was too much.”", "When she heard the young man’s mumbling, she suddenly erupted in anger.", "“Too much? That was too much?”", "Did he light her fuse? Agnes went past being hysterical, grabbing him by the collar and beginning to shake him around.", "“Too much? Can you say that after looking at this!?”", "[Claire Agnes’s Status Window]", "[1. General Information]", "Summoned Date: 2013. 09. 20.Marking Grade: SilverSex/Age: Female/27Height/Weight: 172.4cm/60.8kgCurrent Condition: HealthyClass: Lv 6. Evil-Hunting TarantulaNationality: Europe (Area 2)Affiliation: SiciliaAlias: Miss Teddybear, Ground Zero, Sicilia’s Bitch, Sicilia’s Demonic Instructor, Cold-Faced Super Maid Who Secretly Loves Cute Underwear, Haramark’s Slaughterer", "“Super maid? Who are you calling a super maid!? Tell me! Tell me!!”", "She shook him around in a craze. When Seol Jihu saw the alias she revealed, he couldn’t help but burst into laughter.", "Uhahahaha! Once Agnes heard his laughter, her complexion froze.", "“You think this is funny?”", "“W-Wait.”", "“You think it’s funny adding this shit to my alias!?”", "“C-Calm… Ak! Aaaaaaak!”", "He didn’t even say a word about ‘Miss Teddybear’ but ended up being beaten to a pulp regardless. That was it for the boy who cried wolf.", "*", "“Heuk….”", "Although he was beaten severely, he wasn’t dead. He was sore all over his body, but he still finished up his morning run before staggering back to the Carpe Diem office.", "He couldn’t bring himself to start weight training, so he pulled himself upstairs to rest. Just as he was about to open the third-floor door….", "‘?’", "He discovered an unfamiliar piece of paper stuck between the door.", "‘A letter?’", "He took the paper out and opened the folded letter."]}