{"cid": "106", "title": "Chapter 106. The Village Head’s Gift (3)", "content": ["The carriage raced through the fields and only stopped once it arrived at the foot of the mountain. Although the village head said that it would take a day by carriage, in reality it did not even take half a day. This was to be expected since four horses had run at full speed.", "Seol Jihu got off with his bags and took a deep breath of the mountain’s grassy air and felt it tickling his nose. Perhaps because the mountain’s energy was deeply ingrained in the air, it tasted fresh and clean like spring water.", "While enjoying this soul-cleansing mossy aroma, Seol Jihu looked up at the overwhelmingly large mountain in front of him with eyes full of admiration.", "Because of its name, Huge Stone Rocky Mountain, he expected it to be full of rocks like a valley. Instead, it actually had lush and dense greenery. The white snow and the fog covering the mountain peak made it look like the legendary Kunlun Mountain.", "“There’s something I’m curious about.”", "Seol Jihu was busy marveling at the majestic scenery when a cold voice flowed into his ears. The owner of the voice was a handsome man with sharp eyes that gave him an angry look.", "When Seol Jihu tilted his head, Kazuki approached him.", "“Why is she here?”", "He glanced at the carriage that had yet to leave. At the same time, a woman with her hair slicked back and tied in a dango-like bundle came out. Her eyes were just as sharp as Kazuki’s, and today, she didn’t have her glasses or the maid outfit that covered her body.", "For some reason, she was wearing a lemon-colored sports bra that matched her hair color along with black leggings that wrapped tightly around her waist.", "“Well….”", "Her exposed collarbones, round ankle-bone, and willowy waist all revealed her alluring figure, making Seol Jihu at a loss for words. She stretched her interlocked hands to the sky and slowly cracked her head left and right.", "Seeing Agnes with his mouth agape, Seol Jihu felt Kazuki’s gaze and quickly muttered out some words, “She said she felt her strength was lacking after failing her last mission.”", "“No.”", "Kazuki shook his head.", "“It’s easy to make up a reason. What I’m wondering is—”", "At that moment, Agnes glanced to the side, making Kazuki shut up. When the gaze disappeared, he finished his sentence quietly.", "“…How did she know you were coming here to train?”", "“Oh, I told her.”", "“Why?”", "“She comes to Carpe Diem to help me train from time to time, so I didn’t want her to make a trip in vain while I was gone….”", "“She helps you train? That person?”", "Kazuki put on a look of disbelief.", "“It’s hard to see that as a simple sign of goodwill…. You’re not affiliated with Sicilia, after all.”", "“She taught me in the Neutral Zone. She’s been giving me good advice ever since.”", "After giving this clear answer, Seol Jihu put on a face that asked what was wrong", "“Why?”", "When Kazuki didn’t say anything, a hint of nervousness appeared on his face.", "“Could it be that the two of you have a bad relationship?”", "“No,” Kazuki denied. “That’s not it, but….”", "He looked troubled as if the reason was hard to say. Seeing this, Seol Jihu tactfully changed the subject.", "“Anyways, is it okay for you to be here, Mister Kazuki?”", "“Me? If you’re talking about my duties as Umi Tsubame’s leader, I made sure to transfer them to the right person.”", "Having noticed Seol Jihu’s intentions, Kazuki immediately took his goodwill.", "“And there’s something I felt during the second Banquet I participated in. That is that the Banquet is full of spontaneity and randomness, so whatever external preparation you make, might be useless. Rather than potentially wasting your time, it will be much more worthwhile to train.”", "“It sounds like you’re saying you can only trust your skills.”", "“Well, I wouldn’t say that exactly. After all, luck isn’t part of someone’s skills.”", "Seol Jihu was about to ask, “Luck?”, but he heard the sound of the carriage leaving. When he subconsciously turned around, he saw Hugo staring at the carriage slowly disappearing into the distance with swollen eyes.", "“Anyways, I’m sorry. It seems my greed caused a misunderstanding.”", "Seol Jihu’s eyes widened at Kazuki’s apology.", "“You must have been excited at the prospect of receiving Master Jang’s personal training. You must feel like unwelcome guests came to crash your party.”", "Kazuki’s Umi Tsubame had a friendly relationship with the Triads. On the other hand, Carpe Diem had a friendly relationship with Sicilia. Connecting these two points with Jang Maldong’s return, one should be able to guess what Kazuki meant by ‘misunderstanding’.", "However, Seol Jihu didn’t know about the delicate relationships between outside organizations and just said what he honestly thought.", "“Not at all. In fact, I’m excited to train together with you and Miss Agnes.”", "“Since there’s that promise we made Master Jang, I’ll do my best to help you too.”", "Kazuki breathed a sigh of relief as if a weight had been lifted off his shoulders. Soon, the carriage completely disappeared from their view, and they heard Jang Maldong yelling what they were standing around for.", "“Just when I erased it from my memories…. Just when I stopped having nightmares about it….”", "The bald black man with a mountain-like build sobbed constantly as if he really didn’t want to go. Seol Jihu couldn’t help but laugh.", "However, both Kazuki and Agnes nodded their heads as if they understood him. Seeing this, Seol Jihu revealed a puzzled look.", "[This is what you wanted.]", "Suddenly, Jang Maldong’s intimidating words brushed past his head. His excitement immediately died down.", "‘Get a grip. You’re not here on a picnic, Seol Jihu. You’re here to train.’", "To not run away…. To not rely on luck…. To be able to face danger squarely…. To not rely on Future Vision….", "To get stronger.", "After steeling his resolve, Seol Jihu followed the sobbing Hugo tottering up the mountain.", "*", "The Haramark region wasn’t a safe zone. As Huge Stone Rocky Mountain was undeniably dangerous, Kazuki should normally stand at the lead, but it was actually Jang Maldong who was in that position.", "Of all the time he spent in Paradise, half was spent in this mountain. Naturally, he knew more about its geography than any native from the neighboring village and thus had no problem acting as the pathfinder. He knew the paths like the back of his hand, and he even had the map Arbor Muto gave him.", "“He sure hid it well.”", "Only thirty minutes passed for Jang Maldong to find Arbor Muto’s hideout and remark sarcastically.", "“Master Jang, please wait.”", "It was then that Kazuki asked the group to stop. At first glance, the cave was too exposed to be called a hideout. Seeing the trees and vegetation around the cave damaged, Kazuki opened his mouth.", "“It seems like the cave was well-hidden at first…. But it looks like something found it and turned it into its living space.”", "“An individual? Or a group?”", "Kazuki lowered his gaze. He examined the earth before calmly replying.", "“Cave Ettins. As for the number… it’s small. There are eight of them inside the cave, but I can’t detect their movements.”", "“Sleeping?”", "“Most likely. They don’t like being outside during the day unless they’re hungry.”", "While Seol Jihu was astonished by his quick analysis, Kazuki took out his crossbow. When he loaded his bolt and pointed it forward, Jang Maldong blocked him with his cane.", "“Master Jang?”", "Jang Maldong turned back and looked at Seol Jihu. “Tell me the four elements that make up the formation of qi.”", "It was a sudden question, but Seol Jihu faithfully replied what he learned, “They’re quantity, speed and power of the flow, control, and imagination.”", "Jang Maldong didn’t say anything and picked up a fist-sized rock from the ground. Then, before anyone could stop him, he threw it into the cave.", "Tak, tak! Drrrrrr.", "The sound of the rock hitting the ground and rolling in the cave echoed out in the silent mountain. A unique trait of the Cave Ettins was that they had two heads. As one of them stayed awake at all times to stay alert, it was impossible for them to have not heard this sound. Since Cave Ettins also had a sharp sense of smell, it was only a matter of time for them to notice enemies approaching.", "And, as expected… a few seconds later, screeching noises began echoing out from the cave. Jang Maldong opened his mouth.", "“Get ready. Give them a blow as soon as they pop out.”", "Seol Jihu roused his mana without hesitation. Powerful energy at the Intermediate (High) level instantly flowed through his Circuit and shot out of his right hand.", "The explosive burst of mana only remained shapeless for a second. Soon, it danced like flowing water and slowly gathered shape until it formed a spear. Although it was only 60-centimeters long, anyone could see that the blue spear was made of mana.", "“They’re coming,” Hugo muttered briefly.", "Drrr! The moment Seol Jihu heard them rush out of the cave, he performed a run-up without a moment of hesitation. The posture he perfected after thousands of trials - from the crossover to the release, his body had thoroughly memorized the movement.", "Agnes, who was watching this, expressed a hint of surprise. ‘It’s perfect.’", "Each of his movements connected naturally. Seol Jihu’s right arm released the Mana Spear at the same time the Cave Ettins shot out of the cave.", "BOOM! When the spear left his hand, the sound of an exploding grenade rang out. The Cave Ettin running out at the forefront paused. Its body shook back and forth like a pendulum before collapsing like a stringless puppet.", "[Kereuk?]", "Another Cave Ettin running out of the cave faltered. It frowned at the explosive sound. It saw its fallen comrade’s two heads, one vaporized without a trace and the other torn to shreds.", "The Cave Ettin took its eyes off the scattered flesh and blood and faced the front. Then, its eyes caught sight of a blue spear flying toward them.", "Thwack! A hole opened up on its muscular chest. The force of the blow caused it to hunch forward, and its feet flew off the ground.", "“Oh shit!” Even the depressed Hugo exclaimed in awe when he saw the Cave Ettin flying backward with its limbs out.", "Boom! Boom!", "One-shot one-kill. Each of Seol Jihu’s spears claimed a Cave Ettin’s life.", "That wasn’t all. Unlike normal spear throws, the shockwave from the explosions affected the surroundings. Kazuki’s eyes narrowed when he saw some of the Cave Ettins lose their balance and fall even without being hit. In fact, some of them had been injured just from the shockwave.", "“Stop!”", "Jang Maldong shouted and suddenly threw Seol Jihu his Ice Spear.", "“Take care of the remaining ones with this. Also, you’re banned from using that earring and bracelet.”", "After snatching the spear out of the air, Seol Jihu charged forward like a ray of light. He was heated up after confirming the might of the Mana Spear. Since he was told to fight like a Warrior, he had no reason to refuse.", "Not having fought for a long time, Seol Jihu pounced like a furious lion. The Cave Ettins also got up in anger at their comrades’ deaths.", "“How is it?”", "While Seol Jihu was fighting the Cave Ettins, Jang Maldong asked the man standing next to him.", "“He’s good.”", "Kazuki replied without looking back. He kept his eyes on the battlefield with his crossbow loaded just in case.", "“That Mana Spear of his has both piercing power and destructive power. Just these two would have been more than enough, but it even has splash effects….”", "“Right, that ability will certainly be useful in the Banquet.”", "Kazuki nodded his head and agreed.", "“Of course, it will. It’s a bit of a shame that he can’t fire them quickly in succession, but it will be a good option for the team to have.”", "“And what if consecutive firing is possible?”", "“Then nothing else needs to be said. It already has the speed of an Archer and the destructive power of a Magician. I can see it being used to ambush a target or to start a fight.”", "Kazuki praised him greatly. This was to be expected since he was witnessing the product of Gula’s carefully crafted one-of-a-kind class for a Warrior with high innate mana.", "“I’m looking forward to the Banquet.”", "Hearing this final comment from Kazuki, Jang Maldong asked once again.", "“Then what about now?”", "“?”", "“His close-quarter combat.”", "The two of them had been watching Seol Jihu’s battle the whole time. The young man was thrusting, striking, and cutting to his heart’s content. Although no one would call the fight a slaughter, it was easy to see that Seol Jihu was overwhelming the Cave Ettins.", "“I’m not sure…. Well, compared to others his level….”", "“I’m not asking you to compare apples and oranges. Compare him to you.”", "Kazuki raised his brows.", "“Compare him… to me?”", "“That’s right. He’s amazing, isn’t he?”", "Was Master Jang trying to show off his disciple? Kazuki tilted his head. He put down his crossbow and glanced to the side. Jang Maldong’s face was frighteningly stiff.", "“…Yes.”", "Noticing the grave atmosphere, Kazuki quietly agreed. He observed Seol Jihu more closely before making another evaluation.", "“He’s amazingly bad.”", "The corners of Jang Maldong’s mouth twisted up.", "“Right, if he participates in the Banquet like this, he’ll be killed in an instant”", "“But only as a Warrior. He will be fine if he uses that spear-throwing ability. As long as the team protects him properly, he should be able to contribute until Stage 2.”", "Kazuki explained, not knowing the stubborn request Seol Jihu made.", "“I already told him that, but he said no.”", "“…Pardon?”", "“He was adamant about taking the position of a Warrior, that damned brat. He said he didn’t want to just throw spears.”", "Kazuki doubted his ears.", "“I, I mean, it’s important to have close combat skills… but how is it strange for a spearman to throw his spear?”", "“That’s what I want to ask.”", "Jang Maldong smacked his stifled chest. Hugo pouted his lower lip from the side.", "“Why did we come here anyway? When Chohong and I were being stubborn, you’d just beat us up until we were convinced.”", "“I would have done that if that guy was as stupid as you two.”", "Jang Maldong snorted and crossed his arms.", "“But he’s someone who uses his brain. He seems to have some level of insight too. When someone like him is being stubborn, it means he has something pent up inside him.”", "“Then… what will you do?”", "“I’ll make him realize it by himself. That’s the only way. He needs to face reality and give up.”", "Kazuki finally realized why Jang Maldong allowed outsiders to join them.", "“It’ll be a day, maybe two, at the longest.”", "The battle was coming to a close. Jang Maldong clicked his tongue.", "“Tsk, he’s still not done against a bunch of Cave Ettins….”", "Seol Jihu took care of all the Cave Ettins living in the hideout. He was satisfied with his Mana Spear and considered his following battle stable.", "He felt like he made great strides forward from the first expedition he went to. Thinking everything went well, he was certain Jang Maldong saw him in a different light as well.", "Once the battle was over, the five of them went into the cave. The hideout was a wide tunnel set up with basic living necessities like a table, a drawer, and a bed.", "One thing Seol Jihu was glad of was that the Cave Ettins didn’t damage the place. After collecting all the books the village head had asked for, Seol Jihu searched the place carefully. Since the village head mentioned the payment would be inside the hideout, there had to be something worthwhile here.", "However, he didn’t notice anything special on the table or in the drawer. But when he opened the storage closet installed on the cave wall, his mouth opened wide.", "The 80-centimeter-long 4-level storage closet was filled with all sorts of colorful glass bottles. The entire closet almost looked like a jewelry shop displaying its prized accessories.", "Kazuki carefully picked up an orange bottle.", "“This looks like an explosive reagent.”", "“Wait, isn’t this an aphrodisiac?”", "Hugo looked at a pink bottle with sparkling eyes.", "Seol Jihu was quite distracted by the whole thing. A high-quality healing potion, a bottle filled with salt, a strange bottle shining in five-colors…. There were so many of them that he didn’t know what was what. However, the bottles containing a milky liquid felt somewhat familiar to him.", "In any case, the group decided to check their effects at a later time and began to unpack. Since they were planning on staying here for a long time, they immediately began to clean up the place.", "It went without saying that everything in the hideout belonged to Seol Jihu. Hugo was envious since many of the bottles looked expensive and valuable, but he didn’t dare to touch any of them under Jang Maldong’s strict orders.", "It was the same for Agnes and Kazuki. There was a reason Jang Maldong made Seol Jihu fight by himself.", "The group took about an hour to clean the place thoroughly. When they went outside, the sun was slowly setting on the western horizon.", "*", "After ordering Agnes, Kazuki, and Hugo to train by themselves, Jang Maldong turned to the dazedly-standing Seol Jihu and asked.", "“Tell me the spear techniques you’ve learned so far.”", "When Seol Jihu answered ‘Thrust, Strike, and Cut’, Jang Maldong nodded his head.", "“Perform them for me while wearing twelve sandbags. You can use as much mana as you want. You can even use Aura if you need to.”", "“Um… here?”", "“Don’t make me repeat myself. You can go wild, so show me everything you’ve got.”", "“How many times should I do it?”", "“Until I tell you to stop.”", "It was a truly random request. Why was Jang Maldong telling him to show his spear techniques?", "Although Seol Jihu was curious, he quietly picked up his spear and took his stance.", "“Start.”", "Swish! A spear full of mana cut through the air. Seol Jihu repeated the three techniques with care.", "‘It’s been a while since I’ve last done this.’", "He suddenly remembered desperately striking the target in the Neutral Zone. As he had practiced these three techniques a thousand times every day, he was well accustomed to doing them.", "Jang Maldong didn’t say much. ‘Quicker’, ‘more accurately’, ‘harder’, he only said these three words and watched Seol Jihu silently.", "After about two hours of nonstop thrusting, striking, and cutting…", "“Haa…! Haa…!”", "Seol Jihu felt his breath getting short. With three sandbags on each of his arms and legs, his limbs felt heavy. Because he had been using his mana since the beginning, he was running low on stamina as well.", "He wished he had some sort of a goal to work towards, but that unfortunately wasn’t the case.", "Seol Jihu shook off this thought and focused on brandishing his spear.", "‘There must be a reason.’", "Jang Maldong was praised as Paradise’s greatest trainer. Thinking he must have a reason for making him do this, Seol Jihu quietly thrust his spear.", "How much time went by?", "He felt something rising from his stomach. His arms felt like they were falling off. The perfect posture he once had was nowhere to be seen, and the movement of his spear became noticeably dull. It was then that Jang Maldong finally told him to stop.", "“Haak…! Haak…!”", "Seol Jihu fell on his butt and gasped for air. His body was drenched in sweat. Still, he smiled, relieved that he was told to stop before his stamina ran out.", "‘Did I pass the first training?’", "Perhaps because of his regular training, he felt like it was doable. However, he soon shook his head. It was unlikely that this was the end of the training, and he most certainly couldn’t be satisfied with himself yet.", "As such, he set his will ablaze and asked Jang Maldong.", "“Master, what’s next on the training regime?”", "“…Hm? Next?”", "Jang Maldong, who was looking around the area, raised his eyebrows.", "“Huh? Is this it for today’s training?”", "“What nonsense are you blabbering? Get up.”", "Jang Maldong spoke as if he had no clue what the young man was talking about. Seol Jihu tilted his head but still got up quickly.", "“Since we got your stamina low… that should be enough to get your blood flowing. Ah, you can take the sandbags off now.”", "A look of confusion flashed across Seol Jihu’s blinking eyes. Perhaps he was mistaken, but he made it sound like he didn’t even start the warm-up, much less the training.", "“Oh right, you said you liked running, yes?”", "Seol Jihu looked around his vicinity and swallowed hard. It was true that he liked running, but running on a flat track was completely different from running on a rugged mountain.", "Moreover, the Huge Stone Rocky Mountain’s topography required more jumping and climbing than running.", "‘Don’t tell me….’", "“Let’s start with a light warm-up.”", "An unknown sense of nervousness surged through him. Then….", "“Before we start the real training, let me give you a piece of advice. Think of the training that is about to start as a battle.”", "When he heard the word ‘start’, his nervousness transformed into anxiety. Jang Maldong continued calmly.", "“I mean you should treat it as if your life is on the line. Otherwise, it will be difficult for you to finish it.”", "Hearing him say this with a straight face, goosebumps shot up on Seol Jiho’s arms.", "‘What…?’ It seemed like he was gravely mistaken about something.", "“Don’t forget. Training is a battle.”", "Jang Maldong didn’t seem to be joking. It didn’t even sound like he was trying to be intimidating. He was simply being honest.", "“Let’s see…. Ah, that place looks good.”", "Jang Maldong raised his cane and pointed at a spot in the distance. Past the rugged terrain, Seol Jihu could see a mountain peak standing tall in the sky.", "‘No way!’", "If he was in his normal condition, he felt like he could travel back and forth at least eight times. But with his exhausted body, just making two rounds seemed difficult.", "However, to Seol Jihu’s dismay….", "“Back and forth, fifty times. You can use mana, so make sure you complete it.”", "A bolt of lightning struck him from the clear sky. He was made to use all his mana and stamina, so what did he just say?", "“Also, you’re prohibited from using that earring.”", "A look of disbelief spread across Seol Jihu’s face as he looked up at the mountain peak. However, Jang Maldong didn’t even bat an eye as he opened his mouth.", "“Since you were so stubborn, I trust you’ll demonstrate with your actions.”", "Seol Jihu grit his teeth. Thus….", "“Now start.”", "The curtains were drawn to the first of Seol Jihu’s four most difficult and tortuous battles."]}