{"cid": "195", "title": "Chapter 195. Paradise and Earth (1)", "content": ["After advancing to a High Ranker, Seol Jihu decided to hold off on using the Divine Stigmata. This was because he changed his growth plan following Jang Maldong’s advice. He gave up on the idea of a quick growth to avoid wasting his precious elixirs and decided to advance slowly, one step at a time.", "First, he decided to focus on recovery. Restoring his dropped stats became his top priority for now. After all, while the drop was only temporary, leaving it as it was for a long time could lead to a permanent drop.", "As such, he reinstated his training regime with a light run. It was then that he realized why Jang Maldong emphasized resting so much.", "Now that he had taken ample rest, his body had recovered to the point of being able to endure harsh training. And so, he began to recuperate quickly.", "Of course, his fast recovery was largely in part thanks to Seo Yuhui’s devoted care. While Seol Jihu had no idea, Seo Yuhui was the richest person in Paradise when it came to medicine.", "She invited Seol Jihu over for dinners every three to four days, feeding him food made with all sorts of precious ingredients that would expedite his healing process. Thanks to this, Seol Jihu looked healthier every day, and he regained his muscle mass, blood volume, and skin even while he was lying in his bed.", "Today was the same.", "Seo Yuhui appeared as soon as Seol Jihu’s training was over and fed him a sumptuous meal that would make anyone watching drool and choke in envy.", "Nom, nom, nom, nom.", "As Seo Yuhui watched Seol Jihu snarf up the meal while sweating, her eyes showed signs of being distracted.", "Should I say it?", "After deliberating for a long time, she carefully broke the silence.", "“Um… Jihu.”", "Seol Jihu, who had his nose buried in his bowl, turned around.", "“Yes?”", "“Mm… um…”", "Seo Yuhui hesitated slightly.", "“The gift you gave me. Where did you get it from?”", "“Oh, from Modern Mall. I bought yours from Victoria’s Secret. Their sizes are accurate and they have more selection of cups. Their designs are pretty too.”", "‘Mine?’", "Seo Yuhui held herself back from voicing her doubts. She instantly thought, ‘Did he really?’ But another thought, ‘No way’, quickly put the previous one to sleep.", "Little did she know that her hunch was correct.", "In any case, Seol Jihu tilted his head as if to ask ‘What’s wrong?’ And Seo Yuhui couldn’t bring herself to question someone with such an innocent look.", "“I… I see. That must have been hard. It’s… uh, hard to find that size.”", "“No, not at all. I know most of the foreign lingerie stores that are in Korea like the back of my hand.”", "Seol Jihu boasted like a board member of a famous company bragging about being a China Hand. [1]", "“I… I see. That’s amazing.”", "Seo Yuhui barely eked out a few words. Oblivious to Seo Yuhui’s feelings, Seol Jihu smiled at her compliment. Then, he suddenly asked.", "“Why do you ask? Does it not fit? Or is it not to your taste?”", "“Mm… no, it’s not that… it might be a little tight though….”", "At that moment, the confidence brimming on Seol Jihu’s face crumbled down.", "“N-No way.”", "‘No way?’", "Now what was that supposed to mean?", "“I took special care in picking yours out. I considered all options and bought the optimal…”", "A flustered mutter rang out.", "Seo Yuhui gently closed her eyes. In truth, he was right. Although the bra was a little tight, it wasn’t so bad that it bothered her.", "Plus, everything else was perfect. The color and design weren’t too gaudy, and it had excellent support that lessened the burden on her shoulders.", "That’s why she had been wanting to ask.", "‘Where did you buy it?’, ‘How did you know my size?’, and things like that. And most importantly, ‘Why did you gift me underwear?’", "“Sorry… I should have asked you before buying it….”", "Dear god! He just said he should have asked before buying it.", "Seo Yuhui stared at the sullen Seol Jihu in disbelief. She couldn’t help but think, ‘Is he flirting?’", "“Just how did she groom him…? Teach him some common sense….”", "In the end, she dropped her head and murmured to herself. A deep sigh rose up from the bottom of her heart and escaped her mouth.", "‘How do I make a man out of him?’", "*", "The other members of Carpe Diem began to return as Seol Jihu focused on his recuperative training.", "The first one to return was Marcel Ghionea. He came back to Paradise exactly two weeks after he left, just like he promised. The next to return were the Yi siblings. And coincidentally, the day Seol Jihu restored his stats, the final team members arrived.", "The last person to return wasn’t Hugo, but Chohong. She arrived late at night after touring around Europe and brought back gifts for everyone.", "Chohong took the gift Seol Jihu gave her in return, then cheerfully went up to unpack in her room. And soon, she darted out with a subdued expression.", "Phi Sora, who was drinking beer on the couch, saw Chohong staring at Seol Jihu, who was happily chatting with Hugo. From her deep contemplative face, Phi Sora realized that she had received the same gift as her.", "“Hey, the gift you got me is really high quality. It sticks to my crotch perfectly, and it’s really soft too.”", "“Right? Right? You are a Warrior, so I tried to look for one that’s stretchy.”", "From the looks of it, Hugo seemed to have gotten one too.", "Silently smacking her lips, Phi Sora caught sight of Yi Sungjin who was sitting on the opposite side.", "“Yi Sungjin.”", "When she called out his name, Yi Sungjin glanced at her.", "“…Yes.”", "He replied rather indifferently.", "“Did you also…”", "“Yep, underwear.”", "Yi Sungjin muttered before she even finished her sentence. Phi Sora’s eyebrows perked up.", "“You too?”", "Yi Sungjin nodded his head.", "“Well… I just said thanks and took it. It doesn’t look like I’m the only one who got such a gift though.”", "“Wait, you mean…”", "Phi Sora knitted her brows. She suddenly thought about Yi Seol-Ah.", "‘No, no way.’", "She was a girl, not to mention a high schooler. He couldn’t be so brainless as to gift that to an 18-year-old teenager, right?", "“Noona got a pair of sneakers.”", "Her suspicion was immediately extinguished.", "“Sneakers?”", "“Yep, a pair of running shoes. He said he wasn’t sure about Noona’s… and just went with sneakers….”", "Yi Sungjin explained calmly.", "So he wasn’t a complete, brainless piece of trash. He at least didn’t cross that line.", "Phi Sora breathed a sigh of relief. She wasn’t sure why she felt this way.", "At that moment, Chohong finally spoke up after being silent.", "“Hey, did you go get your class advancement?”", "Seol Jihu flinched. He had planned to keep quiet about it for now and brag in the morning. He hadn’t expected someone else to bring it up first.", "“Why are you so surprised? You were a Level 4 after all. It’s obvious you’d level up after what you achieved in that war. So? Did you?”", "Seol Jihu nodded his head somewhat regretfully.", "“Yeah… I did.”", "Then, Hugo flinched for some reason. Chohong asked again.", "“I knew it. So, what’s the class name?”", "Seol Jihu straightened his back and neck.", "“Nothing. Just Lance of Nemesis.”", "“Huh? Lance of what?”", "Chohong blinked. She knew most of the names a Warrior received when they leveled up, but this was the first time she had ever heard of a Lance of Nemesis.", "Looking around, Chohong found Jang Maldong sitting quietly on the couch and asked.", "“Old Man, I’ve never heard of that class before. Is it a named class?”", "‘Named class?’", "“It must be.”", "Jang Maldong answered calmly.", "“Hey, open up your Status Window. Let us see your class name.”", "Chohong approached Seol Jihu half in doubt. When Seol Jihu opened his Status Window with a confused face, the members of Carpe Diem gathered around him.", "“It’s true….”", "Chohong whistled, her head shoved up close to the Status Window. She seemed rather envious.", "“What’s a named class?”", "“A named class is, um… something similar to a one-of-a-kind class. How do I say this…”", "“It’s a unique class that the gods bestow upon special Earthlings.”", "Phi Sora explained seeing as how Chohong couldn’t.", "“It involves a bit more work from the gods since they are made by taking the Earthling’s disposition and behavior into account. Also…”", "She paused for a moment before continuing.", "“A named class is significant in that it is the stage before an Earthling is accepted as an Executor.”", "“An Executor?”", "“Including those who are dead and those who are alive, Earthlings who have been chosen as Executors have all had unique classes. As far as I know, there are no exceptions.”", "Phi Sora explained calmly, which was unbefitting of her usual personality.", "“Simply put, it is a class that is watched carefully by the gods. Receiving a named class doesn’t mean you’ll become an Executor, though.”", "“….”", "“Take Claire Agnes, for example. Though, we don’t know what will happen when she becomes Level 7.”", "“Don’t you have to be Level 6 to receive a named class?”", "Chohong, who was listening quietly, suddenly barged in. Phi Sora shrugged.", "“That has been the case until now, so I don’t know. It’s not like there’s a rulebook that strictly says you have to be Level 6. Maybe it’s up to the gods to decide. He is an Irregular, after all.”", "“But even among Irregulars…. argh!”", "Murmuring in disbelief, Chohong suddenly groaned and scratched her head hard. Feeling like the atmosphere suddenly got heavy, Seol Jihu spoke nonchalantly.", "“So it’s not a big deal. We don’t know what will happen in the future.”", "He then nudged poor Marcel Ghionea.", "“By the way, what happened with you, Mister Ghionea? Did you become a High Ranker?”", "“When I came back, I dropped by just in case. I was told I’m lacking contribution points.”", "Marcel Ghionea answered calmly.", "“Contribution points? Didn’t you get some from this war?”", "“No.”", "The Archer slowly shook his head.", "“Contribution points are earned through a purely performance-based system. They aren’t given out just because you participated in a war. Just like the name implies, it depends on how much you’ve contributed.”", "It made sense, so Seol Jihu quickly nodded his head in acceptance.", "“Because I was taken captive after the Seven Armies appeared, I was unable to accomplish much….”", "“Same here.”", "Hugo also muttered dejectedly.", "“I’m lacking experience and contribution points. Ira, that fucker. She told me to raise my intelligence first.”", "When Hugo clenched his fists, Chohong expressed deep sympathy.", "“Makes sense. How could someone with noodles for brains be able to handle being a High Ranker?”", "“What’d ya say? And who’s the one who went from being a Priest to a Warrior because of their birdbrain?”", "“Thank you~ Next Level 4, please~”", "“…You bitch!”", "“Dude, you should be ashamed of yourself. You entered Paradise way before Jihu and he’s surpassed you already.”", "“He caught up to you too!”", "“At least I didn’t get surpassed. And don’t you know that Level 5 is where you’re supposed to get stuck?”", "“….”", "Hugo shuddered as if he had nothing else to say. He was practically on the verge of tears.", "Chohong smirked before putting her arm over Seol Jihu’s shoulders.", "“Anyways, our leader is a High Ranker now. We can’t just let this go so easily now, can we?”", "“What are you planning this time?”", "When Jang Maldong asked worriedly, Chohong snorted.", "“Isn’t it obvious? A celebration party! It’s been a while. Let’s drink ‘til our noses drop!”", "“Brat, it’s not like you’re the one who leveled up. You’re just using this as an excuse.”", "Jang Maldong hit the mark.", "“Ei, I don’t need a celebratory party. It’s embarrassing.”", "When Seol Jihu laughed awkwardly, Chohong yanked his arm.", "“You better not bail on us! It will be on me today!”", "Hearing this, Hugo’s head shot up.", "“Really?”", "“Yeah, why?”", "“No takesies backsies.”", "“You think I’m like you? Plus, today’s hero isn’t you.”", "“You made a mistake. A BIG mistake!”", "Hugo stormed out the door, yelling about a chance at revenge. Chohong clicked her tongue before pulling on Seol Jihu’s arm and shouting.", "“Alright! Let’s go!”", "The office quickly turned rowdy. As the other members followed Seol Jihu and Chohong, Jang Maldong also got up with a wry smile.", "*", "It was late at night, but Eat, Drink, and Enjoy was still bustling.", "When Seol Jihu walked in, the pub fell dead silent. But that only lasted a moment. Soon, the pub became even louder with people talking over each other.", "Seol Jihu could see people standing up from their seats to see him, but he walked over to the table Hugo grabbed without batting an eye. But when he saw all the liquor bottles filling up the table, he stopped.", "Even Phi Sora looked overwhelmed. Of course, Chohong was the one who was the most taken aback.", "“You crazy mother—”", "“You said it’s on you, right?”", "Hugo giggled as he popped a bottle open.", "“Get the bill and cry me a river~”", "“You fucker… I swear, if you don’t finish these…”", "“Uuuuuhuh. Don’t worry, I’ll finish them even if I have to drink night and day for four days straight. Don’t you run away.”", "“Fuck, fine. Let’s both die today. Let’s eat, drink, and die!”", "Chohong pulled her sleeves up and plopped down on a chair.", "Just like that, a drinking party celebrating Seol Jihu’s class advancement started.", "Everyone was there. And with stories of the war serving as a fantastic relish, Seol Jihu drank and enjoyed talking without realizing the time passing by.", "There were sharp gazes that would intermittently sting his back, but he paid no attention to them and focused on talking.", "And by the time the next morning rolled around…", "“Bro, I’m just wrapping my head around this now, and you know? Shouldn’t everyone here kowtow to you and say thanks?”", "Hugo, who had drank dozens of bottles and was thus more drunk than ever before, put the bottle in his hand down and spoke.", "“Man, am I wrong? If it weren’t for you— you know? I’m right!”", "“No, not at all. Everyone fought hard together, both Earthlings and Paradisians.”", "“Butttt! If you weren’t there, whoosh! Everyone here would have been swept dead!”", "“Okay, okay, I get it. So quiet down.”", "Hugo talked louder even as his tongue got tied. Regardless of whether he was right or wrong, Seol Jihu stopped him from embarrassment.", "“Noodlebrain is right! You should have been there for the post-war festivities. The person who rendered a distinguished service was lying half-dead, but these sons of bitches were partying out in the streets without a care!”", "“Daaaas right! Das what I’m tryna sayyy!”", "When Chohong chimed in, Hugo nodded his head in a big motion and slammed the table hard.", "“Fucker, you’re drunk already.”", "Chohong snorted and sneered.", "“You’re not the one to say that anyways. You got knocked down after a single punch.”", "“Bitch please!”", "Thud! Hugo slammed down on the table with both hands. As if that wasn’t enough, he stepped onto the table that was filled with liquor bottles, glared down at Chohong as if to butcher her alive, and barked.", "“Man! If I became a High Ranker! You know!? That stupid Undying Diligence woulda! But what!? Ira that bitchass!”", "He couldn’t even form proper sentences, yet he rambled on and on. His face was red, and with how loudly he was yelling, Chohong clapped her hands and mockingly called him a drunk, barking dog.", "Jang Maldong sighed.", "“Ehew….”", "Seeing him shake his head, Seol Jihu smiled bitterly as well.", "It was then.", "“And, yo! If that’s whatchu gon’ say! Huh!? If it weren’t for our Seol here, huh!? You better—!”", "“Fuc~king hell.”", "At that moment, an unknown voice cut in with a curse. Seol Jihu turned his sunken gaze to where the voice came from.", "“I can’t bear listening to you lot anymore.”", "A group of four men in their mid-20s was sitting around a table, glaring at them.", "“Stop boasting, shut the fuck up, and drink quietly.”", "[1] https://en.wikipedia.org/wiki/China_Hands"]}