{"cid": "351", "title": "Chapter 351. Reform (1)", "content": ["Seol Jihu stared at Baek Haeju with a dumbfounded face.", "Slurp! Slurrrrrp!", "He had offered her to take some, but he was lost for words seeing her face practically buried in the ramen bowl. Her chopsticks had a whole pack’s worth of noodles on it too.", "“Um, uh… can you leave some for me…?”", "He tried to stop her, but Baek Haeju was unresponsive. Turning a deaf ear to anything he said, she finished the noodles and even the soup clean.", "“Aheuuu…”", "Baek Haeju then let out a satisfied groan before looking back at Seol Jihu. Licking her ramen soup-drenched lips, she sent him a burning gaze.", "“….”", "Seol Jihu wasn’t all that pleased about the situation.", "‘I told her to take some and she took the entire bowl away. She made me lower my guard by looking indifferent. She’s worse than people who try to take a bite from their friends’ food! A two-faced witch!’", "Shouting out all sorts of criticisms inwardly, he took out another bag of ramen from his belt. But when he finished making another bowl, Baek Haeju took it without a word of thanks and buried her face in it once again.", "He wanted to say something but held himself back. She was a benefactor who helped him greatly in this war, after all.", "‘Right, I might as well treat her properly this time and leave behind a good impression. That way, she will be more willing to help next time.’", "Trying to form a good relationship with the Sacred Empress with just ramen might be a bit ambitious, but Seol Jihu was confident in his ramen-making skills.", "“Um, do you need this…?”", "And so, he took out instant rice and fried kimchi from his belt. Baek Haeju cast a quick glance at him and immediately snatched them out of his hand.", "She left behind the perfect amount of noodles and soup, pouring the fried kimchi and rice in and taking a big spoonful.", "Seeing her eat in such a hectic way while sweating all the while, Seol Jihu’s anger somewhat died down.", "‘She knows how to eat.’", "Nodding in approval, he took out another bag of ramen.", "However, he sighed in the next moment as new, uninvited guests appeared one by one.", "“Ah, the smell of ramen…”", "Somehow having smelled the scent of ramen, Phi Sora was peeking her head outside the tent. She wasn’t the only one.", "“Argh, I was sleeping so well. Making me hungry…”", "Chung Chohong woke up.", "“Bastard! How dare you spread such an unholy smell in our sacred camping ground? Try making another one! I’ll make it disappear in the blink of an eye so you’ll think twice before making it again!”", "And the yelling Hoshino Urara also appeared.", "Three hungry prowlers drunk on sleep crawled over one by one.", "“Ramen~ Ramen~ Ramen~!”", "The trio rubbed their chopsticks and drooled while Seol Jihu moved the ramen he boiled into a bowl.", "“…Huh?”", "He blinked rapidly.", "A dainty hand stealthily moved and snatched the bowl of ramen as soon as Seol Jihu put it down. It was a natural, fluid movement.", "“W-What?”", "“It vanished?”", "Chohong and Hoshino Urara’s jaws dropped.", "It was the same for Phi Sora. Her widened eyes slowly turned to Baek Haeju as her expression contorted.", "“What was that?”", "Slurrrrrrrrrp!", "Baek Haeju’s reply came in the form of an amazing slurp.", "“Hello? You already had some! Why would you take that?”", "Slurp, slurp!", "“Oh my! Look at this person. She’s just eating while ignoring everything else! Where is your conscience?”", "Gulp, gulp!", "“Oh? Ooooh?”", "Phi Sora walked up quickly with a dumbfounded face.", "Baek Haeju turned around and began to eat even faster.", "“Argh, are you really doing this!?”", "Phi Sora tried to take the ramen bowl by force, but then suddenly screamed and stepped back as a terrifying aura rose up from Baek Haeju’s body. She even glared at her sharply.", "It was like the saying, the person who farted gets angry. Phi Sora protested feeling wronged.", "“Are you crazy!?”", "“Be quiet.”", "“W-What?”", "“I said, be quiet. Do you realize how long I… hua, huaaa…”", "Phi Sora had no choice but to back off as Baek Haeju snapped at her.", "Meanwhile, Baek Haeju continued to drink the ramen soup, as if she wouldn’t let a single drop go to waste.", "With no confidence to overcome the difference in three whole levels, Phi Sora could only stand there with her mouth agape.", "“Hiiing…”", "She sniffled slightly as her eyes reddened. In the end, she looked for Seol Jihu with beads of tears glistening around her eyes.", "“Dear… this person…”", "Seol Jihu shook his head and boiled more water.", "‘Who would have thought that a day would come where Phi Sora came to me crying? Is my ramen that good?’", "He then vowed to himself.", "‘The end might not be that far off. If Paradise’s problems are all taken care of, I’ll open up a ramen restaurant.’", "A small, shabby restaurant in an alleyway.", "*", "Earth time, the Year 2018.", "In Paradise, the allied force of the Federation and humanity defeated the Parasites that initiated an all-out war at Tigol Fortress.", "They forced four out of five Army Commanders into releasing their divinity, half of the Nests were destroyed, and the Parasite Queen that appeared in the final moments of the war received a serious injury and was forced back to the Empire.", "Furthermore, the Seventh Army Commander was forced to retreat from the Spirit Realm, and the Fourth Army Commander perished.", "Not even two days were needed for this news to spread to every corner of humanity’s territory.", "Perhaps because of this, a huge welcoming crowd was gathered by the time they returned to Eva.", "It wasn’t just Eva’s residents. Many Earthlings could be seen among the crowd as well.", "They had come to see Seol Jihu because of how absurd this event really was.", "The moment Seol Jihu walked through the city gate, a huge cheer erupted. It was so loud that Seol Jihu winced reflexively.", "‘Damn it, I shouldn’t have led the way.’", "Seol Jihu grumbled inwardly as he remembered how he was told to get on a Horus and walk in first.", "“How are you feeling?”", "Teresa giggled as she followed behind him on her own Horus.", "“You’re finally back in Eva. Why don’t you say something for the crowd?”", "‘To the crowd?’", "Seol Jihu tilted his head back and looked up at the sky. Then, he spoke in a low voice.", "“…I feel like I’m going to explode.”", "“Explode? With emotion?”", "“No, not exactly…”", "Seol Jihu said with a serious face.", "“I want to pull a prank…”", "“…Pardon?”", "Teresa blinked.", "“You mean… your mischievousness is going to explode?”", "“Yes. I haven’t pulled any pranks in a long time because I was too busy with the war… Now I’m itching all over…”", "Now what does this mean?", "What is this man trying to say at a triumphant procession?", "Is he trying to joke around?", "No, it doesn’t look like he’s kidding from the look on his face.", "Teresa made a flustered face before feigning a smile.", "A triumph was not something that came by often, and there was something she really wanted to do.", "“Erm, why don’t you wave your hand at them?”", "“It’s embarrassing.”", "“What’s so embarrassing about that!? Look at all the people gathered here. They’re here to see the face of the hero!”", "“Hero? It’s not like I did it alone.”", "“Eii, don’t wimp out. Look, everyone else is waving their hands.”", "Just like Teresa said, the members of Valhalla following in behind him were all marching in a stately, triumphant manner. They were fully enjoying the procession while walking through the flowery path laid out by young girls in white ceremonial dresses.", "“Come on. You worked out for this victory. You’re more than qualified to receive this treatment.”", "Seol Jihu looked around as Teresa pressed him.", "‘I’d prefer something quieter though…’", "Seol Jihu laughed bitterly. It wasn’t that he hated this, just that he was embarrassed by it. He didn’t enjoy large commotions by nature.", "As he was smacking his lips in hesitation, he suddenly caught sight of a little boy.", "He was holding onto the hem of his mother’s clothes with one hand and a flower in the other while staring at him fixedly.", "A smile bloomed on Seol Jihu’s face as he saw the little boy standing on his tippy-toes to get a better look.", "The boy’s eyes widened when Seol Jihu faced the boy and raised his hand slightly. He looked to be in disbelief like he couldn’t believe that Seol Jihu was looking at him.", "The moment Seol Jihu raised his hand higher to wave—", "Whaaaaaaaaaaah!", "The already thunderous cheers got even louder, going from ear-piercing level to eardrum-bursting level.", "‘Nice!’", "Teresa smiled in satisfaction. Furtively driving her Horus to Seol Jihu’s left, she gave a tender smile and waved her hand as well.", "This way, it looked like the king and queen were standing side by side, being welcomed by their people.", "—Long live Representative Seol!", "—Long live the Haramark Royal Family!", "“Ehe, ehehehe.”", "Hearing the chant she was aiming for, Teresa’s lips wriggled up and down.", "However, this was very short-lived.", "“Ohohoho~!”", "Seeing Teresa cover her mouth with one hand and laugh, Charlotte Aria drove her Horus up to Seol Jihu’s right.", "The chant changed instantly.", "—Long live Representative Seol!", "—Long live Your Majesty the Queen! Hurrah! Hurrah!", "Teresa’s face stiffened.", "She gave a sidelong scowl at the blonde, twin-tailed girl responding to the cheers while gently grasping the hem of Seol Jihu’s clothes.", "But that only lasted a moment. She put her smiling face back on and waved her hand even more eagerly.", "Then, she lowered her voice and muttered.", "“Damned kid, why don’t you take a hint?”", "“I did. That’s why I’m here.”", "“Hoho, so you wanna go at it? A crybaby like you?”", "“I applaud your bravery, but don’t forget that this is Eva.”", "Savage words went back and forth as the two smiling ladies continued to wave their hands.", "Of course, their sharp-toned conversation was buried by the thunderous cheers.", "*", "There was no end in sight to the welcoming crowd.", "Not only did they stretch along the road from the city gate, but they were also camped in front of Valhalla’s building. As such, it wasn’t until Seol Jihu reached the palace that he could catch a breath.", "Of course, arriving at the palace wasn’t the end of the celebrations.", "After receiving Charlotte Aria’s formal congratulations and thanking the expedition team members that were returning home, there was a citywide festival arranged by Sorg Kühne.", "This was when he led Valhalla’s members and sneaked out of the palace. Though he liked festivals, there was such a thing as too much.", "At this point, he wanted to drop everything and just rest. The fatigue that had been building up since he arrived at the city had finally exploded.", "And so, he was almost crying by the time he returned to Valhalla’s building.", "“It’s been a while.”", "Kim Hannah came to meet them at the entrance. She was smiling while standing with a suit jacket hanging on her arm.", "“Good work, everyone. Welcome ba—”", "“Oi, move over, please. We want to go in.”", "“Ehew, we’re finally back. Forget the war, I thought I was gonna die there.”", "“Tell me about it. What kind of celebration lasts so long? I didn’t even see an end in sight.”", "Tap, tap. Everyone passed by Kim Hannah, barely receiving her greeting.", "Most headed straight to their room while some went down to the hot springs.", "Kim Hannah blinked rapidly before laughing at the awful shapes they were in.", "She sent a meaningful smile at Seol Jihu, who was standing like a monk who’d reached Nirvana.", "“Iya~ Somehow you managed to come back alive this time too.”", "“You say that like you didn’t want me to come back alive.”", "“Of course not. I prayed for your safe return day in and day out ever since you left.”", "“Wow~ Thank you, Jinah’s Mom.”", "“Jinah’s Mom?”", "“That’s the name of the daughter we’ll have in the future, using Seol Jihu’s ‘Ji’ and Kim Hannah’s ‘Nah’… Ow, ow, ow. Sorry, sorry, don’t hit me.”", "Seol Jihu immediately stepped back and apologized.", "“You just came back and the first thing you do is crack jokes?”", "Kim Hannah put down the foot that was raised halfway into the air.", "“I’m sorry to bother you when you just came back, but there are a few things I need to report to you. Well… you should rest for today. I can see exhaustion practically written on your face like you’re going to collapse at any moment.”", "She wasn’t wrong, but Seol Jihu shook his head.", "“Do you have any news on Yuhui Noona?”", "“Miss Seo Yuhui is…”", "Kim Hannah’s complexion darkened slightly.", "“I’m sure you’ve already heard, but she returned to Earth a few days after arriving in Eva. There was nothing the temple could do for her at the moment.”", "Returning the wounded to Earth. It was something that was only used as a last resort. At the same time, it was only used in special cases.", "The reason was simple. To use this method, the wounded had to be alive and awake when they entered the temple and used its portal.", "Moreover, the immediate cause for Seo Yuhui’s collapse was the overexertion of holy power. Since the gods’ oath made one’s abilities disappear when they went back to Earth, the rampaging holy power would obviously disappear as well.", "With the immediate cause gone, the body would also recover as time went by.", "Though, of course, everything would come back the moment they returned to Paradise.", "“I heard she’d go to the hospital to get treated, but…”", "Kim Hannah observed Seol Jihu while talking. Given his personality, he should be fidgeting anxiously like a dog that needed to poop. But the way he was nodding his head and listening attentively, he looked calmer than she expected.", "Even in reality, Seol Jihu was calmly racking his brain.", "‘The fact that Noona returned to Earth without staying in Paradise must mean that this matter cannot be taken care of within a short period of time.’", "She was likely trying to bait out the big fish while taking her time.", "“What’s wrong? I thought you’d be going berserk.”", "“…Because I already heard about it two days ago. It’s not like there’s anything I can do to help her immediately. I might as well stay calm and do what I can.”", "“By that, you mean gathering offerings?”", "“That, and other things…”", "Seol Jihu spoke vaguely and evaded giving a clear answer.", "Since even Miss Foxy was oblivious about her real condition, Seo Yuhui must be conducting her plan in absolute secrecy. It wouldn’t be too late for him to tell Kim Hannah once Seo Yuhui came back.", "“Oh right, where’s Miss Eun Yuri?”", "“Sleeping. Apparently, she cut it pretty close. I was also told that she would be much stronger than before when she recovers. At least, that’s what the Magician named Roselle said.”", "“We can trust Lady Roselle. That’s good to hear.”", "Seol Jihu breathed a sigh of relief.", "“Let’s discuss the rest tomorrow. I’m about to pass out…”", "He moved his steps, groaning.", "‘He looks okay.’", "Kim Hannah smiled as she watched Seol Jihu limp toward the stairs. She heard the battle was brutal and bloody beyond precedent with even the Parasite Queen making an appearance. But nevermind signs of trauma, Seol Jihu looked and acted like he came from a local bar. Like always.", "“Representative.”", "Kim Hannah stopped him just as he was about to pass by her.", "Bowing respectfully, she continued saying what she couldn’t finish before.", "“Welcome back.”", "Seol Jihu flinched.", "“…Yeah.”", "He turned his head halfway and curled the corner of his mouth up.", "“I’m back.”", "Nudging Kim Hannah’s arm in embarrassment, Seol Jihu trudged through the first-floor lobby.", "Kim Hannah continued to stare at Seol Jihu as he walked up the stairs before letting out a light sigh.", "“I’m glad.”", "Although two members suffered grave injuries, everyone had thankfully returned alive.", "With this, the building that had been as silent as a Buddhist temple should return to its usual rowdiness.", "Kim Hannah chuckled.", "“Anyway, Jinah’s Mom? Hilarious.”", "‘He hasn’t changed a bit even after such a big war.’", "Shaking her head while trying to put on her jacket, she suddenly paused.", "“…Huh?”", "‘Wasn’t it on my arm?’", "The suit jacket had disappeared before she noticed.", "Kim Hannah furrowed her brows, looking down at her left arm in a daze. She suddenly recalled Seol Jihu, who scurried up the stairs with his hands cupped in front of him.", "He had nudged her before he left too.", "“…This guy.”", "Kim Hannah rushed up the stairs and threw open his door.", "“Hey!”", "However, no one was inside the representative’s room.", "Having a sudden thought, she walked over to her own room, and that was when she was found Seol Jihu buried in her bed, sleeping.", "Of course, he was using her jacket as a blanket.", "“….”", "Kim Hannah stared dumbfoundedly before crossing her arm and scoffing.", "“…Hello, Mister Pervert?”", "“?”", "“Don’t give me that questioning look. You know what you’re doing. Jeez, just when I thought you got better… Did you go to the war and pull pranks 24/7? Did you bother the Parasite Queen like this too?”", "“Lady, lady.”", "“Lady, my ass. Get up!”", "“Is that how you should be talking to your husband who just came back from a hard day at work?”", "“Are you high?”", "Kim Hannah stomped into the room.", "Opening her palm wide, she growled.", "“You bastard!”", "Chak, chak! When she mercilessly slapped his back and buttcheeks, Seol Jihu yelped and rolled over on his back.", "“You went to war and this is what you learned? Are you crazy? Huh?”", "“Stop!”", "“Hero? This is the grand hero who saved the Spirit realm and defeated the Parasite Queen? Don’t you have any shame!? Get up!!”", "“Argh! It hurts!”", "Seol Jihu wriggled violently and pulled Kim Hannah’s jacket up to his head.", "*", "Seol Jihu woke up the next morning on the dot.", "Of course, not in his room, but in Kim Hannah’s.", "He had to hear all sorts of abuse ranging from ‘get your ass up’ and ‘get out’, but he managed to last until she gave up.", "Kim Hannah’s room was filled with plants that gave off a refreshing scent.", "Seol Jihu smiled looking at the flowerpots by the bed.", "Despite the scolding, Kim Hannah must have prepared them so he could get a good night’s sleep.", "Seol Jihu hopped off the bed, draped Kim Hannah’s jacket over his shoulders, and walked out to the terrace.", "The feeling of smoking while relaxing under the morning sunlight couldn’t be described with words.", "“So peaceful…”", "He was glad that he decided to participate in the war. Otherwise, Tigol Fortress would have fallen, and humanity would have been stamping their feet with their houses on fire by now.", "The peace he was enjoying now was something he had earned through making the right choices at the right time.", "“….”", "To be honest, he was still in disbelief.", "But regardless, he had overcome a big hurdle.", "And the more difficult a hurdle was to overcome, the better the reward would be for overcoming it.", "Now it was the time to enjoy the fruits of his labor.", "As always, eating came first.", "Seol Jihu dragged his starving stomach over to the cafeteria. He wanted to fill his stomach before doing anything else.", "There was a prior guest at the cafeteria.", "Phi Sora was lounging in her chair, rubbing her round stomach as if she just had a wonderful feast.", "“What are you doing?”", "When he called out, Phi Sora raised her head slightly before lowering it back down.", "“Just sitting here. You know, enjoying life.”", "“When did you get so philosophical?”", "“How could I not? I fought ‘til my back broke. No, that wasn’t even a fight. I was just beaten over and over again. Anyway, you should also take a moment and think about the preciousness of life.”", "“I just was, actually. The past despair is what makes the present peace all the more precious, isn’t it?”", "Phi Sora flinched. She raised her head again and looked at Seol Jihu in a renewed way.", "“I didn’t expect something like that to come out of your mouth. Looks like you can say nice things from time to time.”", "“What do you mean, from time to time?”", "“Do you really need to ask? You spend your free time teasing and pulling pranks on people, you chase after women’s breasts like a baby, and then you suddenly become a different person when something happens that makes you angry. It’s like you have a terrible case of bipolar disorder. Ah, you make a hell of good ramen, though.”", "“…Rude.”", "Seol Jihu rubbed his ribs after being pummeled by the harsh facts.", "“I don’t tease people that much.”", "“Shut it. I still remember Phi-diot. Ah, I’m getting angry just thinking about it.”", "Phi Sora grumbled before suddenly sitting tall and going ‘Ah!’.", "Seol Jihu, who was sitting across from her, stared at her curiously.", "“By the way, when are we doing the thing?”", "“What thing? Going to the temple?”", "“Ei~ You know what I mean.”", "Phi Sora shot up and circled around the table excitedly. Plopping down next to Seol Jihu, she leaned against his shoulder and brought her face up close.", "“We can go to the temple in our own time. I’m talking about that. You must have gotten a lot of good things from the Spirit Realm and Tigol Fortress.”", "Phi Sora tickled Seol Jihu’s side with her elbow and bobbed her eyebrows.", "“You’re not going to take all of it, right?”", "At that moment, Seol Jihu’s eyes flashed."]}