{"cid": "245", "title": "Chapter 245. City of Anarchy (2)", "content": ["Darkness bit a chunk out of the sunset-dyed sky, scattering the orange hue into oblivion and blanketing the world with nighttime.", "Seol Jihu blankly stared at the city left in the darkness of the bygone sunset.", "‘This place…’", "Where was it? And why was it in such a visible mess?", "Seol Jihu stood in place for a long time before moving forward, staggering as though he was dead drunk.", "All sorts of scenery flashed by his eyes. A dirty mother and daughter, sitting on the side of the street with a small tin can in front of them, and Earthlings walking by them with indifferent looks.", "A mother feebly looking up at a passing Earthling, a boy begging on his knees pleading to a man to give something back, and the Earthling kicking him away in disgust.", "An old woman flailing her arms in the air while being dragged out by an Earthling pulling on her hair.", "An Earthling screaming at a woman to pay off her debts, Earthlings harassing a Paradisian woman calling for her mom.", "Earthlings standing in front of a show window, ignoring the ruckus around them and commenting on the soulless women on display.", "Paradisian women already sold to customers, enduring dirty looks and inappropriate groping.", "“!”", "Seol Jihu suddenly stopped in place. He turned his gaze to a dark alleyway, his eyes immediately filling up with doubt.", "A small corpse was spilling out of a trash can that fell to the floor.", "Seol Jihu’s eyes trembled. No matter how he looked at it, the corpse couldn’t have been alive for more than a few months.", "Suddenly, a splitting scream rang out, followed by loud slapping noises. But no one paid any attention to the horrible sound.", "In fact, the sound of giggling only grew louder. They were disregarding even the stench of a rotting corpse, enjoying the madness of nightlife.", "Seol Jihu felt like he was dreaming.", "‘What?’", "There were no morals or basic human rights.", "‘What am I looking at?’", "There was only self-indulgence masked as freedom.", "“Just what the hell…!”", "Seol Jihu raised his voice before unknowingly shutting up. It was because he remembered Kim Hannah telling him that not all royalty were competent.", "Seol Jihu feigned a smile as he watched an Earthling successfully solicit another Earthling to enter a building. He was dumbstruck.", "That couldn’t be the reason that they were given the building. That couldn’t be the reason they entered Paradise. Yet… these things were happening in front of his eyes.", "“There’s a simple reason that Eva is a popular city among Earthlings.”", "It was Kim Hannah’s voice.", "“Because it’s a comparatively safe city. It isn’t close to the Parasites’ territory, and the famous Tigol Fortress is acting as a line of defense. Though, the fortress was conquered once.”", "“….”", "“There’s less threat of an invasion, so Earthlings are flocking to it after Scheherazade. Not to mention, they can also see the Federation.”", "Seol Jihu fell silent. Kim Hannah continued with a monotonous voice.", "“This is Eva, a city where several organizations are working together to blind the immature queen’s eyes and squeeze out benefits.”", "“…These people.”", "Seol Jihu clenched his teeth.", "“Why… why did they enter Paradise…?”", "His voice trembled.", "Kim Hannah turned her gaze. She saw the crawling boy…", "“You can plunder money.”", "…saw the old woman screaming and yelling on the ground…", "“You can steal money.”", "…and saw the collapsed Paradisian woman being dragged by her hair.", "“And you can earn money.”", "Next, she turned to Seol Jihu and shrugged.", "“For the record, most of the people ran away when the royals issued that mandatory conscription order for the war.”", "“If they entered Paradise—!”", "Seol Jihu shouted. A light flickered in Kim Hannah’s eyes, though only for a moment.", "In truth, the response she was expecting was, ‘There’s no reason for them to go this far!’ But Seol Jihu’s response was far from it.", "‘…If they entered Paradise.’", "This was what infuriated Seol Jihu. The Earthlings abandoning their duty. It was less that he felt pity for Paradisians and more that he detested seeing a wonderful city in this state.", "‘I guess it doesn’t matter.’", "Kim Hannah had achieved her intended goal.", "There was a reason she brought him out on his first day here. This city of anarchy, overflowing with unsightly virility and entertainment, was under the tight control of Eva’s eight organizations. It was obvious that they wouldn’t spare a seat for Seol Jihu.", "Of course, Seol Jihu didn’t come to Eva just to take a single seat. No, he came to devour everything. And to do that, he needed to push the eight organizations aside.", "Meaning, he had to consider them his enemy.", "‘This should be good enough, but…’", "Kim Hannah decided to urge him on a bit more. She knew of a place that directly contradicted what Seol Jihu was trying to achieve in Eva. There shouldn’t be a better place to incite his emotions.", "“Let’s get a move on.”", "Hearing this, Seol Jihu stared at Kim Hannah fixedly. His expression was frighteningly stiff.", "“We came all the way here. We might as well buy something.”", "“Kim Hannah.”", "“Who knows what’s going to happen in the future?”", "Kim Hannah scanned Seol Jihu from top to bottom.", "“Shouldn’t you at least get yourself a nice set of armor?”", "Hearing the intent behind her words, Seol Jihu swallowed his own words.", "“You don’t need to worry about money. With my name, they won’t mind putting it on the tab. We can just pick out any item we want.”", "Kim Hannah threw her handbag up and smiled sweetly.", "“Do you remember what I told you in Scheherazade?”", "*", "Kim Hannah cut through the night street, leading Seol Jihu to a shabby building on the outskirts of the city.", "The place looked like a haunted mansion from the outside, but it was really an auction house. It wasn’t an official auction house, but a VIP auction house that was used for black-market dealings.", "When Kim Hannah approached the building, the two guards standing at the entrance walked forward.", "“Our apologies, but the entrance is closed for the day. The auction is already underway.”", "“I know.”", "Kim Hannah smiled, retorting, “We’re not here to participate in the auction, but to meet someone.”", "With that, she put her hand into the handbag and took it back out. She seemed to show something to the guards, but Seol Jihu couldn’t see it clearly as he was standing behind her.", "What he did notice was that the guards’ attitude changed completely.", "“Excuse me. Who should I say it is?”", "“Tell him the fox is here.”", "The two guards shrunk back, but only for a moment.", "“What brings you to…”", "Kim Hannah whispered quietly.", "“…Please wait just one moment.”", "One of the guards distanced himself, calling someone with a communication crystal before nodding his head.", "He came back, then spoke.", "“He said he would meet you.”", "“Where should I go?”", "“Ah, if it’s okay with you, can you wait 30 minutes? He’s in the middle of training.”", "“Training, huh.”", "Kim Hannah snorted.", "“I don’t see why not. Ah, can we watch the auction for a bit? Standing around for 30 minutes is awfully boring.”", "“If you’ll only watch, then yes. Should I guide you in?”", "“It’s fine. I’ve been here a couple of times before.”", "“Then I’ll come back in 20 minutes.”", "The guard bowed. Kim Hannah grabbed the dazedly standing Seol Jihu’s hand and pulled him inside.", "Hot air filled the building’s interior. Every time they took a breath, they felt a strange heat stinging their nose.", "Soon, they pulled back on black curtains and entered, the source of the heat revealing itself.", "There were dozens of people sitting on the stairs of an amphitheater in front of the stage. They were drinking wine, eating food, or cheering quietly. Everyone was wearing a mask and a hoodie.", "The auction was already well underway, just like the guard said.", "“Here is the next item—!”", "The auctioneer standing on the stage raised his arm, his voice resounding in the closed space.", "Next…", "“It is— a Sky Fairy!”", "Seol Jihu doubted his ears. He widened his eyes in shock as he saw the ‘item’ being moved to the center of the stage.", "“I will save the long explanation. Males are rare among Sky Fairies. I’m sure you all know that adolescent male Sky Fairies are treated as treasures even amongst their own race!”", "The auctioneer’s words didn’t enter Seol Jihu’s ears. His eyes were fixed on the young Sky Fairy, shackled around his ankles and neck, crying with his head dropped.", "One person shot their hand up. From the thin, slender arm, one could guess she was a woman.", "When she made a beckoning gesture with her index finger, the auctioneer pushed the Sky Fairy forward. The woman’s hand caressed the fairy’s body, causing him to shrink back in tears.", "The more the ‘item’ reacted in disgust, the more excited and bold the woman became, cackling loudly.", "At that moment, a stumpy man raised his hand.", "The laughter stopped. The two of them then called out bids in intense competition before the auctioneer brought the Sky Fairy away.", "The woman spat on the floor and sat back down angrily.", "Having watched the entire scene unfold, Seol Jihu’s mouth widened. His soul seemed to have left his body.", "He had witnessed a slave trade for the first time in Paradise.", "“Kim Han—”", "“I’ve come to guide you.”", "Seol Jihu’s sentence was cut short by the guard’s timely return.", "“Yes, let’s go.”", "Kim Hannah smiled and linked arms with Seol Jihu.", "Seol Jihu could feel a furtive pressure on his arm. Kim Hannah was hinting him to stay put.", "Seol Jihu couldn’t take his eyes off the stage, but had no choice than to leave with Kim Hannah pulling him.", "The moment he passed through the black curtains again, he realized his breathing was much rougher than before. His heart was also beating several times faster than normal.", "Seol Jihu gritted his teeth while trying his best to collect his breath. He now had a good idea what kind of a place Eva was. He didn’t think he could be surprised any more than this.However, this thought was thoroughly crushed the moment he followed the guard into the basement.", "“He’ll be right out after putting on his clothes. The training just ended.”", "The guard bowed before taking his leave. However, Seol Jihu didn’t notice him at all.", "The odor of chestnut flower[1], filth, blood, and rotting flesh. All sorts of putrid odors were resounding in the room.", "…No, the smell was the least of his concern.", "There were dozens of one-cubic-meter steel cages. In each cage were all sorts of foreign races, all shackled up.", "That wasn’t all. Discovering a chain hanging down from the center of the ceiling, Seol Jihu’s breath stopped. And when he saw the lump of meat hanging on the hook, his eyes split open.", "No matter how he looked at it, it was a Sky Fairy’s corpse, handled ‘skillfully’ into a lump of meat.", "“….”", "Words no longer came out of his mouth.", "Seol Jihu remembered seeing a similar scene. Was it when he infiltrated the Delphinion Duchy Laboratory? He had found Hugo hanging like that as well.", "“You’ve heard of human flesh capsules on Earth, right?”", "Even in this situation, Kim Hannah’s voice was calm.", "“It’s the same in Paradise. How should I say this… Earthlings have fantasies about Fairies as a race.”", "Kim Hannah shrugged.", "“It might not be to the point of immortality, but some people have baseless beliefs that they’re good for their health or that they would give some sort of stat bonus. People like that are rare though.”", "Seol Jihu had to clench his fists to rein in the disgust rising from his stomach. On the other hand, nausea shot up to his throat, arousing intense animosity.", "Humans were in no position to curse the Parasites.", "Just by looking at the Earthlings operating this building, one could see that they treated foreign races like livestock, just like how the Mutant Orcs treated humans.", "Suddenly, a faint moan rang out. It sounded like a whimper as well.", "Seol Jihu walked forward just in case and immediately furrowed his brows.", "The inside of the cages was stained in indescribable horror, being unbearable to witness.", "A female Sky Fairy was lying almost unconscious, naked. Just by looking at her, one could easily guess what kind of tragedy she suffered and what the ‘training’ the guard referred to was.", "Seol Jihu clutched onto the cage subconsciously. He wanted to take her out if possible.", "Although it was far too late, he wanted to send her back to the Federation.", "But how?", "He didn’t bring any money, much less his spear.", "“Are you okay?”", "In the end, the only thing he could do was ask a meaningless question.", "The tragically weeping Sky Fairy stammered.", "“Child…”", "‘Child?’", "“Child… my child…”", "She searched for a child even as she cried endlessly.", "What would the Federation think if they saw this?", "“Vile humans.”", "A begrudged voice stabbed his back. From a cage behind him, Seol Jihu saw a Beastman glaring at him with resentment. Judging from her fox tail, she seemed to be a Foxman.", "“A savage race that can only worry about satisfying their insatiable greed even with the threat of the Parasites looming over them.”", "When Seol Jihu met the Foxman’s eyes, the latter spat out a curse as if she had been waiting for this moment. Seol Jihu wanted to deny it but instead closed his mouth, seeing signs of torture all over her body.", "“Just you wait. Even if I die and become a vengeful spirit, I will—”", "“Aigoo, that bitch is at it again.”", "The female Foxman spitting out curses flinched and dropped her head. An obese, mustached, middle-aged man was plodding over in big steps. The female Foxman’s eyes glinted fiercely.", "“You…!”", "“Shut up, will ya? We got a guest. Do you need more training too? Hmm?”", "“I dare you to lay a single finger on me! This instant!”", "“You’re free to die if you want, but then the Foxman kid over there will just have a harder time.”", "The man glanced at a cage near her, speaking mockingly. The female Foxman drew a deep breath and shut her mouth while the man laughed slyly. Judging by how good he was in handling her, he seemed to be rather experienced.", "While the sound of teeth grinding brutally flowed out, Kim Hannah sighed.", "“Why did you want to meet us here? We could have just met in a room.”", "The man’s eyes widened.", "“What are you talking about? You said—”", "The man paused in the middle of his sentence and narrowed his eyes. He blinked rapidly, seeing a young man clutching onto a cage, staring fixedly at a slave.", "“Who’s this?”", "“A potential buyer.”", "“Oh? He looks young. Anyway, why is he—”", "Seol Jihu abruptly turned his head, glaring at the man with a burning gaze.", "The man flinched momentarily but laughed seeing the youth clutching onto the cage tightly.", "“Iya~ You’ve got good eyes, young man. Sorry, but that bitch isn’t for sale. She’s a hot item, you see. People are lining up to get their hands on her.”", "‘What?’", "“Sky Fairies became easier to capture when they lost their spirit power, so they’re a little more common these days. But Foxmen are always in low supply. If you really want her, join the auction tomorrow night.”", "Seol Jihu finally realized what was going on. For some reason, this man was treating him as one of them.", "“Now, now, don’t be so upset. You’re Miss Foxy’s guest, so I can pull some strings for the sake of establishing a good relationship.”", "The man smacked his lips and continued.", "“So? Did anything catch your fancy? Did you want to bring it home or use it for medicine? If you want, we can cut it up for you.”", "The man spoke while gesturing at the lump of meat hanging on the hook.", "Seol Jihu’s brows twitched. He reflexively felt around his waist, but his spear couldn’t be grabbed. It was the same when he put his hand in his pocket. He only clenched the poor egg with force.", "The man clicked his tongue.", "“I told you, that bitch isn’t for sale. I won’t sell her even if you offer a million gold coins. No, I can’t. It’s a matter of credit.”", "“….”", "“Anyway, pick something other than that Foxman.”", "Seol Jihu turned back from the cage with difficulty.", "He was at his limit.", "The string holding his sanity together had tensed up ever since he saw the night street. If pulled on just a little more, it would snap.", "Kim Hannah had been signaling him with her eyes since a while back. Just as she quickly opened her mouth—", "“Hey.”", "“I’m not buying.”", "The words Seol Jihu had been holding in burst out of his throat.", "The man’s eyes widened.", "“What?”", "“I’m not buying anything here. No matter how good they are, they’re too dirty for my taste.”", "Seol Jihu spat out these words while clenching his teeth. Then, he quickly brushed past them and left the basement.", "The man simpered as he saw the young man disappear.", "“Haha, what an irritable young man.”", "“Ah, hey!”", "Kim Hannah called him multiple times, but Seol Jihu ignored her. He didn’t even look back.", "‘These insane pieces of shits…!’", "Seol Jihu walked furiously with sharpened eyes. He wanted to get out of this godforsaken building as soon as possible.", "That was why he didn’t notice.", "That the egg had twisted out of his grasp and peeked its head out of the pocket.", "Next, it bounced out, landed gently on his shoulder, and tilted forward.", "Almost as if it was leaning forward to carefully observe the enraged Seol Jihu’s face.", "1. Chinese chestnut flowers have a distinctive semen-like odor. "]}