{"cid": "384", "title": "Chapter 384. The Shade of the Giant Tree (3)", "content": ["“Suspicious points?”", "The corners of Seol Jihu’s eyes curled up slightly.", "In that instant, Kim Hannah felt an indescribable, fierce sense of disharmony. It was like trying to walk across a crosswalk but having the green light flicker after taking the very first step.", "After hesitating for a brief moment…", "“Yes. You see…”", "She chose to stop without rushing across.", "Because it felt like the light would turn red at a moment’s notice.", "“I believe an external organization interfered in this matter.”", "She quickly dropped her gaze to the clipboard and reported another matter.", "“An external organization interfered…? Did they get in our way of gathering offerings?”", "Seol Jihu smiled softly and asked while resting his chin on his hand.", "Kim Hannah heaved out the breath she had been holding in.", "“No, it’s the opposite.”", "“Opposite?”", "“The main branch of the Temple of Luxuria, which is located in Scheherazade, donated offerings to us. The bishop even came to Eva personally and looked after Miss Seo Yuhui.”", "“The bishop…?”", "Seol Jihu raised his eyebrow.", "Kim Hannah flipped a page on the document and continued.", "“Roberto Servillo. He’s an Italian man from Area 2. He is a Level 6 Bishop who serves Luxuria.”", "Seol Jihu blinked a couple of times and then rolled his eyes.", "“So, not only did they donate offerings, but a Level 6 Priest also came to tend to Yuhui Noona…”", "He then glanced at Kim Hannah.", "“That sounds like something we should be grateful for. What’s the reason you called it interfering?”", "“It’s simple.”", "Kim Hannah continued.", "“Roberto Servillo and Miss Seo Yuhui are not on friendly terms.”", "“This is the first time I’ve heard of this.”", "“That’s natural. Roberto Servillo knows how to conduct himself in the public eye, so his less-than-friendly relationship with Miss Seo Yuhui is not known to the masses.”", "“That means that he’s hiding it, so how do you know about it?”", "“Mm, it’s a long explanation… but the Temple of Luxuria once enjoyed an era of prosperity along with the Temple of Gula. That was when Sung Shihyun and Miss Seo Yuhui were active as Executors.”", "Seol Jihu nodded his head, gesturing at her to keep going.", "“But their cordial relationship didn’t last long. After the Empire Raid Expedition, the two Executors parted ways for unknown reasons, and Sung Shihyun then joined Sinyoung. Miss Seo Yuhui quit her position as an Executor and retired from Paradise around the same time, and Sung Shihyun went missing not long afterward.”", "“Who would have thought he defected to the Parasites?”", "Seol Jihu snorted.", "“Anyway, so?”", "“The Temple of Luxuria was naturally put in a difficult position. With the Executors that acted as their pillars of support gone, their past domineering attitude came back to bite them.”", "Recalling the incident he experienced in Haramark, Seol Jihu smacked his lips.", "The mysterious group was desperate to attack him when he didn’t do anything to them. So he could guess how passionate they must have been in attacking the Temple of Luxuria, which must have been flaunting its political power.", "“The Temple of Luxuria’s influence diminished by the day. Still, with how rare healing Priests were, there was a constant demand for their members, so they were able to maintain a certain level of influence. But they must have wanted to regain their past influence, which went above the Magicians’ Guild, or maybe they felt threatened by the pressure from their surroundings— regardless, after Miss Seo Yuhui retired, the bishop, who was the representative of the Temple of Luxuria, made a certain decision.”", "“Decision?”", "“He joined hands with Sinyoung.”", "Kim Hannah said firmly.", "“Aha.”", "Seol Jihu exclaimed.", "“Now that you mention it, you used to be with Sinyoung.”", "“You overhear interesting stories while following board members. I paid attention back then.”", "As a former distinguished manager from Sinyoung, it wasn’t surprising that Kim Hannah would know about such internal matters.", "“Sinyoung, huh… I didn’t think I’d hear their name here.”", "Seol Jihu tapped on the table with his finger.", "“Sinyoung’s Yun Seohui did not have a good relationship with Miss Baek Haeju and Miss Seo Yuhui. This was an open secret.”", "“So you’re saying Yuhui Noona and Yun Seohui weren’t on good terms, and because Roberto Servillo joined hands with Sinyoung, Yuhui Noona didn’t see him in a good light?”", "“I can’t be certain. Considering Miss Seo Yuhui’s gentle personality, there is a chance she did not mind it too much. But we can’t rule out any possibilities. There might be something only she knows about as well.”", "Kim Hannah continued.", "“To be honest, I don’t think Roberto Servillo made the wrong decision. The Temple of Luxuria was in need of a new partner organization, and Miss Seo Yuhui had retired at that point.”", "In other words, Seo Yuhui wasn’t in the position to criticize the bishop’s decision.", "“The reason I judged that the bishop’s relationship with Miss Seo Yuhui was bad is because of Miss Seo Yuhui being on guard against him.”", "“?”", "“She was thought to have retired from Paradise forever, but she came back. An Earthling that is a legend of Paradise and the Star of Lust. As you know, Miss Seo Yuhui’s influence among Luxuria’s Priests is unhindered and unrivaled.”", "Seol Jihu agreed easily. He could tell just by how she led members of the Temple of Luxuria’s main branch during the Valley War.", "“Even now, there are many Priests who wish for Miss Seo Yuhui’s return. Luxuria is also asserting that she is still the apostle. Given all this, what do you think the person who believes he protected the Temple of Luxuria all this time would think?”", "“So you’re saying this is a matter of desire for political power.”", "Seol Jihu chuckled.", "“But it didn’t look like Yuhui Noona cared all that much about political power or her influence.”", "“People who are at the top of their fields usually don’t care. It is the runner-ups who are antsy to get ahead.”", "Seol Jihu rubbed his chin slowly.", "He understood the background story to an extent.", "The bishop, who did not want Seo Yuhui’s return more than anyone else, had come to help her personally. It was indeed strange.", "“And there is something else I have to tell you.”", "Kim Hannah spoke.", "“We ran into the bishop once while we were guarding Miss Seo Yuhui. Roberto Servillo, the bishop, asked about Representative’s whereabouts.”", "“About my whereabouts?”", "“Yes. He requested to see you, saying that he had something to say. When I told him you were away on important business, he asked if it was because of Miss Seo Yuhui and when you would be coming back.”", "“So what did you tell him?”", "“I said I would call you to find out and didn’t say anything else. I figured it would be better to let him run his imaginations wild.”", "Seol Jihu smiled at Kim Hannah’s response.", "“Good job.”", "“Was it?”", "“Yep, that was the perfect response. I’d give you a well-done stamp if I could.”", "Kim Hannah smiled bitterly, seeing Seol Jihu’s exaggerated happiness.", "“What should we do from now on?”", "“Easy. Just continue as we normally have.”", "“What do you mean?”", "“Go around auction houses buying offerings and then calling Yuhui Noona through Miss Baek Haeju. Ah, actually, you don’t have to worry about going to auction houses. I plan on going personally.”", "Seol Jihu got up from his seat and stretched.", "“Do the other reports have anything urgent?”", "“No, there’s nothing much except for Miss Seo Yuhui’s matter.”", "“Then I’ll listen to the rest later. I want to focus on this for now.”", "Seol Jihu finally started up his engine.", "Kim Hannah drew her breath subtly.", "“Understood.”", "“Alright, you can go now. I need some time to think about this alone.”", "Kim Hannah put the clipboard back under her armpit.", "However, she didn’t leave.", "Rather than turning around, she walked forward and stood in front of Seol Jihu’s desk.", "“Hey.”", "Now that the official business was over, she placed the clipboard down on the desk and narrowed her eyes.", "“Aren’t you being a bit too shameless?”", "“…Maybe?”", "Seol Jihu winked.", "“Sorry, but we’re not at the stage to reveal anything yet.”", "“Still, shouldn’t you at least throw me a hint or two?”", "Kim Hannah had worked her butt off during the eight months that Seol Jihu was gone, so it was understandable that she would feel disappointed.", "Not as a subordinate, but as a human being.", "“I guess I was a little harsh on Valhalla’s queen.”", "“Queen, my ass. What was it again, Jinah’s Mom? Don’t you know a true couple shares even their most secretive fetishes in bed? What queen? You’re treating me like an office wife.”", "“I wasn’t that bad.”", "The couple exchanged jokes while giggling.", "“Anyway, if you’re sorry, let me follow you to the auction houses. I won’t get in your way.”", "“You don’t really have to, but I guess you can if you’re free… Ah, let me ask you for a favor too.”", "“A favor?”", "“Yep. Teach me how to act.”", "It was a seemingly random favor.", "He was saying he would go to auction houses but was now asking her to teach him how to act.", "Kim Hannah couldn’t figure out what Seol Jihu was planning, but she nodded her head nonetheless.", "“If that’s what you want.”", "*", "Seol Jihu went to work right away.", "Starting from Eva, he went through all the auction houses in every city.", "Kim Hannah stayed by Seol Jihu’s side and observed the situation carefully.", "In truth, there was nothing noteworthy about it. He was doing the same thing she had been doing while he was gone.", "The only difference was that he showed signs of being overly obsessed with obtaining offerings. That was what he looked like, at least from the outside.", "He bought any offering that made its way to the auction no matter how big or small the holy power contained inside it was, and he even visited high-level Priests and pleaded with them to sell him offerings in their possession.", "He did not hesitate to purchase them above the market price.", "This was simply throwing money into the fire in Kim Hannah’s eyes, but as promised, she only followed him silently and did not hinder him in any way.", "It was because a rumor started going around. A rumor that Valhalla’s representative had returned after being gone for a long time and that he was buying up offerings without regard for the price.", "She was sure Seol Jihu had his reason for all of this. This wasn’t a conjecture, but a near certainty, as he returned to being normal the moment he came back to Valhalla’s building, and away from the public eye.", "And just like that, as he spent his days racking up offerings, unexpected guests visited Valhalla.", "*", "While Seol Jihu was swirling the ice cubes inside his drink wondering when Miss Baek Haeju would come back, the door burst open and several people rushed in.", "“Representative Seoooool!”", "He looked up, wondering whom the cheerful voice belonged to. The guests were none other than the magic girl trio that included the branch head of Eva’s Magicians’ Guild.", "“Where have you been? You just came back!”", "A light-brown haired girl came rushing in.", "“I wanted to see you!”", "Odelette Delphine slammed her hands down on the desk.", "Seol Jihu blinked.", "“…It’s been a while.”", "“Yes! It has!”", "Odelette Delphine had an incredibly heightened tone for some reason.", "“I have a biiiig favor to ask.”", "“A favor?”", "“Yes!”", "Odelette Delphine thumped her chest.", "“Let me come!”", "Seol Jihu spat out the ice water he was drinking.", "Come? Where?", "“I want to come too!”", "“W-What are you talking about?”", "“You know, there!”", "‘She can’t possibly be talking about there, can she?’ Seol Jihu wiped his lips and stared at Odelette Delphine dumbfoundedly.", "“Hehe.”", "On the other hand, Charlotte Aria was smiling like a fool, perhaps happy to finally see Seol Jihu.", "“….”", "For some reason, Eun Yuri was staring into the far distance, fiddling with an inflatable cheering stick that one would expect to see at a baseball game.", "Now that he thought about it, he heard that these girls started holding regular meetings to discuss magic.", "Only now did Seol Jihu realize what Odelette Delphine meant.", "“Why are you asking me that…”", "“Aaaaah! Let me come! Pleaaase?”", "Odelette Delphine dropped to the floor and began rolling around.", "“Please~ Please~~!”", "She started throwing a temper tantrum with her arms raised into the air.", "Charlotte must have found this amusing as she quickly joined in with her.", "“Let her~! Let her~!”", "Roll~ to the left. Roll~ to the right.", "With two people doing this, it quickly got out of hand.", "Seol Jihu glanced at Eun Yuri, hoping she would do something about it, but became speechless instead.", "“Go, go.”", "Eun Yuri was cheering them on, waving the long cheering sticks to the beat of their rolling.", "With an expressionless face.", "Seol Jihu closed his eyes.", "Odelette Delphine and Eun Yuri aside, he remembered hearing Charlotte Aria becoming a respectable queen who was capable of leading a nation, but…", "‘She didn’t grow at all…’", "“…Your Majesty.”", "Once Seol Jihu looked down with the eyes of a disappointed teacher, Charlotte Aria quickly calmed down.", "“If Sir Sorg Kühne sees this, he will be very disappointed.”", "This seemed to have done the trick as Charlotte Aria tottered back up.", "“No… i-it’s just been a while since I last saw you… so I wanted to be spoiled… I still carry myself with dignity when it’s important…”", "“….”", "“And I wasn’t planning on telling her at first… but Delphine noticed that Yuri and I were growing abnormally fast….”", "“….”", "“I asked Teacher and she only said she’d think about it… so we figured she would immediately come to a decision if Valhalla’s representative asked her… so…”", "Charlotte Aria rubbed her thumbs together with her head lowered.", "Seol Jihu shook his head.", "“Sure, go ahead.”", "“Really?”", "“Reaaaally?”", "Two children, no, Charlotte Aria and Odelette Delphine raised their heads.", "Seol Jihu would gladly have said yes if they came to ask him normally.", "Not only was he in a cooperative relationship with Odelette Delphine, but he also knew her talent.", "If she could become stronger and play a bigger role in future battles, Seol Jihu would only welcome it.", "“You know how to take her to the Dream World right?”", "“Un!”", "“Go and ask Lady Roselle if she can take in Miss Odelette Delphine as well. She might even be listening in on this conversation. Just know that I can’t do anything if she says no.”", "“Yaaay!”", "“Whoo!”", "The two children shot their hands up with a loud cheer.", "They ran out, chattering and clapping their hands joyfully as if Roselle had already given them the answer.", "Only afterward could Seol Jihu pause to breathe.", "He then glanced at Eun Yuri, who was hiding behind the inflatable cheering sticks and laughed.", "“Does Lady Roselle not want to accept Miss Odelette Delphine as a disciple?”", "Eun Yuri shook her head.", "“No, not at all. She thinks highly of her.”", "“Does she?”", "“Yes. About our talents, Teacher said that mine was heaven-endowed, that Her Majesty Aria’s was precious, and that Delphine’s was special.”", "Now that she mentioned it, their aptitudes were vaguely different.", "Genius, Prodigy, and Brilliant.", "Having the three competing against each other sounded fun. It seemed like there would be a positive synergistic effect too.", "“It’s just… the timing was a bit off.”", "Eun Yuri continued.", "“She has to choose a successor, so with more disciples, there is more to worry about. She’s surprisingly soft-hearted.”", "Seol Jihu did a double-take.", "In truth, Eun Yuri was the most likely candidate for inheriting Roselle’s Eternal Light of Wisdom. But with his earlier decision, she now had another competitor to worry about.", "“It’s fine.”", "Noticing what Seol Jihu’s thoughts were, Eun Yuri put out the cheering sticks that she was hiding behind.", "“I would have given you some sort of signal if I didn’t want more competitors. Without waving these. I’m happy to have her on board.”", "“Really?”", "“Yes. You see, the three of us fight all the time when we meet because the paths we’re pursuing are totally different.”", "Eun Yuri was a Mage, Charlotte Aria was a Sorcerer, and Odellete Delphine was a Magician.", "“I always hated hearing her go on about how magic is something that follows preconceived laws. Now that we’re on the same terms, I can use this chance to stomp her flat. If Teacher chooses me, that smelly Magician will know her place better.”", "Eun Yuri then snorted and sneered, “Hmph, magic that sets a limit on itself is no magic.”", "Seol Jihu was taken aback after hearing her honest thoughts, as what he expected to hear was more along the lines of, ‘We’ll compete in good faith and do our best!’", "“You must be confident.”", "“A Mage without confidence is just a corpse. But…”", "Eun Yuri smacked her lips.", "“I’m not so sure now. Recently, all I am getting from Teacher is scolding and more scolding.”", "“She’s scolding you?”", "“Yes. She says that someone pursuing the limits of the Path of Mana shouldn’t go around tasting everything and should only dig one well to the absolute bottom…”", "Seol Jihu grew curious hearing this and activated his Innate Ability.", "‘Ek.’", "He almost yelled in surprise after seeing Eun Yuri’s status window.", "Ever since he entered Paradise, he had never seen such a long and complicated status window.", "‘How does she have so many abilities…? What the heck is ESP aptitude? And what’s extrasensory perception?”", "It wasn’t just her abilities. Her aptitude had also gotten longer.", "“Don’t worry about it too much.”", "Eun Yuri said calmly.", "“I won’t let the Eternal Light of Wisdom be taken away from me. Being scolded often is only proof of her interest, isn’t it?”", "“Well, I guess there’s the saying, spare the rod, spoil the child.”", "“Exactly.”", "“Alright. If I have to invest in something, I’ll be sure to choose the silver glass coin.”[1]", "“Silver glass coin…?”", "Eun Yuri glared at Seol Jihu.", "“…It was a joke.”", "“Kuhum, anyways, it looks like you’ve been busy lately. Sorry for bothering you. I’ll leave now.”", "“Okay.”", "“Ah, by the way…”", "Eun Yuri paused in the middle of turning around and gave Seol Jihu a furtive look.", "“Has anything been troubling you recently?”", "Seol Jihu’s eyes widened before he smiled blandly.", "“Haha, then can I ask you for a favor?”", "“Of course.”", "“It’s nothing difficult. Can you let Odelette Delphine know that I will be calling Mister Philip Muller soon about something?”", "“That’s it?”", "“Yes. But…”", "Seol Jihu lowered his voice and whispered some more.", "Eun Yuri tilted her head but agreed nonetheless.", "“That’s all I have to do?”", "“Yes.”", "“Got it.”", "Eun Yuri bowed and then left the office.", "“…I thought it was funny. Silver glass coin.”", "Seol Jihu giggled to himself.", "In any case, he was thankful that Eun Yuri was doing well by herself.", "But he couldn’t be content.", "Time wasn’t infinite.", "Eight months.", "That was enough for the Parasites to have recovered from their defeat at Tigol Fortress to a degree.", "‘Before they rise back up…’", "He had to succeed.", "The last of the three goals he vowed to achieve when he left Haramark and moved to Eva.", "*", "It was around dinner time the next day that Baek Haeju entered Paradise.", "Seol Jihu asked her to call Seo Yuhui as soon as he saw her, and Baek Haeju came back the very same day with a reply.", "“I contacted Miss Seo Yuhui. She said she would enter Paradise by tomorrow in Paradise’s time.”", "The moment Seol Jihu had been waiting for was finally here.", "The day when he would reunite with Seo Yuhui.", "And the day to raise the curtain to the final plan.", "1. A pun using Eun Yuri’s name. Eun means silver, Yuri means glass. Investing in a coin is a cryptocurrency reference (i.e. Bitcoin). "]}