{"cid": "151", "title": "Chapter 151. With Two Golden Eggs (2)", "content": ["A song asked, ‘Have you seen a hyena wandering around the foot of a mountain looking for food?’", "Of course, the Yi siblings were humans, not wild beasts, so they didn’t need to wander around a mountain in search of food. But recently, they had been empathizing with the hyena from this song.", "Like a bolt of lightning from a clear sky, the organization they were affiliated with had perished overnight.", "‘We can overcome this together. White Rose won’t die like this. This is only the start, so believe in me and follow me.’ And so on and so forth.", "Bok Jungsik had gathered up the remaining members and made an impassioned speech. Yet, he disappeared the next day like he never existed.", "It was only then that the Yi siblings found out about the whole story behind the controversy.", "The true face of the uncle they knew from a young age and thought to be a good man… was something the siblings, who were yet of age, found hard to believe.", "It wasn’t until a Red Notice was issued for Bok Jungsik that the siblings finally accepted this fact. At the same time, they realized that they had to face the reality that they had been avoiding so far.", "Most of the guild’s combat force had been killed, and when the leader ran away, the remaining people began to leave one by one.", "While White Rose was breaking apart and scattering in all directions, the inexperienced siblings didn’t know what to do.", "Although they mustered up their courage and visited Phi Sora when they heard she had returned, they were only told to pack their bags and wait.", "As even the most loyal members left, only the siblings remained in the empty guild house.", "Since they had to vacate the building by the end of the day, today was their last day here as well. Whenever they thought, ‘What are we going to do after today?’ the whole world turned black. Was this what it felt like to be on top of a sinking ship?", "Yi Sungjin, who was meaninglessly rummaging through his bags, suddenly opened his mouth.", "“Noona.”", "“…Hm?”", "As though she was thinking about something else, Yi Seol-Ah was a bit late to react.", "“Why is our life always like this?”", "Yi Seol-Ah, who was lying on her back and looking up at the ceiling, burst into laughter at her younger brother’s lamentation. After giggling for a long time, she wiped her slightly teary eyes and agreed.", "“I don’t know.”", "“I think we’re cursed or something. Both on Earth and in Paradise.”", "Although they were both too young to discuss life, they were both confident that they lived tougher lives than most people their age or even ordinary adults.", "“How does nothing we do work out….”", "Yi Sungjin grumbled quietly. Yi Seol-Ah nodded her head before suddenly tilting her head.", "“Well, it’s not everything.”", "“?”", "“It’s not like there weren’t good things. Both on Earth and in Paradise.”", "“What did you like then?”", "“Me? Well….”", "Yi Seol-Ah began to count with her fingers.", "“Doing track-and-field?”", "“You got kicked out for refusing to pay your dues.”", "“Hey, don’t say that. I didn’t refuse to pay. I couldn’t. Plus, I walked out with my own two legs.”", "“Same difference.”", "“And when Mom said she wouldn’t give up on us, I was really happy.”", "“She’s now lying in the hospital from overworking. Because of us.”", "When Yi Sungjin calmly spoke the truth, Yi Seol-Ah scratched her head with a wry smile.", "“Hey, do you want to go to Orabeo-nim? If we catch a carriage, it will only take three or four days to get to Haramark.”", "A hint of hesitation dyed Yi Sungjin’s face, but he shook his head.", "“I don’t know. Even if icons of misfortune like us visit him….”", "“Why not? He’s doing well.”", "“I don’t think he’ll greet us with open arms even if we go. Don’t you remember going to Grandma’s house when we had nowhere to go and being chased out after a day?”", "“…Eii, no way.”", "A subdued mumble flowed out. A skillfully toned-up voice seemed to imitate Yi Seol-Ah’s voice, and Yi Sungjin sighed inwardly thinking, ‘Noona must have remembered that time too.’", "“Ah, I don’t know anymore.”", "“Why? Do you have anywhere else to go to?”", "“You know that I don’t.”", "“Then let’s go. We can ask him to buy us a meal and tell him about our situation.”", "Yi Seol-Ah seemed to be holding back her laughter, but Yi Sungjin didn’t recognize the abnormality. It was because his mind was preoccupied by something else.", "“We can’t. How are we going to go when we’re still bound by our contracts?”", "“Don’t worry. I took care of the contracts.”", "“You did? How?”", "“I went to Phi Sora and threw my gauntlet down.”", "“Didn’t she tell you to shut up and wait?”", "“I went to her again. I slapped her a few times and screamed at her to hand over the contracts, and she immediately did while sobbing.”", "“What?”", "Only then did Yi Sungjin turn his head, realizing that something was wrong. He immediately saw a shocked Yi Seol-Ah staring at the door with widened eyes.", "Yi Sungjin turned his gaze to the door reflexively and was instantly frozen stiff.", "A familiar young man was looking down at him. When their eyes met, the young man raised his hand with a smile.", "“Hey.”", "The brother and sister shouted simultaneously.", "“Orabeo-nim!”", "“Hyung!”", "*", "Seol Jihu took the siblings who were crying like baby chicks and headed to a restaurant. Of course, he didn’t forget to personally help them pack.", "As expected of a restaurant in the most famous city of the Seven Kingdoms, it boasted an atmosphere and facility incomparably cleaner than Haramark’s Eat, Drink, and Enjoy.", "When Seol Jihu said to the siblings, ‘What do you want to eat? Order whatever you want,’ they both asked, ‘How did you get here?’ And with a wry smile, Seol Jihu ordered for them and began to explain.", "By the time the siblings’ curiosity was somewhat satiated, the waiter brought the ordered dishes to the table.", "Seol Jihu suggested to the siblings to talk after they eat, but he was surprised when they finished their plates in the blink of an eye. It was to the point where he wondered whether White Rose starved them.", "Frankly speaking, although the siblings didn’t starve during their time at White Rose, they had never once had a comfortable meal. Because they always felt like they were walking on eggshells whenever they ate; being relaxed for once made them eat food like drinking water.", "Moreover, the person they had been dreaming about had really come to take them, so how could they not be happy?", "After they ordered dessert to ease their bloated stomachs, the conversation continued.", "It wasn’t anything special — asking about how things went after leaving the Neutral Zone and whether they knew what happened to the others.", "However, what became the main topic of conversation were Seol Jihu’s accomplishments.", "The siblings were so knowledgeable in his feats that they began to compete with each other to speak. It was to the point that the calmly listening Seol Jihu was beginning to feel uncomfortable.", "‘This is a bit… troubling.’", "This seemed like a good time to tell them. Before getting to the main point, Seol Jihu decided to break the siblings’ fantasy. He understood why they were excited. After all, he had just rescued them from a sinking ship. However, he was neither a savior nor a Superman.", "“No.”", "That’s why he spoke.", "“Almost everything in the record is a lie, or they’re exaggerations.”", "To do things correctly.", "“The Banquet? Master Ian centered the report around me, but in reality, I wouldn’t have been able to do a thing alone. No, there’s no reason to even say ‘wouldn’t’. Because I for sure couldn’t. If it weren’t for the Triads, Umi Tsubame, and Carpe Diem’s cooperation and backing, I would have been beaten up for not knowing my place.”", "Seol Jihu quickly continued.", "“It’s the same for the laboratory. The explosion? That was the Federation’s doing. I didn’t purposely lead the guards away to provide an opening. Things just turned out favorably as I was running for my life.”", "“….”", "“What came after that was a series of pain. I cried from hunger, drank piss to quench my thirst, and puked…. In the end, I tried to break through the encirclement in a do-or-die method and ended up with a hole in my thigh. Do you know what happened after I fell from the sky?”", "The siblings who had been talking non-stop shut up and blankly stared at Seol Jihu.", "“I begged for my life. While crying. It’s not a memory I’m proud of.”", "When Seol Jihu lifted up his sleeve and showed them his wounds, Yi Seol-Ah hiccuped.", "“This is the truth. This is how I’ve lived.”", "Seol Jihu sighed and pulled his sleeve down.", "“And I might go through similar things in the future. No, I will, without a doubt.”", "When Seol Jihu spoke solemnly, the joyful atmosphere quickly turned despondent.", "The siblings weren’t idiots, and they naturally realized why Seol Jihu was telling them all this.", "Seol Jihu stared at the two flustered siblings. As he had expended two golden eggs, he did not want to lose them. However, he didn’t want to force them by using their contracts either.", "One thing that was comforting in this complicated situation was that they were shining gold, just like in the past.", "Then how should he treat them to get them to trust and follow him?", "After much deliberation, Seol Jihu decided to ‘show’ them.", "He took out the two pieces of paper he got from Phi Sora.", "“These are your contracts. As long as they are in effect, you are bound by the conditions you previously agreed to.”", "When two pairs of worried gazes touched him, Seol Jihu held the papers up with two hands.", "“First.”", "Then, without a moment of hesitation, he tore them in half.", "Ignoring the shocked siblings, he tore the contracts into tiny pieces before throwing them into the trash.", "“There. With this, you’re free.”", "Then, he smiled.", "Seol Jihu dusted his hand and continued.", "“Since you’re free, you two now have countless possibilities for the future. You can go back to Earth or continue living in Paradise. I believe you’ll choose the latter, but that means you have more decisions to make. You can rely on each other to overcome any future difficulties, enter another organization, or follow me.”", "Seol Jihu paused for a moment before calmly finishing his statement.", "“That is, depending on your goals for Paradise and what you think of this world… your lives in Paradise will differ significantly.”", "In short, he was leaving the decision to the siblings.", "“You mean, if we follow you, Noona and I will also have to participate in dangerous things?”", "Yi Sungjin pointed out the essence of the issue.", "“Not immediately. You need to be qualified to participate in risky missions. But once you level up more and acquire abilities befitting that level….”", "Seol Jihu hesitated before nodding.", "“A time will come when you have to do something even if you don’t want to. I want you to help me then. If you’re not confident, it might be better to not follow me.”", "Seol Jihu spoke for the last time.", "“Here is the main point. If you see Paradise as a game to enjoy in your spare time, I don’t want us to be together. Because our goals are different.”", "After this, Seol Jihu closed his mouth and waited.", "As this was not a problem that could be answered in a moment, a not so short silence filled the air.", "The first person to break this silence was Yi Seol-Ah.", "“You see, our mother is sick.”", "“…Mother? She has an illness?”", "“Yes. She’s not our biological mother, but our step-mother.”", "“Ah, your dad remarried?”", "“No, we have a step-dad too. Though he’s not here anymore.”", "Seol Jihu blinked. Both of their parents were step-parents? Orphans? Adoptees? All sorts of thoughts brushed his head.", "“Um, excuse me for being rude, but….”", "“It’s fine.”", "Yi Seol-Ah bit down on her fork, which had a tiny piece of cake on it, and then shrugged.", "“Our biological parents divorced when we were young. Sungjin and I followed our mother, who remarried not long afterwards. We formed a family with our step-father, but our biological mother couldn’t stand his physical abuse and left us behind. Our step-father then remarried, and we got a step-mother. But this time, our step-father ran away.”", "Seol Jihu’s jaw slowly dropped low.", "“It’s fine. You don’t have to make that face. There were times when things were rough… but our step-mother is a kind person.”", "Seol Jihu was taken aback. The bright, cheerful Yi Seol-Ah was one reason, but he was also surprised by how complicated this whole thing was.", "“When she found out about our situation, she burst into tears and promised she would take care of us…. But she got sick from overworking herself.”", "“Is it urgent?”", "Yi Seol-Ah shook her head.", "“She has time. But we don’t have any money, and from what we heard, it’s not an illness that has a cure…..”", "Seol Jihu could see Yi Seol-Ah biting down on her fork as if to hide her true emotions.", "“We came to Paradise to make money for the hospital bills and to find a cure for her illness. That’s the goal Sungjin and I are trying to achieve in Paradise.”", "Yi Seol-Ah smiled.", "“Orabeo-nim, did you know? That Paradise has a panacea that can cure any illness.”", "“…Really?”", "“Yes. But this medicine is apparently extremely rare and is difficult to find. And to bring it back to Earth, you also need a crazy amount of contribution points.”", "This was only natural. If the medicine that could cure any illness appeared in modern society, Earth would figuratively flip over.", "For such an influential item, even the contribution points Seol Jihu had accumulated so far might not be enough.", "“When I heard what Orabeo-nim said, I immediately thought this, ‘Ah, if I follow Orabeo-nim, I’ll be able to raise my abilities and earn contribution points. My goodness! How can there be such a good offer?’”", "Yi Seol-Ah clapped her hands together in an exaggerated expression of joy, to which Seol Jihu smiled bitterly. She was saying she would follow him.", "“What about you, Sungjin?”", "“It’s the same with me.”", "His immediate answer made Seol Jihu embarrassed for being so nervous.", "“Well, Noona already said everything that needed to be said….”", "His mouth moved slightly.", "“But to add one more thing, I want to be happy.”", "What did that mean?", "“Following me will make you happy?”", "“To be honest, I don’t know.”", "Yi Sungjin answered sincerely.", "“But when we stayed together in the Neutral Zone, I was happy. For the first time in my life.”", "Seol Jihu scratched his cheek.", "“Paradise is different from the Neutral Zone.”", "“I know. Are you happy in Paradise, Hyung?”", "Happy? That wasn’t a question he could answer so easily.", "To be completely honest, he wasn’t completely happy. There were more than a few occasions when he was suffering in pain, and there were several occasions when he cried from misery.", "But, overall?", "“I’m happy.”", "Seol Jihu smiled softly.", "“Good friends, a good master, good people… I’d have to say I’m happy.”", "At least, happier than on Earth.", "Yi Sungjin silently nodded his head, as if that was enough.", "With that, the conversation came to a halt.", "After emptying the cup of tea, Seol Jihu quietly put it down.", "“I think…”", "With a chuckle, he opened his mouth.", "“It will be better for you guys to follow me. Looks like you already decided that anyways.”", "Seol Jihu let out a long sigh before slowly getting up from his seat.", "“Let’s go.”", "“W-Where?”", "“What do you mean where? Of course, to Haramark.”", "When Seol Jihu winked, brother and sister stared at each other. They nodded their heads with cheerful looks, then shouted simultaneously.", "“Yes!”", "“Yes!”", "**", "“Hyung, there’s something I’m curious about.”", "On their way to the stable next to the palace gate, Yi Sungjin suddenly asked.", "“What’s up?”", "“Did you really slap Phi Sora to get the contracts from her?”", "Seol Jihu chuckled.", "“No, I was just kidding. With her personality, I doubt she’ll let anyone do that.”", "“I guess you’re right.”", "Yi Sungjin looked mildly disappointed.", "“Why?”", "“That person is a bitch. Er, I mean, a mean person.”", "“Well, her personality is pretty terrible. But it’s not like she doesn’t have a good side.”", "“She’s kind and takes care of people who are good to her. Everyone else, she treats them as enemies.”", "Seol Jihu agreed with this assessment 100 percent.", "“She has this thing I call ‘Bitching Time’. At least once every day, she bitches about something even though we didn’t do anything wrong.”", "“But if she didn’t refuse other organizations’ scouting offers, we wouldn’t be here right now.”", "“She did what?”", "Yi Sungjin genuinely looked surprised.", "He muttered in confusion, “There’s no way that witch did that.”", "Just what did Phi Sora do to make Yi Sungjin so skeptical and spiteful?", "As a new question was beginning to rise in Seol Jihu’s mind, the group arrived near the castle gate.", "But when he tried to find a carriage to Haramark, the coachman looked disappointed.", "“Oh no, the carriage to Haramark just…”", "He turned back to the castle gate and blinked.", "“Huh? It’s still there? Oi, Jang Tu!”", "When he raised his voice at a carriage in the distance, a coachman named Jang Tu came running.", "“Oooh! Customers!?”", "“Yeah, a group of three. But I thought you were full and set off a while back.”", "“Don’t speak of it! I was going to set out with three people, but one of them vehemently refused!”", "“Who?”", "“Dunno! Some crazy bitch cried about leaving with just three people being wrong and kept bitching about waiting a bit more!”", "Jang Tu shouted in anger and spat out a mouthful of saliva."]}