{"cid": "134", "title": "Chapter 134. An Unexpected Result", "content": ["That night.", "Seol Jihu didn’t expect to be able to sleep when he switched out of being a night watch and entered the tent. But despite his restless mind, he was able to sleep with no trouble.", "In his light sleep, he felt someone’s hand carefully embracing his neck. And when a squishy sensation softly pressed down on his face, he let go of his mind as if his previous troubled state was a lie.", "Every time he tossed and turned, a gentle touch slowly stroked his back or patted it. And when a sleep-inducing scent flowed into his nostrils, he quickly fell back to sleep.", "Amidst a quietness and stillness that felt like a wonderful grass field embracing his body, Seol Jihu slept like a baby without waking up once.", "As a result, when he woke up, his perplexed mind had subsided by a degree.", "Seol Jihu tilted his head as he rubbed his eyes under the morning sunlight.", "‘Strange.’", "His body was soaked with an unknown scent. Smelling this refreshing scent that made his heart pound, Seol Jihu buried his face in his arms and clothes and took deep breaths.", "Thinking about it now, he felt like someone was taking care of him in his sleep. Just like when he was being taken care of at the Temple of Luxuria…", "But that wasn’t the only strange thing.", "While eating and cleaning up the campsite, Seol Jihu was bothered by Sakamoto Jun and Hugo.", "“Jealous… I’m so, so jealous….”", "“?”", "“How did it feel? Can you please describe it in detail?”", "For example, Sakamoto Jun muttered strange things in a polite manner of speech, which was different than the casual tone he usually used. Hugo, on the other hand, tried to smell Seol Jihu or rub his face on his clothes.", "“Hey— Stop—”", "It took Seol Jihu painstaking effort to push the bull-like Hugo off of himself.", "“Why are you doing this?”", "“Evil bastard!”", "“Huh?”", "“Traitor!”", "Hugo’s expression had surpassed jealousy and envy, and was dyed with rage.", "Seol Jihu looked around with a confused face. Seeing Kazuki turn around and face him, Seol Jihu gave him a look asking to be saved.", "“….”", "But rather than saving him, Kazuki sent him a curious gaze before stealthily glancing to the side. There, Seol Jihu saw Seo Yuhui walking with her head down.", "When he met her eyes, Seo Yuhui’s face turned red like a sunset reflected on a river. She turned away and looked into the far distance.", "Well, there really wasn’t much to see because they were on a grass plain.", "Seol Jihu quickly realized something must have happened while he was asleep, but he also stopped caring about it.", "This was because he began to see a black dot in the distance.", "Soon, when grey castle walls began to appear, Seol Jihu’s eyes sparkled.", "It was Haramark.", "The Alliance team had finally returned to Haramark after two weeks.", "Before departing, Seol Jihu and Kazuki shook hands.", "“Good job.”", "“You too, Mister Kazuki.”", "When Seol Jihu returned the words with courtesy, Kazuki tilted his head.", "“Hm… I don’t think I did anything to warrant being called a good job. Without you, we might still be in Stage 2.” Kazuki continued, “And… I apologize for saying you were stubborn back in the Huge Stone Rocky Mountain. I’m sorry.”", "That conversation during the training must have been bothering Kazuki the entire time.", "Although Seol Jihu had forgotten about it completely, Kazuki was the type of person who was just as strict with himself as he was with others.", "Seol Jihu asked.", "“Will you participate in the next Banquet too?”", "“No.”", "Contrary to Seol Jihu’s expectations, Kazuki answered firmly.", "“I’m not sure, but I think it might be better for me to let it go.”", "The way Kazuki muttered calmly looked bitter.", "With the end of this Banquet, Kazuki would go separate ways from the Japan Business Federation borrowing the Triads’ power, since that would be difficult to do alone.", "Seol Jihu stared at him fixedly before opening his mouth.", "“Mister Kazuki.”", "“?”", "“Have you considered coming to Carpe Diem?”", "Hearing this sudden offer, Chohong, who was yawning loudly, widened her eyes in surprise. Even Hugo, who was holding onto Seo Yuhui’s hand and refusing to let go, jumped and turned around in surprise.", "Seol Jihu’s eyes gazed at Kazuki. Rather than carefully deliberating on this decision, Seol Jihu had thought of it on the spot.", "To be more precise, he wanted to try working with him. The man in front of him might fill in the gap left behind by Dylan…. No, Seol Jihu was convinced Kazuki would do more than fill the gap.", "“You don’t have to give me an answer immediately.”", "“I will refuse.”", "However, Kazuki shook his head almost immediately.", "“I might have considered it more if you had asked before the Banquet….”", "Kazuki rubbed his chin, and then smirked.", "“But I don’t want to let go of the steering wheel just yet.”", "“Steering wheel?”", "“There can’t be two captains on the same ship, no?”", "It was then that Seol Jihu realized why Kazuki had declined.", "With a grin, Kazuki turned around and raised his hand.", "“See you later.”", "Seeing Kazuki walk away with just those three words, Seol Jihu scratched his cheek with his finger. He felt embarrassed, like a child who had his inner thoughts revealed.", "After saying goodbye to everyone else, Seol Jihu headed back to Carpe Diem’s office with Chohong.", "Just as he was about to arrive at the building he dreamed of, he encountered an unexpected person. The old man in a black suit walking toward them from the opposite direction was Jang Maldong.", "“Old Man?” Chohong spoke first. “You’re still alive?”", "Thwack!", "“Arrrgh!”", "Chohong clutched her head and rolled on the ground.", "“Argh! Why’d you hit me?”", "“Damned fool. Why don’t you go pay for another Ceremony to have me killed?”", "“I was just saying hello because I missed you!”", "“Oh yeah?”", "When Jang Maldong raised his cane again, Chohong quickly shot up and escaped. Jang Maldong lowered his arm with an angry pant, then found Seol Jihu laughing awkwardly.", "“Looks like you just came back.”", "“Yes. What about you, Master…?”", "“I’m coming back after meeting an applicant for the team.”", "Seol Jihu let out a small exclamation. By ‘applicant’, he had to be referring to a new Archer.", "Jang Maldong must have been hard at work while they were away at the Banquet.", "“I stealthily made the offer to Mister Kazuki, but I got rejected.”", "“That’s obvious. Why would he enter this team given his position in Paradise? Anyways, where’s Hugo?”", "Seeing Seol Jihu hesitate, Jang Maldong clicked his tongue.", "“Never mind. He’s probably gone straight to the pub like he always does. I wonder when he’ll fix that habit, tsk.”", "Seol Jihu smiled bitterly. He couldn’t bring it upon himself to tell him that Hugo chased after Seo Yuhui.", "“Let’s go up.”", "Jang Maldong got on the stairs without further ado. Once he entered the office, he took off his suit and plopped down.", "“Whew, now I feel alive. There were too many recommendations… I’ve practically had a tour of all of Paradise’s cities…. Hm?”", "Seeing Seol Jihu standing still, Jang Maldong asked.", "“What aren’t you sitting?”", "“Thank you.”", "When the young man suddenly bowed down to his waist and thanked him, Jang Maldong blinked his eyes.", "“What are you on about?”", "“If it wasn’t for you, Master….”", "Seol Jihu stood straight and spoke with sincerity.", "“Then I wouldn’t be standing in this office right now.”", "He wasn’t wrong. If it weren’t for Jang Maldong’s hellish training, Seol Jihu might have died or have been eliminated in Stage 1.", "“Thanks to Master’s training, I was able to return alive. Thank you so much.”", "Jang Maldong’s expression cracked at Seol Jihu’s politeness. To be honest, he was extremely weak to attacks like this.", "“No… well… you put in a lot of effort….”", "It was to the extent that a huge grin emerged on his usually solemn face.", "Soon, he quickly put on a straight face, then turned around with a dry cough.", "“Kuhum. You must be tired. Rest for now. We’ll talk tomorrow.”", "However, Seol Jihu didn’t leave. Seeing how he was hesitating and smacking his lips, Jang Maldong realized he still had something that he wanted to say.", "After a brief moment of silence, Seol Jihu spoke straightforwardly.", "“I killed people.”", "Hearing this sudden confession, one of Jang Maldong’s eyebrows perked up.", "“…How many?”", "“Two.”", "“Why?”", "“Because they ruined the Banquet I barely managed to restore.”", "A conspicuous light flickered in Jang Maldong’s eyes.", "“You’re saying they deserved to die?”", "“In my opinion, yes.”", "“Then that’s fine.”", "When Jang Maldong glossed over it so easily, Seol Jihu was taken aback.", "“Why are you surprised? If they deserved to die, you should kill them.”", "Jang Maldong snorted.", "“I wouldn’t be sitting still if you let them off with a lame excuse. Well, I’ll have to listen to the details to really know… but well done. If you encounter leopards who can’t change their spots, just pull them out by their root.”", "Seol Jihu nodded his head, thinking he did exactly that. Hearing Jang Maldong say this, he felt the emptiness inside him melt away.", "“Anyways, you should go. I can’t rest because you’re standing there.”", "“Y-Yes!”", "Just as Seol Jihu was about to take his leave, the sound of footsteps climbing the staircase suddenly rang out.", "The one who threw open the door in the next moment wasn’t Chohong or Hugo. It was Ian, with his white beard fluttering in the air.", "“Ian?”", "“Maldong!”", "Ian shouted brightly, then waved his hand at Seol Jihu.", "“It’s been a while, Seol!”", "“H-Hello.”", "When Seol Jihu greeted him back, Ian placed his hand on the young man’s shoulder.", "“You just came back from the Banquet?”", "“How did you find out so quickly?”", "Jang Maldong asked in surprise.", "“Don’t underestimate the Kingdom’s information network.”", "After making a peace sign with his hand, Ian tilted his head up and laughed. He then grabbed Seol Jihu and Jang Maldong and forcefully pulled them up.", "“What are you doing?”", "“Now, now, let’s go. Hurry!”", "“Go where?”", "“The pub, of course. Do you have any idea how curious I was about this Banquet?”", "The two bickered for a while, but Ian was the eventual victor.", "In the end, Ian dragged Seol Jihu and Jang Maldong to Eat, Drink, and Enjoy.", "*", "Once they arrived at the pub, Seol Jihu had to tell the long story.", "The entire time, Ian listened with keen interest and excitement. When Seol Jihu talked about Audrey Basler, he became angry and muttered, ‘What a total bitch! But is she pretty?’ And when he heard that Seol Jihu had beaten her up, he danced and said, ‘Serves her right! But is she pretty?’", "Then, when Seol Jihu explained how he turned the Banquet into a real banquet, Ian let out a shocked exclamation. Even Jang Maldong, who had been listening in with a stiff expression, nodded his head and smiled.", "As for Stage 3, Seol Jihu couldn’t talk about it in detail. Because of the restriction that was placed on him by the Seven Gods, even if he tried to talk, no words would come out of him.", "As the same thing had happened to everyone who passed Stage 3, Ian wasn’t all too surprised.", "After about an hour or two of talking, the story of the Banquet came to a close.", "Seol Jihu watched Ian drinking a bottle of liquor joyously, then spoke.", "“…Master Ian, there’s something I’m really curious about.”", "Ian bobbed his head, signaling the young man to go ahead.", "“What do you know about the word ‘destiny’?”", "Ian flinched and put down the liquor bottle. He began to rub his beard with the back of his hand.", "“Destiny…. That’s a rather philosophical topic.”", "“….”", "“Can you try writing that word in a foreign language? Whatever you know is fine. I can’t trust Synchronization 100%.”", "When Ian handed Seol Jihu a pen and a piece of paper, Seol Jihu wrote what he could.", "“Destiny (宿命)…. 宿 meaning ‘constellations’ and 命 meaning ‘to move’. This is too broad.”[1]", "Ian read the word carefully and spoke.", "“What part of destiny do you want to learn about?”", "Seol Jihu fell in thought for a moment at this sharp question, then explained.", "“Choice.\"", "\"Destiny and choice. I see.”", "Ian slapped his knees and smiled.", "“First, destiny refers to a fate that is determined at birth.”", "“A fate that is determined at birth?”", "“That’s right. If I were to interpret it my way, I would say it is surrendering oneself to fate.”", "Seol Jihu was slightly confused. The way Ian put it, it sounded like fate couldn’t be avoided.", "“Don’t make that face. In life, you’ll come across multiple instances where you will have to surrender to fate. It will be thousands of times. Even in this moment.”", "Seol Jihu still looked like he couldn’t understand.", "“You might think fate is something amazing, but that’s not the case at all.”", "Ian smacked his lips.", "“It’s not that complicated. You and I are both humans, right?”", "“Yes.”", "“Once we are born, it is our fate to live dozens of years and our fate to die once our lifespan ends. Can you go against this fate?”", "“No.”", "“Exactly. That is why you can only surrender to it.”", "Ian grinned.", "“But in order to live, humans have to eat and breathe, no?”", "“Of course.”", "“That’s the same thing. As we were born humans, we were born with the destiny of having to eat or breathe to survive.”", "Seol Jihu made a dazed expression as if he had suddenly been struck with a hammer.", "“Here, we can make a ‘choice’.”", "Ian giggled before tilting his body forward and speaking quietly.", "“What would happen if we didn’t eat or breathe?”", "“We would die… right?”", "Seol Jihu answered somewhat hesitantly.", "“Right. We’d die.”", "Ian nodded hard enough to make his beard flutter.", "“This is the important part. At this moment—”", "Tang, tang! He continued as he pounded the wooden table.", "“By not breathing or eating, or in other words, by selecting one of these choices, we can meet one of our predetermined fates - life or death!”", "Ian blurted out passionately, while Seol Jihu opened his mouth slightly.", "Although he didn’t understand everything Ian said, one part was etched into this brain.", "That even if one had to surrender to fate, there was more than one fate to choose from.", "In other words….", "“Isn’t it surprising if you think about it? That such a trivial choice can change your fate completely!”", "Even a small choice could change the outcome. Someone born with the fate of the Heaven-Slaughtering Star should be no exception.", "“You see, Seol, humans always make choices while they live. Whether that be in the past, present, or the future.”", "“You’re saying I should be careful with every little decision I make?”", "Ian clicked his tongue.", "“Boy! It’s up to you to interpret what I say, but don’t come to a conclusion so rashly!”", "He stroked his beard and shrugged his shoulders.", "“Huge destinies like life and death are usually placed toward the end of one’s life. And life is long. Unlike in games, you can’t see the ending just by making one or two choices.”", "With that, Ian let out a hearty laugh.", "“…You’re right.”", "Seol Jihu agreed with him subconsciously. Ian coughed and quickly grabbed his liquor bottle. But realizing that it was empty, he frowned.", "“Dang it. I’ll have to order more.”", "“That’s enough drinking, don’t you think?”", "Jang Maldong, who was listening quietly, spoke curtly.", "“Don’t you feel bad getting treated for blabbering on about senseless and rubbish philosophy?”", "“Senseless and rubbish!?”", "Ian became angry.", "“And how are you so sure that I won’t be the one paying?”", "“Isn’t that your specialty? Drinking liquor, pretending to be asleep when you get drunk, then actually falling asleep.”", "“Tsk, you found out.”", "“You can order more if you’d like.”", "Seol Jihu cut in between the two bickering old men.", "“Really?”", "“Of course.”", "Seeing Ian’s delighted face, Seol Jihu smiled brightly for the first time.", "He wouldn’t feel bad ordering a hundred bottles for him. After all, what he said alleviated him of all his worries and made him feel refreshed.", "“Okay! Great!”", "Ian immediately ordered more liquor, then went ‘Ah’ as he looked at Seol Jihu.", "“You said you came back today, right?”", "“Just now, actually.”", "“Then you must not have heard about it.”", "“It?”", "“The Ceremony, I mean. I heard you asked for a Ceremony at the Forest of Denial’s tomb.”", "He was right. Although Seol Jihu planned to go at first, he ran into a schedule conflict due to the Banquet.", "“You see, Princess Teresa went to the Forest of Denial with a group of attendants, but….”", "When Ian’s tone turned serious, Seol Jihu became nervous as well.", "“Did something happen?”", "“Well….”", "Soon…", "“…Come again?”", "Seol Jihu heard Ian’s explanation and doubted his ears.", "“The Ghost Saintess flipped over the ceremonial table?”", "1. Certain Korean words are made with Chinese characters (Hanja). The word Destiny here is made with those two characters. (Kind of weird since Ian isn’t even Chinese). "]}