{"cid": "185", "title": "Chapter 185. To Earth", "content": ["At that moment, a loud cough rang out.", "Jang Maldong was standing in front of the door, looking at the distant mountain.", "“Looks like it’s gotten a lot quieter now… may I come in?”", "“Ah, yes, yes!”", "Seo Yuhui quickly got off of Seol Jihu and scurried away from the room like a newly-wed wife who had just been caught in an intimate moment by her father-in-law.", "Teresa and Chohong also left, feeling rather pleased with themselves.", "“I didn’t mean you had to leave.”", "Jang Maldong sat down on a chair and took off his fedora.", "Seol Jihu greeted him with a smile.", "“I’m glad you’re here, Master.”", "“Me too. You have no clue how hard it was to cut in.”", "When Jang Maldong grumbled quietly, Seol Jihu readily agreed with him.", "“Yeah, they stormed in the moment you took out the needles.”", "“How is your body doing?”", "“Everything’s fine. My physical level went down, but it says that it’s only temporary and will recover after a good rest.”", "“That’s good to hear.”", "Jang Maldong was rather brusque in his manner of speech. But remembering what Chohong said to herself while he was ‘unconscious’, Seol Jihu smiled happily.", "After a momentary silence, Jang Maldong opened his mouth.", "“I’m sure you’re tired of hearing this by now… but well done. The victory at Arden Valley is an achievement worthy of being lauded as legendary. You really did well.”", "“Haha, legendary? You’re flattering me.”", "“I’m saying it as it is. What you accomplished is something no one has done since the creation of the Seven Armies. If this can’t be called legendary, then what will?”", "This made sense the more he thought about it, so Seol Jihu simply scratched his cheeks bashfully.", "“The heat from the news died down a bit now, but the entirety of Paradise was talking about you just three months ago. Even little kids should know your name by now. Not just Paradisians and Earthlings, but also the Federation and the Parasites.”", "Considering how calm Jang Maldong was, it didn’t seem like he was here to simply praise him. While Seol Jihu couldn’t be sure, he felt like Jang Maldong had another objective.", "Was he mistaken in thinking that he sounded very worried?", "…Then again, the matter at hand was about an Army Commander perishing at the hands of a Level 4 Warrior.", "And the infamous First Army Commander, known to be one of the stronger commanders, at that.", "Putting all this together, Seol Jihu really didn’t know what sort of results it would bring back to him.", "‘It could be good, or it could be bad.’", "“I’ll take my leave now.”", "Jang Maldong got up from his seat. Seol Jihu’s eyes widened.", "“You’re leaving already?”", "“You don’t need to say empty words. I can see the exhaustion in your eyes.”", "Jang Maldong chuckled.", "“I’m kidding. I know your body hasn’t fully recovered, but I still wanted to come see you and say a few words.”", "“…Master!”", "Seol Jihu hurriedly stopped Jang Maldong, who was turning around to leave.", "When Jang Maldong looked back with eyes that said, ‘What’s wrong?’, an intense internal conflict flashed within Seol Jihu’s eyes.", "It wasn’t that he forgot. He just had the thought buried in the corner of his mind.", "He didn’t know whether the others had already forgotten or if they were purposely not mentioning it, but Seol Jihu wanted to blurt out what he had been keeping pent up in his heart.", "At least to Jang Maldong, if no one else.", "“It’s about… Master Ian….”", "Jang Maldong’s complexion stiffened slightly. But that was it.", "“Yes.”", "He smacked his lips.", "“I know.”", "Then said calmly.", "‘So it’s as I thought!’", "Seol Jihu’s heart sank even though he had been expecting it. The shape of his mouth distorted.", "“I’m sorry.”", "“…What?”", "Because it sounded like Jang Maldong was asking what he was sorry about, Seol Jihu continued his words in a subdued voice.", "“Because of me… Master Ian passed away. To protect me….”", "Jang Maldong dropped his head. After closing his eyes, he did not open his mouth until a few moments later.", "“That bastard… what did he say before he closed his eyes?”", "He then continued without giving Seol Jihu a chance to reply.", "“Did he say he regretted it?”", "He shook his head immediately afterwards.", "“I doubt he did. After all, his creed was ‘never do something you’ll regret’. That’s what I think.”", "[I… don’t regret it.]", "Ian’s words crossed his mind.", "Seol Jihu became dazed.", "“I’m not sure if these words will be consoling enough, but you already—”", "Jang Maldong, who was continuing quietly, couldn’t bring himself to finish. This was because Seol Jihu was staring at him fixedly with an odd, hard-to-describe expression.", "“What’s wrong?”", "“…He passed away.”", "Seol Jihu murmured as if he was entranced by something.", "Jang Maldong furrowed his brows.", "“I know. What I mean is—”", "“Of course, I know he returned to Earth. But we won’t be able to see him in Paradise anymore.”", "“….”", "“And we don’t know how he’s doing on Earth either.”", "Seol Jihu’s face contorted.", "“Aren’t you… sad?”", "“You…”", "Jang Maldong opened his mouth, then closed it immediately. Then…", "“…I am. I think it’s a shame.”", "He admitted it just barely.", "“Let’s stop this conversation here. Rest up.”", "Jang Maldong pushed his fedora down on his head. He could feel a penetrating gaze on his back, but he turned around without a word.", "Tak. The moment he closed the door, he heaved out a short sigh.", "‘This brat.’", "His wrinkled face turned gloomy.", "‘To think it was to this degree….’", "He knew Seol Jihu was different than normal Earthlings when it came to his views on Paradise. But he never imagined that it would be this bad.", "When he heard what Seol Jihu just said, a shiver had run down his back.", "‘Saving him…’", "Was the right answer.", "If they’d chosen to kill and resurrect him, he had a strong hunch that they never would have seen him again.", "Because… because…", "[Because I like this place.]", "[Money, fame, I don’t think there’s anything wrong with liking them. But I’m not coming to Paradise because of them.]", "[This is the place where I belong.]", "[It’s also the place that gave me a fresh start… I really can’t think of anything to say other than that I like it here.]", "The words he’d heard from the young man suddenly crossed his mind. It was the reply Seol Jihu had given about why he entered Paradise.", "Only now did Jang Maldong clearly understand the meaning behind these words.", "He wasn’t sure just when it started, but what Seol Jihu just said made it certain.", "Seol Jihu…", "[We won’t be able to see him in Paradise anymore.]", "[Aren’t you… sad?]", "…was a Paradise addict.", "And a severe one at that.", "**", "A few days later, Seol Jihu was finally discharged from the intensive care unit. Of course, he couldn’t leave the Temple of Luxuria that easily.", "On the day he was being released, Seo Yuhui forced him to take a final examination, causing him to be held up until late afternoon.", "Because of this, he couldn’t enjoy the party to celebrate his discharge and fell asleep from exhaustion the moment he returned to the office he longed for so much.", "And when the next morning dawned, Jang Maldong called for a team meeting using his authority as Carpe Diem’s advisor.", "“Congratulations on being discharged, leader.”", "Marcel Ghionea bowed when he saw Seol Jihu come down to the living room, then respectfully offered his hands.", "He was holding onto a translucent plastic bag, which contained a carton of tofu. When Seol Jihu stared at him fixedly, Marcel Ghionea said confidently.", "“I hear it’s Korean tradition to give tofu to an acquaintance who is discharged from the hospital. I prepared it as a congratulatory gift.”", "A hint of confusion crossed Seol Jihu’s face.", "“Who told you that?”", "“I saw it in a movie. It was a scene of a stupid, but loyal subordinate giving tofu to his organization’s boss, who had just been discharged from the hospital.”[1]", "“…Just out of curiosity, what happened in the next scene?”", "“The boss smacked the subordinate’s head hard, but he took a bite of the tofu. I’m sure he was embarrassed.”", "Seol Jihu could hear Yi Seol-Ah giggling.", "‘This person is a bit…’", "Seol Jihu was happy with Marcel Ghionea because his cold and calm personality reminded him of Kazuki, but it seemed that he had a rather clumsy and awkward side to him as well.", "In any case, Seol Jihu took a bite of the tofu without complaining.", "“Thanks!”", "A smile emerged on his face as he nibbled on the tofu. He wasn’t feigning laughter and was genuinely enjoying the moment.", "He was deeply moved, seeing the members of Carpe Diem gathered around the living room couch.", "Jang Maldong, Chohong, Hugo, Yi Seol-Ah, Yi Sungjin, and Marcel Ghionea… the faces he’d seen every day moved him for unknown reasons.", "Finally. He’d finally returned to his daily life.", "‘Wait, now that I think about it….’", "Around the time he realized that one person was nowhere to be seen—", "“Looks like everyone is here.”", "Jang Maldong’s voice flowed out. Before Seol Jihu could ask where this missing person was, Jang Maldong cut to the chase.", "“I’ll go straight to the point. Isn’t it about time you all go back?”", "Seol Jihu quickly turned to him.", "“I thought you’d say that.”", "Chohong nodded while stretching.", "Seol Jihu quickly asked back.", "“Didn’t you already go? While I was asleep.”", "“Well, it’s not like no one went… and we also talked about making the trip back and forth in shifts….”", "Chohong shrugged.", "“But it felt wrong to just leave you here and go. So we’ve been putting it off day after day.”", "“But you didn’t know when I’d wake up….”", "“You woke up though. Anyways, a big event just ended, and it’s been a long time since I’ve gone back, so it’s about time I do.”", "“Same here. For the record, I’m going to stay there for a while this time. I have a trip planned, you see.”", "Hugo chimed in as well.", "“Sungjin and I are also going back….”", "Yi Seol-Ah and Yi Sungjin nodded their heads as though they had been waiting.", "“I think I will need about two weeks.”", "And Marcel Ghionea easily agreed as well.", "With everyone speaking as if going back was necessary, Seol Jihu was caught off guard. Jang Maldong, who was secretly watching Seol Jihu, opened his mouth.", "“How about you, Seol?”", "“Yes?”", "“Why don’t you go on a long trip like Hugo? Take a long break to recover. How does a month sound?”", "“A whole month?”", "Seol Jihu muttered in shock.", "“A month on Earth… that’s three months in Paradise. Isn’t that too long? Especially for him….”", "Thankfully, Chohong took Seol Jihu’s side. Jang Maldong tapped his cane on the floor before replying.", "“Then how about two weeks?”", "Chohong didn’t say anything as if that was more acceptable, but Seol Jihu still seemed reluctant.", "“Even two weeks is a bit long….”", "Jang Maldong’s eyes narrowed.", "“From what Miss Kim Hannah told me, you haven’t properly settled the problem of your background environment. She said there are a few things of concern.”", "‘Why did she have to mention that?’", "Seol Jihu bit his lower lip.", "“I don’t know. Even if that’s the case, two weeks is still too long. I don’t see the need to go back right now either.”", "“Is there something urgent you need to take care of in Paradise?”", "Seol Jihu’s pupils made a full circle around his eyes.", "“Uh… first, I have to drop by and thank everyone who came to visit me during my stay at the temple.”", "“I don’t know if that’s even necessary, but you can do that at a later time. They all know what you’ve been through anyways.”", "“I want to go to the temple too.”", "“The temple’s not going anywhere. You can go when you come back. Since you’ll most definitely become a High Ranker, you’ll need some time to think about what you want to be, anyways.”", "“I have to quickly restore my physical level too. At the Huge Stone Rocky Mountain.”", "“I’m going back to Earth as well.”", "“Then I can go alone.”", "“I thought I told you to focus on eating well and getting ample rest.”", "Seol Jihu shut his mouth. Jang Maldong continued as if to console a petulant child.", "“You were discharged from the temple, but your body hasn’t fully recovered. If you push yourself too far, there is a good chance that the temporary drop in your physical level will become permanent. For now, you need to rest.”", "Unable to refute him, Seol Jihu simply nibbled on his lip. To be honest, he wanted to shout that he simply didn’t want to go back.", "In the sudden heavy atmosphere, Jang Maldong’s brief sigh rang out.", "“…One week.”", "Seol Jihu still didn’t answer.", "“Are you saying that’s too long?”", "The other members of Carpe Diem began to look back at him. Feeling their gazes, the young man scratched the back of his head roughly.", "He couldn’t understand why everyone was looking at him like he was acting strange… but in the end, he knew that he had no other choice and lowered his head.", "“…Got it.”", "**", "As if to strike while the iron was hot, Jang Maldong suggested that Soel Jihu return to Earth that very day.", "Although Jang Maldong had never forced him to do anything until now, Seol Jihu had the feeling that Jang Maldong was pushing this onto him forcefully.", "He even followed Seol Jihu to the temple. It was almost as if he was policing him to make sure he returned properly.", "On their way to the temple, Jang Maldong suddenly asked.", "“Where do you live?”", "“Huh? Oh, um, Seoul.”", "“Seoul can’t all be your home.”", "“…Seodaemun-gu Hongeun-dong.”", "“Seodaemun-gu, huh.”", "Jang Maldong nodded his head and continued.", "“It should be close to Hongdae.”", "“Yeah, it’s only about 15 minutes away….”", "“Great. There’s a good pork belly restaurant near Hongik University Station’s 8th exit.”", "“?”", "“Go there if you have the chance. It’s excellent.”", "Seol Jihu looked a little puzzled. What Jang Maldong said really came out of nowhere, but given his personality, it was likely that there was a significance to it.", "But Seol Jihu couldn’t figure out his intention no matter how hard he thought about it.", "Soon, they arrived at the portal in the temple.", "Jang Maldong told Seol Jihu to go in first and stopped in front of the altar.", "Seol Jihu gave Jang Maldong a short farewell and climbed up the stairs.", "And just as he put one foot inside the warp gate—", "“Seol.”", "A heavy voice pulled on his leg from behind him.", "“I’m really proud and thankful for what you’ve done.”", "“Ah.”", "“But this world isn’t the place you live in.”", "Seol Jihu’s half-turned body paused hearing what followed immediately afterwards.", "“Don’t forget.”", "[Don’t forget.]", "“Where you belong, is Earth.”", "[This is the place where you belong.]", "“….”", "Seol Jihu pushed the foot he took out of the warp gate back in.", "Pretending not to have heard him, he let the warp gate engulf his body.", "This was his third return to Earth.", "1. In Korea, tofu is given to people who leave prison, not the hospital. "]}