{"cid": "191", "title": "Chapter 191. Doubt", "content": ["“Wow!”", "Seol Jihu checked his phone as soon as he woke up and exclaimed. There was a huge backlog of unread messages and missed phone calls. The problem was that they all came from the same person.", "[Damn it. Just you wait until I see you again.]", "Imagining a seething Phi Sora typing this message, Seol Jihu guffawed and took his clothes off. Then, he headed to the bathroom, humming.", "Today was the day to return to Paradise. As he had been waiting for this day for so long, he was naturally in a good mood.", "After washing every inch of his body, Seol Jihu prepared to go back refreshed. As he had finished most of the preparations last night, all he was doing was a final check-up.", "First, he had to arrange a good background story. As such, he messaged Seol Wooseok.", "[I have a business trip.]", "[Again? Didn’t you say you just finished a huge project?]", "[Director Kim is the type to come up with work even if there isn’t any.]", "[Ah, I think I know what you mean.]", "[Don’t worry, I’m fine. I’ll be working overseas so I might not be back for a while, but once I do, I’ll have most of my debts paid off.]", "[Okay. I understand you wanting to pay your debts back as soon as possible, but don’t sacrifice your health. Take some vitamins, if anything.]", "A pleased smile bloomed on Seol Jihu’s face as he read the message. He wanted to talk more, but he knew Seol Wooseok must be busy preparing to go to work.", "Thinking that this was enough, Seol Jihu plugged his phone to the charger. After grabbing some freshly washed clothes from the drying rack, he put them on, ate a banana for breakfast, then checked the items he was bringing to Paradise.", "“Let’s see, red ginseng for Master Jang… a present for Yuhui Noona… presents for Princess and Flone… something to tease Miss Phi Sora about….”", "Throwing the banana peel into the trash, the check-up was drawing to an end. It was then.", "Tok, tok. Knocks rang out from the door, causing Seol Jihu to turn to the front door.", "‘Who is it at this time of day?’", "He couldn’t think of anyone who would come. Tilting his head, Seol Jihu walked to the door.", "“Who is it?”", "Gulping down the banana in his mouth and opening the door—", "“….”", "His face stiffened as he stared at the hallway. The excited glint in his eyes instantly subsided, his eyes widened, and his mouth opened slightly.", "After all…", "“Ah.”", "Someone completely unexpected was standing there.", "“…Hey.”", "The woman standing at the doorway must have been a bit embarrassed as she gently tucked her hair behind her ear.", "“Have you… been well?”", "The person asking him this with an awkward smile was none other than… Yoo Seonhwa.", "Facing a completely unexpected situation, Seol Jihu was at a loss for words.", "He thought their relationship was over.", "He thought he would never see her again.", "And so… he never expected her to come see him first. He stared at her blankly, not knowing what to say or do.", "“Can I come in?”", "Her soft voice snapped him back to reality.", "“Huh? Oh, yeah.”", "When Seol Jihu stepped back, Yoo Seonhwa walked in and gently took her shoes off.", "“It’s cleaner than I thought…”", "She sounded somewhat regretful.", "“What about breakfast? I thought you wouldn’t have eaten yet, so—”", "Yoo Seonhwa raised the shopping bag in her hand and waved it slightly. Seol Jihu subconsciously wiped the crumbs around his mouth and turned his gaze.", "It was then that Yoo Seonhwa saw a couple of bananas lying on the kitchen table.", "“Ah, bananas.”", "“Do you want one?”", "Yoo Seonhwa glanced at Seol Jihu, then smiled.", "“Yeah.”", "“?”", "“It’s been a while. I’m feeling it.”", "Seol Jihu didn’t expect her to say yes but hurriedly brought the banana over. When he peeled it for her, Yoo Seonhwa displayed a nostalgic expression.", "“This reminds me of that time.”", "Murmuring to herself, she carefully took a bite.", "“It’s good….”", "She smiled faintly so that it was barely visible. Next, when she finished the whole thing and began to look around, Seol Jihu held his hand out.", "“Give it to me. I’ll throw it away.”", "“No, it’s fine. Where does the food waste go?”", "“Food waste? I just use the trash can over there….”", "“Trash can?”", "Yoo Seonhwa quickly walked over to the trash can. Seeing several banana peels piled on top of each other, she sighed.", "“Geez, I told you so many times that you can’t throw banana peels away with other trash….”", "She then found a yellow plastic bag from the drawer underneath the sink and began to separate the trash properly.", "Seeing Yoo Seonhwa standing in the kitchen, Seol Jihu subconsciously placed his hand over his chest. He blinked his eyes, feeling his heart pounding under his palm.", "“I heard.”", "Yoo Seonhwa spoke with her back turned to Seol Jihu, still taking out the banana peels from the trash can.", "“You’re employed now and paying back your debts?”", "“How did you know?”", "“Wooseok Oppa told me.”", "“Hyung told you?”", "Didn’t I tell him he didn’t need to persuade anyone? No, maybe he just let Seonhwa know without any ulterior motive. That this is how I’m living now. I’m sure he had to say something to explain paying off the debt with my money.", "Seol Jihu decided not to be too forward.", "“Aunty was really happy when she heard you got into Sinyoung. She said her son was pulled up from a quagmire.”", "What about Father and Jinhee?", "Seol Jihu held himself back from asking. He figured there was a reason she did not mention them.", "“Oh, by the way.”", "After tying the plastic bag together, Yoo Seonhwa slowly lowered her arm. Her shoulders danced slightly as she gently turned around.", "“I heard you completed a huge project recently?”", "“He told you about that too?”", "“Is your body okay?”", "It was at this moment that Seol Jihu felt that something was off. She didn’t say he did well or ask about the job, but was asking whether his body was okay?", "Just as he was thinking that she was asking about the wrong thing—", "“Wooseok Oppa said that you work late every day and even go on business trips. Make sure they pay you every cent you work for!”", "“Oh, of course.”", "Seol Jihu accepted the strangeness thinking, ‘They sure talked about all sorts of things.’", "“Yeah, my body’s fine. Why, do I look sick?”", "“….”", "“Who’s going to take care of my health if I don’t? I’m not going anywhere dangerous and I’m always looking out for myself, so you don’t have to worry about me.”", "“…Haa.”", "Seol Jihu was taken aback as Yoo Seonhwa suddenly let out what seemed like a dumbfounded sigh. Her clear eyes turned a bit sour. The way a chilling air emanated from her, she seemed to be glaring at him.", "“Whew.”", "Huh? Isn’t this what happens before she lectures me?", "Seol Jihu scratched his head, wondering what he did wrong now.", "Gulp. Yoo Seonhwa forcefully swallowed hard before collecting her breath and speaking out.", "“I came to tell you something.”", "It was finally time. Seol Jihu gave his undivided attention to Yoo Seonhwa as his chest tighten from extreme nervousness.", "“It’s about the money you gave me…”", "“That’s your money.”", "Seol Jihu cut her off, clearly revealing that he did not want the money back. Yoo Seonhwa shook her head.", "“Let me finish.”", "Seol Jihu shut his mouth.", "“I plan on opening a small shop.”", "“A shop?”", "“Yeah, with the money I saved up and the money you gave me. I had to take out some loans and I’m not sure how well it will go, but since I don’t have to pay rent or key money, it won’t go out of business at the very least.”", "“Oh, congrats!”", "He wasn’t sure why she suddenly brought up this topic but congratulated her from the bottom of his heart.", "‘She must have a lot of money.’", "At this time, he was only surprised and didn’t have other thoughts. But that changed when he heard her next few words.", "“Do you want to do it together?”", "“…What?”", "Completely caught off guard, a look of disbelief quickly took over Seol Jihu’s face.", "“It’s a fairly large shop.”", "Yoo Seonhwa continued softly with a calm expression.", "“It’s downtown near four universities. It will be pretty hard by myself, so I want you to help.”", "“Se-Seonhwa?”", "“You just have to manage the employees, so it won’t be too difficult. All you have to do is help clean up from time to time, and open and close the shutter in the morning and at night.”", "“W-wait.”", "“Let’s do it. If you want, I can put your name down as a co-owner. I can say that the money you gave me was an investment.”", "Yoo Seonhwa spoke her mind in a while-we’re-at-it kind of way. By now, Seol Jihu had gone beyond the point of being dumbfounded to being shell-shocked.", "Setting aside why she was suddenly making him this offer, Seol Jihu felt like he knew what her intentions were. The past Seol Jihu would have been attracted to this offer for sure. If he was the same gambling addict he was back then, he would have accepted immediately with joy.", "But that wasn’t the case now.", "“No.”", "Seol Jihu shook his head.", "“I can’t do that.”", "There were two reasons he flat out rejected her offer. The first was that he had mostly ended his relationship with Yoo Seonhwa, and the second was obviously Paradise.", "He refused to give this up, even if he was held at gunpoint.", "“Why?”", "Yoo Seonhwa’s long, slender eyebrows faintly bent out of shape.", "“I told you, it won’t be difficult at all. You’ll make more than you do now, and you’ll have more time too. Looking at it long term—”", "“That’s not the problem.”", "Feeling like she would persuade him if he let her continue, Seol Jihu quickly cut her off.", "“I just, I just like this work.”", "“You like it?”", "“Yeah. Even if you’re right, it’s a matter of personal preference. I think the work I do right now is perfect for me. Plus— I still have a lot of things I have to do.”", "Seol Jihu spoke firmly without missing a single beat.", "“I won’t quit.”", "The moment he put the nail in the coffin, Yoo Seonhwa stared at him with a burning gaze.", "“…But it’s dangerous.”", "A short mutter escaped her mouth. When a straightforward gaze glared at him, Seol Jihu suddenly came to his senses. Moreover, he had heard the muffled mutter, and a hint of surprise crossed his face.", "His heart stung a bit.", "“D-Dangerous?”", "He averted his gaze unknowingly.", "“It’s a pharmaceutical company.”", "That wasn’t enough of a reason to deem a job dangerous.", "“I think you’re misunderstanding something. I’m not doing clinical trials there or even researching new medicine. I’m just a sales rep. There’s nothing dangerous.”", "“Really?”", "Seol Jihu explained skillfully, but Yoo Seonhwa kept digging into the matter.", "“Can you say it’s not even a tiny bit dangerous?”", "Seol Jihu furrowed his brows. The way she was talking, it was as if she was telling him to quit because the job was dangerous. It was then that the slight doubt in his mind bloomed into a real one.", "“Are you saying I’m lying?”", "Feeling like she was impeding his ability to enter Paradise, Seol Jihu’s voice turned sharp. But after saying it out loud, he went “Ah.”", "At the same time, Yoo Seonhwa looked as if she was at a loss for words. She bit her lower lip and looked straight at the young man.", "A sudden silence descended.", "“Because you…”", "In the suffocating silence, Yoo Seonhwa quietly spoke.", "“Because you don’t look at my eyes when you lie.”", "After a brief silence, a long sigh flowed out. Yoo Seonhwa put the shopping bag down.", "“Take some time to think about it.”", "And although she stared at Seol Jihu for a little while longer…", "“I’ll be off then.”", "She soon turned around and left.", "The front door closed quietly. Like a bolt out of the blue, left alone once again, Seol Jihu stood frozen like a rock for a long time. Only when the sound of her footsteps completely vanished did he finally come back to his senses.", "“…The heck…”", "Smoothing down his face with his hands, he suddenly caught sight of the shopping bag Yoo Seonhwa left behind. Inside it were bento boxes with rice and side dishes.", "Opening them one by one, he saw braised short ribs, soy sauce braised quail eggs, kimchi pancake, bulgogi, and vegetables for bibimbap. They were all Seol Jihu’s favorites.", "“…Gulp.”", "His mind was in a complicated place, but his mouth was honest. It quickly ordered him to put the food inside it.", "In the end, Seol Jihu started an unexpected, early sumptuous lunch.", "‘But what was that?’", "Yoo Seonhwa coming to visit him without telling him wasn’t such an uncommon thing. Looking back, that’s what she always did.", "No matter how difficult he made things for her or how hard he pushed her away, she would always come see him first and comfort him to do better. Although the time between her visits got longer as he betrayed her trust more and more, the result was always the same.", "The past Seol Jihu knew this better than anyone else and used it to his advantage, clinging onto Yoo Seonhwa.", "The problem was what came afterward.", "One time, Seol Jihu claimed to have quit gambling and reformed, begging Yoo Seonhwa to live together in a two-room apartment. And the moment he received the security deposit from her, he ran to the casino.", "After this incident, Yoo Seonhwa became hesitant when it came to giving him money. Making him the co-owner of her new shop?", "‘It’s too strange.’", "He tilted his head constantly. But in any case, the food was great. As he was familiar with her cooking skills, Seol Jihu nodded his head. The braised short ribs were soft and chewy, almost like the ones Seo Yuhui made on Huge Stone Rocky Mountain….", "“….”", "When he thought how similar the two meals were, Seol Jihu suddenly stopped in the middle of taking another spoonful of rice.", "‘Could it be?’", "Thinking about it now, it felt like Yoo Seonhwa was trying to pull him out of going back to Paradise no matter what. Of course, this only made sense if Yoo Seonhwa was an Earthling who knew about Paradise’s existence…", "But could he confidently say she wasn’t?", "[…But it’s dangerous.]", "Seol Jihu’s eyes rolled in a circle. He had often gotten the feeling that Seo Yuhui was oddly similar to Yoo Seonhwa.", "Although there were clear differences that distinguished them, Seol Jihu wouldn’t be surprised if Paradise had a polymorph magic of some sort.", "With how strange today’s visit was and the odd feeling he got from it, he really couldn’t be blamed for suspecting this possibility.", "He could be right, or he could be wrong.", "‘Let me think.’", "He had to think of all possibilities, but the simplest way was to confirm with his own eyes.", "In that instant, Seol Jihu shot up from the kitchen chair as though he had been hit by lightning. Dashing to the window and looking out, he could see Yoo Seonhwa leaving the building.", "Soon, she turned a corner and disappeared into an alleyway.", "Seol Jihu quickly threw on his clothes and shoes. He didn’t forget to stuff the remaining food into his stomach, then picked up the items he planned to bring and tore the return ticket in half.", "Finally, he was back in Paradise.", "Normally, he would have walked out of the temple leisurely, feeling himself in the moment, but he didn’t have the time now.", "Running out with a shopping bag in each hand, Seol Jihu stopped by the reception desk and asked if he could check the entry and exit records.", "But the reply he got was, “We can’t reveal anyone’s personal information, even if the person asking is you. And especially if the information you’re asking about is Lady Seo Yuhui’s.”", "The receptionist seemed adamant. Because it looked like she wouldn’t give in even if he laid down with his belly exposed, Seol Jihu turned around without lingering attachments.", "Activating the Festina Earring, he quickly ran to the Carpe Diem office. But instead of going inside, he changed course and headed to the building on the opposite side of the street.", "‘If she’s here, it’s significantly less likely that they’re the same person.’", "‘If she’s not here… then the question is up in the air.’", "Seol Jihu dearly wished for Seo Yuhui to be inside, and raised his hands as soon as he got to the door.", "Dum, dum, dum, dum! Knocking on the door loudly, he shouted.", "“Yuhui Noona!”"]}