{"cid": "317", "title": "Chapter 317. A Tiger Father Does Not Beget a Dog Son (2)", "content": ["When Seol Jihu first saw the drawing, he thought, ‘I can’t tell what she tried to draw.’", "And at the same time, an inexplicable fear and displeasure welled up inside him. It was the kind of fear that humans instinctively felt when their brains experienced something beyond their capacity.", "Just holding the drawing in his hand caused his body to cry out in discomfort. He wanted to rip it into shreds or burn it into cinders.", "Just as he unknowingly strengthened his grip on the paper—", "“Take a deep breath.”", "Philip Muller’s subdued voice rang out in his ears.", "“The intense repulsion you must be feeling right now is a natural reaction as a living being existing in the Middle World. The same goes for that miss.”", "The Middle World did not tolerate the Astral Phenomenon. In other words, what Seol Jihu was feeling right now was the emotion that the Middle World had against the Astral World.", "“….”", "Seol Jihu had to admit, he couldn’t act so weak when he didn’t even look at the real thing like Oana. Moreover, that was the place they now had to enter.", "Although Seol Jihu strongly wanted to avert his gaze, he suppressed this desire and slowly scanned the drawing.", "‘I don’t see a bamboo forest or an ocean….’", "First, the drawing practically had no blank space. Any spots that could be described empty had lines spreading out chaotically like cracks. It was as if an A4 paper was crumpled up and flattened out. Furthermore, a vortex was raging around the entire paper.", "No, he thought it was a vortex at first. But looking at it closely, it was a congregation of strange things, drawn in a metaphysical way.", "“It reminds me of The Scream by Edvard Munch.”", "Seol Jihu went “Ah” at Oh Rahee’s murmuring. He was thinking he had seen something similar before. There were hundreds— no, thousands of agonizing, wide-eyed men, stretched long as if they were being sucked into a black hole, forming a vortex.", "“It looks like there really is something there. In that bamboo forest— or rather, the center of the place.”", "Kazuki gave his thoughts on the matter with furrowed brows. Once everyone’s gaze fell on him, he pointed at the center of the drawing.", "“This spot is the only clean place.”", "Now that he mentioned it, only the center of the drawing was free from the cracks or the vortex. It was a bit strange that such a chaotic drawing had a center that was so clean.", "“It’s like we’re looking at the eye of the storm. Perhaps this central region will lead to the cause of this phenomenon.”", "Seol Jihu turned back to Oana. The girl nodded her head with difficulty, quietly agreeing with Kazuki.", "With this, their destination was set. Only now did Seol Jihu put down the paper.", "“Looks like we’ll have to enter that place…”", "“Can— can we wait a moment before going?”", "Oana pleaded with a voice tinged with tears.", "“I don’t think I can handle it if we go in now…”", "“…I’m okay with waiting, but will you be okay?”", "“One hour— no, 30 minutes is enough.”", "When Seol Jihu asked worriedly, Oana bit her lower lip.", "“I was like this when I first got the Spirit Eyes. I’ll be able to handle it once I get used to it.”", "Seol Jihu nodded silently. He couldn’t help but think that this was on a whole different level than looking at some ghosts, but there really wasn’t much they could do at this point other than hoping for Oana to endure until they arrived at the destination.", "Now was a good time to rest anyway since they marched nonstop after getting off the carriages. Seol Jihu ordered a one-hour break, then looked for the paper he’d put down.", "‘Oana is trying hard. I can’t possibly lose out.’", "The discomfort he felt wasn’t too bad at the moment, but it should get stronger as they got nearer. Seol Jihu wanted to get familiar with the feeling as much as possible before then, but someone must have had similar thoughts as the paper he’d placed was gone.", "“Ugggh—”", "Hugo was staring at the drawing with his arm stretched out and his head reaching far to the opposite side.", "“It’s like looking at a monster with its mouth open.”", "The frowning Hugo muttered as he looked back at Seol Jihu.", "“It feels like the Parasite Queen is waiting for us to walk into her wide-open mouth. Not that I’ve ever seen her.”", "The mouth of a monster. Different people indeed had different interpretations.", "Seol Jihu spoke quietly.", "“Even if that’s the case, it doesn’t change the fact that we have to go. It’s like the saying, you have to enter a tiger’s den to capture a tiger.”", "“Shit, I guess you’re right… Did you get any messages from Valhalla? Or the palace?”", "“Not yet.”", "“Hm, I hope nothing bad happens. I don’t feel good about this.”", "Hugo spat on the ground, then threw the paper far away. Seol Jihu sighed before running out and picking the paper back up. Then, about an hour later, Oana fully recovered and gave the okay sign.", "“Let’s set off then.”", "Steeling his resolve, Seol Jihu led the expedition team down the peak to the mysterious region where the Astral Phenomenon was happening.", "*", "[He is leaving.]", "The Parasite Queen became flushed from excitement surging up from the bottom of her heart.", "[He’s leaving, leaving, leaving, leaving…!]", "The Queen’s universe-gazing eyes were chasing a single Star. As the constellation moved, her pupils lit up as if to explode.", "And by the time the Star reached a certain point, the constellation’s light turned faint, and the Parasite Queen’s eyes shot open at the same time.", "Boom! The Parasite Queen stood up hard as if to destroy the throne.", "[He entered!]", "A voice mixed with joy and bliss burst out.", "The Star had yet to leave the Middle World completely. But just now, it most certainly entered the exit point. In that case, it should only be a matter of time before it was gone for good. Just this fact alone was enough for her to make her decision.", "[Hear me—!]", "The Parasite Queen’s cry echoed in the empty grand hall.", "However, she was the sole Chief Deity of this planet. If she wanted, she could transmit her voice to the ends of the world.", "Despite being unable to break away from the Corrupted Throne, the entire region of the olden Empire was her territory.", "As of this moment, the Army Commanders gathered at the front lines and the entire Parasite army were looking up at the sky.", "The overcast sky was showing a huge scene of the grand hall and the Parasite Queen.", "[March forth!]", "Finally, the troops were ordered to advance.", "In the next moment, the eagerly waiting five Army Commanders moved.", "Starting with the Death Knights and the undead army led by Unsightly Humility, four armies moved simultaneously.", "Behind them, birth-giving species leading countless young ones and over 200 Nests protected by an unfathomable corpse army followed in perfect order.", "At last, the Parasite’s full-scale invasion had started.", "*", "The Federation sentry standing watch at the border region became lost for words.", "Pitch-black darkness. That was the only way he could describe what he was seeing.", "Despite the sentry post being situated at a high altitude, everything in his sight turned black in an instant. The Parasites had appeared at last, their army dyeing heaven and earth in their color.", "They were marching forth, ready to devour this grand, majestic mountain range.", "“Uup!”", "The sentry barely held himself back from screaming and hurriedly bent down. He fumbled around the table and gripped the communication crystal he caught hard.", "*", "“Here they come.”", "Teresa spoke as she calmly stared at the crystal ball that had just flickered off.", "Next, she heaved a heavy sigh.", "Though they were doubtful, it really was just as they expected. The moment Seol Jihu left for the Spirit Realm, the Parasite Queen set out as if she had been waiting for this very moment.", "‘The expedition team should be near their destination, if not there already…’", "It was too strange to be a mere coincidence. She could only come to the conclusion that the Parasite Queen aimed for this exact moment.", "“What shall we do, Princess?”", "Haramark’s general, Jan Sanctus, who was quietly standing by her side, asked.", "“Is there even a need to ask? There’s only one thing we can do.”", "Starting now, it would be a race against time. They could not spend even a single second in vain.", "Seol Jihu wanted Teresa to buy time until he returned, and Teresa fully planned to meet his expectations.", "“Assemble the forces stationed at the valley fortress, leaving behind only the absolute minimum to defend it.”", "“The preparations are already finished.”", "“Good. Then—”", "Teresa took a deep breath, then spoke sharply.", "“Contact Sicilia.”", "The situation came to a head.", "*", "Sorg Kühne ran. When he received the call, he dropped everything he was doing and started running like a man struck by lightning.", "Afterward, he only ran crazily. The soldiers and maids who knew his usually calm personality sent him flustered gazes, but he did not mind it in the slightest.", "It was because this was a matter of utmost urgency.", "He was in such a hurry that he skipped the procedures to receive a royal audience and ran into the grand hall.", "“Your Majesty!”", "He shouted at the top of his lungs as soon as he ran inside.", "“Urgent news just came in!”", "Getting down to the ground as if to fall flat on his face, he pressed the floor with his hands.", "“The Parasite’s invasion has been confirmed! They are making their way past the Hiral Mountain Range and marching toward Tigol Fortress at frightening speed!”", "A grave shout echoed out.", "“The enemy’s military strength has not been fully identified, but judging by the five Army Commanders leading the march—”", "Sorg Kühne, who was delivering a heated report, raised his head. As soon as he saw the sight in front of him, he flinched. Charlotte Aria was sitting on the throne. Her eyes were tightly shut, and the hands grabbing onto the armrests were shaking.", "“The Parasites have engaged an all-out war.”", "Sorg Kühne swallowed hard and finished his report in a somewhat quieter voice.", "“…The Federation has requested our help.”", "Her faintly trembling eyelids went up. Her weak pupils swayed as if to burst out into tears at any moment. It was obvious to anyone watching that she was petrified by fear.", "“…Kühne.”", "A trembling voice mixed with an airy breath flowed out.", "“Seol Jihu…”", "Sorg Kühne frowned immediately. Seol Jihu was not important at this moment. Of course, if he was present in the city, he would have been able to lead Eva in the Queen’s place. However, the young man left to fulfill what must be done for the future of humanity.", "It wasn’t as if Charlotte Aria didn’t know this. Seeing the Queen still searching for Seol Jihu at a time like this, Sorg Kühne couldn’t help but scowl in frustration.", "“Do not worry, Your Majesty. As I said before, this humble servant will take care of—”", "“Even now…”", "However, the suppressed voice that flowed out afterward said something that was slightly outside of Sorg Kühne’s expectations.", "“He must be risking his life.”", "“…Pardon?”", "“Perhaps, even in this exact moment where we are talking, Seol Jihu could be pushing through danger, hovering between life and death. Isn’t that so?”", "Sorg Kühne didn’t know what to say at the sudden question.", "“That’s….”", "Charlotte Aria opened her mouth and repeatedly took in deep breaths. She was seemingly trying to calm her pounding heart.", "After a short moment of silence—", "“Representative Seol—”", "Charlotte Aria quietly spoke.", "“…is a benefactor who saved the dying Eva.”", "This was an obvious truth.", "“He is also the man who helped this royal self escape from the clutches of the evil hand.”", "And an undeniable fact.", "“Father said so, ‘benevolence must be returned with benevolence.’”", "Speaking in a slightly weary voice, Charlotte Aria clenched her teeth.", "Her eyes lit up.", "“He is now going beyond Eva to save the whole of Paradise. How can I refuse the request of my benefactor?”", "“Y-Your Majesty—”", "“Since Representative Seol is absent, this royal self must lead the Earthlings.”", "Sorg Kühne looked up in a daze.", "Charlotte Aria slowly got up from the throne.", "“The time to return his benevolence has come.”", "Sorg Kühne’s complexion slowly brightened. While he was only in charge of administrative duties in name, everyone knew that he was the acting regent for the queen.", "With Seol Jihu’s absence, what he was most worried about was the draft call. However, Charlotte Aria revealed the intent to step up to the front line.", "If so, he had a way. Compared to the title of the royal administrator, the title of Queen carried an incomparably heavier weight.", "“I hereby command under the name of Aria.”", "Though her voice was trembling as it flowed out.", "“The Eva Royal Family shall accept the Federation’s request for aid.”", "Eva’s Queen showed her resolution in a quiet, yet clear voice.", "“Assemble the army and summon the Earthlings!”", "“Your Majesty!”", "With a raspy breath, Sorg Kühne smiled beamingly and lowered his head until it almost touched the ground.", "“This humble servant shall obey your command!”"]}