{"cid": "104", "title": "Chapter 104. The Village Head’s Gift", "content": ["A clear, bright morning dawned in Paradise. The sky was serene and blue, like a cool seaside that presented a refreshing feeling to anyone who saw it.", "However, Carpe Diem’s office was bustling with Jang Maldong’s bombshell announcement.", "“You’re staying!?”", "When Chohong shot up in shock, Jang Maldong frowned.", "“I haven’t gone deaf, so stop yelling!”", "Chohong looked left and right in utter disbelief.", "Hugo was busy cheering and dancing around the room, and it didn’t look like he was the one responsible. But it was hard to believe that Seol Jihu convinced him. After all, Jang Maldong was more stubborn than a mule.", "In the end, she could only conclude that he changed his mind on his own.", "“…Are you serious?”", "Seeing Chohong’s complicated gaze, Jang Maldong tapped the floor with his wooden cane.", "“I’m not saying I’m coming out of retirement. It’s just….”", "“It’s just…?”", "“I’m the one who created Carpe Diem and have been with it through thick and thin. If I leave it alone, it will either get disbanded or get absorbed. It didn’t sit well with me to let that happen.”", "“Geez, Old Man, you’re worrying about it too much. Didn’t I say we’d take care of it?”", "“Take care of it?”", "Jang Maldong laughed out loud.", "“Even if your mouth is twisted, you need to speak properly. You are actually saying that, when you said you can’t handle being the leader!?”", "“Hurrah!” Hugo raised his arms and cheered.", "“Shut it! What are you so proud of!?”", "Thwack! Jang Maldong’s cane struck his head mercilessly. But that was seemingly not enough to calm Hugo as he continued giggling while rolling around on the floor screaming.", "“Then,” Chohong spoke, “What are you saying you’ll do?”", "“For the moment, I’ll stay on as the team advisor.”", "After smacking his lips, Jang Maldong looked back and forth between Chohong and Hugo and sighed.", "“It would have been a different story if I wasn’t aware of Carpe Diem’s current state, but now that I am, I can’t just sit by and watch it fall to ruin. I’ll be here at least until you find a new Archer.”", "“Ah, stop! We’re not going to fall to ruin!”", "“I can see that happening as clear as day, you brat!\"", "In truth, Jang Maldong’s temporary return should be something to celebrate given Carpe Diem’s current situation. His long experience would definitely keep the team well balanced.", "Chohong’s eyes rolled, and she slumped down on the couch. She could tell the old man had made up his mind by the way he had switched out of his suit and changed into his training clothes.", "“Whatever! Do what you want!”", "“Good, I will.”", "“Hmph, you’ll regret it for sure. For the record, I did tell you to go back!”", "“Shut it. Now that we’re talking about this, let’s get something straight. Didn’t I tell you to learn about reading the state of affairs? What’s the point in becoming a High Ranker? All you’re good at is fighting.”", "“Aaaaah!”", "Chohong waved her hands fiercely. Jang Maldong stopped talking, but it was too late. Seol Jihu and Hugo were looking at her with widened eyes.", "“Really? You’re a High Ranker now?”", "“Ah, why did you tell them? I was going to surprise them!”", "Hearing Seol Jihu’s question, Chohong threw a temper tantrum. Jang Maldong snorted without batting an eye.", "“What’s there to be surprised about anyways?”", "“Ehew.” Chohong scratched her head, then shot a boasting smirk at Hugo.", "“See, I told you I was gonna get there first.”", "She then turned to Seol Jihu and made a peace sign with her fingers.", "“I’m a High Ranker now!”", "“Whoaa!”", "Seol Jihu ran forward excitedly, and the duo rejoiced while dancing to the tune of Libertango. Animated by the lively atmosphere, Hugo began to dance as well.", "“So? What did you go with?”", "“Templar.”", "Seol Jihu drew a deep breath.", "Templar! It just sounded too cool!", "His eyes shone with admiration, especially when he thought of his own half-assed class name.", "Seeing him be so openly jealous, Chohong rubbed his nose in satisfaction. She then remembered the saying, ‘happiness multiplies when shared’, and remembered the gifts she had brought.", "“Wait here.”", "Chohong went and found the shopping bags that had been sitting in the corner of the office since she returned. Then she cleared her throat with a cough.", "“Kuhum, I generously brought you a gift.”", "“Really?”", "Seol Jihu’s eyes widened. Hugo then peeked his head, asking “What about me?” but both Chohong and Seol Jihu were too absorbed in their own world to pay attention to him.", "“Yep. Knowing how much you like training, I—”", "“What a coincidence. I have a gift for you too.”", "“Hm?”", "“Wait here.”", "With a sweet grin, Seol Jihu hopped to his bedroom. When Chohong saw what he returned with, she only stood there and blinked her eyes dazedly.", "“Here, it’s a gift for becoming a High Ranker. Congrats!”", "Chohong stared at the iron mace tinged with black as if she was entranced. The large iron ball hanging on the tip and the sharp thorn-like spikes gave the weapon an intimidating aura.", "“It’s called the Thorn of Steel. It’s apparently made out of a meteorite.”", "“Hoh! A meteorite?”", "Even Jang Maldong was impressed.", "“It even has two enchantments on it that doubles its power!”", "It sounded like he was selling an insurance plan or something, but Chohong was too busy gawking at the terrifying beauty of the mace to notice.", "“How is it? You like it?”", "She loved it. There was no way she could possibly not like it.", "Rising to Level 5 was difficult, but just getting there wasn’t enough. One had to obtain equipment worthy of their level to truly call themselves a High Ranker.", "The problem was that the cost of the equipment shot up dramatically from Level 5. Most people couldn’t even dream about changing out all of their equipment, as they could only afford one or two with the money they had saved up.", "The money Chohong had saved was barely enough to change out her weapon, but this ‘+2 Thorn of Steel’ was a true weapon worthy of a High Ranker. Thanks to this, she could invest her money in her armor.", "“Ho… how…?”", "The shock she received must have been great as even her voice was trembling.", "“I was invited to the royal palace when I came back. They told me I could take whatever I wanted, so I brought that one.”", "Hugo appealed his existence going, “Me! What about me!?” But ignoring him completely, Chohong looked at the gift surpassing her imaginations and stood at a loss for what to do.", "“What… y-you should have brought something for yourself…. How could you use that precious opportunity for me…?”", "Even though such words were coming out of her mouth, her body was honest. The corners of her mouth were twitching up repeatedly.", "“I-It’s fine…. Tell them you want to switch it out for something else….”", "She even said something she didn’t mean.", "“Eii, I chose it because I wanted to. I’d never do that.”", "“But.”", "“Don’t be like that. Here. Be a good Chohong, okay? Here—”", "“A-Ah, hey, s-stop. Stop~”", "When Seol Jihu tried to push the mace into her hands, she took a small step back and twisted her body side to side. Then when she pretended to give in and finally took it, her body shuddered as if it had just been electrified.", "‘How can it fit into my hands so perfectly?’", "The Thorn of Steel’s temptation was simply too great. Once she grabbed it, she didn’t want to ever let go. In her ecstasy, she even began to delude herself into thinking that the weapon was crafted just for her.", "“Ah~”", "Chohong moaned in a daze, then quickly snapped back to reality. A young man with a blush on his face was looking at her with anticipation. Her complexion slightly paled.", "“So what gift did you get me?”", "“…Huh? Uh….”", "Looking at his smiling face, she couldn’t bring herself to not give it to him. But when she compared her present to the mace….", "That wasn’t all. Chohong spotted the sandbags tied around his wrists and her eyes swayed like a stream of water.", "“What~ Don’t tease me and show me.”", "“W-Wait.”", "Chohong subconsciously hid the bag behind her back. She then stepped backward, bit by bit.", "Tilting his head, Seol Jihu activated Festina Earring and quickly ran behind her. At the same time, he snatched the bag from her hand and looked inside.", "“Ah!”", "Chohong frowned belatedly and restlessly bit her lower lip. Jang Maldong had never seen her trembling so much, so even he couldn’t help but wonder what she had brought.", "“This is….”", "The gift Chohong had gotten him were sandbags. She immediately dropped her head.", "“I thought they’d help you with your training….”", "She would have given them earlier if she knew. The gift exchange had just happened at an awkward time. Although she pondered for hours about what to get him, she was too ashamed to say anything.", "She felt like she was walking on eggshells.", "“Oh, this is great. I was just thinking that I brought too little.”", "However, Seol Jihu looked sincerely happy. Not a hint of disappointment could be seen on his face.", "Chohong muttered with a sullen face.", "“Don’t lie. I know you brought four of them.”", "“Not just four of them, only four of them. Plus, they were super cheap so I could barely feel a thing after putting them on each of my limbs. Now, I can have two on each.”", "Seol Jihu held the paper bag in his embrace. Because it had been so long since he last received a gift, just the fact that he got a gift made him happy.", "And seeing how genuinely happy he was, Chohong brightened up.", "“Really?”", "“Yep, thanks. I’ll wear these when I train from now on.”", "His embarrassing yet sincere expression flew right at her. The bridge of Chohong’s nose became flushed red.", "“D-Do what you want.”", "Jang Maldong snorted and turned his head. He looked at Chohong, who was looking at her mace and grinning from ear to ear, with a look of surprise.", "He always thought of her as a tomboy, so he couldn’t get used to her unexpectedly prim side. On the other hand, he made a faint smile as he watched the grinning young man.", "As someone who had been helping him train, he knew very well that Seol Jihu had brought eight sandbags with him rather than four.", "‘Little brat.’", "As he was nodding his head in approval, he suddenly saw a big black man standing quietly in a corner. From the way he had his back toward everyone, Jang Maldong could easily tell that he was sulking. Seeing how petty the big guy was, Jang Maldong chuckled.", "*", "The news of Jang Maldong’s return spread quickly.", "The importance that the name ‘Jang Maldong’ carried was partly because he was a veteran who had been active in Paradise far longer than anyone else. However, the real reason laid behind the achievements of the Earthlings he had raised.", "Although not all acclaimed Earthlings studied under him, every Earthling who did became a bigshot known by everyone. This was both the proof of Jang Maldong’s discerning eye and his undeniable skill as a trainer.", "But if one asked whether these two things were the reason for his fame, then that wouldn’t be entirely correct.", "In any case, once Jang Maldong’s return was confirmed, the first person to visit him was Ayase Kazuki, the leader of Umi Tsubame, one of the best teams in Haramark.", "Their relationship wasn’t bad as they once were master and disciple, but for some reason, Kazuki didn’t look so happy. It almost looked like he was here because he was forced to come.", "Having read his face, Jang Maldong also didn’t look at Kazuki in a good light. This was because of his knowledge that standing behind Umi Tsubame was the huge Japan Business Federation.", "Although Kazuki came, he couldn’t bring himself to open his mouth easily. A man who could kill his beloved younger sister was this uncomfortable? While curiosity filled Seol Jihu’s expression, Chohong and Hugo already seemed to know the answer as they maintained their silence.", "After hesitating for a long time, Kazuki said, “It’s the wishes of the Federation Head.”", "“She congratulates your return and wishes to express the Japan Business Federation’s desire to support Carpe Diem as much as it can.”", "“Tell me the reason you’re here.”", "Hearing Jang Maldong’s brusque tone, Kazuki cut straight to the point.", "“The Federation Head will be sending a skilled Archer. She wants Master Jang and Carpe Diem to make full use of him. In exchange, she wishes for you to grant him the honor of receiving your Mystic Acupuncture.”", "“I refuse.”", "Jang Maldong refused flatly before Kazuki could even finish.", "“As you might expect, I have no intention of holding a needle ever again.”", "Kazuki closed his eyes. He looked like he had nothing to say.", "“Is that all?”", "“In case you refused, she gave an option 2 and option 3. And as long as you permit it, she wishes to come to visit you herself—”", "“Tell Tsuji Yuki this,” Jang Maldong raised his hand as if it wasn’t even worth hearing the rest. “The moment you bring up even the ‘nee’ in needle in front of me—” He gripped his cane tight and stared at Kazuki with piercing eyes.", "“I will cut off all connections with you.”", "‘Needle?’", "What was this Mystic Acupuncture? Seol Jihu tilted his head, all the while swallowing his saliva at the heavy aura Jang Maldong was giving off.", "Jang Maldong and Kazuki were simply sitting on the couch, but a heavy atmosphere different than what Seol Jihu was used to, filled the air.", "“Raise your head.”", "Kazuki’s drooped head must have tugged at his heart as Jang Maldong’s voice softened.", "“I got a little worked up thinking about the past. I’m not angry at you.”", "“…Thank you!” Kazuki slowly looked back up.", "“But still, I can’t understand it. Tsuji Yuki should know my personality.”", "When Jang Maldong rubbed his chin and asked, a look of bitterness spread on Kazuki’s face.", "“She sent me here on purpose.”", "“Hm?”", "“Because she knew I’d hate it.”", "Huu- Kazuki let out a short sigh before opening his mouth.", "“If it is okay, I would like to talk to you from now on as the leader of Umi Tsubame.”", "When Jang Maldong nodded, Kazuki slowly continued his words.", "“For the ‘Banquet’ that will soon start, Umi Tsubame would like to request cooperation from Carpe Diem.”", "“Oh? It’s already time for the Banquet?”", "Chohong suddenly cut in. Jang Maldong furrowed his brows but opened his mouth after hearing the word ‘Banquet’.", "“Mm, now that I think about it… it should be coming up soon.”", "“Yes, six weeks later will be the two-year mark since the end of the fourth Banquet.”", "“Looks like people are still in a frenzy considering what happened in the last one.”", "“Yes, it’s quite incredible. Some people are already on the move,” Kazuki replied firmly.", "“Tsk, tsk, people’s greed really knows no bounds. Do they want to repeat the same mistake again?”", "“That catastrophic incident only occurred once…. And besides, this one is a special Banquet.”", "“What about the Haramark Royal Family? I heard that they planned to ban Earthlings from participating in the Banquet after that incident.”", "“It’s been canceled. The recent high death count among High Rankers seems to have affected their decision.”", "Seol Jihu scratched his cheek, hearing their back-and-forth conversation. Chohong and Hugo were also paying attention, so it seemed they knew what Kazuki and Jang Maldong were talking about. But for Seol Jihu, all this talk about a banquet or whatever was new.", "‘There’s still a lot I don’t know, huh.’", "However, he did have a vague idea. This ‘Banquet’ was likely to be the reason for Haramark’s heated atmosphere, which he had been noticing since the day he came back.", "“But why? Umi Tsubame, no, the Japan Business Federation should have already acquired a couple of entrances.”", "“It’s because the current state of Umi Tsubame isn’t good.”", "“?”", "“The Federation Head transferred half of the team to form a separate elite team.”", "Jang Maldong’s face seemed to ask what nonsense he was spouting now.", "“The Japan Business Federation’s power has weakened that much? Wait, they’re forming a team of elites, but they left you out?”", "Kazuki fell silent. A moment later, he let out a dry chuckle.", "“You got on the Federation Head’s bad side, huh.”", "“Yes,” Kazuki replied firmly. “She ordered me to not participate in the rescue mission… but I didn’t listen.”", "“Ah, right, I heard you participated too.”", "Jang Maldong nodded his head as if he finally understood things.", "“Well, command and discipline is that bitch's creed, so I see why she’d be upset. Besides, you know the Federation Head’s personality.”", "“My younger sister was among the captives. I didn’t have a choice.”", "Seol Jihu could hear Jang Maldong click his tongue. After a brief moment of silence, Jang Maldong said.", "“I’m not so sure. The Business Federation has two entrances. The fact that they took your teammates means that they will not allow you to participate.”", "“Yes, I also believe that to be the case. But I wasn’t told that I was forbidden from participating explicitly.”", "“So what will you do?”", "Kazuki’s eyes shone at this question.", "“There are more entrances available. To be more precise, I have been contacted by someone in a similar situation. However, he possesses an entrance.”", "In other words, Kazuki was proposing for Carpe Diem to join a three-way cooperation. When Jang Maldong asked who it was, Kazuki immediately revealed the other party’s identity.", "“He is a middle-level executive of the Triads, a man named Hao Win.”"]}