{"cid": "194", "title": "Chapter 194. High Ranker (2)", "content": ["The veiled indigo and violet colors revealed themselves.", "[Innate Ability, ‘Nine Eyes’, has been fully unlocked.][Innate Ability, ‘Future Vision’, and Innate Ability, ‘Nine Eyes’, are fusing.]", "The Nine Eyes embraced Future Vision and began to evolve. While this process was underway, Seol Jihu looked around in a huge fluster.", "A brilliant light was gathered around his eyes, making him unable to see a thing. He felt like a strange, indescribable sensation was sweeping through his body before unraveling like a skein of yarn.", "It was as if he alone was frozen, while the world was flitting past him quickly.", "Soon, when the sensation left his body completely and the light vanished from his eyes and returned his vision… Seol Jihu became speechless as he saw the flurry of messages filling the air.", "[Your Innate Abilities have evolved to ‘Future-Gauging Nine Eyes’.]", "Seol Jihu’s two Innate Abilities had fused into one ability. He could see a few other messages, which he read as though he was entranced.", "[Future-Gauging Nine Eyes (Grade Unknown)]—The ability to gauge the future, one of the Three Realms.[1]—A future prediction capable of reading the secrets of nature, a high-order analysis of all information existing in the present to predict the future, and a future vision based on supernatural senses and supernatural abilities— a unique ability that does not conform to any of the above three.—A being who experienced the next world transformed his consciousness into emotions and stored it in the realm of subconsciousness. As the ability recalls what has ‘already happened’, it is closer to ‘gauging’.—The better the user remembers the matters of the present, the more responsive the stored emotions will be.", "Seol Jihu was taken aback by the sudden situation but still managed to voice his thoughts.", "‘Gula-nim, Future Vision—’", "[It did not disappear.]", "Gula answered as if she knew what he was going to ask.", "[It simply returned to the place it belonged to.]", "What she was saying was this: that Future Vision, which was imperfect until now, and thus only showed fragmented effects, would finally show its true effects after fusing with the Nine Eyes.", "[You should have realized it by now.]", "Gula’s voice awakened the dazed Seol Jihu.", "[That it is not by any coincidence that you entered Paradise.]", "Seol Jihu’s dream was not a lie. It was a truth, a reality that he had experienced before.", "[I will say this out of concern for you. Do not have blind faith.]", "Gula spoke with strength.", "[With things that did not happen before happening now—]", "His early killing of Kang Seok, the future ‘Constellation Killer’, in the Neutral Zone. The early death of Evangeline Rose, the renowned future ‘Guardian of Eva’, in the Banquet—", "[With things that should not have happened before happening now—]", "And the perishing of Undying Diligence in the war…", "[The future has begun to change.]", "The flow of water, which should have followed a set course, suddenly changed. And as a result, the tiny streams of water that Seol Jihu affected until now, received momentum and began to rage like a tidal wave.", "[This new ability will become a guide that will help you see the path you must now tread.]", "Gula reached out with her hand and stroked the head of the young man standing like a statue. The dazed Seol Jihu collected his senses and stared into the air.", "[The right directions (2) of Innate Ability, ‘Future-Gauging Nine Eyes’— Indigo: Fate Pioneering, Violet: Stellar Evolution— have been unlocked.]", "Previously, only the blue color was unlocked from the right side. And now, so were indigo and violet.", "The past Seol Jihu may have disregarded this as something insignificant. But after unlocking the right side and experiencing just how complicated the blue color was, Seol Jihu felt his shoulders get heavy.", "He had trouble understanding the Choice of Destiny alone, but now he had to figure out how the two additional colors of the right direction worked. To be frank, he did not have the faintest idea of how these two new abilities worked.", "But there was one thing he knew. Thinking about these two abilities in terms of their connection with Future Vision, they had to have powers on a completely different dimension than his other abilities.", "Fate Pioneering and Stellar Evolution.", "Just like Gula and Ian said, perhaps these two abilities were the key weapon and shield to combat the Parasite Queen’s schemes against humanity.", "At least, that’s what he thought.", "“Wheeew.”", "In the end, he had no way to find out now. He just had to face it head-on and figure it out, as he had always done.", "Seol Jihu heaved out the breath he had been holding in. Then, he turned the messages off one by one. The list of skills he could learn as a High Ranker, which had been covered by the messages, showed up.", "Level 5, or the realm of High Rankers, was where Earthlings started to be considered experts. Fittingly, he saw several skills that sounded rather extraordinary, like Sword Qi.[2]", "‘Hm?’", "Two particular skills caught Seol Jihu’s attention.", "‘Curse… vengeance…?’", "[Nemesis: Misfortune-delivering Curse Spear]—A spear that distorts the law of causality to twist the target’s luck and deliver him or her misfortune. This ability can be seen as a curse since it causes an unknown disaster to befall its target.—But since it forcefully reverses the law of cause and effect, the user must also bear the boomerang effect of equivalent power.—While it can be used consecutively, the user must be careful in using it as the user may die from overusing the curse.", "[Nemesis: Punishing Vengeance Spear]—Delivers divine retribution that the target deserves in accordance with the law of causality. This technique was developed by the Goddess of Gluttony, Gula, by observing the Martial God’s ability, ‘Floral Substitution’.[3]—During a battle, when you receive damage surpassing a certain limit, this skill will deliver an ‘absolute’ counterattack that equals the damage you’ve taken.", "Seol Jihu’s surprise only lasted a moment. Soon, a look of worry blanketed his face. These skills were clearly incredible, but he could tell how difficult it would be to acquire them.", "[What are you so worried about?]", "Gula asked, seemingly having read his thoughts.", "[Don’t worry and focus more on training. The future isn’t the only thing that received momentum.]", "Seol Jihu tilted his head. This was the first time Gula was saying something like this. Considering that she was a god, Seol Jihu didn’t think she was saying this just to console him. Most likely, there were secrets that he had yet to discover among the numerous newly evolved abilities.", "‘I understand. Thank you so much!’", "After bowing respectfully to the statue to express his gratitude, Seol Jihu left the temple with light steps.", "And while Gula was gazing at the spot Seol Jihu was previously standing on, a sensual voice suddenly rang out in the empty space.", "[See, I told you he would like it.]", "The voice belonged to Luxuria, the Goddess of Lust.", "[Look how grateful he was. And isn’t this the first time he didn’t complain about his class name?]", "[I just can’t understand.]", "Gula grumbled when Luxuria boasted.", "[Just what is good about a name like that…? High Mana Lancer sounds much better.]", "[How crude.]", "[Hmph. I let it go this time since you insisted so much, but when he becomes Level 6, I will make sure mana is in his name!]", "If Seol Jihu heard this, he would surely convulse violently. The frightened Luxuria quickly stopped her.", "[Don’t. What are you going to do if my child goes astray?]", "[Your child? At the moment, he is without a doubt, my child.]", "Inside the temple, the bickering of two goddesses continued for a long time.", "*", "After leaving the temple, Seol Jihu stopped and tilted his head up. Long beards stretched out from the clouds in the sky, giving a refreshing blue view.", "Seol Jihu smiled as he looked up at the sky.", "[Your Status Window]Summoned Date: 2017. 03. 16Marking Grade: GoldSex/Age: Male/26Height/Weight: 180.5cm/68.6kgCurrent Condition: HealthyClass: Lv 5. Lance of NemesisNationality: Korea (Area 1)Affiliation: Carpe DiemAlias: Smartass, Top Graduate, First Star, Headache, Crybaby, Prankster, Haramark’s War Hero, The Adversary, Training Masochist", "Finally!! He finally reached Level 5.", "He was now a High Ranker, basically, one of the experts who could walk around with their chests puffed out. He could safely say that no one in Paradise could ignore his strength.", "Remembering how he participated in an expedition as a porter back when he was just a Level 1 Warrior, he was quite moved. But the class advancement wasn’t the only reason he was happy.", "[Class: Lv 5. Lance of Nemesis]", "Looking at this class name, a broad grin appeared on his face. He glanced at it once, twice, thrice, and then some more. He didn’t get tired no matter how many times he saw it.", "Because it was cool.", "In truth, he hadn’t expected such a cool name. He would have been happy to simply lose the word ‘mana’. As Seol Jihu had vowed to serve another goddess if even the ‘ma’ of ‘mana’ was in his new class name, he couldn’t be happier that Gula accepted his request.", "“Hic.”", "He was so touched that he even teared up. He remembered the miserable days when he was too embarrassed to even reveal his class name.", "But those days were over now. When he thought about saying, ‘Hello, I am Level 5 High Ranker, Lance of Nemesis, Seol Jihu,’ he felt something welling up inside him.", "Although Fate Pioneering and Stellar Evolution suddenly popped up in his head, Seol Jihu shook the thought off. He wanted to enjoy being happy, at least for today.", "The streaks of daylight shining down from the sky seemed to lighten up his future. Feeling happier than ever before, Seol Jihu wiped his tears and skipped down the stairs with feathery steps.", "[Mana this, mana that! Just what’s wrong with you!?]", "[What’s so wrong about the word mana!?]", "And all the while, he had no clue what the two goddesses were talking about back in the temple.", "*", "It usually took Seol Jihu ten minutes to get to the Carpe Diem office from the temple. But today, it only took five minutes.", "Seol Jihu straightened his back as he opened the door and walked in. Standing proud and looking around, a look of disappointment suddenly crossed his face.", "He couldn’t see Jang Maldong.", "‘No one is back yet…? Is Miss Phi Sora in her room?’", "Snooping around, Seol Jihu caught sight of something black. The moment he strained his eyes to take a closer look, it disappeared in the direction of his room.", "Feeling that something was out of place, he followed the mysterious afterimage to his room. There, he saw a black puff of smoke curled up in a corner.", "Seol Jihu’s face glowed up.", "“Flone!!”", "He shouted joyfully.", "[Hmph.]", "But what returned was a thorny hmph. The top part of the smoke even turned itself back.", "“Flone?”", "[Hmph!]", "Heaving out a strong snort, Flone went under the bed as if she didn’t want to see him.", "‘Ah.’", "Remembering how Flone always stayed by his side while he was in a coma and no one was around, Seol Jihu belatedly went ‘Ah’.", "Flone had to be hurt. Even though he was forced to return to Earth by Jang Maldong, he had left without saying a word. To make matters worse, even when he returned, he tossed her aside in his room, never greeting her once, and went on about his business.", "When he thought about how she supported him during the war and how she saved Teresa in his place, he felt even more apologetic.", "“Floneee.”", "Seol Jihu apologized, telling her to come out, and even sweeping the underside of the bed with a gunny sack.", "“Kyaang!” An angry voice rang out along with a strong pull from his hand. Seeing a clear bite mark on the half-chewed-off gunny sack, Seol Jihu awkwardly scratched his head.", "Then suddenly, a bright idea popped up in his head", "“Flone, I brought you a present~”", "Flone still didn’t react. Seol Jihu rummaged through his baggage. Because Flone was a ghost, he had to get her something different from what he got everyone else. Thankfully, he managed to come up with a good gift idea after much deliberation.", "Seol Jihu sat down on his chair and stole a glance behind him. The word ‘present’ must have piqued Flone’s interest, as a single strand of smoke peeked out from under the bed.", "When the smoke noticed Seol Jihu’s gaze, it started to hide again. Seol Jihu quickly spoke.", "“The pendant. You said it was a keepsake of your mother, right?”", "The smoke stopped, hearing the word ‘keepsake’.", "[Yeah.]", "An apathetic voice rang out. Seol Jihu quickly gestured at her to come over.", "“I’ll show you something cool.”", "[Cool?]", "“You’ll love it, Flone.”", "Hearing how confident the young man was, Flone came out hesitantly before flying next to Seol Jihu.", "[Hmph, I’m just taking a look.]", "“Ai, don’t be like that. We are friends, aren’t we? I just didn’t have time earlier. Please forgive me.”", "Acting cute, Seol Jihu massaged the area he believed were her shoulders. Then, he carefully placed the pendant at the center of the desk.", "The marvelous artisanry of the pendant was noticeable no matter how many times he saw it. But because it was an artifact from hundreds of years ago, there were spots that had faded and discolored.", "“Watch this.”", "Seol Jihu took out a plastic cup and filled 3/4ths of it with water and 1/4th of it with ammonia. Next, he placed the pendant inside before taking it out 30 minutes later. Using a mild, neutral detergent and mixing it into a bowl of lukewarm water, he washed the pendant clean.", "Next, when he gently scrubbed the pendant with a toothbrush and wiped the water off with a towel, a soft exclamation burst out.", "[Wow…!]", "It wasn’t a difficult process. But every time the toothbrush stroked the pendant, the green discoloration disappeared, and the pendant’s old brilliance returned. As Flone had never seen such a thing, she couldn’t help but be surprised.", "[Wow, wooooow….]", "“All we have to do now is wash the pendant clean in lukewarm water and dry it under sunlight.”", "Showing her true figure before Seol Jihu even noticed, Flone stared at the sparkling pendant in a daze. As far as she was concerned, Seol Jihu had just used a mysterious magic spell.", "“How is it?”", "[Refreshing. I feel like I just took a bath.]", "Seeing her stretching joyfully, Seol Jihu smiled.", "**", "Same time.", "Phi Sora was sitting on her bed two rooms over from Seol Jihu’s. Currently, she was in deep contemplation as she looked down at a box.", "Anger was nowhere to be seen, and only confusion remained on her face.", "“God, this smartass…”", "Phi Sora slicked her hair back in frustration.", "“What is this?”", "Murmuring to herself, she picked up the item inside the box with her thumb and index finger.", "“Why did he give me this?”", "What she clawed up was none other than… underwear. To be precise, it was a set consisting of a bra and a matching pair of panties.", "And a fairly classy one, at that.", "To be honest, she liked the gift if she was talking about it in an isolated context. Not only did the passionate red color suit her, but she also liked the rose patterns that were on the underwear. The texture was soft as well.", "‘It’s so expensive….’", "Even at a glance, she could tell that it was from a famous underwear brand. When she saw the 210,000 Won price tag, her eyes almost popped out of their sockets.", "‘He surprisingly has good taste.’", "Right, she accepted this and was happy. But there was just one problem.", "“Why the hell did he give this to me?”", "She just couldn’t figure out why Seol Jihu gave her this particular gift. It wasn’t as if she was his girlfriend. It was too expensive and high quality to be a joke gift, and it didn’t seem like he had any malicious intentions either. Moreover, she never told him about her size.", "The truth was that Seol Jihu was just being stupid. Because Yoo Seonhwa praised him that one time, he thought other people would like this gift as well.", "But because Phi Sora didn’t know Seol Jihu well enough to know this, it was only natural that she agonized over the meaning of this gift.", "In the end, after pondering for a long time, Phi Sora tried on the bra.", "Soon…", "“…Eh?”", "Phi Sora’s eyes widened and she blinked quickly while looking down at her chest.", "“It’s the perfect size?”", "1. A Buddhism concept. The Three Realms refer to the world of past, present, and future respectively. ", "2. Again, Sword Qi isn’t sword-specific. It’s more suitable to call this Weapon Qi (I’m just using Sword Qi since that is the norm in Korean). ", "3. Floral Substitution (移花接木) literally means grafting a flowering tree to another tree. It means secretly swapping something out through an elaborate method. "]}