{"cid": "133", "title": "Chapter 133. At Least", "content": ["The Salt Desert — where white pearl crumbs ripened under the scorching sun, was filled with ferns and long tropical trees that resembled palm trees.", "There, a human figure dropped from the sky.", "Splash!", "The splashing and the subsequent sinking noise were unusually loud. Kazuki, who had finished setting up a campsite, was resting under his tent when his gaze was forced towards the lake. The white pillar of water that shot up from the middle sprayed in all directions.", "As the head and back of a young man appeared on the water, Kazuki realized Stage 3 had ended.", "He expected it to take a few days at the very least, but it seemed to have ended rather quickly.", "“Seol!”", "He called Seol Jihu’s name out loud, but the young man didn’t budge. He only floated around with his head in the water.", "Only then did he realize that something was off.", "He immediately began running before coming to a halt. This was because Chohong, who had been fooling around in the middle of the oasis, had suddenly jumped in.", "“Wake up!”", "When Seol Jihu didn’t react to her close screaming, she quickly dragged him out of the water.", "“Heeeeeeey!”", "Worried that he was dead, Chohong shook his body crazily, and Seol Jihu’s body fluttered like a flag during a storm.", "“What are you doing!? Are you retarded!?”", "Maria ran over in a hurry and kicked Chohong’s butt hard. This was because it was a taboo to thoughtlessly manhandle an unconscious person, whose injuries were unknown.", "Seol Jihu’s eyes were half-open. But his dazed state clearly showed that his consciousness was jaded.", "“I don’t notice any outside injuries.”", "Kazuki murmured after quickly scanning Seol Jihu’s body. Maria chanted a healing spell, but when it didn’t seem all that effective, she clicked her tongue.", "“You’re right. It is his mind, not his body, that is injured.”", "“Can you treat him?”", "“Mental treatment can only be given by an extreme minority of High Ranked Priests. If a Magician were here, they could help calm him down a bit, but….”", "Kazuki looked around the oasis. But he couldn’t find the Priest, who must have followed Seol Jihu to Stage 3.", "“Wait just a bit.”", "Maria smacked her lips.", "“His eyes are in focus, so he must be conscious. If he’s like this because of exhaustion from overburdening his mind, just resting will help him recover.”", "Hearing this, Kazuki nodded his head calmly. However, he was boiling on the inside.", "‘Just what the hell happened?’", "Kazuki knew how strong Seol Jihu’s mental endurance was. After all, back in the Huge Stone Rocky Mountain, when his mind and body were on the verge of breaking down, he had endured with nothing but his willpower.", "‘Did he meet a god or something…?’", "Not knowing that his frustrated thought was spot on, Kazuki began to take off Seol Jihu’s jacket and armor.", "When Sakamoto Jun handed him a healing potion, Kazuki supported Seol Jihu’s neck and slightly tilted the bottle.", "Thankfully, his throat drew gentle gulps. Seeing how he was recognizing and accepting the liquid flowing inside, he didn’t seem to be unconscious.", "Then, after about ten minutes, Seol Jihu spat out a short breath. Seeing the young man blinking his eyes, Kazuki opened his mouth.", "“Did you recover your senses?”", "Seol Jihu rolled his eyes side to side.", "Kazuki spoke.", "“We are at the oasis, the place we entered Stage 1 from. You’re back in Paradise.”", "“….”", "“It hasn’t been that long. About an hour or two since I returned from Stage 2.”", "Seol Jihu gave a small nod before letting out another short breath.", "“Seol, there’s something I want to ask.”", "Seeing that the young man had regained his calm, Kazuki neared Seol Jihu’s face and whispered.", "“She went to Stage 3 too, right?”", "Seol Jihu realized that he was referring to the Priest.", "“Do you know what happened to her? This is a matter of critical importance.”", "Kazuki looked quite desperate, and Seol Jihu felt like he knew why.", "This was because one of the Seven Gods had revealed the Priest’s identity.", "Seol Jihu closed his eyes gently.", "Ira’s voice rang out and dyed his vision white. She must have created a portal underneath him and sent him back as soon as she rewarded him.", "In a way, she was being generous.", "It seemed that he didn’t need to worry about others. Since the remaining four members passed Stage 3 as well, they had the right to receive the rewards they deserved.", "Once they woke up and received their Harmonious Wish, they should return to Paradise as well.", "Then suddenly, as if to prove that his thinking was correct, another splash rang out. Everyone’s attention turned to the lake.", "The Priest must have regained her consciousness as she tilted her head as soon as she rose to the surface of the lake. As a result, her wet hood fell back, and her long hair flowed down.", "The jet-black hair glistened brightly under the sunlight.", "Chohong’s eyes widened in shock, and Maria dropped her jaw with a loud gulp.", "Kazuki quickly tried to cover their eyes, but it was impossible to block multiple pairs of eyes.", "The woman went ‘Ah’ and touched her head. But she must have realized it was too late as she turned and faced the six pairs of eyes staring at her fixedly.", "She slowly put her arm down.", "She was the Daughter of Luxuria — Seo Yuhui.", "“Vitale Resurgens.”", "A fist-sized orb formed on Seo Yuhui’s palm and radiated a green light. Maria covered her eyes with the back of her hand and muttered.", "“Holy f… an Ancient Spell….”", "Although Seo Yuhui was wearing a wide and flabby robe, her twin peaks protruded out. Hugo, who was swallowing his saliva while looking at her chest, quietly asked.", "“What’s an Ancient Spell?”", "“A hella rare spell.”", "“Is it good?”", "“Shut up. This is the first time I’m seeing one.”", "Maria couldn’t take her eyes off Seo Yuhui and spat back at Hugo as if he was a bother.", "The green orb quickly shot down and was absorbed into Seol Jihu’s nose. His pale complexion slowly regained color and his dazed eyes recovered their clarity.", "As vitality began to surge out from the inside, Seol Jihu could quickly raise his body.", "“Thank you.”", "When he bowed and expressed his thanks, Seo Yuhui returned a serene smile.", "“Also….”", "Seol Jihu hesitated before continuing with difficulty.", "“I’m sorry.”", "Seo Yuhui’s eyes widened at his sudden apology, and she tilted her head. Then, she realized why he apologized and sent him an odd look.", "“…You’re the same as ever, apologizing for something meaningless.”", "“Pardon?”", "“No, it’s nothing.”", "Seo Yuhui shook her hand as she covered her mouth.", "“I meant you had nothing to apologize for.”", "“But because of me, you—”", "“No.”", "Seo Yuhui gave a somewhat alluring smile.", "“It might be the opposite.”", "Seol Jihu blinked his eyes at the whispering voice.", "Didn’t the Seven Gods force Seo Yuhui to participate in the Banquet as his guard?", "Seol Jihu was tilting his head, while Seo Yuhui was smiling brightly.", "“I didn’t realize at all!”", "Sensing a strange current of air flowing between the two, Chohong suddenly exclaimed out loud. She seemed somewhat displeased.", "“Why did you hide your identity?”", "“Chohong!”", "Kazuki gave her a warning, but Chohong didn’t stop.", "“Am I wrong? She’s an Executor! If she had stepped up during Stage 2—”", "“Manners, Chohong! Watch your mouth.”", "Kazuki cut her off sharply.", "“She said she had a reason, didn’t she?”", "“What did you just say? Watch my mouth?”", "Chohong’s fuse was lit. Kazuki also became icy like a blade.", "When the two High Rankers seemed ready to fight, Seo Yuhui stepped between them modestly.", "“Those who passed Stage 3 cannot participate in the Banquet again.”", "When Chohong met her pure eyes, she flinched.", "“I’ve cleared the Banquet in the past, so participating this year was a special case among special cases. Because of it, a restriction was placed on my abilities and in revealing my identity.”", "Her refined, gentle voice rang out like the twilight’s sunlight gently embracing one’s ears. Hearing this, Chohong subconsciously calmed down.", "“I can’t reveal the reason because it is personal, but I had to participate.”", "“No—”", "When the woman who was known as the Daughter of Luxuria politely asked for an understanding, Chohong became embarrassed and could only scratch her head.", "Now that she knew her circumstance, there wasn’t much she could say. Especially since she performed more than her fair share of work.", "“I just meant… it would have been nice… if you said something….”", "She must have really been flustered as Chohong suddenly explained politely before hiding behind Seol Jihu.", "Kazuki clicked his tongue.", "“…My apologies.”", "“Don’t be. It’s my fault.”", "Seo Yuhui gave a refreshing smile.", "“But—”", "Kazuki wanted to say something, but he shut his mouth when Seo Yuhui shook her head. He then pushed his hair up before letting out a long sigh.", "“…Let’s go back. To Haramark.”", "*", "Although they took a carriage on the way there, they had to walk on the way back.", "The atmosphere of the Alliance team was rather quiet. But that couldn’t be helped.", "Walking along with them wasn’t just someone famous. She was an Executor, one of the strongest Earthlings in Paradise and one who had created countless legends with a man named Sung Shihyun.", "Because of this, everyone was rather careful around her. After all, even Kazuki found it difficult to interact with her.", "However, while Seo Yuhui might appear aloof, she wasn’t a woman who enjoyed loneliness by nature.", "In fact, it wouldn’t be strange for someone of her position to see herself as special and privileged. Not only was she exalted among humans, but even the Parasites acknowledged her existence as special. In the first place, the Daughter of Luxuria was a privileged class.", "Despite all this, Seo Yuhui didn’t act haughtily. In fact, she acted just like any other Earthling.", "Because she always treated others with affection and gentleness, she merged into the team in only one or two days.", "For dinner, she personally volunteered herself to be the chef. And even with simple ingredients, she made dishes that brought out deep flavors and aroma. Her skill was truly at a masterclass level.", "“Keu! To think I would get to taste the food handmade by Luxuria’s daughter!”", "Sakamoto Jun was deeply moved and made a big fuss. Seo Yuhui returned a gentle smile.", "“Eat as much as you want.”", "“Ah, can I get more!?”", "“Me too! Me too!”", "Hugo shouted as if he didn’t want to lose out. When he shoved his plate out competitively, Seo Yuhui refilled his soup with a wry smile.", "The two of them combined had already finished over ten plates, but as the cook, Seo Yuhui couldn’t help but feel happy.", "“Mm….”", "Seo Yuhui was slowly stirring the soup ladle when she caught sight of a young man.", "Seol Jihu was eating quietly. Although he was moving his spoon mechanically, there were times when he paused and blankly stared into the air.", "After silently watching him for a while, Seo Yuhui carefully opened her mouth.", "“Um….”", "“….”", "“Is it not to your taste?”", "It was rare for Seo Yuhui to take interest in someone first. Naturally, everyone’s attention became focused on them. Seol Jihu was still staring at the air below him with a blank look.", "Only when Kazuki nudged him with his elbow did he respond.", "“?”", "When Seol Jihu raised his dazed face, he saw Seo Yuhui who looked a bit embarrassed.", "“You looked like you weren’t enjoying the soup….”", "“Ah.”", "That wasn’t the case. It was just that….", "“It’s good.”", "Seol Jihu forced a smile and began to take one spoonful of soup after the other. However, Seo Yuhui’s worried gaze didn’t leave him so easily.", "She wasn’t the only one who was worried.", "After the dinner ended, Sakamoto Jun and Hugo finished setting up their tent and went to chat with Seol Jihu.", "“Seol! You’re pretty good! I learned a thing or two from ya!”", "“Learned what?”", "“Don’t pretend you don’t know! ‘Even if you’re an amazing woman, I’m different~’ Weren’t you trying to attract attention by acting aloof?”", "“….”", "“Is it that? The bad guy trope.”", "Hugo giggled as he whispered into Seol Jihu’s ear. However, Seol Jihu only stared at him quietly.", "Taken aback, Hugo continued.", "“Anyways, you can look forward to tonight.”", "“Look forward… to what?”", "“Jun and I only set one tent. And we threw the rest away.”", "“Why?”", "“Isn’t that obvious? We can sleep in the same tent as the Daughter of Luxuria! We’ll be sharing a bed!!”", "Hugo shouted excitedly, then crossed his arms triumphantly.", "“For the record, I’m taking the middle. That’s decided. No matter what.”", "“…Go ahead.”", "Seol Jihu nodded his head, signaling that he didn’t care. Seeing this, Hugo blinked his eyes and spoke awkwardly.", "“Um… Seol.”", "“Yes?”", "“Are you worried about something? Or did something happen?”", "“No, I just have a lot to think about. It’s nothing, really.”", "Hugo smacked his lips. With Seol Jihu saying it was nothing, he could only accept his words at face value.", "On the entire way back home, Seol Jihu barely said a word. He spent most of his time staring dazedly into the air, and his expression didn’t change much either.", "Although he immediately responded when someone initiated a conversation, there was a huge difference compared to when he would smile brightly and make jokes or pull pranks.", "One could say that the atmosphere around him changed.", "“Sorry for making you worry. I’m really fine.”", "Although he put it in a nice way, he was essentially shooing them away, saying he wanted to be alone. Even Hugo was able to take the hint.", "“Mmm….”", "Hugo turned around with a disappointed face.", "Time passed and the camp out began.", "As there were seven members in the group, one person had to stand as a night watch alone. While everyone wanted to become paired up with Seo Yuhui, Seol Jihu volunteered to stand watch alone.", "One benefit was being the first to stand watch, but the bigger reason was that he wanted to think without disturbance.", "Silent night.", "Seol Jihu stared fixedly into the air again. Although he might look this way to an outsider, in truth, he was staring at his Status Window.", "To be exact, he was thinking about his Nine Eyes.", "[Your Innate Ability, ‘Nine Eyes’, is evolving.]", "[The right direction (1) of your Innate Ability - Nine Eyes, Blue color: Choice of Destiny, has been unlocked.]", "The first direction of the right side - Choice of Destiny.", "He couldn’t grasp what it meant at all. No, the meaning was too ambiguous.", "Looking back, it was the same when the Golden Commandment was unlocked.", "Although he could directly look into it just as he had always done….", "[You. Never forget.]", "[The decision you made today…!]", "Ira’s voice was still echoing in his ears.", "It wasn’t just anyone who said these words. When spoken by a god, the word ‘never’ carried a much heavier weight.", "He couldn’t help but think there was some greater meaning behind the advice to not take the right direction lightly.", "And when he remembered Gula saying ‘he isn’t ready’ and vehemently trying to stop Ira, he became convinced.", "It wasn’t as if he wasn’t given any hint.", "Of course, it was only a theory, one that he currently had no way of proving. But the same thought had crossed his mind when he went to provoke the Medusa in Arden Valley.", "That the Nine Eyes were related to the Future Vision in some way.", "[Your Innate Ability, ‘Future Vision’, responds to the awakening of a new ability!]", "Otherwise, this message wouldn’t have appeared during the first awakening of the Nine Eyes.", "Furthermore, through the Banquet, he experienced what he could consider the evidence. This was what he could deduce so far.", "Just like how the left and lower directions were connected, the right direction’s Choice of Destiny and the upper direction’s Golden Commandment were related. The left and right sides were also related to ‘choice’. There were simply too many questions he didn’t have the answers to.", "But what could he do? The Nine Eyes, as an ability, was extremely unkind as it didn’t give detailed explanations.", "When Seol Jihu flicked his cigarette away, sparks of ember swayed in the air. Seol Jihu pulled his legs in. Wrapping his arms around them, he stared at the campfire endlessly.", "As the fire burned vigorously, Oh Rahee’s face suddenly popped up in his mind. Then, Lara Wolff, the white headband girl, the burly man, Audrey Basler, and Slick Hair flashed by.", "The same went for the man and woman duo.", "Seol Jihu stared at the duo’s contorted faces inside the wavering flames.", "“Why did you have to kill?”", "His subdued voice….", "“Why couldn’t you just go to the portal? You wouldn’t have been summoned to Stage 3.”", "…was frighteningly calm.", "Not a single emotion could be felt.", "“Was it really worth it…?”", "Even though he knew he was seeing a hallucination, he continued to talk.", "All the way until the duo’s faces disappeared.", "Glaring at the campfire, Seol Jihu took out a new cigarette. His gaze slowly fell down and stopped at his hand that was searching for the lighter.", "Until the Banquet, he had never killed a human being. There were times when he had left people to die when he could have saved them. But he had never killed anyone personally.", "And in Stage 3, he experienced his first murder.", "Seol Jihu looked at his hand with an indifferent look.", "The hand didn’t look any different than usual. It wasn’t shaking, he wasn’t paying attention to it subconsciously, and he wasn’t having nightmares either.", "He had killed them because they did something to deserve it. Besides, this was something Seol Jihu expected to experience eventually.", "Even if he tried to imbue some sort of meaning into this experience, this was all he felt. And that was what made him feel uncomfortable.", "It didn’t make sense from a common-sense standpoint.", "A twenty-six-year-old who didn’t even know the ‘mur’ from ‘murder’ was fine after killing two people?", "The feeling of slicing the woman’s neck was still vivid in his mind. The same went for piercing the struggling man’s stomach and skewering him to the wall.", "Yet, he really was fine.", "A sudden thought popped up in his head.", "Seol Jihu had thought that the future was changing, even by a little, insignificant amount. He still believed this now.", "But what about ‘me’?", "Was I also changing along with the changing future?", "Or was I moving toward the same direction Future Vision showed me?", "He couldn’t make a hasty conclusion. But if he treated this uncomfortableness as something insignificant, he felt it would be the latter.", "The moment he acknowledged and accepted this numbness, he felt like he would become the monster he saw in his dream— the one who rampaged in battlefields like a demon and enjoyed drenching himself in blood.", "If he were to change like that, should he be happy? Or should he be wary?", "Seol Jihu closed his eyes in deep thought.", "That was his ‘first’ murder.", "He had even killed two people.", "They must have had their own lives. Perhaps, they had made that extreme decision due to being unable to overcome a wall they were facing.", "“….”", "Seol Jihu buried his face between his knees.", "He had really hoped… that he would at least feel a tinge of guilt."]}