{"cid": "313", "title": "Chapter 313. The Eve (2)", "content": ["[The time is nigh.]", "A vigorous voice solemnly resounded in the grand hall.", "[Soon, the Star will leave the Middle World.]", "Speaking with a slightly flushed voice, the Parasite Queen spread out her bone wings. The tips of her wings shook faintly. It was a sign of excitement.", "[Listen, all.]", "Then, just as the Parasite Queen reached out towards the Army Commanders and was about to say something—", "“Pardon me, my generous Queen.”", "A subdued voice cut her off. At that moment, Unsightly Humility, Vulgar Chastity, Abhorrent Charity, and Exploding Patience all turned their gazes in shock.", "Then, they were shocked once again after seeing a young man looking up directly at the queen.", "Cutting off the Supreme Queen’s words? This was something unthinkable for the four Army Commanders, who received the divinity of the Seven Virtues and became the Queen’s servants.", "“There is something I am dying to know. May I?”", "Only Twisted Kindness raised his eyes slightly and glanced at the talking man.", "“How insolent!”", "A dignified voice cut in. Though the owner of this voice looked like a refined noblewoman, the shroud of the deceased draped over her caused her to give off a bleak aura.", "It was Exploding Patience.", "“Queen, I beg for your forgiveness instead. Please excuse that inferior race’s insolence.”", "Afraid of the Queen’s wrath that would soon descend, the Banshee’s voice echoed out in the grand hall.", "But the Queen’s reaction was even more surprising. She would have normally chastised a Commander’s impertinence while exuding a frightening killing intent.", "[Speak.]", "But this time, she went beyond allowing it and smiled.", "[What intrigues you so much?]", "She was like a mother watching her cute newborn.", "While Exploding Patience shook from shock, Sung Shihyun grinned.", "“I’ve had this question even when I was a human.”", "[Go ahead. Say it. I am curious as well.]", "Sung Shihyun cut to the chase at the Queen’s urging.", "“What is the reason you are so obsessed with it?”", "[Obsessed?]", "“Tigol Fortress, I mean. I’ve seen it a few times myself, and that place is no joke.”", "[And? So what?]", "The Parasite Queen nodded.", "“Eii, it’s not exactly, ‘so what?’”", "[Keuk. I see. You want to know why we are so focused on attacking Tigol Fortress when there are other places we can strike.]", "“Exactly. It’s true that Tigol Fortress needs to be brought down, but you can do that later too. If I may be blunt, if you had cast the Federation aside and instead focused on attacking humanity, the Seven Kingdoms would have fallen long ago. Though, I admit that I’m being result-oriented.”", "[Indeed, you are. Why do you ask when you already know so well?]", "“I take it that means there is something I do not understand?”", "“Why don’t you stop there?”", "The moment Sung Shihyun’s question ended, Exploding Patience cut in calmly.", "“Really, humans are a race with no semblance of manners. Clueless vermin, when it comes to this matter, no one knows better than our Queen.”", "Sung Shihyun turned his gaze. He glared at the Banshee dressed like a noblewoman with a slightly annoyed look.", "“Not very patient, are you? What a waste of your title!”", "Exploding Patience snorted at Sung Shihyun’s mockery.", "“Funny you say that. I am being more than patient right now. If it wasn’t for the fact that we are in the countenance of our Queen, I would have taught you a lesson long ago.”", "“Oh yeah?”", "Sung Shihyun got up resolutely. When he turned to the side and grabbed the hilt of his sword, the unsuspecting Commanders couldn’t hide their shock.", "Sung Shihyun was clearly asking for a fight.", "In front of the Queen, no less.", "“Queen.”", "Sung Shihyun opened his mouth.", "“You should know the direct reason I betrayed humanity.”", "[I do.]", "“Then you must understand what I am about to do. Isn’t that right, my generous Queen?”", "Hearing his arrogant tone, the Parasite Queen laughed out loud.", "[Indeed, my children were not particularly fond of you joining me. Especially Exploding Patience, whom you defeated in battle once before.]", "“Since we are about to go to war, I will refrain from causing her demise. I will stop at just teaching her a lesson.”", "[Fufu, you are looking down on the Banshee Queen too much. Did you forget you still cannot control your power properly?]", "“I will know whether she deserves to be respected or looked down upon when I tear off that damned shroud of hers. I’ve been curious, actually, about the sound this cranky bitch makes in bed.”", "The noblewoman’s face reddened at the man’s sexually degrading remark. It was as if she would explode at any moment.", "[Determining the pecking order, eh? I agree it wouldn’t be a bad idea.]", "The Parasite Queen languidly rested her chin on her hand.", "[But you’ve yet to hear my reply, no?]", "Hearing this, Sung Shihyun pushed his half-unsheathed sword back in.", "“I guess this isn’t the best place. Anyway, I’ll accept that you’ve allowed it.”", "He smiled beamingly, then went back on his knee.", "[My reply to your question is simple.]", "The Parasite Queen’s voice rang out.", "[The reason I am so obsessed with Tigol Fortress— it is because Tigol Fortress is the final turning point.]", "“Final turning point?”", "[A turning point refers to the crossroad we must pass through to arrive at the ultimate future I envision.]", "“I didn’t know my Queen enjoyed being cryptic like Gula… I mean, can’t you just say, ‘We have to attack Tigol Fortress because of X reason’? That would make it so much easier to understand.”", "[If that is what you want, I will lower myself to your level and ask. What is the greatest resistance that the Federation and humanity can pull off in the current situation?]", "“That’s…”", "Sung Shihyun replied after mulling over the question.", "“Revitalizing the Spirit Realm and reviving the World Tree. And I guess the Federation and humanity joining hands?”", "[Then suppose all of those things came true. Do you think that will be enough to overturn the tide of this war?]", "Sung Shihyun tilted his head.", "“Well… the war might last a little longer and become more annoying… but I don’t think we would be at a disadvantage or even lose. As long as I can fully control this power, that is.”", "[You are correct. As a matter of fact, you could say we are looking at victory square in the face.]", "“That’s what I’m saying. Then why—”", "[That is, if we can get rid of one obstacle.]", "Hearing this, Sung Shihyun’s expression waned.", "“Obstacle?”", "[I am talking about a Star. One that shines brighter than any other.]", "The Parasite Queen spoke calmly before tilting her head up. She gazed up as if to look at the countless stars shining around the planet.", "After a moment of silence—", "[Countless Stars exist in the universe. Not just in Paradise, but in any galaxy.]", "The Parasite Queen continued her words.", "[A vast majority of Stars are born with a certain fate. These Stars generally cannot escape the destiny that has been chosen for them.]", "Most Stars advanced toward their predetermined fate. So, if a being capable of moving the constellations manipulated their course, they would have no choice but to be sucked into that future.", "[But.]", "At this moment, the Parasite Queen foreshadowed a twist.", "[There are a small minority of Stars that are capable of pioneering their own fate.]", "Stars that were unmoved by external manipulation, that could paint their future with their willpower, certainly existed.", "[And very rarely among them are Stars that can make other Stars evolve.]", "Going beyond themselves, there were also Stars that could attract nearby Stars to their own orbits and cause them to change their course.", "[…I.]", "The Parasite Queen’s voice trembled.", "[I was and still am, afraid of that Star.]", "The grand hall turned clamorous. No one expected the Queen to admit she was afraid.", "Only Unsightly Humility kept his head low, not moving an inch.", "[Looking back, it was only a dead Star. Yet, bothered by a humiliating memory of the past, I ended up committing a huge mistake.]", "“By mistake, you mean—”", "[Sending three of the Seven Armies to eliminate that Star.]", "Sung Shihyun was about to ask, ‘If you’re that afraid, can’t you just destroy that Star?’ But when he heard what the Parasite Queen said, he was forced to shut his mouth.", "‘It doesn’t make sense.’", "A part of him was still in doubt. The hell-bent Queen sent three armies headed by Undying Diligence, yet the Star withstood it?", "It just didn’t make sense. Never mind a single Star, a force of such scale should have threatened the downfall of humanity itself.", "[That was an absolutely inexcusable mistake. All I had to do was ignore it and continue walking on my path.]", "The Parasite Queen lamented with a sigh.", "But who could blame her? Her hasty choice was what caused the dead Star to regain its light.", "It was easy to see just by looking at the current movement of the stars. Many paths leading to the Parasite Queen’s desired future closed; on the flip side, many paths leading to the Federation and humanity’s desired future opened up.", "Still— the tide had yet to turn.", "Although the Parasite Queen squandered much of what she built up, the future that she desired was still alive.", "But what if something similar to the previous mistake happened again?", "Then, not even the Parasite Queen could guarantee what would happen. But, at the very least, it was clear that a large, frightening change would occur.", "And so the Parasite Queen finally realized — this Star could not be touched carelessly.", "A half-hearted hardship would only encourage the Star’s growth. The best course of action was to carry on without stimulating the Star as much as possible.", "[That is why we need to capture Tigol Fortress.]", "Tigol Fortress, the final turning point, the final step that must be taken before the Parasite Queen could reach her desired future.", "“Aha.”", "Sung Shihyun spoke.", "“So when you said that the Star will leave the Middle World…”", "He nodded his head and continued.", "“You meant you would strike Tigol Fortress while he is not in this world.”", "[Indeed.]", "The Queen finally gave a satisfied smile.", "[The moment Tigol Fortress falls, the fate of the Federation and humanity will be set in stone. The world will head toward the future I want. So this must be done during the time the Star is away.]", "The future would fully open up once the final hurdle was overcome. From that moment onward, the Parasites’ fate would embark on a swift current.", "[Even the salmons swimming upstream cannot change the flow of water.]", "The Parasite Queen spoke with strength.", "[No matter how bright a Star shines, it is, in the end, a mere Star. As long as the course of this planet is determined, no matter how much it struggles, it will only be swept away when it exhausts its energy.]", "“…I understand.”", "Sung Shihyun shrugged.", "“Well, I wasn’t really opposed to the upcoming battle or anything. I was simply curious. As for me, I’ll just sit back and enjoy the show.”", "[Yes, it is still too early for you to head into battle. I will command you when you have gotten used to your power and can control it.]", "“I can still go watch, right?”", "[As long as you remember what I said.]", "After giving her approval, the Parasite Queen got up from the throne.", "[Listen, all!]", "The Army Commanders all lowered their heads.", "[As I am sure you all heard, this war will be a battle of time.]", "[The moment the Star makes its move will be the time we make ours.]", "[And that time is quickly approaching.]", "[Assemble your forces! While the Star is away, do everything in your power to topple Tigol Fortress!]", "All-out war was declared. The Parasites, laying low after the defeat at Arden Valley, finally awoke from their slumber.", "The Army Commanders responded to the Queen and got up simultaneously.", "At that moment, the Queen called out to one Commander.", "[You remain here.]", "“Me, Your Majesty?”", "Twisted Kindness, whose name was called, asked back.", "[Yes. There is something I must say to you separately.]", "Once the other five Army Commanders tactfully left, Twisted Kindness tilted his head.", "“Hnng. I sincerely hope you will not give me a boring command, like attacking humans to bind their feet.”", "Other than Sung Shihyun, Twisted Kindness was the only Army Commander to have fully absorbed the Seven Virtue’s divinity.", "Hearing the Last Dragon’s grumblings, the Queen smiled.", "[Do not worry. That is something that must be done as well, but what I will task you with is another matter. I am sure it will catch your interest.]", "“Hoh. You emphasized the vital importance of Tigol Fortress. You are telling me there is a matter of even greater importance?”", "[It can’t be helped. This is because of another Star.]", "The Parasite Queen sounded reluctant as well.", "“Oho, another Star. By that, you must mean—”", "[The Star of Lust.]", "Twisted Kindness’ eyes lit up.", "The Parasite Queen looked up at the ceiling once again, gazing at the Star she feared the most.", "Although the light it was giving off was still insignificant, she did not dare to let down her guard. Because looking at it from a different perspective, the Star had achieved this much with only such insignificant light.", "She must not make the same mistake twice.", "Clenching her fists, she focused entirely at the center of the massive colony of Stars.", "[His recent activities have caught my attention in a bad way.]", "“I’m intrigued. So, what is it that you would like me to do?”", "[It would be a different story if Undying Diligence was here. The other children are not enough to assure me. I can only trust you to take care of this matter.]", "The Parasite Queen turned her gaze back down and continued.", "[From now on, you will…]", "Because of it, she failed to see.", "That hidden behind the Star she feared the most, a small Star radiating a cold chill was starting to blaze quietly.", "*", "Same time.", "Eun Yuri was face to face with Roselle.", "“Miss Eun Yuri…”", "Though it was unclear what they talked about, Roselle was staring with a slightly dumbstruck face.", "“Teacher.”", "Eun Yuri called Roselle with a sense of urgency in her voice.", "“Do you think it’s possible?”", "Roselle’s rapid blinks only lasted a moment.", "“To summarize…”", "She licked her lips and continued.", "“Borrowing the pathway used by the World Tree’s avatar to manifest itself, connecting the Spirit Realm to the Middle World, and materializing the Dream World in reality.”", "Roselle spoke calmly as she slowly lowered her arm holding a teacup with half-finished tea.", "“…You want to materialize a space that transcends the Astral World where two worlds simply overlap, a space that even I cannot understand and guarantee…”", "Clunk. As the sound of her teacup touching the saucer rang out—", "“Oh my.”", "The corners of Roselle’s mouth curled up.", "“Miss Eun Yuri, you’ve come up with quite an interesting idea.”"]}