{"cid": "387", "title": "Chapter 387. Mockumentary (3)", "content": ["It was then.", "Woong!", "With a short ringing sound, a faint barrier was cast around the room.", "It was similar to the one Seol Jihu saw at the temple.", "“How can I not come when the Hero of Paradise is calling me?”", "A voice was heard from the room where only Seol Jihu was standing.", "“I wasn’t sure what to think when I first got the message from Delphine. That Valhalla’s representative will call soon and that I should pick up the call in an isolated place.”", "The voice sounded a bit brusque.", "Soon, a young man slowly appeared from the table in the center of the room.", "An indigo Magician’s robe, a thick book resembling a dictionary in his left hand, and a pair of emotionless pupils behind gold-rimmed glasses…", "“And when you asked me to come to Valhalla in secret, I instantly thought, ‘Ah, this man is about to start something.’”", "Philip Muller appeared out of thin air and spoke as he quietly flipped through a page.", "Seol Jihu smiled.", "If the Star of Avarice was visiting officially, Kim Hannah would have told him about it in advance.", "However, he had heard nothing of the sort from her.", "Because she didn’t know Philip Muller would be visiting.", "“I knew you would be able to get in here without being found out.”", "“I almost got caught, actually.”", "Philip Muller spoke without taking his eyes off his book.", "“Eh? You almost got caught?”", "Seol Jihu’s eyes widened.", "“Since I’ve been here once before, it wasn’t difficult to set the coordinates correctly. But when I tried to teleport, mana flooded in from this building, trying to hinder my spell… I would have been found out if I was even a few seconds late.”", "“From the building…? That means…”", "“Eun Yuri, was it? It should be her, one of the Magician Trio who’s been hanging out with Delphine recently. Anyway, she must have sensed something because she scattered her mana around every nook and cranny of the building.”", "Philip Muller smirked.", "“What a cheeky girl. A Magician, who’s not even a High Ranker, trying to compete against a Unique Ranker who’s an apostle of god…”", "“So something like that happened… Maybe I should have let Miss Eun Yuri know.”", "“No, it was unexpected for me too. And to be honest — it was fun. I don’t know about you Warriors, but we Magicians have our own fights. Thanks to her, my blood started boiling after a long time.”", "Philip Muller’s voice carried a subtle pride. It seemed he considered this ‘fight’ a victory since he managed to teleport in without being discovered.", "“Anyway, a Magician of her caliber should have a different way of thinking than most people. From what Delphine’s told me, she’s pursuing the limits of the Path of Mana. If given the chance, I’d love to meet and discuss theories with her.”", "Given Philip Muller’s personality, it was rare to see him show so much interest in someone.", "Seol Jihu’s expression turned odd.", "“Should I arrange a meeting between you two? I can lend a hand if you want.”", "“I’m trying to discuss theories, not romance.”", "He refused firmly.", "“I’d love to meet her as a Magician, but she seems like a dangerous woman to be involved with as a man. You better be careful too.”", "“What’s wrong with Miss Eun Yuri?”", "“She must have been annoyed that I didn’t fall for the trap, so she started searching through the entire city like a crazy woman. It really wasn’t something to react so badly for… It was like she was chasing after me with a knife.”", "Philip murmured the last sentence.", "“Plus, I have a wife. If I want to live a long life, I have to be careful.”", "“Eh? You’re married?”", "“You didn’t know? My Servant is my wife. We didn’t register for marriage or anything, but we’ve been living together for five years in Paradise, so we’re practically a married couple.”", "Philip Muller snorted as he pushed his glasses up. He looked like he didn’t know why he had to explain all this.", "“Anyway, let’s quit the small talk and cut to the chase.”", "“Got it.”", "Seol Jihu walked toward the desk. Knowing Philip Muller’s personality, he started talking as soon as he sat down on the opposite side.", "“There are Paradisians and Earthlings within humanity’s camp that are communicating with the Parasites.”", "Philip Muller flinched.", "Seol Jihu crossed his legs and placed his interlocked fingers on his knee.", "“I’d like to ask for Mister Muller’s opinion regarding this matter.”", "Only now did Philip Muller take his eyes off his book. He stared at Seol Jihu with a subdued gaze.", "“I’m not sure why you’re asking me all of a sudden, but…”", "He stared for some time before slowly retorting.", "“I’ll give my answer first. I don’t think there are traitors within humanity’s camp.”", "Seol Jihu widened his eyes at the unexpected response.", "“I thought for sure that you’d agree… Can I ask why you think so?”", "“I thought so too originally with 90 percent certainty. But I changed my mind after the Arden Valley War.”", "“?”", "“Think about the condition that Undying Diligence put forth after he and the Parasite Army arrived at the valley.”", "Seol Jihu slowly searched through his memories.", "It was something that happened almost ten years ago, but the memory quickly came back with how shocking it was.", "[Amongst you should be a human who recently began to make a name for himself.]", "[If you hand over that person… we will go back quietly. I shall promise with my name.]", "Once Seol Jihu shut his mouth, Philip Muller started talking again.", "“Undying Diligence was talking about you. The Valley War, the Delphinion Laboratory Incident, the Banquet… you were the only one who started making a name for himself back then.”", "Seol Jihu nodded his head, and Philip Muller continued.", "“The thing to note is that Undying Diligence did not know your name. It’s hard to believe the Parasites didn’t care when they went so far as to bring three of their armies to battle, and it also doesn’t make sense that they would say something like that if they already knew. It’s not like it was difficult to distinguish you, so why didn’t they know?”", "Seol Jihu understood what Philip Muller was getting at. If there were traitors amidst humanity’s camp, there was no way the Parasites wouldn’t have known this information. After all, with how easy it was to characterize him, the traitors would have revealed his name.", "“So it’s highly likely that there were no traitors at the time that were directly communicating with the Parasites. But—”", "At that moment, Philip Muller came in with a huge ‘but’.", "“Whether it be the past or present, I do believe there are Earthlings or Paradisians that are trying to defect to the Parasites. This, I’m sure of.”", "Meaning, there were people who were willing to betray humanity if given the opportunity.", "The immature, young Seol Jihu wouldn’t have understood why.", "He would have angrily yelled asking how Earthlings could do something that directly went against their duty.", "But he was different now.", "Seol Jihu easily acknowledged what Philip Muller said and smiled.", "“I guess there are people trying to flatter the winning side no matter where you go.”", "“People trying to flatter the winning side… That’s a good way to put it.”", "Philip Muller laughed blandly before turning serious again.", "“The problem is that Paradise isn’t a sporting event that you pay a fee to enter.”", "“Yes, it’s a deathmatch that doesn’t stop until one side perishes completely.”", "“Exactly. To be honest, most Earthlings are probably hoping the status quo continues. Parasites leaving humanity alone and only fighting with the Federation, and the Federation barely hanging on.”", "Because only then would Paradise continue to need Earthlings.", "“But there is no way this status quo will go on forever. In fact, if it wasn’t for you, it would have changed long ago. Arden Valley would have been taken over; Haramark, which serves as the outpost of humanity, would have been conquered by mass-produced mutant orcs; and Eva would probably be hanging on by a thread… Humanity would have been counting down to their doom.”", "Philip Muller said after a short pause.", "“Thankfully, things aren’t so bad right now. But… in the end, Earthlings will have to make a decision one day. To fight, to escape to Earth, or…”", "“Jump to the Parasites’ side and continue their activities in Paradise.”", "As Seol Jihu finished the sentence, Philip Muller nodded his head. He then crossed his arms as if he said everything he had to say.", "Now, it was time to reveal the reason he asked. Seol Jihu organized his thoughts before starting.", "“When I moved from Haramark to Eva… I made three vows.”", "Seol Jihu’s voice was low and calm.", "“The first was to clean up the deeply-rooted corruption inside Eva. The second was to improve humanity’s relationship with the Federation. And the third… was to change humanity.”", "Philip Muller listened to Seol Jihu quietly.", "“At present, I can confidently say the first and second goals have been met. But I haven’t achieved the third goal yet.”", "“….”", "“To tell you the truth, at first, I thought things would change if I just worked hard to set an example for others. But that was the wrong expectation to have. Humanity has never had a proper fight with the Parasites, yet they were more afraid than they needed to be. This perception hasn’t changed even though we won the last battle.”", "“It can’t be helped. It’s true that the Parasites are a powerful enemy.”", "Philip Muller sighed.", "“It’s true that we won the last battle as you said, but anyone with some thought would know not to be so optimistic about the future course of the war. In fact, they would be pessimistic.”", "“I think so too. We could only push them back in Tigol Fortress where we had an overwhelming advantage. And something like that won’t happen ever again.”", "“The people looking for an opportunity to defect probably don’t think well of you. Because the Parasites will pay more attention to humanity with how much you’ve busted them up.”", "“That’s the point.”", "Seol Jihu’s voice grew slightly louder.", "“As you said, Earthlings will have to make a decision one day. That day may not have come yet, but I’m sure everyone feels that it’s closer than ever before.”", "“And?”", "“So wouldn’t there be more antsy traitors as well?”", "Philip Muller furrowed his brows like he didn’t understand.", "“What are you trying to get at?”", "“Mm, going back a little bit.”", "Seol Jihu cleared his throat, thinking that a more detailed explanation was needed.", "“The Parasite Queen has left humanity alone all this time. Compared to how they’ve dealt with the Federation, they’ve practically been ignoring humanity. But if you take a closer look, that isn’t necessarily the case.”", "Seol Jihu stretched out his arm.", "Chwak! A pile of records flew into his hand.", "“Master Ian personally compiled these records. Try giving them a read.”", "Seol Jihu handed the pile over.", "Soon, Philip Muller’s eyes slowly widened as he flipped through the pages.", "He could see many familiar names.", "Al Zahra, Alvaro Skroke, Eleanor Luna, Joshua Claflin… They were all Earthlings who were once renowned in Paradise. The important thing was that they were no longer in Paradise.", "“Of course, I’m sure some of those incidents were caused by the conflict between Earthlings. But—”", "“There are incidents that the Parasites had a hand in.”", "“Yes. And if you focus on that, you’ll see something in common that’s very interesting.”", "Seol Jihu spoke.", "“The Parasite Queen hasn’t been ignoring humanity. She understood Earthlings better than anyone else, and she acted accordingly, throwing hints to incite certain situations.”", "“Explain.”", "“Could it be that there was no one more outstanding than me among the countless Earthlings that came to Paradise? No, I don’t think so. But the problem is this. Whenever a hero appears and tries to do something, the Parasite Queen would appear.”", "“….”", "“And she quickly dispatched the hero. Whether it be killing them like with Joshua Claflin, corrupting them and forcing them to defect like with Marika Larisa, or coaxing them to join like with Sung Shihyun.”", "Right, the Parasites hadn’t neglected humanity.", "“It wasn’t that the first ranked didn’t care about the third ranked. Rather, they simply devised a situation so that they didn’t need to care.”", "The Parasites had carefully controlled the situation so that they would interfere only when it was absolutely necessary.", "“…I understand what you’re saying.”", "Philip Muller asked calmly.", "“But what did you mean by the Parasite Queen throwing hints?”", "“As I said, the Parasite Queen understands Earthlings well.”", "Seol Jihu spoke clearly.", "“Let’s try to put ourselves in their shoes.”", "“Whose shoes?”", "“The ones who are happy to defect to the Parasites’ side given the chance but haven’t entered the Parasite Queen’s eyes.”", "Seol Jihu continued.", "“The Parasite queen is extremely aloof and arrogant. Even High Rankers might not necessarily catch her attention.”", "The day to make a decision was coming closer by the minute. Humanity could no longer wish for things to stay the same. In this situation when humanity might be the next target of the Parasites…", "“The would-be traitors have been forced into a spot where they need to quickly prove their worth to the Parasite Queen.”", "Philip Muller’s eyes narrowed.", "“And what would be the best way for them to prove their worth?”", "His expression was ambiguous like he was on the verge of fully grasping the big picture.", "Seol Jihu threw another hint.", "“For example, what if there’s a human who’s become an eyesore to the Parasites, but the Federation and humanity puts him on a high pedestal and treats him as a hero? But if you take a closer look at the things he’s done, he’s only a lucky High Ranker who’s relied on miracles to seemingly get through perilous situations?”", "“…You.”", "Philip Muller’s eyes finally widened like giant bells.", "“Don’t tell me.”", "As the other side finally seemed to have gotten a grip on the situation, Seol Jihu slowly got up from his seat.", "“That’s why I called you, Mister Muller. I wanted to take this opportunity and make an offer.”", "He walked around the table in a relaxed manner, and…", "“By any chance—”", "He finally revealed the reason he called him here today.", "“Do you want to make a movie with me?”", "“…A movie, you say.”", "Philip Muller muttered dazedly.", "Though it might seem random, he wasn’t so foolish as to not understand the hidden meaning.", "“You want me to appear in it?”", "“No. Yuhui Noona and I will be the leading actors, and I already have the other main cast in mind. Actually, he came to me personally, begging to participate in the movie.”", "Seol Jihu stopped and placed his hand over his mouth.", "Looking at the giggling Seol Jihu, Philip Muller swallowed his saliva, feeling unfamiliar with this side of him.", "“Then what do you need me for?”", "“I’d like you to be the director. The cinematographer, to be precise.”", "“…Hmm, I appreciate you seeing me in such high regard, but I’m a very expensive man.”", "Philip Muller inhaled unwittingly.", "“Don’t worry. The movie will rake in huge profits. It’ll be our joint production.”", "“How much are you expecting?”", "“Well—”", "Seol Jihu winked.", "“If cleaning up the would-be traitors within humanity goes well, I plan to make a sequel right away. The expected profit for that, I guess, is the change within humanity.”", "Philip Muller closed his eyes.", "“…Aren’t you being overly ambitious with that estimation?”", "“Am I?”", "“It’s so high that it seems unrealistic.”", "Despite saying this, Philip Muller’s expression was a sight to behold.", "The corners of his eyes were twitching, and his lips were trembling. It was easy to see how excited he was.", "Seol Jihu expected this reaction.", "After all…", "[What was I supposed to do when we were attacked from both the inside and outside?]", "[Didn’t I warn you in advance?]", "[I thought they were all wiped out. Who would have known that so many people would only be the tip of the iceberg?]", "[You didn’t even bother listening when the former Star of Avarice yelled it at you, word by word. Serves you right.]", "When he saw Yun Seohui with the Nine Eyes, the conversation she had with his past self showed that Philip Muller was interested in this problem.", "“Regarding how realistic it is, why don’t you decide after seeing the script?”", "Seol Jihu shrugged.", "“Of course. Cinematographer? If this movie is worth investing in, I don’t see why not.”", "Philip Muller knew too.", "Seol Jihu said the other main cast came to find him personally. This meant that all of this wasn’t just a guess and that the opposing side had made a move.", "If so, there really couldn’t be a better opportunity to strike.", "Of course, Philip Muller naturally had some doubts, but the man in front of him was a famous leading actor who had already given multiple successful hits.", "The success of this movie was practically guaranteed.", "“…Ah.”", "Philip Muller opened his eyes after collecting his breath.", "“Before speaking about any investment, there’s something I’d like to know as the potential cinematographer.”", "He asked as if he just thought of this.", "“What genre will this movie be? Action? Thriller? Dramatic twists?”", "“Mm.”", "Seol Jihu stopped walking and blinked a couple of times.", "“Since we’ll be mixing in plenty of bait and deception…”", "After a short deliberation, he put his hands into his pockets and grinned.", "“Mockumentary. Let’s go with a mockumentary.”"]}