{"cid": "321", "title": "Chapter 321. Simultaneous Outbreak of War (2)", "content": ["Tigol Fortress.", "It was a mighty stronghold built at a vantage point in the Hiral Mountain Range with mountains on all four sides. Established on a rugged terrain several hundred meters above sea level, it truly was a fortress blessed with natural defensive barriers.", "Not only did its geographical placement make it a reliable base for defending the road that led to the heart of the Federation, but it also served as a strategic location for protecting the border between the Federation and humanity.", "Realizing the importance of this location early on, the chief of the Fallen Angels, Gabriel, integrated her knowledge from another world with the dwarves’ excellent craftsmanship and the Spirits of the Sky Fairies to build the walls of the fortress through blood and sweat.", "As much as it was called the last bastion of the Federation, most people felt the same feeling when first standing in front of the fortress.", "Anyone that entered through its magnificent entranceway, which stood like an impregnable gate at the bottom of the cliff, and slowly walked up to the top would be able to see giant statues holding sharpened spears and swords carved into the sides of the cliff.", "When they arrived at the end, they would be confronted with the fortress rampart which stretched along the terrain as far as the eye could see like an endless highway.", "And once there, most people would fall into terror at the majestic and fear-striking sight of the upright fortress towering over them on a highland with flowing clouds, just like that of a painting.", "If one actually tried looking up from below the fortress, the person would be exhausted from just following up the cliff with their eyes, feeling it firsthand for themselves what ‘impregnable’ truly meant.", "However, it was inevitable for amazing things to become familiar and new things to become worn-out. Such was the natural order of the world.", "The mountains that surrounded Tigol Fortress used to boast a dark green color full of vitality, but now everything was dyed crimson on a background of gray, making them look ominous.", "The dark red stains that persisted on them through many years were evidence of just how long a violent war had been taking place in this location.", "It was the same for Tigol Fortress itself.", "There were so many scars of war on the fortress that it was shameful for it to have once been called the ‘Tomb of the Corpse Army’.", "It wasn’t only because of the long war.", "At any rate, it was a stronghold that had fallen once. The Federation managed to succeed in recapturing it in the end, but there was no way that the Parasites obediently retreated after their loss.", "The Parasites enacted all kinds of brutal and wicked atrocities on the fortress, causing it to lose its once hoary color. And with it, its longstanding prestige was extinguished, just like the shriveled up dead tree at the center of the stronghold.", "Of course, the Federation had restored the fortress to a certain extent after reclaiming it, but the fixes were only superficial.", "No matter how imposing its exterior looked, as long as the World Tree remained dead, the fact that the fortress was only a hollow shell of its former self was something that both the Federation and the Parasites knew.", "Perhaps it was because of this that a negative atmosphere was flowing within the stronghold.", "It was unknown whether the anxiety within the fortress had an effect or not, but even the sky above it was blotted with dark clouds. Thanks to that, the weather couldn’t get any more depressing.", "The Sky Fairies were aiming their notched bows forward, every single one of them with wide eyes filled with fear that couldn’t be described with words.", "The Cave Fairies that were cursed by the Elemental Spirits all had their eyes covered with cloth, but it went without saying that they too, were taut with anxiety, evident from how tightly they were gripping their weapons.", "That wasn’t all. The Dwarves were hard at work, making Thunders even at this very moment while the Beastmen had their claws raised and their fangs bared.", "All the Federation’s forces, including its elite troops, were gathered on the fortress in an attempt to defend it. This was undoubtedly a grand spectacle.", "However, there was an impossible-to-hide terror hanging in the atmosphere.", "They had no choice but to be afraid. There was an absolutely overwhelming sight unfolding before them beyond the ridge.", "It was a terrifying sight that easily dwarfed the majestic presence of Tigol Fortress.", "Corpse Armies, reproductive species, mother species, the Five Armies… and the figure of the Parasite Queen relaxed on her throne, reigning over the entire sky.", "The screen flickering with static signals made it apparent that it was only a projection of her, but just the appearance of the enemy leader subjected the Federation to tremendous pressure.", "\"…\"", "Gabriel, the chief of the Fallen Angels, looked up at the Parasite Queen, who was haughtily staring down at the fortress from the sky, and sighed quietly.", "Their morale had already hit rock-bottom as it was. With the projection of the Parasite Queen, who was caged on her Corrupted Throne, appearing before them, there was no more need to talk about their state.", "On the one hand, they could feel a strong will transmitted from the enemy— the will of the Parasite Queen to surely bring down Tigol Fortress again.", "She knew that she had to encourage her allies, but no words came out. They were faced with a war where defeat was as inevitable as fire, so she had no idea how to boost their morale.", "Gabriel stayed silent for a while before slightly raising her head and asking.", "\"Do we know anything about humanity’s movements?”", "Her question finally broke the long silence, but there was no reply.", "Gabriel let out a deep sigh.", "\"I know our communications have been cut because of the signal jamming. I’m asking about our most recent contact.”", "\"About that…\"", "A Fallen Angel, who stood near her opened his mouth to say something with difficulty but mumbled his words.", "\"What is it?\"", "Gabriel gave a tired smile.", "\"Did they say they won’t help us since it wasn’t their problem?”", "\"We’ve received news that a draft call was made in five kingdoms, but…”", "The Fallen Angel trailed off his words.", "She didn’t need to hear any further to infer that any further communications had been cut since Parasites arrived.", "\"A draft call, huh.\"", "Gabriel’s response was lukewarm.", "That was because she knew there was a very, very big difference between news of a draft call being made and the news of reinforcements being sent their way.", "Of course, there was a possibility that the royal families really did send their armies, but…", "'They won’t be enough.’", "They would be of some help against the Corpse Army, but the real help that the Federation needed was from the Earthlings. But whether the Earthlings that were practically without any order would obediently heed the draft call… Frankly speaking, Gabriel was skeptical.", "Furthermore, the problem was that even if the Earthlings came, their chances of victory were still unknown. The Parasite Queen seemed hellbent on conquering their fortress as it looked like she practically brought her entire force.", "The only solace was that Twisted Kindness, who was known to be unrivaled in one-on-one battles, was nowhere to be seen, but this didn’t comfort her at all.", "No matter how she looked at the situation, there was no hope, only despair.", "Gabriel muttered to herself while in deep distress.", "\"It would be nice if the Executors came…”", "\"It’ll be better if you don’t place your hopes on them.”", "Gabriel heard a husky voice that was mixed with a growl at that moment.", "It was a sturdy and muscular Beastman with a mane flowing from the lines on his face.", "\"When our home was taken over, those bastards only looked at us like they were looking at a blazing fire from across the river. Those bastards did nothing when the Executor who was coming to our aid with a small number of people was ambushed and killed. What are you expecting from these shameless bastards?”", "\"Well. I know how you feel about humanity as the King ruling over an entire race, but…”", "Gabriel let out a sigh. It was already her third time sighing.", "\"No matter what your story with them is, we can’t help but hope they will answer our call. We’re in a situation where every extra hand is vital.”", "“Ridiculous. You’ve always emphasized rationality before.”", "\"Still. Who knows?”", "Gabriel looked at that shriveled up tree before faintly laughing.", "\"That World Tree over there in a sorry state might just suddenly spring back to life.”", "\"Funny. Did you finally go crazy now that the enemy is right in front of us?”", "The Beastman snorted.", "\"Didn’t you believe that you should do your best in what you can instead of meaninglessly clinging to impossible tasks?”", "\"It’s because a human that went and accomplished one of those impossible tasks said he’d personally head out.”", "Gabriel retorted without showing any change in expression.", "In response, the Beastman suddenly shut his mouth.", "\"…Seol Jihu, was it?”", "The hero who killed the First Army Commander, the infamous vanguard of the Parasite Queen that struck terror throughout Paradise.", "The weight his name carried was certainly not light.", "\"Indeed. I’ve heard quite a bit of how he was a man of great ability, enough to make my ears buzz…”", "\"Yes. The Federation would be receiving an enormous boon if he really manages to revive the World Tree. How about it? Wouldn’t you be willing to put down your grudges with the humans and think about becoming allies with them then?”", "\"Hah. Let’s talk about this after we see the results.”", "The Beastman King snorted at the optimistic ‘what if’s’.", "\"The World Tree’s revival… hehe. If he truly manages to accomplish that, then I am willing to change my mind about the humans who accompany that person.”", "He didn’t completely turn down the suggestion. It was because he knew just how difficult the task was, which was to the point that even the Federation had given up on it.", "That was why if Seol Jihu really pulled it off…", "It was at that moment.", "Right when their words came to a lull, the projection of the Parasite Queen waved her hand in a wide arc.", "And following that, several hundreds of Nests could be seen settling down on the ground in organized droves and begin bulging their bodies.", "Gabriel’s eyebrows subtly knitted.", "The Nests simultaneously sent their roots down into the ground. It was the sign that signaled the Parasite’s attack.", "The infestation had begun.", "And sure enough.", "\"…They’re coming.\"", "The Corpse Army finally started to take action, just like the Beastman said.", "The small dots in the distances gradually became bigger while the surrounding slopes began to be filled with black figures.", "A sinister rumbling filled the surrounding air as they approached closer, moment by moment.", "They could feel their hair rising as the very ground beneath them began trembling even when they were standing on the fortress.", "\"…Damn it. Is this how it felt? I’m sorry, okay?”", "Gabriel muttered something incomprehensible before grinding her teeth.", "Even though they were in a dilemma of having to defend their base despite needing to quickly go out and get rid of the Nests, they couldn’t just sit there and do nothing.", "After barely managing to shake off the oppressive sensation, Gabriel shouted while looking at the dark wave that was sweeping all the mountains in their sight like a tsunami.", "\"All units!\"", "When she shouted at the top of her voice, the Sky Fairies raised their bows in unison.", "Underneath the arrowheads were stones that let off electric sparks. The Thunder attached to them trembled left and right as they emitted a blue light.", "\"Fire!\"", "With that word, a sharp wind swept through the whole area. A sonic boom was followed by a piercing shriek before a deafening thunderclap shook the entire world.", "*", "Meanwhile.", "Seol Jihu, who had thrown himself into the smoke hole, scrunched his face at the sharp pain on his chin.", "\"Ow ow ow ow….\"", "The moment he was about to get up while stroking his chin, he suddenly felt another strong impact on his back.", "When he shouted in pain and looked behind him, he could see Phi Sora, who was treating him as a cushion with her eyes tightly closed.", "When she peeked her eyes open, she realized the situation and quickly got off him.", "\"I-I’m sorry.”", "\"No, it’s fine. More importantly…”", "Looking around, he found the members that entered the hole in the second round. It seemed like they had entered as soon as the first team passed through.", "This meant that everyone had landed in the same place.", "Seol Jihu, who whimpered as he pushed himself off the ground, suddenly fell in a daze.", "The sky was red.", "No. The entire world was dyed in a blood-red color.", "It was difficult to say that his surroundings looked nice, even with empty words. The plants that would have once created beautiful scenery were all withered and bent.", "It was a different sensation from the sight he saw at the Delphinion Duchy. If what he saw back then was an already dead world, then this place looked like a dying world. It was just like a gasping patient that was on the verge of death.", "In any case, such things weren’t important since they managed to cross over to this place. The important thing now was whether they arrived at the Spirit Realm or not.", "Their answer was given to them shortly after.", "\"What’s that?\"", "Seol Jihu, who had been dumbfoundedly looking around, fixed his gaze in the direction that Kazuki had pointed. Then, he became utterly speechless.", "An appalling sight was being unfolded in that direction.", "Strange figures numbering in the hundreds, or even thousands, could be seen. They were beings that they’ve never seen before in their lives, but seeing how they were dyed in a dark shade of one of five colors, it was obvious that they were Spirits at first glance.", "However, the majority of these Spirits were dying.", "While appearing to be lesser in numbers, bright blue, haze-like things were slaughtering the Spirits with an overwhelming disparity in strength.", "Most of the Spirits were being extinguished without even being able to escape, and even those that were desperately resisting were surrounded by these hazes and soon scattered into ash.", "Since they weren’t able to fight back, the number of Spirits, which was initially in the thousands, was quickly falling.", "\"Get ahold of yourself!\"", "Seol Jihu came back to his senses when a stern voice rang in his ears.", "He got up to his feet and focused as he saw Baek Haeju holding her light green spear in front of him.", "The situation was clear.", "The fortune amidst all the misfortunes was that the Spirit Realm hadn’t completely fallen. The Spirits were still fighting.", "Of course, it was correct to say that it was a one-sided massacre, but the important thing was that the Spirit Realm hadn’t been destroyed yet.", "That fact alone was enough for them to act.", "They hadn’t imagined that they would witness such a sight as soon as they arrived, but that just meant that the situation was that urgent.", "If so, then there was only one thing left to do.", "Seol Jihu roughly swung his arm and cut the rope wrapped around his wrist.", "He stood his ground and tightly grabbed the Spear of Purity before pointing at the strange blue, haze-like creatures that were ruthlessly slaughtering the Spirits.", "And then.", "\"All units.\"", "At Tigol Fortress and the Spirit Realm…", "\"Prepare for battle.\"", "The fateful battles that would decide the future of Paradise commenced simultaneously at two locations."]}