{"cid": "454", "title": "Chapter 454. The Second Coming of Gluttony (4)", "content": ["Sung Shihyun was thrown into the air by the power of the explosion.", "His body drew a curve, swaying like a tattered piece of cloth in the air.", "His eyes were out of focus, blank.", "Only the sky filled his vision. Gray clouds drifted slowly before his eyes like a panorama.", "‘I….’", "His mouth slowly closed. His eyes, looking fixedly at the sky, also lost their vitality.", "Perhaps it was because he was close to his death that everything that happened to him since he first entered Paradise began to flash through his mind.", "Sung Shihyun quietly closed his eyes.", "Sung Shihyun, the first Invited to receive a Gold Stamp, and the next in the line of the elites from Area 1, following Baek Haeju and Seo Yuhui.", "In March 2013, he was named the top graduate in his class in the Neutral Zone and joined the ranks of the ‘Irregulars’ by successfully completing an impossible mission alone while beating others by a landslide.", "Even after graduating from the Neutral Zone, nothing stood in Sung Shihyun’s way.", "The Daughter of Luxuria, who became an Executor in the shortest amount of time in the history of Paradise, accompanied Sung Shihyun and helped him grow. Of course, his own talent was remarkable, too.", "As he began to earn contribution points and achieve greater success, he grew more and more fond of Paradise.", "He still remembered exchanging some of the rewards he earned on his first expedition for money and buying several bowls of abalone porridge, which cost more than 20000 won a bowl, on his way home.", "[Shihyun, where did you get the money to pay for all this…?]", "[Aw, come on, Mom! You gotta try something like this once in a while. And don’t worry! I make a lot now.]", "[I know you got a job, but still, this is….]", "[I’m telling you, it’s nothing. You have no idea how successful I am.]", "And he was successful in Paradise.", "Sung Shihyun had an aptitude for all that was useful in Paradise, and he quickly blossomed into one of the strongest Earthlings in Paradise with the help of his comrades, combined with his own efforts.", "It was only natural that he fell in love with Paradise. In Paradise, he was given infinite opportunities to change his life, which had been considered a failure on Earth. He especially liked that he could obtain rewards commensurate with his efforts.", "But as is often the case with those who greatly surpass their peers, he too became a target of jealousy.", "Those who envied Sung Shihyun were too afraid to face him head-on, so instead, they began plotting against him in secrecy.", "When he first experienced their malice, he felt as if he had been hit in the back of his head with a rock.", "It began when he set out on an expedition to a site near the Parasites border.", "It was widely known that there were ancient ruins in that area, but most Earthlings dared not approach it because of a nearby Parasites fortress.", "So, Sung Shihyun destroyed the fortress first before heading to the ruins.", "It was then that he ran into an expedition team trying to set foot inside the ruins.", "They fought over the right to explore, and in the process, insults and punches were exchanged.", "For Sung Shihyun, who had destroyed the Parasites fortress, only to have his reward almost taken away from him, the fact that he kicked the expedition team out without seriously hurting them was already an act of benevolence.", "But when he returned from the expedition, he discovered that he had become a scumbag who claimed possession of the ruins by force.", "The rumor spread quickly, and no one listened to his protest. Not even an article was written that shed light on his position.", "But that was okay. Sung Shihyun didn’t need everyone to like him. He was fine as long as he got what he rightfully deserved.", "Baek Haeju told him these things happened all the time, that he shouldn’t pay much attention to it. Seo Yuhui told him that he should bear with it. So he did. He chose to consider it a price for fame.", "But his mystery haters were not only persistent but also malicious.", "Everything he said and did, which would not have been a problem had it come from anyone other than Sung Shihyun, became exaggerated in rumors circulating all around Paradise.", "One day he decided to visit one of the organizations that wrote a wrong article about him. The organization apologized and promised to conduct a more thorough investigation before publishing an article, at which point he returned home.", "But the next day, Sung Shihyun had become a thug who threatened the said organization with force.", "Once Sung Shihyun became preoccupied with what others thought of him, he unknowingly began to place restrictions on what he should or shouldn’t do, and his patience quickly began to run out.", "It was around that time he learned about the kind of rumors that were circulating regarding Baek Haeju, who made significant contributions for Paradise, and Seo Yuhui, who sacrificed herself more than anyone else for Paradise.", "Sung Shihyun didn’t want to be like the two.", "No matter how hard he thought about it, he couldn’t figure out what he had done wrong. But since everyone seemed to hate him so much, he decided to give them a reason for it.", "At last, Sung Shihyun whipped out his sword, despite Seo Yuhui’s attempts to stop him.", "His first target was the informant organization that ran an inaccurate article about him. He beat them up, and once he got a name for who ordered them to write such an article, he proceeded to destroy them as well.", "That was the beginning of an all-out war.", "The more persistent his opponents became, the more tenacious Sung Shihyun became.", "He found the expedition team that first framed him and killed them after cruel torture.", "He captured those who had come to assassinate him, tortured them, and brutally killed all teams and organizations associated with these assassins for everyone to see.", "In the process of carrying out his revenge, Sung Shihyun changed. He also earned various nicknames.", "Disappointed by his cruelty, comrades left him one after another. But Sung Shihyun didn’t care about that. It wasn’t like nobody wanted him.", "Even after becoming a member of Sinyoung, Sung Shihyun’s attitude remained the same. No, in fact, it got worse. Sung Shihyun had nothing to be afraid of, with such a powerful organization supporting him.", "He wasn’t any less cruel to his comrades. If he didn’t like the way they looked at him, or if he heard them talking behind his back, he threw a fit. It wasn’t until he saw them kneel before him and beg for their lives that he felt any better.", "It didn’t take long for everyone to become afraid of Sung Shihyun.", "Years of harassment and unfair criticism directed toward him quickly began to diminish.", "This gave Sung Shihyun confidence that everything he did was right, that he was right.", "But that was before he heard that his mother had passed away.", "She died in a car accident.", "It was a common cause, but the way it happened wasn’t common at all.", "A car drove onto the sidewalk and hit his mother on her way home from work. The driver, a foreigner, went missing immediately after the accident. Everything about this incident reeked of Paradise.", "Sung Shihyun returned to Earth as soon as he heard the news.", "He stood for hours in front of his mother’s smiling portrait.", "Even then, his anger was directed at those responsible. He had no intention of defecting.", "But everything changed when Yun Seohui and others from Sinyoung arrived at the funeral.", "[It seems there has been a mistake on our part. I’m sorry we couldn’t protect her.]", "[But you should have paid more attention. She’s your mother, after all.]", "[You have to understand. We did our best, but you know better than anyone that you have enemies everywhere. There are at least 10 organizations that I know of.]", "[You dummy. Why weren’t you more careful?]", "Sung Shihyun watched Yun Seohui bow to his mother’s portrait before stepping outside the funeral home, but immediately stopped when he heard voices coming from the outside.", "[Did you see his face? It was quite a sight.]", "[I feel bad for the deceased, but at the same time, I feel a little bit relieved too. He’s been such a pain in the ass.]", "[Right? Maybe this will bring him down a notch or two. I don’t know who it was, but I’m thankful to them. That’s right, there’s something I heard before coming here.]", "[Oh, that? Yes, I’ve heard it too, but it’s an unconfirmed rumor.]", "[But it’s true that Director Park has been holding grudges against Sung Shihyun ever since the bastard beat him up.]", "[Well, yes, but….]", "[So Director Park talked to the guard team in charge of Sung Shihyun’s mother, and….]", "When Sung Shihyun heard that, he felt something snap inside him.", "Should he kill Director Park? Should he do the same to his family? Perhaps he should just destroy Sinyoung.", "Countless thoughts flashed through Sung Shihyun’s mind, but in the end, he shook his head.", "Director Park wasn’t the actual culprit. And, given how meticulous he was, he would have already wiped out all the evidence.", "…No, the truth was, he didn’t care about evidence.", "He was sick of all this.", "Sung Shihyun emptied his head of everything.", "He decided to do what he had always done.", "The opponent crossed the line. Now, it was his turn to do the same.", "After the funeral, Sung Shihyun returned to Paradise. He secretly crossed the border into enemy territory.", "He faced the Parasite Queen.", "[Power.]", "And he spoke.", "[I want power.]", "[The power to destroy all Earthlings.]", "The Parasite Queen accepted his demand.", "Seeing Sung Shihyun’s potential, the Parasite Queen offered him two privileges. The first was that the Parasite Queen would personally turn him into a parasite. The second was that she would create a vessel for him to use, even if it took her some time, in case a vacancy emerged in the position of the Army Commanders.", "Fortunately for Sung Shihyun, when he successfully completed the two procedures, Undying Diligence died.", "After absorbing the divinity of Diligence into his body, Sung Shihyun entered the nest specially prepared for him by the Parasite Queen. He promised himself that, on the day he came out as the First Army Commander of the Parasites, he would keep the vow he made at his mother’s funeral….", "Koong!", "Sung Shihyun fell from the sky and rolled across the ground.", "WAAAAAAAH!", "Cheers erupted from everywhere.", "They couldn’t help it. The First Army Commander of the Parasites, the defector of humanity, who had lured Seol Jihu into a trap and killed him, thus facilitating the fall of Paradise, had finally fallen.", "Seol Jihu withdrew his spear and calmed his breathing.", "The fact that he had finally reached the state of perfect harmony, and the power of his own Reinforced Sword Qi surprised him, but instead of staying complacent, he quickly glanced around.", "Seol Jihu’s eyes subsequently narrowed.", "‘Vulgar Chastity and Unsightly Humility are….’", "…Gone. He couldn’t sense them anywhere. They had vanished without a trace.", "Apart from Sung Shihyun’s divinity, which was rapidly diminishing, the only divinity he could sense nearby was that of Abhorrent Charity.", "Seol Jihu quickly shook his spear over his head. Teresa saw his signal and shouted for her soldiers to gather.", "It was then.", "All of a sudden, the roaring cheers stopped.", "Sensing the heat coming from in front of him, Seol Jihu turned his head forward.", "Surprisingly, Sung Shihyun was standing up. There were holes in his chest and abdomen, but his eyes were still burning furiously.", "“Kuhuk!”", "Blood spurted from Sung Shihyun’s mouth.", "His legs were shaking. Even standing still was a challenge for him now.", "Nevertheless, his one remaining hand held on tightly to the white longsword.", "“…”", "Seol Jihu turned and faced Sung Shihyun, who was now staggering.", "The Army Commander’s injury was fatal, but he was still alive. His divinity struggled desperately to revive its vessel. But the harder it struggled, the faster it was burned down by Seol Jihu’s mana left inside him.", "“Huuuu….”", "Moments later, a long sigh escaped Sung Shihyun’s mouth.", "He slowly raised his head and looked at Seol Jihu with eyes full of spite.", "“You….”", "Sung Shihyun’s lips quivered.", "“So you never really considered it…? Not even once…?”", "He asked in a hoarse voice.", "Seol Jihu’s eyes widened.", "“Defecting…. It wouldn’t have been a bad offer for you either….”", "Seol Jihu clicked his tongue.", "“I know you experienced it, too….”", "Sung Shihyun clenched his teeth.", "“You’re famous…. So you must have, at least a few times….”", "“Stop.”", "Seol Jihu interrupted him.", "He sighed as he looked at Sung Shihyun, who was shaking.", "“I know. Everyone has an excuse or two.”", "“…”", "“I’m sure you have a lot to say. You have a reason for betraying humanity. I get that. I do. But….”", "Seol Jihu continued.", "“Can you really hold your head up high?”", "Sung Shihyun’s breath quivered.", "“Can you say with confidence that everything you’ve done since entering Paradise is fair? Were your actions all just?”", "“…”", "“I know I can’t. And I don’t think you can either.”", "Sung Shihyun’s face contorted.", "“I don’t want to criticize you for taking revenge on people who have been shitty to you, but you’ve lost your right to claim innocence the moment you hurt innocent bystanders.”", "Seol Jihu raised his spear and pointed it at Sung Shihyun.", "“You can’t seriously be trying to instill pity…. Or do you really believe that everything that has happened to you isn’t fair, but everything you’ve done to others is?”", "Sung Shihyun remained silent. He only stared at Seol Jihu with resentful eyes and bit his lips.", "“In short….”", "Seol Jihu started toward Sung Shihyun.", "“I’m trying to say that I don’t want to hear your excuses. Forget about everything else, and just focus on the two of us, capeesh?”", "Tuk. The longsword slipped out of Sung Shihyun’s hand and fell toward the ground.", "“Let’s just say that we made different choices.”", "Seol Jihu stopped before Sung Shihyun, who was now twitching and shuddering, before giving a bitter smile.", "“You wanted to destroy this fucked up world, and I wanted to change it, forcefully, if necessary.”", "“…”", "“…That’s all there is to it.”", "He pushed Sung Shihyun down with his spear.", "Then he raised his left hand into the air to invoke the Authority of Gluttony.", "Seol Jihu’s left arm stretched toward Sung Shihyun on the ground, gasping for breath.", "“Uk!”", "Sung Shihyun flinched as he felt a mysterious energy pass through him from head to toe.", "“What….”", "Sensing the changes taking place inside him, Sung Shihyun began to tremble with fear.", "The mysterious energy permeated his circuit and spread to every nook and cranny of his body.", "It began devouring the divine energy dissolved into his mana.", "“No….”", "When he felt the powerful energy leaving his body, Sung Shihyun raised his arm with much difficulty.", "“Give it back….”", "But his struggle was meaningless.", "Seol Jihu withdrew his arm to check the energy that Gluttony had devoured.", "The divinity of diligence. When he saw the faintly glowing mass of energy over his palm, Seol Jihu smiled.", "With this, Sung Shihyun could no longer wield the kind of power that he used to wield in the past. Now, he was nothing more than a parasite who was only slightly stronger than the rest.", "“I told you I wouldn’t let you die so easily.”", "“Give it back…!”", "“No. I’m only paying you back for everything you’ve done to me.”", "Seol Jihu put the divinity into his pocket.", "“Go to sleep now. Although I can’t help it if you die in the process.”", "Seol Jihu raised his foot and kicked Sung Shihyun in the head.", "Sung Shihyun’s eyeballs spun and his body went limp.", "He was able to stand up only because he had fully absorbed his divinity. Other Army Commanders would have died as soon as the Reinforced Sword Qi struck them.", "So Sung Shihyun was now out of the picture.", "But the war wasn’t over yet.", "Seol Jihu looked around the battlefield and saw Teresa retreat in the distance.", "He thought he saw a light flickering in the direction in which Abhorrent Charity’s energy was felt.", "‘What was that?’", "Even though Seol Jihu had signaled Teresa to pursue the enemy, he never expected her to succeed.", "The present Seol Jihu could detect a divinity’s presence from miles away. But he couldn’t sense the divinities of the Second and the Sixth Army Commanders anywhere at the moment.", "This could only mean one thing: that they had gone so far away that even his mana, which had reached the level of Divine Beginning, could not reach them.", "‘It looks like they ran away while I was fighting Sung Shihyun….’", "He wondered how they could travel so far in such a short time.", "Toong! He used the Ethereal Shift to move closer to Teresa and realized almost immediately why she was retreating.", "The parasites and Nests that survived Seol Jihu’s attack had formed barricades, blocking Teresa and her soldiers’ route of travel.", "Abhorrent Charity was above them. There was a bright glow coming from under his robe.", "“So it was you?”", "When Seol Jihu saw that, a possibility crossed his mind, and he immediately called out to Abhorrent Charity.", "“What did you do?”", "[I merely used teleport magic to transfer the two Army Commanders as far away from here as possible.]", "His answer was well within Seol Jihu’s expectations.", "“When?”", "[When you first appeared before us. I notified them and then forcefully transferred them while the First Army Commander bought us time.]", "“I’m surprised. I thought you’d all release your divinities and come at me.”", "[We still would have lost.]", "Abhorrent Charity replied calmly.", "[Given the possibility that the Arcus Spirit will regain its powers and that the Executors will recover from their injuries and come to your aid, our chances of winning are very slim.]", "“So you moved them…. You sure are quick to act.”", "Seol Jihu clicked his tongue. The enemy’s argument was logical, and he couldn’t find any fault with it.", "“Why didn’t you save yourself?”", "[You ask when you already know the answer. The moment I decided to use my divinity, my fate was sealed. My divinity will soon go out of control, so even if I run away now, the fact remains that the same thing that happened to Raging Temperance will happen to me.]", "All Army Commanders, with the exception of Sung Shihyun and Twisted Kindness, needed to rest for nearly a year once they released their divinity.", "But that didn’t mean they couldn’t use their divinity at all during the resting period. They could, as long as they put up with the consequences, including losing control of their divinity, which could eventually lead to their deaths.", "[Once my divinity gets out of control, the chances of you discovering our location would increase. If you had caught up with us while we waited for my divinity to subside, my efforts would have been useless.]", "[Perhaps I am being much too careful… but isn’t it better to be careful than to be sorry? After all, you are the Brightest Star, who transforms the impossible into reality.]", "“That’s too bad.”", "Seol Jihu chuckled.", "He would be lying if he said he wasn’t sorry, but at least he had the Third Army Commander in checkmate. He remembered Black Seol Jihu saying that Abhorrent Charity was far more troublesome than Vulgar Chastity.", "Dried tentacles were constantly falling out of Abhorrent Charity’s sleeves. Blood, sweat, and other secretions dampened his robe and dripped down. The light emanating from under his robe also grew bigger and bigger.", "The enemy finished all the preparations. Now everything was only a matter of time.", "Seol Jihu shrugged his shoulders.", "“If you’re going to do it, do it quickly. I’d be glad if you die without making a fuss.”", "[I’d like to say you’re underestimating me, but…. Huhuhu….]", "He was at his limit. Suddenly Abhorrent Charity opened his arms wide with a low laughter.", "Woong!", "An ominous energy spread under his robe.", "[Huhahaha…!]", "Abhorrent Charity cackled madly.", "His robe began to swell, and rays of light stretched out and through the cloth.", "[Your Majesty!]", "Abhorrent Charity tilted his head back and shouted at the sky.", "[I will be watching from the other side! Please show me that you can beat the golden constellation!]", "It was then that a bright ball of light shot out from Abhorrent Charity in a spherical motion.", "FLASH!", "A loud explosion erupted. Light swallowed everything in the vicinity. This light was stronger than a dozen special thunders combined.", "Abhorrent Charity’s energy passed through the barriers prepared by the Priests. It rushed toward the city at an alarming speed.", "But it was only for a moment that his color filled the sky and the earth. Soon a brighter golden light rose from the ground and clashed into Abhorrent Charity’s energy.", "The two energies pushed each other for a brief moment before the golden energy shattered its opponent and dyed the world yellow.", "[Curse you, Seven Sins….]", "A bitter smile spread on Abhorrent Charity’s lips as he watched the tide of electricity rush toward him.", "[You… created a monster….]", "The golden tsunami swallowed Abhorrent Charity before he could finish his sentence.", "Amidst the flashing light, his shadow shook violently in zigzags and then scattered like a spray of water.", "Once the storm subsided, nothing remained in the air.", "Only a faintly glowing ball of light had fallen onto Seol Jihu’s palm.", "Abhorrent Charity, the Third Army Commander, had perished.", "The Parasites’ Seven Army Commanders, once feared by everyone, were reduced to just four in number when the fall of humanity was just around the corner.", "On that day, the Parasite Queen’s roar spread far and wide beyond the imperial territory."]}