{"cid": "261", "title": "Chapter 261. To Lead (1)", "content": ["Dozens of papers were strewn across the streets.", "Seol Jihu had just returned to the city, but he could feel countless people stealing looks at him. The signs all over the city were screaming— that something unusual was happening.", "Seol Jihu picked up one of the papers lying on the ground.", "Soon, his eyes went wide before narrowing. The newspaper explained what had happened while he was gone.", "—While Carpe Diem’s main force left to complete the royal family’s mission, the Eva Alliance sent Ochoa Cartel’s Level 5 Warrior, ‘Noah Freya’ and a representative of the Eva Alliance, the level 5 Warrior ‘Yang Yang’, to attack Carpe Diem’s base. Receiving Carpe Diem’s request for assistance, the Triads dispatched ‘Ayase Kazuki’ and others, successfully annihilating the Eva Alliance’s forces raiding Carpe Diem.", "Coincidentally, at the same time, Ochoa Cartel and the other organizations picked a fight with members of the Triads at the pub. Although it was only a small, insignificant fight at first, it quickly intensified until organizations were brought into the mix.", "The Triads’ executive, ‘Ming Jie’, understood the seriousness of the situation and tried to stop the conflict, but the Eva Alliance unscrupulously raised their hand, taking out their weapons despite Ming Jie’s attempt to appease the situation. In the end, they attacked the Triads’ forces first.", "In response, the Triads struck back, lighting the fuse for a war which ended in the Eva Alliance’s complete defeat.", "The leader of Ochoa Cartel, ‘Omar Garcia’, was present at the scene. As he was making his escape, he was caught by the members of Carpe Diem who were on their way to reinforce the Triads. Captured and questioned, he revealed that he was instigated by Jung Sua, the representative of the royal family’s partner organization, Evangeline.", "Jung Sua is pleading innocence, claiming that she knew nothing about Omar Garcia’s plans, but this was clearly the Eva Alliance’s attempt to drive out Carpe Diem and the Triads after suffering a huge loss from the recent revelation of their illegal activities.", "With Jung Sua revealed to be the one who suggested Carpe Diem’s escort mission, her words are losing trust.", "As a result, the Eva Alliance was completely annihilated, leaving behind only the Dongchun Merchants and Red Hwaru. However, the Triads and Carpe Diem suffered great losses as well.", "Carpe Diem managed to escape the worst-case scenario thanks to the Triads’ timely support, but two legends of Paradise, Seo Yuhui and Jang Maldong have suffered severe injuries, causing the rage of many Earthlings…", "‘What?’", "Seol Jihu didn’t catch the last bits of the news, which noted, ‘Everyone is awaiting the decision of Eva’s queen, Charlotte Aria.’", "Seo Yuhui and Jang Maldong suffered severe injuries?", "Seol Jihu’s head turned white.", "“Ooooh? What? What the hell happened?”", "Phi Sora must have picked up a newspaper too as she muttered in shock. It wasn’t just her. Everyone else was in shock.", "In the next moment, Seol Jihu ran.", "He initially planned to stop by the palace to report the successful completion of the mission, but that thought evaporated altogether as he ran at full speed toward Carpe Diem’s building.", "Passing the main gate and throwing open the front entrance, he heard someone scream and backed off.", "It was Chohong.", "“Ah, hey! Easy on the do—”", "Chohong, who was about to get angry, shut her mouth seeing Seol Jihu.", "“Oh, you’re here…”", "She changed her attitude right away, welcoming him before trailing off. She had no other choice when she saw his face and spoke carefully.", "“W-When did you get here?”", "“Just now. Where’s Master Jang and Yuhui Noona?”", "Seol Jihu had a ton of questions he wanted to ask, but he asked the most important matter first.", "“Old Man is enjoying the hot spring… Yuhui Noonim, I think, is resting in her room.”", "Seol Jihu’s eyes waned. Of the two supposedly injured people, one was enjoying the hot spring and the other was resting in her room?", "“Did they come back from the emergency treatment room already?”", "“Uhh, about that…”", "Chohong avoided Seol Jihu’s eyes. She seemed guilty of something.", "“I only heard after you left… and Old Man reluctantly agreed to it as well…”", "She muttered something Seol Jihu couldn’t understand. He no longer waited for her reply and hurried up the stairs. He wanted to check their conditions with his own eyes.", "The door was open. Just like Chohong said, Seo Yuhui was resting in her room. To be more precise, she was sitting on her bed, playing with the red egg.", "‘What’s he doing there?’", "Seol Jihu couldn’t figure out what the egg was doing here, but he set the question aside. This wasn’t the first time it had happened anyway.", "What mattered was Seo Yuhui’s condition.", "But the way she smiled and gently tickled the egg, she looked nothing like a severely injured patient.", "Seol Jihu breathed a sigh of relief before knocking on the door.", "Seo Yuhui turned around in a startle.", "“Jihu?”", "“…Noona.”", "“When did you get here?”", "“Just now.”", "Seol Jihu continued as he stepped into the room.", "“Are you okay?”", "“Yeah, I’m fine. There’s no problem at all. Ah, except the problem that I’ve been having.”", "“Are you really, really okay?”", "As Seol Jihu asked a second time, Seo Yuhui smiled bitterly.", "“You saw the newspaper?”", "Seol Jihu became convinced. The publicly known story was a lie.", "Words could easily be manipulated to instill different thoughts in people. For whatever reason, someone must have pulled some strings to make the false story go out.", "And within Carpe Diem, there was only one person who would think of such a thing.", "Before Seol Jihu mentioned the name, he asked.", "“What happened?”", "“Unn… We’re pretending to be hurt. Miss Hannah said that would make it easier to manipulate public opinion.”", "Seo Yuhui spoke in a slightly bashful way.", "‘As I thought.’", "After relief came suspicion. Seol Jihu felt stuffy for whatever reason and hurriedly asked.", "“Can you give me an explanation?”", "*", "Kim Hannah has been running around like a headless chicken trying to take care of recent events. Even today, she left the Carpe Diem building early in the morning and had yet to return.", "Seol Jihu stayed cooped up in the main office after hearing Seo Yuhui’s explanation. Sitting at the desk chair, he smoked endlessly. Otherwise, he didn’t feel like he could relax.", "Although he was working hard to pretend like he was okay, he was seething on the inside like a blast furnace at full capacity.", "White smoke came out of his nostrils and mouth, like the steam escaping a heated kettle. By the time his cigarette butts formed a small mound on the ashtray, the clacking of high heels rang out in the hallway.", "Soon, knocks rang out, followed by the sound of the door opening.", "“You’re back? Good work. Did the mission go well?”", "He could tell who it was without even having to look.", "Seol Jihu spoke with a slightly hoarse voice.", "“…Come sit.”", "“What, why? Why are you acting so serious?”", "Seol Jihu’s chin shook a little. Kim Hannah must have known what he meant, so seeing her act this way made him too spiteful.", "Seol Jihu took a deep breath.", "“Don’t you have something to say to me?”", "“I’m a bit busy right now…”", "“You don’t have time to talk even for a little while?”", "“…Fine, I’ll stay and talk. But keep it simple.”", "“Sit.”", "Even Seol Jihu was surprised by his cold tone. Kim Hannah looked at Seol Jihu with a renewed expression. Next, she quietly walked forward and sat down on a chair.", "Seol Jihu had already heard about the events leading up until here.", "After a moment of silence, he asked.", "“Is this why you asked me to lend you the pendant?”", "“Yep, it was just in case anyone attacked… Having it, saved us.”", "Seol Jihu scoffed.", "“No, you borrowed it to reverse the situation if the Eva Alliance invaded and devoured them instead.”", "“You’re right. Since Flone was here, I didn’t think we’d lose.”", "Kim Hannah admitted easily.", "“But it’s not like I didn’t give much thought to it. Flone’s strength is one thing, but her main advantage is that her existence has not been revealed to Paradise. I had to devise a plan to utilize this advantage, and that’s how this plan came to be.”", "What she said wasn’t wrong.", "“But like I said in the past, the success and failure of the plan was unclear with you around. We kept poking at the Alliance, but they continued laying low. In the end, you had to leave this city to bait them out.”", "Seol Jihu understood what she meant.", "“Anyway, everything went well. With the Eva Alliance attacking first, we have the proper justification to deal with them. We also hid Flone’s existence, and with clear evidence supporting us, the public support is with us as well. The Eva Alliance is practically done for.”", "Indeed, the outcome of the plan was an undeniable success. After all, five of Eva’s seven remaining organizations had collapsed.", "…That was the case if he only looked at the outcome.", "But what Seol Jihu had a problem with wasn’t that.", "“You know that’s not what I’m talking about.”", "“…”", "“Since when—”", "Seol Jihu cut himself off in the middle, feeling that his tone was getting unnecessarily sharp. However, his voice had already gotten loud.", "“Park Dongchun Ajusshi gave us the information. That the royal partner would pull some strings in secret.”", "Kim Hannah revealed the truth.", "“And shortly afterwards, I also got a message from Sorg Kühne, saying that Jung Sua, the representative of Evangeline, brought up the idea of having Carpe Diem escort the Federation members. He was delaying the decision and wanted our input on the matter. I figured that was the perfect opportunity. So—”", "“This is the first time I’m hearing any of this.”", "Seol Jihu cut her off, and Kim Hannah went mute. Seeing her staring fixedly, Seol Jihu continued where he left off.", "“Couldn’t you have said something to me? Or at least, you could have called me after the plan ended in success. Do you have any idea how surprised I was when I came back?”", "Kim Hannah scratched her head as she made a flustered expression.", "“Ah… Were you?”", "“What? Was I?”", "“I mean, it’s true that I didn’t tell you about it… but what’s wrong with that? It’s not like I committed a crime. And look, the outcome is great.”", "Seol Jihu doubted his ears, finally turning his gaze and staring straight at Kim Hannah. Facing his heated gaze, Kim Hannah flinched subconsciously.", "She wanted to pretend that she was fine, but her body shrunk back on its own. Her throat felt parched, and she licked her lips unknowingly.", "This was the face, the attitude, and the other side of Seol Jihu that Kim Hannah witnessed for the first time ever.", "Who would have thought such a terrifying face would be hidden underneath all that childish laughter?", "‘…I see.’", "While she finally understood what Seol Jihu’s enemies had felt all this time, she barely managed to raise her hands and shrug.", "“How rude! I thought you’d praise me. I gotta admit, I’m a little taken aback by your anger.”", "She sounded innocent and nonchalant. Seol Jihu almost snapped and let his anger explode, but—", "“….”", "He held himself back at the last moment.", "Checking Kim Hannah with the Nine Eyes, he confirmed that she was still shining gold.", "There had to be a reason the Golden Commandment was showing up in this situation, a reason that Kim Hannah was treating him this way.", "Seol Jihu growled.", "“Why are you doing this?”", "A subdued voice flowed out. It was as if he was restraining himself despite having many things to say.", "With Kim Hannah being sensitive to the emotional changes of others, there was no way she wouldn’t catch this.", "Perhaps this was the final chance.", "Something that Kim Hannah learned after coming to Eva was that Seol Jihu did not hesitate to pull out his spear against those he deemed to be his enemies.", "Regardless of the intention, Kim Hannah had tricked Seol Jihu.", "Perhaps it was misleading to say ‘tricked’, but Kim Hannah had definitely carried out a plan while keeping Seol Jihu in the dark about it.", "Thankfully, the trust they had built up until now seemed to be telling Seol Jihu that there must be a good reason for her actions.", "“…I know.”", "As such, Kim Hannah decided to come clear. Fixing her posture, she sat tall and explained.", "“You must be surprised and confused. You might also be furious and disappointed.”", "“But Jihu.”", "“….”", "“What you’re feeling now is what I felt the first night we came to Eva.”", "When Seol Jihu heard this, he felt as if a hammer had struck his head.", "His expression became dazed, and his mouth opened slightly.", "“I’m not saying that I’m in the right. I was the one who took you around the city, after all.”", "Kim Hannah uncrossed her arms and subtly lowered her gaze.", "“But it’s not like I demanded anything difficult.”", "She slowly continued.", "“Calling for a meeting, explaining the circumstances carefully, hearing everyone’s opinion and discussing whether anyone had better ideas… at the very least, we could have contacted the Triads and let them know of our plan.”", "“….”", "“What did you think I felt as you dragged the main force along with nothing more than the words, trust me?”", "Seol Jihu remained silent.", "“And that’s not all. You accepted the royal family’s mission right away. You never thought to get back to them later and discuss it with us first?”", "Seol Jihu finally realized why Kim Hannah was doing all this.", "[Do we need to have a meeting? Just tell me.]", "And he learned why Kim Hannah had glared at him back at the cafeteria.", "“I’ll be blunt. What would you do if I said with no explanation that we should go to Scheherazade this instant and hit Sinyoung? As you know, I have a grudge against Sinyoung, and they’re not a righteous organization either.”", "Seol Jihu clenched his teeth.", "“You’d obviously say no, or at least ask me to explain. I would have no choice but to follow your order. Because at the end of the day, I’m just a member of this team. But that’s not the case with you.”", "It’s fine when I do it, but it’s not fine when you do.", "Seol Jihu hated these kind of hypocrites the most. But that was exactly what he was doing right now.", "“If you push hard, we’ll have no choice but to go along. As long as we’re a part of this team, we have no other choice. Why? Because it’s obvious that we’ll be ostracized the moment we refuse. Then, we’d have no choice but to leave.”", "Of course, Seol Jihu had no intention of doing this, but it was true that he practically forced the Carpe Diem members to follow him in achieving his goal.", "“That’s what it means to be a leader. You have the authority, and the position to use that authority. That’s why you, of all people, should not have done that.”", "Put nicely, he was a conqueror. But in reality, he was a dictator.", "At least in regard to the previous incident, Seol Jihu had acted like a dictator.", "“Of course, Chung Chohong and Richard Hugo might not think the same way. Same for Master Jang. They’ve all been watching you from right by your side for a long time, so they must have a deep-rooted trust in you.”", "But that wasn’t the case for Kim Hannah and the others.", "“In any case, I want you to think one more time how everyone must have felt as they followed behind you that night.”", "Kim Hannah let out a small sigh.", "“And with that— I admit I acted out of place. I won’t say I did it for you or anything like that. I did it, fully prepared to accept any punishment.”", "Seol Jihu spat out the breath he had been holding in. Then, he looked up at the ceiling.", "His vision was blurry, and he felt like he could see Ian’s face on the wavering ceiling.", "[I’ve witnessed your capabilities with my own eyes, but I still need to ask you again.]", "[As a strategist, you’re risking hundreds and thousands of lives if we’re talking about a small scale conflict, and hundreds of thousands, even millions, if we’re talking about a large-scale conflict. Are you offering this strategy, fully aware of the implications?]", "And what Jang Maldong said also crossed his mind.", "[Jihu, being a member of an organization means living a communal life. It’s a community where members share common values and interests.]", "[There’s a limit to an arbitrator stepping up and handling the issue. You have to let the parties involved resolve the situation on their own. Of course, you can’t give them too much freedom, or else the community will instantly become a mess. I’ve seen more than a few organizations that collapsed because of this.]", "[That’s why you need rules and regulations. Applying principles and fundamental rules to everything to assure fairness. Miss Kim Hannah knows this too well.]", "The advice he’d heard in the past dug into his chest. Moreover…", "[I’ll take care of this by myself. I want to do it with my own strength, you see.]", "[At the very least, I told you beforehand, didn’t I?]", "Seol Jihu remembered why he got so mad at Chohong during the Delphinion Laboratory incident.", "He couldn’t hide his embarrassment. Of course, the situation was different from back then, but as Kim Hannah said, simply telling his teammates to trust him wasn’t a convincing argument.", "Yes, he was busy, but did he really not have time to call the Triads even once?", "No, not at all.", "It wasn’t that he couldn’t call the Triads, but that he didn’t.", "The one person who should have stuck to the principles and fundamental rules no matter what had not done his job.", "Before Seol Jihu realized, his anger had dissipated completely. His drunken state of mind cleared up, and his mind seemed to turn sharper.", "Only now did he start to see his surroundings.", "Was I too temperamental? Did I go too far? Was I too hasty?", "Thinking so, he was struck with a strange sense of déjà vu.", "“….”", "He thought he had fixed this after suffering a major loss in the Neutral Zone.", "‘Was I…’", "But just like the saying, humans always repeat past mistakes, he ended up making the same mistake just because he had grown a little bigger.", "‘Too rash…?’", "Seol Jihu closed his eyes.", "Oop- sorry for the late chapter. I just woke up. Thankfully my editor was up early in the morning and managed to release it before it was too late. I swear I set the timer last night before I slept but I guess I didnt...?", ""]}