{"cid": "206", "title": "Chapter 206. Seol Jihu Faithfully Plants Flags Today As Always", "content": ["Seol Jihu dragged his lucky charm, or rather Flone, to the library as soon as he heard her story. Like the adage, ‘there is a way out even if the sky falls’, Seol Jihu was quick to move once he had a plan.", "The Pagoda of Infection.", "This was the place that Flone pointed out as where the Rothschear family’s sacred artifact was hidden.", "Burning with fervor, Seol Jihu searched every corner of the library for a few days and gathered a good amount of information.", "And the result was truly unnerving.", "—REDACTED.", "“…What’s this?”", "It wasn’t difficult to find information regarding the Pagoda of Infection. The problem was that every single record cut off after a few pages with the word ‘REDACTED’.", "Even an idiot would realize that the latter content was deleted. Seol Jihu had checked dozens of history records, including records of unofficial history, yet information regarding this place had been removed without exception.", "It was as if all of Paradise had come together and promised to keep silent.", "But from all the records he read, he was able to gather two pieces of information.", "—The Emperor feared the (REDACTED) attacking the Empire and devised a special measure. That is to erase the (REDACTED)’s existence altogether.", "And.", "—After that day, the Empire and all of its subsidiary countries moved quickly. They arrested anyone who talked about (REDACTED) on the streets and went beyond keeping the secret under wraps to redacting all information regarding it….", "“…Man.”", "Seol Jihu smacked his lips after reading just a few lines. He didn’t have a good feeling about this.", "He investigated the Rothschear family’s secrets just in case, and it was just as he thought. He couldn’t find a single record related to the Pagoda of Infection.", "—Rothschear, one of the four duke families who founded the Empire. They serve the Goddess of Chastity.", "—Castitas, the Goddess of Chastity, bestowed the family with the sacred artifact, the Spear of Purity, which housed the elemental spirit, Arcus. The family thus came to be called the Spear of the Empire, and as the name suggests, they always stood at the frontlines of war to combat outside enemies.", "—They are said to be protected by a mythical guardian Phoenix that symbolizes joy.", "Getting confirmation about the Rothschear family’s background and the existence of the Spear of Purity were the only gains.", "Seol Jihu asked Flone about the Pagoda of Infection, but she only said, ‘Huh? What’s that? I have never heard of it before.’", "The fact that Flone had never heard about it could only mean that the Emperor’s measures had been successful.", "‘The Pagoda of Infection.’", "Just its name exuded all sorts of trouble.", "‘I doubt it’s talking about a simple contagious disease…’", "There were more than a few suspicious points, but Seol Jihu had no thoughts of reconsidering his plans.", "He had to go.", "This was the opportunity he had been waiting for. If he gave up now, elevating Carpe Diem to an organization would truly become a hopeless dream.", "Though even the Emperor of the ancient Empire had been wary of this place…", "‘Let’s face it head on.’", "Seol Jihu walked forward, shaking off his fears.", "**", "After returning to Carpe Diem’s office, Seol Jihu fell into deep thought. Setting aside the matter of conquering the Pagoda of Infection, just getting there was a problem.", "The area in question was similar to the Forest of Denial in that it bordered the Parasites’, the Federation’s, and humanity’s territory.", "Strictly speaking, though, it was closer to the Federation and humanity’s side.", "‘I’ll need a Pathfinder for sure….’", "A Pathfinder was indispensable as he could run into the Parasites at any time. It wasn’t as if he didn’t know any Archers, but Marcel Ghionea was poor at scouting and Yi Seol-Ah lacked experience.", "‘Warriors…’", "Carpe Diem had a rather strong lineup of Warriors, including himself, Chohong, Phi Sora, and Hugo.", "But that was only in terms of firepower.", "In terms of scale and the size of their party, this trip to the Pagoda of Infection would be an expedition, not an exploration. And Seol Jihu had a strong feeling that simply being good at fighting would not be enough for this expedition.", "This worry stemmed from his lack of information. To be more precise, he still had misgivings in his ability as a leader purely due to his inexperience.", "He wanted an experienced, quick-witted veteran who could control Carpe Diem’s temperamental Warriors in case of an emergency.", "It would be perfect if there was someone as skilled as Dylan. It wasn’t as if he couldn’t think of anyone. But he was hesitating because accepting an outsider’s help would mean he would need to return the favor.", "Seol Jihu knew how incredible the result of this expedition would be, given that it hadn’t fallen into anyone’s hands. So he would be lying if he said he didn’t have any regrets about sharing the loot with outsiders.", "‘What should I do?’", "“BOO!”", "While he was deep in thought, a shrill voice struck his ears. When Seol Jihu opened his eyes, he saw Chohong standing in front of him with her mouth open.", "Seol Jihu laughed blandly.", "“Having fun?”", "“Bastard, you’re making me feel embarrassed.”", "Chohong took a step back and grumbled with a flushed face.", "“What are you doing here all alone? You had your eyes closed and your arms crossed too.”", "“I think.”", "“Think?”", "“Therefore I exist.”", "“Argh, cut the bullshit.”", "Chohong furrowed her brows.", "“Why do you have to be like this? You’re such a turn-off sometimes, you know that?”", "She fiddled with her fingers as she criticized him.", "“But hey, please tell me you were thinking about our next mission. I don’t care if it’s a scouting mission or an exploration.”", "“You must be bored.”", "“Bored doesn’t even cut it. I’m about to flip from itching all over. Let’s go out, let some fresh air into our nostrils, beat up some monsters and have a change of pace. How about it?”", "Chohong made a passionate speech while waving her hands.", "Seol Jihu nodded his head calmly.", "“I was just thinking about one.”", "“Oh? And this came from a trustworthy source?”", "“More than trustworthy.”", "“I see…”", "Chohong rubbed her hands together and giggled.", "“Right, you’re not the type of person to just sit still. I thought you’d make your move soon.”", "Then, she suddenly spoke as if she just remembered something.", "“Oh yeah, have you been to the palace?”", "Seol Jihu furrowed his brows at her sudden mention of the palace.", "“No? Why would I go there?”", "“To get money.”", "“Money? From what? Participating in the war was mandatory.”", "“Not that. You hired those kids from Blood Line.”", "Only then did Seol Jihu go “Ah.”", "He remembered Teresa mentioning this. That he should look for mercenaries and that she would pay him back later.", "Seol Jihu hesitated.", "“I don’t know if it’s right to accept that money… I didn’t hire them out of my own pocket.”", "“That’s even better! You’d have extra money to spend. It’s true that Blood Line came to help, so there shouldn’t be any problem.”", "Chohong kept persuading him to take the money, but Seol Jihu seemed rather reluctant.", "“I don’t think Haramark has spare money right now.”", "This wasn’t a baseless assumption. A war required an exorbitant amount of money to be spent. Now that the war was over, not only did Haramark have to rebuild the valley fortress, but they also had to pay out their war dues.", "Even the military expansion Jan Sanctus asked for was in far reach.", "“Oh right, there were talks about that recently. About how people haven’t received any money even though months have gone by since the war. Well, you’re the one who called Blood Line, so you do what you want.”", "Chohong shrugged.", "Seol Jihu slowly rubbed his chin.", "‘Again.’", "For some reason, when he thought about Teresa, his conflicted mind suddenly tilted to one side.", "Right, it’s not like the inheritance is only in one place. Other than the one in the heart of the Empire where I obviously can’t go, there are still three other places.", "Seol Jihu murmured before coming to a decision. Doing her a favor before leaving Haramark didn’t sound so bad.", "Having made up his mind, Seol Jihu got up.", "*", "Seol Jihu went to find Kazuki straight away. It was to ask him to become the Pathfinder for the expedition.", "When he gave a rough explanation of the situation, Kazuki unexpectedly agreed right away.", "“Alright, I’ll go with you.”", "When Seol Jihu stared at him in a daze, Kazuki, who was reviewing the piece of paper with the terms and conditions of the temporary contract, raised his head.", "“Ah, I haven’t had a lot to do recently. My team disbanded too.”", "It seemed Umi Tsubame broke up into pieces in the end. Well, since Kazuki joined hands with the Triads, it was unlikely that Japan Business Federation would have sat still.", "“Also, isn’t this the first expedition you planned yourself?”", "Was it?", "Now that he thought about it, he had always followed others, accepted missions, or was dragged along forcefully. He had never decided alone.", "In that sense, this was indeed Seol Jihu’s first expedition.", "“I’m curious. I doubt an expedition planned by an Earthling of your caliber will be ordinary. Anyways, I don’t think following you will be a bad thing.”", "Kazuki’s clear praise made Seol Jihu smile bashfully.", "“Thank you for trusting me.”", "Kazuki stared at the smiling Seol Jihu with a somewhat bitter look. Soon, he suddenly chuckled.", "“I don’t sense any feelings of entitlement from you. That’s why I can trust you.”", "With that, Kazuki flicked the paper.", "“Anyways, about these terms.”", "“Yes.”", "“Artifacts will be distributed according to the class of the participants. This is all good, but…”", "Kazuki’s eyes narrowed slightly.", "“Artifacts that do not conform to any class and artifacts that carry holy power will belong to Seol Jihu.”", "Distribution of loot generally followed a 1/Nth rule. With the exception of artifacts, this basic rule of Paradise applied to even porters.", "Of course, Seol Jihu rightfully deserved more of the cut, seeing as how he was the one who planned the entire expedition, but he wasn’t even saying he would pay a small price for the right to those items, which would be the norm. Rather, he was asking for an absolute ownership over them.", "“Can you give me a more detailed explanation?”", "“Mm… sure, it’s an open secret anyways.”", "It wasn’t that Kazuki was being greedy, and since Seol Jihu knew this was Paradise’s rule, he revealed his inner thoughts openly.", "After hearing his explanation, Kazuki went “Ah” and dropped his jaw.", "“So it’s because of Lady Seo Yuhui.”", "“Yes, from now on, I plan to give her every offering I get my hands on. So I plan to use these same terms for a while.”", "“In that case, I have no complaints. We’ll go with this.”", "Kazuki signed the contract without hesitation, and Seol Jihu nodded his head.", "Seol Jihu knew Kazuki would understand. After all, Kazuki was also indebted to Seo Yuhui.", "“Whew.”", "Kazuki breathed a sigh of relief after handing the contract back to Seol Jihu.", "“If this expedition goes well, I’ll finally have some room to breathe.”", "“What do you mean?”", "“Ah, I need to form a new team before moving to Eva, but I’m severely lacking money. Hao Win gave me some funding, but that’s all debt.”", "Seol Jihu’s eyes widened.", "“You’re going to Eva too, Mister Kazuki?”", "“Of course. The hill I’m hiding under is moving to Eva, so how can I not? Didn’t Hao Win tell you?”", "Kazuki replied immediately before smiling.", "“Anyways, thanks! You saved me.”", "Seol Jihu waved his hand.", "“Isn’t it too early to say thanks? We don’t even know if anything is going to be there.”", "“That’s true. Returning empty-handed from expeditions or explorations is an everyday occurrence.”", "Having said that, Kazuki glanced at Seol Jihu and smiled silently.", "“But seeing as how you’ve never failed before, I figured I can get my hopes up.”", "I’ve never failed before? Seol Jihu tilted his head once again.", "*", "The next place Seol Jihu visited was the royal palace.", "“An expedition?”", "Seeing the young man who visited her out of the blue, Teresa's eyes opened like that of a rabbit.", "“Yes.”", "Seol Jihu nodded his head with a bright smile.", "“I heard that things have been a little loud recently. I was thinking it would be a great idea to go out, get some fresh air, and loosen up.”", "“….”", "Teresa was clearly at a loss for words.", "Seol Jihu wasn’t wrong. Because their finances were in the red, she had been thinking about swallowing her tears and selling the royal family’s land.", "Seeing Seol Jihu who was full of smiles, Teresa reviewed the contract again.", "The terms were strangely stingy.", "No, in the first place, it was uncommon for the princess to be asked to go on an expedition. It didn’t seem like he didn’t know about the Royal Family’s situation, so it was also strange that he was asking her to ‘get some fresh air and loosen up.’", "Moreover, it wasn’t as if she was a Magician or a Priest. Carpe Diem was overflowing with skilled Warriors, so she didn’t understand why he wanted to bring another Warrior with him.", "There were more than a few suspicious points.", "However, Teresa’s ability to take a hint was easily a 100. There was no way that Seol Jihu was saying this without a reason.", "Teresa secretly glanced at Seol Jihu and examined him thoroughly. He seemed strangely full of confidence.", "‘Hold on.’", "Teresa suddenly thought of the expedition offer she had received in the past from White Rose. She had put careful thought into the matter before asking Seol Jihu to join the expedition, but Seol Jihu was extremely against it at that time.", "Teresa believed in her hubby’s ‘intuition’ and didn’t follow White Rose’s expedition. And lo and behold, not only did the expedition end in failure, but it also became the source of a spectacular political mess. Teresa remembered how relieved she was at the time.", "The important thing was Seol Jihu had a totally different attitude now compared to then. Not only was he not uncertain, but he was clearly hoping that she would go with him.", "In that instant, a bolt of lightning struck Teresa’s head.", "‘A jackpot. A super jackpot, at that!’", "She didn’t know the details, but he must have received an incredible piece of info. That was why he was asking her to come.", "Teresa finally understood Seol Jihu’s intentions.", "‘He’s looking after me.’", "Simply giving her the loot for free would be unfair to his teammates and possibly raise protests, so he was making her join the expedition to rightfully receive a cut.", "‘Again… just when I’m in trouble….’", "Teresa found it incredible how he appeared to save her whenever she was having a hard time. How could she not develop feelings for him?", "“Haa—”", "Sighing from the bottom of her heart, Teresa spoke with a slightly flushed voice.", "“I can really go with you?”", "“Of course. I mean, I’m the one who’s requesting you to come.”", "“Eii, I know Carpe Diem has lots of Warriors.”", "“Strength isn’t the only thing that matters. I’m personally expecting other things from you, princess.”", "The way he was putting it made Teresa feel even more apologetic.", "Seol Jihu grinned.", "“You’re coming, right?”", "He was going this far. How could she refuse or even play hard to get?", "Teresa nodded silently. Then, she stared at Seol Jihu fixedly.", "“Excellent decision. Then…”", "The moment he finished saying, “I’ll let you know when the date has been decided,” he flinched.", "A subtle glance.", "He might be mistaken, but he felt like he saw two hearts blooming inside Teresa’s pupils.", "‘N-No.’", "It wasn’t that he disliked the princess, but Seol Jihu considered himself a man of principle. As he vividly remembered what happened when he gave her the longsword and shield, he couldn’t just ignore this problem.", "“I-I’ll take my leave now. And here.”", "Seol Jihu hastily got up and passed the shopping bag he had brought with him in a hurry.", "Teresa, who got up as if to prevent him from escaping, licked her lips slightly with her tongue. She then blinked her eyes, seeing the shopping bag.", "“It’s a gift. It’s nothing big though.”", "“Oh, my.”", "It was effective.", "Teresa’s eyes, which were turning more and more seductive by the second, regained their sparkle.", "“I bought it when I was on Earth. I forgot to bring it with me last time I came here…”", "However, Seol Jihu had committed a fatal mistake. The moment Teresa heard the word ‘gift’, the light in her eyes grew more intense, and her heart-shaped pupils became clearer.", "Of course, Seol Jihu noticed this change as well.", "“I bought something you need in your daily life. It’s nothing big, so please accept it.”", "Pang!", "“I’ll be off, then. Thank you for having me!”", "Seol Jihu activated the Festina Earring and ran away at full speed.", "“….”", "And once Seol Jihu left, Teresa stood still and looked down at the shopping bag on the desk.", "This was the first time she received a gift from an Earthling.", "She thought this every time she saw him, but…", "‘If only Earthlings were all like him….’", "How great would that be?", "In any case, she was given an unexpected way out of her predicament and an unexpected gift.", "After fiddling with the shopping bag for a long time, she shoved the stack of documents on her desk out of the way.", "“Eit!”", "Who cared about work?", "At least for today, she wanted to indulge herself in this feeling of weightlessness.", "And soon, just like Seo Yuhui, Phi Sora, and Chohong…", "Teresa had the same reaction as the other women who opened Seol Jihu’s gift.", "However, her confusion at the gift only lasted a moment. Soon, the corner of the mouth curled up, and her eyes also curled to crescent shapes.", "“Wow….”", "With a bra in one hand and panties in the other, she chuckled.", "Light pink hearts on a shade of a lovely pink color.", "Moreover…", "“That person…”", "Looking back and forth at the underwear in each of her hands, Teresa couldn’t hide her admiration.", "Putting the underwear down, she placed her hand over her mouth and giggled.", "“What a taste!”"]}