{"cid": "416", "title": "Chapter 416. Omen (7)", "content": ["Nur was a port city located in the northwest corner of the human territory, facing the Parasites with the Mariposa Sea between them.", "The presence of the body of water hardly meant the city was safe from invasion. Some Parasites were capable of flying, and there had already been one case in which the Parasites crossed the sea to attack Nur.", "Having said that, it was undeniable that in recent years the Parasites had concentrated its forces on Tigol Fortress, and that it was only in Haramark’s Arden Valley that it had clashed with humanity.", "It was a pitch-black night, without a hint of color.", "“…Hmm?”", "The coast guard on duty yawned before suddenly blinking his eyes.", "He thought he saw something moving beneath the dark waters.", "Although his eyesight was exceptional for a mere guard, unfortunately for him, the enemy had already begun to move.", "Whoosh!", "The shadow jumped at him with great speed.", "When the guard turned his eyes to the sea, the shadow was already behind him, its eyes glowing with malice.", "“What…!”", "The light instantly disappeared from the guard’s eyes and his arms fell to his sides.", "“Uh….”", "His body shook as if he were drunk and he fell toward the sea.", "The succubus quickly grabbed the guard by his neck and slowly pushed him into the sea as if feeding the water.", "Carefully, so that no sound would disturb the silence, tentacles shot up from the sea even before the body reached the surface. They wrapped around the body and dragged it quietly into the water.", "What happened next was a mystery to all, but soon blood dyed the water red.", "These kinds of events were happening simultaneously along the coastline of Nur.", "[Good.]", "When the succubi finished removing all guards from the coast, Vulgar Chastity looked down at the sea with a nod of approval.", "[Come up.]", "With that, a fish-shaped monster that had tentacles sprouting from all over its body appeared above the surface of the sea.", "It was the Temerator, the final evolved form of upper-rank Parasites that gave birth to middle-rank Parasites.", "When Vulgar Chastity signaled, hundreds of Temerators opened their mouths at once and fired sound waves at the city.", "The sound waves quickly spread and took control of the entire city, successfully disabling all forms of communication in Nur.", "[Move.]", "Vulgar Chastity continued to issue orders without a break.", "Under her command, the succubi split into four groups and headed to the gates located in the east, west, north, and south of the city, respectively.", "In order for the first phase of their plan, the invasion of Nur, to succeed, they had to exterminate the entire city without allowing a single survivor.", "A short moment later a head appeared above the sea from where Vulgar Chastity had already left.", "It was Sung Shihyun, the First Army Commander of the Parasites.", "“…Fuck, this is way too easy.”", "He smirked in the direction of Nur, still sleeping without knowing what was about to happen to them, and then dragged his wet body out of the water onto the shore.", "“As expected.”", "He wasn’t the only one.", "The Third Army Commander, Abhorrent Charity, and the Fifth Army Commander, Exploding Patience, led their troops to the shore.", "The Seventh Army Commander, Twisted Kindness, who had been gracefully floating in the air, also prepared to descend.", "Parasites tied to the tentacles of the Temerators also appeared behind the army.", "Splat, splat…", "The coast turned black in an instant.", "“You know what to do, right?”", "Standing at the forefront, Sung Shihyun turned his head left and right to loosen his neck, and aimed his long sword at the city.", "“We’re screwed if we miss even one. Seize quickly, but don’t make any mistakes.”", "Then he kicked the ground and shot forward towards the city.", "At the same time, the Parasite Army, led by the five Army Commanders, rushed at Nur.", "*", "Dawn had already broken when a group of Earthlings arrived at Nur.", "“Arrrgh, I’m so tired. I need to get some sleep.”", "“We should stay at a high-class inn. The rewards were pretty good this time.”", "It seemed like they were on their way back from an expedition.", "Laughing cheerfully among themselves, they entered the city without suspecting anything, for there were a few other Earthlings besides themselves heading for the gate, as well as guards keeping watch nearby.", "Only after passing through the gate did they realize something was off.", "“…Huh?”", "“What the… Why is it so quiet?”", "The city was quiet, and there was something ominous about the silence.", "They could even hear themselves breathe.", "One of the men looked around, dazed with his brow wrinkled.", "Even considering the fact that it was still early in the morning, it was strange that there was no one on the street.", "Another thing that caught his eye was the collapsed buildings. As far as he remembered, these buildings were intact when they left the city.", "And there was this nasty smell.", "It was the smell of rotting flesh and blood.", "“What happened?”", "“Hey, did something happen here last night?”", "The man asked the Earthling entering the gate.", "But no reply came to his ears.", "The Earthling passed him without a word.", "“Hey…?”", "The man’s eyes widened.", "Because the woman who ignored him had suddenly stopped.", "She turned around and staggered past the man again towards the gate.", "She continued to walk back and forth like a corpse.", "That wasn’t all.", "“G-Guard!”", "Despite the desperate call, the guard at the gate didn’t even look back.", "“W-What’s going on?”", "The man finally realized something was wrong and began to back away.", "But he was too late.", "“Look, we should…!”", "The man turned around and opened his eyes wide in astonishment.", "His comrades were looking down at the ground, their faces as pale as ghosts.", "Their ankles were bound by tentacles stretching out from holes in the ground.", "The same had happened to his own ankles.", "At the same time, the Earthlings walking into and out of the city all stopped at once.", "Creak, creak.", "They turned their heads to their prey.", "“What….”", "The man could not grasp the situation. Still, even in the midst of confusion, he knew instinctively what was about to happen.", "“What is this….”", "Tears began to well up in his eyes.", "The next moment the corpses rushed at him with their mouths stretched to their ears.", "*", "On the day Baek Haeju arrived, Seol Jihu held a meeting.", "The topic of the meeting was the Gorad Boga expedition.", "Their plan was simple.", "First, they were to meet the queen of Scheherazade and use Roselle’s mana to find out what she was hiding.", "Then they would decide what to do with the stele, with the option of Seol Jihu bringing it with him or leaving it in Gorad Boga.", "Seol Jihu got up at the crack of dawn and started preparing immediately.", "He put on his gloves, wrapped the transparent cloak he received from Vidalif around him, and headed for the temple with the Spear of Purity in his hand.", "It was because the storage where he kept the Divine Elixirs was in the temple. He always carried one with him but kept the others in storage.", "‘Harmonia Magic Square.’", "Seol Jihu stared at the cube surrounded by black energy.", "This box he obtained in the Special Tutorial infused the user with powerful mana that transformed the mana circuit from within.", "More precisely, it activated the reverse-flow energy against natural laws.", "Seol Jihu had planned to use it as soon as he finished the ‘Path of the Soul’ trial, but quit because Black Seol Jihu strongly opposed it.", "[Quit talking nonsense. Don’t you know how dangerous that thing is?]", "[I hate words like ‘awakening’ and ‘rampage’.]", "[Awakening Skill itself puts great pressure on the body. As if that isn’t enough, you want to mess up your body’s structure to forcefully increase your innate potential? Are you out of your mind?]", "[What’s that? You actually think that the magic square can be controlled? Didn’t you read the description? It says there that it’s unstable.]", "[Sure, it’s usable if the user keeps it at an appropriate level. But let’s be honest, do you really think you won’t strain yourself?]", "[If you really want to use it, then by all means do so. But don’t learn Berserk and don’t even think about learning Thousand Thunder from me.]", "With that, Seol Jihu could no longer be stubborn.", "Both were dangerous techniques, but it was more reasonable to learn Thousand Thunder since it did not distort the user's mana circuit.", "‘I told him I won’t use it, but….’", "But who knows what will happen in the future?", "Seol Jihu stuffed the Harmonia Magic Square into his backpack.", "When he returned to the Valhalla building, most of the members had already arrived before him.", "The carriages arrived shortly after and in turn they boarded the carriages.", "“Kkiiing….”", "Just as Seol Jihu was about to climb up, he felt something pull his foot.", "The little fuzzballs had gathered around him and were biting and pulling his ankle.", "Seol Jihu blinked once before kneeling down and facing their sympathy-winning eyes.", "“What’s wrong? You don’t want me to go?”", "“Kking!”", "“I’m sorry, but you have to wait. I promise I’ll play with you guys when I get back.”", "“Kkiing…. Kkiing….”", "“Until I get back, eat well, play hard, and be good, okay?”", "Seol Jihu stroked their heads one by one and then stood up.", "Then he climbed up into the carriage and closed the door.", "“Kkiing! Kkiing!”", "He could hear the little claws scratching the carriage door.", "“Why are they doing that all of a sudden? Now I feel bad for them. They sound so sad.”", "“I don’t know.”", "Seol Jihu shrugged and let out a small sigh.", "Then he spoke.", "“Let’s go.”", "A moment later the carriages carrying the members of Valhalla swiftly passed through the gate.", "*", "Around the same time.", "The road between Nur and Scheherazade made for a spectacular sight.", "Darkness covered both the land and the sky.", "There was no order or pattern in the way it moved.", "It was rushing forward as if reaching its destination was its only purpose in life.", "The Parasites had successfully taken control of Nur in just one day and were now heading for its next destination.", "To Scheherazade.", "Of course, running wasn’t all they were doing. They did have a strategy.", "In Nur, for example, they were careful to leave the city as intact as possible.", "They also picked out about 100 undamaged bodies, turned them into Parasites, and ordered the succubi to hypnotize them.", "This deception tactic was intended to delay the enemy finding out that Nur had been attacked.", "In addition….", "“I see six insects one kilometer ahead.”", "They were using Twisted Kindness as an aerial scout.", "Upon hearing her report, a group of succubi flapped their wings and hurried forward.", "The Earthlings who spotted them stood dazed for a moment, then turned in a hurry to escape when one of the succubi stretched out her arm in their direction.", "FLASH!", "Light exploded and rays of light pierced the Earthlings’ chests.", "It was photon magic.", "The Earthlings all fell to the ground at the same time, and the succubi quickly flew towards them and caught their bodies.", "“Do we have to be this thorough?”", "Vulgar Chastity, watching the sight from afar, lowered her head.", "She was holding Sung Shihyun in her arms.", "“Even if the enemy notices, it’s just one city. Seizing it will be as easy as pie.”", "Her argument wasn’t entirely unfounded.", "Only a few years ago, three out of the total Seven Armies were enough to destroy humanity forever.", "There were now a total of five armies heading to Scheherazade, among them the most powerful Army Commander, Twisted Kindness.", "Taking down Scheherazade seemed like a piece of cake.", "Nevertheless, Sung Shihyun’s expression remained nonchalant.", "He seemed too annoyed to even answer Vulgar Chastity’s question, but because her gaze lingered on him for too long, finally he spoke with a frown.", "“Do you think we’re doing this just to conquer a city?”", "“We aren’t?”", "“I’m talking about our ultimate goal. You think we’re going through all this crap just for a piece of stone?”", "“….”", "“I hate repeating myself, so remember when I say this. Forget about the city and the stele. Your only focus should be killing that bastard.”", "“I know, but what could go wrong at this point? Even if he realizes right now, it’s….”", "Suddenly, Vulgar Chastity stopped.", "Because she saw Sung Shihyun’s face distort into anger.", "“Listen, you stupid bitch. Can you please just keep your mouth shut?”", "“What?”", "“I said, shut the fuck up. Because I’m hating myself more every time you speak. Ah, why was I so afraid of these shit-for-brains….”", "Vulgar Chastity’s eyelashes trembled.", "“I feel sorry for the Queen. She has to put up with these good-for-nothing fuckers….”", "“What did you say?”", "Exploding Patience, the Banshee Queen, who was flying beside them growled at Sung Shihyun.", "“You see, this is why they say ignorance is bliss. Stupid fuckers are always too proud.”", "Sung Shihyun shook his head left and right.", "“…Who do you think you are?”", "With a big sigh, he pushed up his bangs with his hand and asked coldly.", "“Aren’t you the Parasite’s Army Commanders? For someone who’s in charge of an entire army, and even received the divinity, your brains sure don’t work.”", "“You!”", "“Didn’t I tell you not to let your guard down during this mission? To always assume the worst?”", "Sung Shihyun said in a bleak voice and Exploding Patience flinched.", "“The worst assumption at this point is that they find out who the traitors are and arrive at Scheherazade before us.”", "Sung Shihyun continued in an annoyed voice like he was doing the rest a favor.", "“If that happens our plan will become useless. That’s why, no matter what happens, we have to get to Scheherazade before them.”", "“Still….”", "“Still? There’s no way he’ll notice? There’s no way he’ll arrive before us? It’s because you keep thinking like that, that you keep losing.”", "“…”", "“What? You don’t agree? But I’m right. ‘There’s no way~’ I bet that’s what you thought before you got beat up by the Brightest Star. Like a freaking punching bag. Isn’t that why we’re in this shit right now?”", "Sung Shihyun’s sarcastic tone caused the Army Commanders’ blood to boil.", "These criticisms were unbearable for someone as proud as they were.", "“Admit it, you retards. You lost. To him. Because of your complacency.”", "The atmosphere grew hostile but Sung Shihyun only snorted, not even flinching.", "“What, you want the same thing to happen again? Are you gonna let him drive you into a corner so that you can go running to Her Majesty? Your Majesty~ I’m sorry~ I didn’t know this would happen~ Your Majesty~ What should I do~ Your Majesty~ Save us~ Your Majestyyyy~ …Are you a fucking child?”", "Vulgar Chastity almost loosened her arms holding Sung Shihyun.", "She’d felt this way when he was still her enemy. This guy had a real talent for mocking others.", "Her anger soared but she had no choice but to keep her mouth shut.", "Because Sung Shihyun, who successfully learned to control his divinity, had risen to the same realm as Twisted Kindness.", "And frankly, what he said wasn’t wrong. That was in fact the way it had been during the Arden Valley War, the Spirit Realm Expedition, and the Tigol Fortress War.", "Most importantly, Sung Shihyun was the chief commander of this operation.", "For this mission alone, the First Army Commander possessed the same authority as the Parasite Queen.", "“If our goal is to draw him out, couldn’t we have done so in Scheherazade?”", "Twisted Kindness asked after a moment of silence.", "“There’s a possibility that could have worked.”", "Sung Shihyun answered with a nonchalant expression.", "“But I told you. He excels at creating variables. I’m sure this time again he’ll come up with an idea that no one’s ever thought of.”", "“…”", "“More importantly, the enemy isn’t stupid. Even if we successfully take over Scheherazade, he isn’t going to come running to us.”", "“Even if he retreats… couldn’t we just follow him and kill him?”", "Vulgar Chastity interrupted.", "“Jesus fuck, he’ll find out about Nur soon. And Scheherazade is in the middle of the enemy territory. Do you really think he’ll come alone?”", "Sung Shihyun snapped again.", "“And, if we were going to do that, don’t you think we would’ve gathered as many soldiers as possible in the Hiral Mountain Range and attacked Eva, instead of crossing the Mariposa Sea and attacking Nur? Hmm?”", "Vulgar Chastity pouted because Sung Shihyun seemed irritated only when she spoke.", "“Ah, whatever. I’m the chief commander of this mission. If you don’t understand what’s going on, just shut up and do as I say. Disobey, and I’ll kill you myself. I don’t care if you’re an Army Commander or not.”", "“…Okay, okay, I get it. That’s enough.”", "Vulgar Chastity mumbled.", "“Then shut up and get moving.”", "Sung Shihyun snorted and continued.", "“Remember, you’re my puppets in this mission.”", "“…”", "“If we win, clap your hands and praise me. If we lose? Then you can swear or throw a fucking tantrum or whatever.”", "Basically he was saying they should blindly follow his orders.", "“You sound very confident…. We’ll see how it goes.”", "Twisted Kindness remarked calmly and recited a Dragonic Spell.", "Abhorrent Charity also cast a spell.", "A violent gust of wind blew past them.", "WHOOOOSH!", "With Sung Shihyun in her arms, Vulgar Chastity flew across the sky at jet speed.", "*", "On the third night after leaving Eva, Seol Jihu realized something wasn’t right.", "In the middle of the night, Phi Sora, who was on a night watch, woke Seol Jihu up as he slept in a tent at a campsite they had set up. They had stopped to rest the Horuses that had been running nonstop for two days in a row.", "Apparently he got a call from Kim Hannah.", "“…What?”", "Seol Jihu’s brow furrowed as he listened.", "“We lost contact with Nur?”", "—Yes, the call is going through, but no one is answering. Not even the royal family. Fortunately, the Japanese Business Federation managed to get in touch with a couple of Earthlings near Nur and sent them to the city, but soon lost contact with them, too….", "Dazed, Seol Jihu listened to her quietly. His eyes slowly began to fill with anxious curiosity.", "Nur had suddenly stopped responding to their contact.", "Such a thing will be impossible unless more than half of the Seven Armies attack at once…. Seol Jihu thought so before gasping in disbelief.", "Why right now?", "It all felt too staged to be a coincidence.", "“…Kim Hannah.”", "The corners of his mouth trembled, but he swallowed once and continued.", "“Listen to me carefully.”", "—O-Okay.", "“Contact the organization in Scheherazade to capture Roe Scheherazade and her attendant. Tell them that whatever happens, they must take away the Royal Oath. I’ll take responsibility for everything.”", "Kim Hannah seemed more than surprised.", "It was a risky move as the situation wasn’t clear yet.", "But soon she realized Seol Jihu’s intention and asked calmly.", "—What if the two have already vanished?", "“Where else would they go besides Gorad Boga? I’ll ask Yuhui Noona the exact coordinates and give you a map.”", "—I understand.", "“Contact every single royal family and representative organizations except for Scheherazade’s. Have them issue a draft call and send all available soldiers to Scheherazade. This has to happen today. Hurry up!”", "Seol Jihu ended the call with a shout.", "He got up to wake up his comrades, but the campground was already bustling with noise.", "“I said, I’ll pay you enough to buy 100 new Horuses!”", "Phi Sora, who overheard their conversation, had already awakened the rest of the members and was bargaining with the wagoner who claimed he was too tired to move.", "Seol Jihu quickly took out another communication crystal from his pocket.", "The crystal was linked directly to Sinyoung.", "‘I wasn’t going to contact them, but….’", "The situation had changed.", "He wasn’t sure, but—", "No, he was sure.", "Now was the time to exhaust every means possible.", "‘Come on…. Why isn’t she picking up?’", "Seol Jihu chewed his lips with his hand over the crystal.", "With a nervous look, he raised his chin up to the sky.", "The night sky was dimmer now as a blanket of dark clouds covered the moon.", "He thought he heard crows in the distance.", "Seol Jihu let out a grunt of frustration as all these seemed like a bad omen to him.", "The situation was rapidly deteriorating."]}