{"cid": "292", "title": "Chapter 292. Eun Yuri (3)", "content": ["The treasure hunt had begun.", "After the difficulty level increased, Kim Hannah did not take her eyes off of the Tutorial. One could say that it was an emergency. After all, Valhalla’s representative could possibly die with one wrong move.", "The reason Kim Hannah was not praying desperately like Chohong or chirping to be let in like Little Chick was because Eun Yuri was surprisingly doing a good job.", "‘She’s smart.’", "That was the evaluation Kim Hannah gave Eun Yuri after two hours from the start of the second stage. Considering the fact that Kim Hannah did not easily give out compliments, this could be perceived as a major praise.", "Fooling Park Woori and Yoo Yeolmu into joining her side and using the group of survivors who were trying to attack her was a brilliant performance, even if Kim Hannah took into account Eun Yuri’s previous experience.", "But that wasn’t all. In order to comply with Seol Jihu’s expectations, Eun Yuri had to get useful tools as quickly as possible. One common mistake among the survivors was that they did not keep into account the time spent putting the coins into the gacha machine.", "It surprisingly took a significant amount of time to insert coins one by one. Since Eun Yuri was experienced, she managed to successfully minimize the time needed to use the gacha machine.", "The method she chose was doing everything simultaneously. First, she wrote down areas that were tricky to get to from the diary. Then, Yoo Yeolmu, carrying the written list, would meet up with the group of survivors, who were following him from a distance, and they’d then look for the coins together.", "It was obvious just from watching what was being played out.", "—Did you find them all?", "—Take ‘em. There’s 201 in total.", "—You aren’t hiding any, right? The moment that bitch starts suspecting us, it’s over.", "—I didn’t, I didn’t. You can count them if you want.", "—I won’t, but she will. She doesn’t make it obvious, but she’s been loosely counting the stack with her eyes every time I bring the coins to her.", "—What a picky girl… By the way, how many more people do I have to get? I’m trying to persuade people whenever I meet them for now. I’ve gathered around sixteen.", "With the coins collected, Yoo Yeolmu would head toward Eun Yuri before sneakily taking a turn. He would then meet up with Park Woori, who would be using the gacha machine, and hand over the collected coins.", "—How does it look? Have we got a fair amount?", "—I’m not sure. I got a leather armor and two spell balls, but… Yeolmu Hyung-nim, is this good enough? Probably not, right?", "—I don’t know. It’s hard to judge by ourselves.", "—This is driving me crazy. It would be better for us and the Missus if it showed up faster… Tsk. How many coins do we have left?", "—We found a bit over half of the coins. Anyway, give them to me first. No, I can do it. You keep pulling.", "—Alright. Ah, you should leave the coins.", "—Of course. Right, the Missus said it would be better to move after we’ve got a few. It might overlap with the route of the next search.", "—Really? Can you show me the map for a second? For you to come easily… I’ll move to the northwest machine. I’ll meet you there next time.", "Afterward, Yoo Yeolmu put the items Park Woori got in his bag and went back to Eun Yuri, who was searching for the easier-to-reach coins in a mountain resort.", "—Here are the items.", "—…This won’t do.", "—Then we’ll need to pull more. Let’s hurry.", "—Here is the list of locations and the coins I found in the mountain resort. Exactly 32 in total.", "—Then I’ll be heading out right away.", "—Thank you. I’ll see you at the next meeting spot.", "Yoo Yeolmu, with the list and coins from Eun Yuri, once again got in contact with the group of survivors. Then the cycle continued, endlessly, until they got every item they wanted or used up all the coins.", "‘She’s doing better than I expected, but…’", "It was impressive that she designed the most effective route to move and gave orders calmly even in such a critical situation. Because of it, Kim Hannah began to look forward to finding out her temperament and aptitude.", "But since she was only doing the best she could do in the given situation, there were still some problems.", "“God, it just won’t come out.”", "Oh Rahee muttered while watching Park Woori eagerly putting in more coins into the gacha machine. He wasn’t so lucky. This was also the one concern Kim Hannah had, but nothing could be done about it since gacha machines were based on luck.", "People could plan their actions but it was the heavens that granted it.", "Since half of the coins were yet to be used, Kim Hannah decided to observe the situation for a while longer.", "*", "Yoo Yeolmu returned. Eun Yuri sighed after checking the items in the bag. It was a failure once again.", "It wasn’t that there was no progress. They got some useful items such as potions, spell balls, and a leather armor. But if one were to ask if they could defeat the rampaging Homunculus, Eun Yuri would hesitate. She simply didn’t have any confidence.", "‘What should I do….’", "Seol Jihu asked her to find a solid solution. But in the current situation, it was uncertain if they could find it this way through the gacha machine.", "Yoo Yeolmu spoke up when Eun Yuri’s face started to fill with uncertainty.", "“Don’t worry too much.”", "“….”", "“It’s not like we don’t have any coins left, and gacha machines really rely on luck. He’ll understand as well.”", "Eun Yuri raised her head and stared at Yoo Yeolmu, who was speaking with a deep voice. He was the one who was having the hardest time at the moment. It was obvious from how his clothes were drenched in sweat.", "He should be tired from running back and forth, but instead of complaining, he was comforting her. Although Eun Yuri did not lower her guard, she definitely felt grateful.", "“That’s right. I’ll keep trying.”", "“Sure. You can hand that over.”", "“How’s it going back there? They aren’t getting suspicious?”", "“It’s fine for now. I’ve been making up excuses every time they ask. I will let you know if I see any suspicious movements.”", "Yoo Yeolmu left the mountain resort soon after receiving the note and the coins. Once she heard the doors close, Eun Yuri shook her head.", "‘He should be fine. He said he’d run away if it became too dangerous.’", "Since the rampaging Homunculus wasn’t running amok on the island, it was unlikely that Seol Jihu was defeated. Moreover, Eun Yuri did not have the time to be worried or tired.", "Even at this very moment, Seol Jihu should be risking his life to hold the Homunculus back.", "‘Let’s go.’", "Eun Yuri stepped forward energetically.", "Then, she ran.", "*", "The whole island was dyed in a golden hue as the sun started setting. Considering the fact that the second stage of the Tutorial started around noon, a significant amount of time had passed.", "“Shit, shit, shit, shit…”", "Park Woori was still wrestling with the gacha machine. He was restlessly inserting coins.", "“Please, please. Come out now. Please.”", "Thousands of coins had already been inserted into the gacha machine, and dozens of items had already appeared. It was about time that a useful weapon would come out, but the vast majority of the items being useless made Park Woori desperate.", "But more than anything, the fact that there could only be one coin inserted into the machine at a time was driving Park Woori mad.", "“God damn it. I want to see the face of the bastard that made this machine.”", "How sadistic must the creator be to make a machine like this?", "“What’s wrong with being able to put tens or hundreds of coins in at once? Ugh, my hand hurts.”", "Eventually, he frowned and massaged his thumb. His fingerprints were overwritten with the coin patterns.", "“I don’t know who made this, but he must be a total asshole. Fuck, whoever made this shit needs to pull the coins out of this machine one by one to get their salary. That will teach them a lesson.”", "Park Woori, not knowing that the seven gods did not receive salaries, held the coins tight as he complained.", "As he got ready to insert the coins in once again…", "“….”", "He blinked rapidly. He tilted his head slightly as well.", "“Uh… what number was I at?”", "He forgot. In fact, he was not counting from the moment he took his hands off. Counting and inserting coins endlessly had made him think that he was counting this time as well.", "“Ah, shit. Was I putting them in? Did I get a new item?”", "Although he tried to trace his memory back, he failed to remember and groaned.", "“Ah, whatever. I’ll say I made a mistake.”", "Thinking they would not kill him for a little mistake, he started to insert the coins once again. However, a vast number of coins were already inserted.", "Although Park Woori did not know, he had put close to two hundred coins while he was grumbling. As he inserted a hundred more, the machine had three hundred coins in total.", "And the gacha machine had an item that could be pulled for 300 coins.", "“Phew.”", "Park Woori turned the lever, seeming tired of the situation. He no longer had any expectation from the machine, having lost all hope.", "Clunk! But when the item came out, Park Woori’s bored eyes widened in surprise. It was an item he had never seen before.", "“…Oh?”", "His jaw dropped as soon as he read the description.", "*", "The problem broke out around the time they passed the 16th location. No, it did not happen yet, but it seemed that something would happen.", "When Yoo Yeolmu was about to head back after collecting the coins, the young man stopped him.", "“I understand that there are still some coins left, but shouldn’t we get going soon?”", "The young man spoke as he looked back toward his resting companions.", "“If it were up to me, I would pull as many items as possible, but a lot of people are frustrated. Everyone is exhausted from searching for hours.”", "This wasn’t too surprising. In the beginning, people cooperated whole-heartedly since they did not know when the monster would attack, but as they found a significant amount, some people began to think differently.", "“Anyway, I was wondering what you thought.”", "Yoo Yeolmu noticed that the survivors were paying attention to this conversation. He had to pick the right response. If he flat out rejected the notion, there was a huge chance they would start suspecting him. But he needed to earn enough time to sneak out once.", "“Well… they said they’re holding the monster back with their bonus privilege, but I can’t be sure because I haven’t seen it myself.”", "Yoo Yeolmu continued as he pretended to be in thought.", "“I guess going when we can isn’t a bad idea.”", "“So you agree.”", "“Rather than agreeing, it’s more that I don’t really care. So you guys already made up your mind?”", "“No, not yet. We’ve got several different opinions.”", "The young man shook his head.", "“I actually think it’s a bit of a shame. There are at least 800 coins left. If we don’t collect them, it means we’ll each get 50 less.”", "“That’s true.”", "Yoo Yeolmu slowly nodded and then continued.", "“Anyway, it won’t matter when we carry out our plan. We already know the route that bitch is going to take. The only question is when.”", "“That’s true.”", "“Then let’s do it this way. I’ll go to her and see what she’s up to. You guys discuss amongst yourselves and come to a decision by the time I come back. If we’re going to continue with the search, we can search with the note I bring, and if we decide to quit, we could go and strike right away.”", "“Okay. So you’re fine either way, right?”", "“Yeah. Anyway, don’t fight and talk it out peacefully. The end is near, so there’s no need to fight.”", "Yoo Yeolmu turned away after an earnest plea. As he walked away with a fast pace, his expression had turned stiff.", "‘If they decide to keep searching, we’ll have some time… but it’s slowly getting dangerous.’", "Although fleeing at this point seemed like the right choice, the decision belonged to Eun Yuri.", "Yoo Yeolmu searched for Park Woori in a hurry after deciding to inform him of the situation and hand over the coins. But once Yoo Yeolmu arrived at the gacha machine, he was struck speechless.", "Park Woori, who had always been complaining and swearing as he inserted the coins, was packing his bag.", "“Oh! Hyung-nim, there you are!”", "Park Woori seemed delighted to see him.", "“What happened? Why…”", "“It happened! Finally! I finally pulled it!”", "“We did?”", "Yoo Yeolmu’s ears perked up.", "“Are you sure?”", "Park Woori grinned, then stood up with his bag. Lifting what he had in his left hand as if to show it off, he raised his thumb. Then, he shouted.", "“Yes!”"]}