{"cid": "399", "title": "Chapter 399. To Change (1)", "content": ["“Still no word from Sinyoung?”", "“No, nothing worth reporting. I’ve heard they’re investigating the case, but that’s just something they leaked to the press as a decoy.”", "“I don’t get it. Their partners are all turning their backs on them. Do they really think they can walk away from this like nothing happened?”", "“They think they can afford to lose a few limbs. As long as the head lives, the rest of the body can regenerate. They’re confident just like that.”", "“Really!?”", "‘I wonder how long that confidence will last.’ Seol Jihu muttered to himself and opened his desk drawer.", "“I can’t believe they’re doing nothing. They must have no sense of urgency…?”", "Suddenly, Seol Jihu’s hand which was fumbling through the drawer stopped and he blinked in confusion.", "Kim Hannah was all smiles. Her eyes sparkled like a girl in love.", "Thinking back now, she’d been looking like that ever since he started provoking Sinyoung.", "“Did something good happen to you?”", "“Why do you ask?”", "“Your smile is really pretty today.”", "“Don’t make me blush. It’s just the makeup.”", "Kim Hannah cupped her face in her hands with a modest sigh.", "The truth was that everywhere she went these days, people were telling her how pretty she looked.", "There were even rumors about her being in love.", "“Do you remember the promise we made when you first recruited me? The second one, more specifically.”", "The question was sudden, but Seol Jihu instantly recalled the incident.", "[Become a big tree.]", "[I’m saying you should grow an organization to its fullest extent centered around you. Big enough so that you can easily look down on Sinyoung.]", "Years had passed since then and Seol Jihu kept his promise.", "As a private organization, Valhalla was definitely more powerful than Sinyoung. Even now, it was putting overwhelming pressure on the pharmaceutical company.", "Sinyoung, which threw her out.Yun Seohui, who mocked her.Jung Minjong, who transferred her to the attack team.", "Kim Hannah couldn’t help humming with joy whenever she thought about how those three must be feeling now.", "Her joy was so intense that once, she even danced alone in her room.", "She was eating better and exercising more often. Her bowel movements were regular and she slept like a baby every night.", "She felt more energetic than ever, and her skin was softer and smoother.", "Such were the effects of the stabilized circadian rhythm.", "“I can’t wait for Sinyoung to come and beg us to talk to them. Ah, you’ll let me accompany you when that day comes, right?”", "Kim Hannah asked, shaking her shoulders left and right.", "“Of course, you’ll be my companion.”", "Seol Jihu gave a small smile.", "“Thank you, Representative.”", "A beaming smile spread across Kim Hannah’s face.", "“When you first said you wanted to build an organization, I never thought this day would come…. I’m glad I joined Carpe Diem. It was one of the best decisions of my life.”", "Reminiscence filled Seol Jihu’s eyes as he watched Kim Hannah smile radiantly.", "He recalled the time he saw her through Nine Eyes.", "The image of Kim Hannah as a succubus, laughing hysterically while looking down at the ashes of Scheherazade, still lingered in his head.", "There was something similar between that version of Kim Hannah and the one standing here now.", "However, even though the situation might be similar, the process and the outcome was completely different.", "Tigol Fortress was free, Scheherazade was thriving, and— most importantly— Kim Hannah was still a human.", "A soft smile spread across Seol Jihu’s lips.", "On the surface, he might appear calm, but he did have a few doubts about his decisions.", "He wasn’t sure if he was going in the right direction or what waited for him at the end of the road.", "But Kim Hannah’s words just now gave him the courage to keep trying.", "Whatever the future might be— it would at least be better than the first run.", "“So, how will you surprise me this time?”", "Kim Hannah asked, her eyes flickering with curiosity.", "Currently, Sinyoung was backed into a corner and Valhalla had used up all its resources. She couldn’t think of anything more they could do.", "But then she remembered Seol Jihu’s words. He said that he would pour out an entire barrel of oil if Sinyoung tried to put out the fire.", "The long-awaited moment had finally come. Now it was time for them to pour oil on the burning house….", "“You may look forward to it.”", "With a grin, Seol Jihu began rummaging through his desk drawer.", "“I’m sure you know about this already. Didn’t I tell you before I left to train?”", "“Ah.”", "Kim Hannah made a sound of recognition but then tilted her head curiously.", "She couldn’t see how that related to the current situation.", "[So rather than attacking the Empire, which has a high probability of failing, I suggest we do something more worthwhile.]", "[Something that will benefit us both. I’ll be straightforward. I think you should use the time that this war bought us to regroup humanity.]", "[Do you want to at least hear me out?]", "After their victory in the Tigol Fortress War, Gabriel had invited Seol Jihu to a meeting with the higher-ups of the Federation and made an interesting proposal.", "But this proposal could not be implemented immediately because of its large scale.", "Almost a year had passed since then.", "Seol Jihu had been secretly preparing to bring this proposal to reality.", "More precisely, he had focused on becoming stronger and left the rest to a trusted comrade.", "But enough with the preparation. Now seemed the right time to initiate the grand scheme.", "“Hoit.”", "Seol Jihu pulled out a communication crystal from deep within the drawer and placed his hand on top of it.", "*", "After the call, Seol Jihu went to the Eva Royal Palace to check on the progress of the plan.", "“Mm…. That plan….”", "Sorg Kühne, the royal administrator of Eva, seemed troubled.", "“Preparations are mostly complete. We’ve secured a wide enough area and have been working together with Dongchun Merchants for a long time to stock up on supplies. And, with the recent turn of events, I don’t think the residents would refuse either. However….”", "He assured Seol Jihu that he was almost ready, but judging from the tone of his voice, there seemed to be a problem.", "“Is it money?”", "When Seol Jihu saw Sorg Kühne smacking his lips, he placed his index finger on his thumb to form a circle.", "“…Yes.”", "Sorg Kühne admitted with a bitter smile.", "“It’s hard enough planning one big event, but I have to take care of two….”", "“You should’ve told me sooner.”", "“I’m sorry. This plan is for the good of Eva, so I wanted to make this work without relying on any outside forces.”", "Said Sorg Kühne, but the truth was he didn’t want to put any more pressure on Seol Jihu, who was already so busy.", "“Don’t worry about it.”", "Seol Jihu saw through him and announced with confidence.", "“Money isn’t a problem at all.”", "Sorg Kühne blinked.", "*", "After he returned to Valhalla, Seol Jihu prepared to leave right away.", "“Flone!”", "[Hmm?]", "“Do you want to go on a honeymoon with me?”", "[…Honeymoon?]", "Flone’s head slanted to one side.", "[I’d take a trip with you any day of the week, but a honeymoon is a bit…. You know I have a husband, right? Although I became a widow not long after the wedding.]", "Flone placed her hands on her waist with disapproving eyes.", "With a light chuckle, Seol Jihu placed his hands over Flone’s shoulders.", "And he spoke.", "“Don’t you think it’s a little late for that?”", "[Excuse me? A little late for what? Are you doubting my fidelity?]", "“Alright, then let me ask you. Who do you like better, your husband or me?”", "[Huh? T-That’s….]", "Flone seemed visibly shaken by Seol Jihu’s question.", "“Hm? What did you just say? I can’t hear you, speak louder. Or maybe you don’t want to go after all?”", "[No, I do! I want to go! I like you better!]", "Giggling, Flone threw her arms around Seol Jihu.", "[Uhuhuhu. Having an affair is more fun than I thought. So, where are we going?]", "“To collect the Rothschear’s inheritance. Can I? I need it for something.”", "[Aha. Of course, you can. Why do you even ask?]", "Flone readily consented before suddenly bursting into laughter.", "[Ahahaha! My husband was supposed to inherit that money, and now I’m basically giving it away. If my family knew, they would be so upset!]", "The laughter continued. Flone seemed content to at least take revenge this way.", "[I like this. Now then, shall we go? Mr. Partner-in-Crime?]", "With a broad smile, Flone clung to Seol Jihu and linked her arms through his.", "Seol Jihu’s face turned bitter. He was only joking, but Flone seemed to have awakened to a new taste.", "Anyway, Seol Jihu announced to the rest of the organization that he would return in ten days and went on a honeymoon trip with Flone.", "Rothschear’s inheritance was buried in a total of five different areas.", "The place where gold was buried was in enemy territory, but it was still close to the border.", "It was as close to the human territory as the ancient emperor’s villa and Seol Jihu was much stronger now than before. So he thought it would be worth a try.", "Of course, if the Parasite Queen or the Army Commanders were to appear, they would be in big trouble. However….", "‘It’ll be fine.’", "According to the bishop, Sung Shihyun told him that it would take about three to four months for the Army Commanders to fully recover. This meant they still had time.", "Seol Jihu traveled to Grazia, located in the northernmost part of human territory, and crossed the sea using the convenient flying artifact named Flone.", "The number of valuables he had found next to the Rothschear Family’s secret arts was by no means small, so he couldn’t help but look forward to finding out how much would be buried here.", "The treasure was buried inside a cave near the shore where the water had come into the land.", "The bay was huge and had several caves, making it difficult for Seol Jihu to locate the correct one at first, but the overall exploration was pretty easy.", "Unlike the Pagoda of Dreams expedition, all he had to do was find what was hidden.", "Flone’s grandfather seemed to have valued the secret arts more than his treasure.", "The search ended quickly.", "Seol Jihu went up a hill, activated his innate ability, and found the spot where red and gold were aligned.", "In short, the House of Rothschear, one of the Four Great Families best known for its wealth, did not disappoint Seol Jihu’s expectations.", "Rather, it exceeded his expectations and went beyond his imagination.", "Seol Jihu carefully stepped inside and opened the moss-covered stone gate, located in the deepest part of the cave.", "When he stepped into the dark space beyond the gate, his jaw dropped instantly.", "The room of about 330 square meters was filled with old chests that showed the passage of time.", "Each chest had been carved with the Rothschear’s crest and was as large as an adult male’s body.", "The treasure chests were locked, but when Seol Jihu pulled one of them with force, it opened with a squeak.", "Seol Jihu felt dizzy as soon as he saw the reddish light coming out of the chest.", "Well-crafted gold bars, not coins, filled the chest so completely that there was not an inch of space left inside.", "That wasn’t the end.", "Some chests were filled with jewels resembling the night sky, while others were filled with luxurious ornaments, all neatly stacked in piles.", "[What do you think? Pretty cool, eh?]", "Flone saw the expression of Seol Jihu’s face and gloated.", "But the next moment her face fell and she said in a pitiful voice.", "[Take them. They’re all yours.]", "“…”", "[You’ve already taken my body and my heart. My honor has been tainted in your hands…. So what does money matter at this point? Now that things have come to this, I am ready to sacrifice my everything for you!]", "For the past few days, Flone had been obsessed with the fictional scenario in which she was a married woman from a prestigious family, and Seol Jihu was the scoundrel who corrupted her by force.", "Seol Jihu shook his head disapprovingly.", "“Let’s get them moving. Nothing good will come from spending our time here.”", "[Sure, but how are you going to move them? There’s only two of us here.]", "She was right. There were simply too many chests for the two of them to carry, as there was a limit to the amount that could fit in a space-expanded bag.", "“I’ve already thought about it.”", "Seol Jihu waved his hand in the air with a grin.", "Immediately the air split in half and from the crack a large hole formed that looked like a black hole.", "[Woah! What’s this?]", "“It’s one of the many convenient features of a Unique Ranker.”", "It was true. When he first became Level 7, he was so busy with training that he didn’t notice that he had many new convenient Authorities that he could acquire.", "Dimensional Pocket was one of those Authorities.", "The moment he recalled the memory of Seo Yuhui at Huge Stone Rocky Mountain pulling the Flower of Soma out of her Dimensional Pocket, Seol Jihu rushed to the temple and paid contribution points to obtain one of his own.", "Seol Jihu rolled up his sleeves.", "“Just throw the chests into that hole. Flone, will you help me?”", "[Why, of course! I grew up without knowing a day of hardship, but for you, I won’t hesitate to get my hands dirty!]", "“…Flone?”", "[Ahahaha! What? You started it~!]", "The two began moving the chests, laughing and chatting merrily.", "*", "“…”", "Sorg Kühne had never looked more in awe.", "He was simply speechless.", "Seol Jihu had asked for a large storage room and that’s where Sorg Kühne had taken him.", "“Watch. Gold, come out.”", "Seol Jihu took out a chest from his Dimensional Pocket and shook it. Gold bars spilled from the opening.", "[Jewels! Come out!]", "With a giggle, a beautiful ghost with silver hair held one of the chests upside down and glittering jewels poured down like a waterfall.", "“No…”", "Sorg Kühne’s mouth dropped open….", "“…Way.”", "…And closed only after the treasures they had brought filled four storage rooms.", "“Is this enough?”", "Seol Jihu asked, dusting off his hands.", "When he saw that all of the rooms had been filled with mountains of treasure, the royal administrator closed his eyes and opened them again.", "With a look of disbelief, he turned to Seol Jihu.", "“Ah, this is the inheritance of Rothschear.”", "“Rothschear? You can’t mean the Rothschear, the Spear of the Empire…!”", "[Mm-hmm.]", "Flone nodded and folded her arms.", "When her eyes met Sorg Kühne’s, she made the V-sign with both of her hands.", "“…”", "Sorg Kühne buried his face in his hands.", "“What’s wrong?”", "“…Nothing. There’s just a lot going on that’s beyond my understanding.”", "He answered weakly before shaking his head with force.", "Then he turned his gaze to the treasure chests and suddenly blurted in a rush.", "“I-I don’t need everything. These are the rewards of an expedition and should be divided according to the ratio set by….”", "But his sentence was cut short by Seol Jihu who shook his head side to side.", "“…Do you have no greed?”", "“Of course I do. But I already have enough to last a lifetime. I have as much as I’ve given you in my storage. It’s overflowing, really.”", "Seol Jihu grabbed a handful of jewels and turned his eyes.", "“And… the need for money will only increase from now on. I believe you’ll use it for the right cause.”", "A lot was hidden behind his words.", "Sorg Kühne’s expression turned solemn and he inhaled deeply.", "Touched by Seol Jihu’s faith in him, his eyes burned with passion.", "“…I won’t use it just for Eva.”", "After a moment of silence, he spoke in a voice close to tears.", "“I’ll use it for the whole of Paradise. I swear on my everything.”", "“Could you prioritize Odor and Haramark?”", "“I will. I promise.”", "Sorg Kühne saw Seol Jihu smile and tightened his fists with resolve.", "“So the money problem is taken care of…. What about Her Majesty?”", "“I told her about the plan a long time ago. She’s already found the Royal Oath and is ready.”", "“Great. And the script?”", "“She says she doesn’t need it. She’d like to speak frankly from her heart.”", "‘From her heart….’", "Seol Jihu stroked his chin.", "He recalled the time Charlotte Aria rolled on the floor alongside Odelette Delphine, yelling, “Let her! Let her!”", "“If it’s too much of a burden, I’ll gladly take her place.”", "“No, it’s fine.”", "Sorg Kühne’s lips curled into the slightest of smiles.", "“I understand why you’re worried, but Her Majesty has changed since she started learning magic.”", "“Mm. It’s a pretty important scene.”", "“I know, but please give her a chance. She’ll uphold the majesty of the royal family of Eva, of Aria blood, in front of the whole world.”", "With that, Seol Jihu could no longer refuse.", "“Well then. I’ll get ready as well.”", "*", "When Seol Jihu returned to Valhalla, he was met with fierce criticism from his administrator.", "“Are you insane? Are you insane!”", "“Wha-What?”", "“You gave them everything? You didn’t even leave a single cent behind?”", "“Well, yeah….”", "“No!”", "Kim Hannah screeched.", "“How could you turn everything over? No, seriously, how could you?”", "She clutched the back of her neck and panted for breath.", "Seol Jihu asked, disconcerted.", "“Is Valhalla suffering from a lack of funds?”", "“No, of course not!”", "“Right? We have enough. And from what I’ve heard, we were able to secure quite a bit of money from here and there because of the recent incident…. Anyway, try to understand. This plan costs a lot of money.”", "“Still! You have to think of profit! Stop being such a pushover!”", "[What? A pushover?]", "It was then.", "[You… What did you say?]", "Flone intervened, unable to conceal her irritation.", "[Don’t make me laugh. You didn’t even participate in the expedition! You see, this guy and I agreed to hand it over.]", "“That’s not what I meant!”", "[And, is that even your money? Nope, it’s mine! I’m the rightful inheritor! So why should you decide what happens to my money? Who do you think you are? Hmm?]", "Kim Hannah hesitated to respond.", "The fact that her opponent was a ghost, a notoriously cruel race, and that everything she said was right, made her speechless.", "“Still… If only he’d brought half of that money….”", "Kim Hannah fell to her knees, pounded the ground with her fists.", "[Hmph!]", "Flone lifted her head with a snort and Seol Jihu smiled bitterly.", "*", "At around the same time, ominous energy filled the Imperial Palace.", "For the past few days, the Parasite Queen had been observing the celestial bodies without a moment of rest.", "[Ha….]", "The movement of the stars was, simply put, a wreck.", "It was so wild and disorderly that even the Parasite Queen had difficulty interpreting it.", "The queen had already figured out the cause of the change.", "While she was asleep, a group of stars reversed their orbit and collided with the brightest star.", "But the brightest star didn’t even budge, and the stars that crashed into the brightest star were shattered to dust.", "In the process, the brightest star began to burn even more intensely, creating a massive explosion centered around the cluster of stars in its vicinity.", "As a result, the celestial orbit was completely distorted and all the stars were being sucked into the storm.", "The stars either adapted to the new orbit created by the brightest star or shattered after failing to adapt.", "All of this was the result of the butterfly effect caused by the stars that initially crashed into the brightest star.", "[Damned fools…. They should have just stayed put…!]", "The Parasite Queen clenched her teeth.", "The problem was that this wasn’t the end.", "As if the situation wasn’t bad as it was, the queen sensed another change was about to take place.", "This change, a massive storm, would affect not only the Federation and humanity but also the Parasites.", "[Keuk…!]", "She could no longer sit idly by and do nothing.", "[Uooooooooh!]", "Her roar of wrath echoed through the palace and spread for several miles.", "The Army Commanders felt the wrath of their queen and shuddered.", "[Queen…!]", "[Your Majesty…!]", "All of them turned at once and began to run towards the corrupted throne.", "The Parasite Queen had summoned the six Army Commanders."]}