{"cid": "141", "title": "Chapter 141. Choice of Destiny", "content": ["Seol Jihu felt his neck tense up. ", "White Rose had finally revealed their cards. Things did get a bit confusing with the appearance of Phi Sora, but there was a possibility that even her intrusion was part of a big act. ", "The important thing was that Jang Maldong’s suspicion had been correct. ", "Seol Jihu decided to focus on this fact and asked back. ", "“What work?”", "“I may have made it sound like something big, but it’s nothing much, honestly.”", "Phi Sora leaned her body forwards with her hands still on the table. ", "“We’ve been crafting up a very~ intricate plan, but it ended up becoming larger than we thought. So, we want you to lend us a helping hand.”", "“Then—”", "“Are you thinking we’re asking for money? Or equipment? Oh please! Our White Rose isn’t a group of beggars.” ", "Phi Sora lifted her chin up and elegantly pointed at Bok Jungsik.", "“As long as you say okay, you get to take your beloved Yi siblings with you. That man will take the responsibility of transferring them without a hitch.”", "In other words, the mastermind behind this proposal was Bok Jungsik, not Phi Sora. ", "As the gazes shifted to him, Bok Jungsik laughed awkwardly. ", "“I wasn’t intentionally pushing the conversation in circles. I was just trying to look intricate in front of Sir… though everything got ruined thanks to someone.”", "Bok Jungsik said this matter-of-factly, but as if it was too shameless for even himself, he let out dry coughs. ", "“Hmm. Well now that things are already this way, I’ll just tell you everything. A while back, I bought a piece of information concerning a ruin from an information guild. It was quite an exchange considering that we paid 10 gold coins for that information.\"", "Seol Jihu’s eyes widened. Information trading was nothing unusual, but 10 gold coins were way too expensive. ", "Converting to Korean Won, the information was worth 50.05 billion Won. ", "“You might say we’re crazy, but the proof the broker prepared was unquestionable. On top of that, we commissioned authoritative Magicians to verify the information, cross-referenced it with historical documents in the library, and deployed survey teams to the site under the consent of the broker. With the facts laid out, I became confident in the validity of this ruin.”", "Bok Jungsik adjusted his glasses. ", "“The ruin definitely exists and if the expedition succeeds, then we would easily earn treasures that far exceed our initial investment of 10 gold coins. According to the reports— don't be surprised— it’s supposedly a secret villa belonging to an ancient emperor built for certain purposes.” ", "“How much more are you planning on telling them!?”", "Phi Sora angrily stopped the conversation. ", "“Why are you spilling everything when you don’t even know if they’re trustworthy yet?”", "“Okay, okay.” ", "Bok Jungsik waved his hand before folding them in front of him.", "“Anyway, that’s the situation…I know it’s an unprecedented and unique transfer condition. But as the guild’s fate is at stake, I ask for your understanding.”", "Bok Jungsik made a smile. ", "“But with Sir’s personality, I doubt you would agree. So we prepared additional terms.”", "“Additional terms? Why haven’t I heard about this?”", "Phi Sora sharply raised her voice, but Bok Jungsik didn’t even pretend to hear. ", "“We will keep the promise of transferring even if the expedition fails.” ", "In other words, they would transfer the siblings as long as they just agreed to participate.", "“But that is an extremely unlikely event. We’ll be troubled if you’re hoping it fails, you know.”", "Bok Jungsik chuckled. It was as if he was extremely confident in his plans. ", "“Additionally… you must be worried that we might try to use you as a meat shield or bait, are you not?” ", "He made an all-knowing grin. ", "It wasn’t wrong to say that it was the first doubt that crossed Seol Jihu’s mind when he heard their proposal. ", "“Sora will be in charge of the expedition, and Sir knows that she’s a capable professional when it comes to work.” ", "As Jang Maldong nodded in agreement, Phi Sora’s nose shot up higher than the Eiffel Tower.", "“But because I trust the reputation of Carpe Diem and Mister Seol Jihu, I’d like to give you the authority to veto any decision during the expedition.\" ", "“What did you say?”", "Phi Sora’s eyes lit up with fire.", "“Are you out of your mind? On whose authority are you basing that on?”", "“Mine. Can I not even do this as the leader?” ", "“Look here, old man! The expedition captain is me!” ", "“Who are you calling old man, I’m your leader! And are you saying that you can’t trust a team led by Sir Jang Maldong?” ", "“I do trust Grandpa! But—!” ", "“Quiet down. The discussion isn’t over yet.” ", "Bok Jungsik stubbornly pushed on as if he would never take back his decision.", "“I apologize for raising my voice. I’ll continue. We’ll grant you veto power, but like Sora was worried about, there is a possibility that this might sow disagreement within the expedition team. Therefore, in the case that you do exercise this right, the transfer agreement may have to be reconsidered.”", "It meant they were placing restrictions to prevent them from abusing the power. ", "In fact, it was rather an obvious restriction unless White Rose was a group of extreme pushovers. ", "“So before you exercise this right, we’d like you to contact me or Sir Jang Maldong first. This way, I can gauge your contribution to the expedition and correctly assess the situation.”", "Basically, he was saying that there would be, by no means, a situation where they’d be forced to enter a death zone against their will. ", "“Lastly.” ", "Bok Jungsik continued.", "“Since we’re asking for your cooperation on the condition of transferring the siblings, it’d be hard to divide the spoils of the expedition. But…”", "“But?”", "Phi Sora stared in disbelief at Bok Jungsik. ", "“We’ll give you a commission fee befitting Carpe Diem’s standard if the expedition succeeds. From my personal funds, of course.”", "A sharp intake of breath could be heard from Phi Sora. But when Bok Jungsik emphasized that the money would be coming from his own funds, no words followed. ", "Seol Jihu, and even Jang Maldong, were both wearing confused expressions.", "“Uh… I’m not trying to put on airs.” ", "Bok Jungsik slightly lowered his head and fidgeted his hands. ", "“I may be wearing a flashy title as White Rose's Guild Master, but… well, I wasn’t like this from the beginning. I too had a very difficult time in the past.”", "Jang Maldong blushed.", "“Why are you bringing up past stories?”", "“You were the one who helped me then.” ", "Bok Jungsik spoke seriously without batting his eyes.", "“I can confidently state that I was sadder than anyone else when I heard you retired, and happier than anyone else when I heard you were coming back.” ", "After a short silence, he spoke on. ", "“Anyhow, I would appreciate it if you didn’t overthink the third condition and just viewed it as my personal wish of paying back my debt.”", "\"….\" ", "“Sora, you should just accept it too. Wasn’t Sir the one who transformed you into a normal person from the very definition of recklessness?”", "“What did you say? Recklessness?”", "Phi Sora voiced out a sharp complaint, but glimpsing at Jang Maldong from the corner of her eyes, she swung her head to the other side. ", "“I may have overcomplicated it, but basically, it’s a bribe.”", "Bok Jungsik squinted his eyes. ", "“Our Yi Seol-Ah and Yi Sungjin… They entered our guild because they trusted me, but I feel like we haven’t been able to look out for them well…” ", "As Bok Jungsik spoke while darting his eyes, Phi Sora erupted.", "\"Hey! What are you staring at me for?\"", "Bok Jungsik let out a deep sigh and laughed dryly. ", "“Anyway, we’ll be transferring the Yi siblings once we succeed with the expedition, so the money’s also for you to look over for them in our stead.” ", "‘Really?’", "Those were acceptable conditions. ", "They were definitely enough to perk his ears. While they were a bit too good, the somewhat acceptable explanation was able to reduce the doubt. ", "Perhaps…", "‘Am I looking at this through colored lenses?’", "It was to the point where this thought popped into mind.", "Seol Jihu organized the conditions one by one.", "White Rose proposed to work together.", "As long as they cooperated, White Rose would transfer the siblings free of charge.", "They would grant veto power to prevent becoming meat shields or bait. ", "Though splitting the rewards would be difficult, they will be given a reasonable commission fee. ", "'….'", "Were there more things to scrutinize? ", "From a cursory glance, there were none. But he decided to re-examine the conditions with a skeptical point of view, like the French philosopher, René Descartes.", "As soon as he did, a new suspicion formed.", "Though they covered it with all sorts of pleasantries, weren’t they trying to get Carpe Diem involved at all cost? ", "In other words, there was a scheme behind this expedition. And they wanted Carpe Diem to be stuck in it with them. ", "Of course, there was also the possibility of just misunderstanding Bok Jungsik’s overly sincere generosity.", "“Oh my! I’m witnessing the very definition of a pushover today… Sigh… Well dear? What are you going to do?”", "And then… ", "“Are you in or out?”", "The moment of truth arrived. ", "As soon as he activated his Nine Eyes, the whole room was dyed in all sorts of colors. ", "Jang Maldong was still shining golden like ever. Bok Jungsik was…", "'Yellow?'", "Attention required.", "'Why?'", "No matter how many times he glanced over, the kind-looking Bok Jungsik was painted in dark yellow.", "“Are you in or out? Why aren’t you speaking?” ", "Inadvertently turning his eyes, Seol Jihu felt his heart pound.", "The frustrated face of Phi Sora was dyed in a clear ocean-blue color.", "'Blue!'", "The Choice of Destiny. ", "He suddenly remembered the voices of Gula and Ira. ", "[I’m not saying that I’ll open all three directions either. The right. I’ll open just this direction.]", "[Similar to the left side, the right side must have all three directions opened simultaneously.]", "[I know. But I will bear the consequences.]", "What on earth was this ‘Choice of Destiny’? Seol Jihu just couldn’t figure out what Ira meant when she said she had to ‘bear the consequences’, or why Gula so desperately tried to stop the awakening.", "But now he felt like he could sort of understand. ", "Pzzt!", "A screen was suddenly projected in front of him like when it had happened in Stage 3. ", "It was an unfamiliar place. In what looked like a rundown room, a lady was seen on the ground with her face burrowed in her knees. ", "[Hic, hic…]", "The sorrowful sound of weeping was heartbreaking. ", "When the lady slowly stood up after a short while, Seol Jihu doubted his eyes.", "‘Phi Sora?’", "The identity of the lady staggering forward was Phi Sora. ", "She proceeded to climb on top of an old chair and grasp a rope tied to the ceiling. ", "Without any hesitation, she slung the noose over her neck and making a freakish smile, she kicked out the chair underneath her.", "The moment he held his breath, the screen disappeared like a lie after an unmistakable creaking noise. ", "Seol Jihu was left in a daze. He had witnessed such a shocking scene that his soul left him. ", "“Hello? What’s with this guy all of a sudden?” ", "Seol Jihu regained his senses hearing the clear voice. Whether it was because of the Choice of Destiny, but his head felt dizzy and dazed. ", "“Now, now, don’t hurry him. Mister Seol Jihu? You don’t have to give an immediate reply so please talk it over with your teammates.”", "“There’s no need for that.” ", "Seol Jihu reflexively replied. ", "“I’ll have to refuse.” ", "Seol Jihu turned them down with a tired voice. ", "\"Huh..? What?\" ", "\"You won’t participate?\"", "Bok Jungsik and Phi Sora cried out at the same time. They were astonished as if they had never thought he would refuse.", "“Is there a condition you aren’t satisfied with… Sir?” ", "Bok Jungsik hastily asked, but Jang Maldong quietly shut his eyes on the side. ", "“But why? Why don’t you want to participate?” ", "There were two reasons why. ", "The first reason was that Bok Jungsik shined yellow. The second reason was…", "“I think it’s a place we shouldn’t go.” ", "\"What?\" ", "Phi Sora’s eyebrows shot up.", "“Shouldn’t go…? What nonsense are you spouting?”", "“It’s dangerous.”", "Seol Jihu who was calming his breath resolutely shook his head.", "“If… If we go, we might die. No, we all will die.”", "“Wha… What did you say?”", "Phi Sora’s face scrunched up. ", "“We’ll die if we go? Old man! What is this guy saying? Grandpa! Who is this guy?” ", "Phi Sora was evidently pissed off.", "“What’s up with him!”", "Preparing for the expedition was hard enough, not to mention she was already irritated by Bok Jungsik’s almost philanthropic conditions, so hearing what was basically a curse made her furious. ", "“Wow! Very funny! Fine! If you don’t want to, then don’t. Did you think we would get on the ground, begging ‘Please change your mind!’ or something?”", "“S-Sora!”", "\"Shut up!\"", "Drrrk. The sound of a chair scraping against the floor rang out. ", "“Then again. It was stupid of me to expect anything from someone who hangs around with the two idiots in the first place. I thought you’d be different based on your rumors, but it seems I wasted my time. Okay then. Don’t bother. We won’t ever ask you again so don’t you dare come back spitting bullshit about how you’ve suddenly changed your mind or something!”", "Phi Sora fired away like a machine gun after standing up.", "“Carefully choose who to reach out to before arranging a meeting next time! What is this nonsense, really?\"", "Spewing all sorts for profanities, Phi Sora kicked the door open and stormed out.", "Bok Jungsik cupped his face in his hands, and Jang Maldong lowered the tip of his fedora. ", "*", "After receiving Bok Jungsik’s polite apologies, Seol Jihu and Jang Maldong left White Rose.", "He had told them to contact him once they had money or items to exchange, and that he’d still welcome them if they ever decided to change their minds. In conclusion, the meeting produced no results. ", "“You did well.”", "Jang Maldong spoke after climbing into the carriage. ", "“I thought you’d scold me.” ", "“You did make some mistakes. Just what made you say that they’ll die if they went?”", "Seol Jihu scratched his cheeks with his thumb. Jang Maldong continued. ", "“It would have been better if you had refused them more gently…. But it’s your choice, isn’t it?”", "Hearing the word ‘choice’ gave him a strange feeling. ", "“I may give you advice, but I don’t plan to go against your decision. You refused them, and that’s that.”", "The intensity of the scratching increased.", "“You’re going to bleed at that rate, you little bastard.” ", "Smirking, Jang Maldong shook his head. ", "“Anyways, you did well enduring. If I had taken Chohong instead of you…”", "Jang Maldong shivered at the thought. ", "“What would have happened if I hadn’t endured?”", "“You would have gotten beaten black and blue. One-sidedly.” ", "Of course! Seol Jihu smiled bitterly. ", "“She must be strong.”", "“She is. She’s skilled and has great talent, but her personality… tsk.” ", "“She doesn’t seem that way from how she treats you though.”", "“Hmm… it still doesn’t change that she has a terrible personality… Well, you’re right. She has an eccentric personality. She divides people into friend or foe, and she judges based on these two criteria alone.”", "“A black and white logic?” ", "“Yes. Exactly that. I’ve constantly tried to fix it, but she’s still like that.” ", "They suddenly felt a jolt. The carriage started moving following the sound of whips. ", "Jang Maldong clicked his tongue and breathed deeply.", "“Let’s get some shut-eye. I’m a bit sleepy after going through all that.” ", "“Please rest first.”", "“Alright.”", "Jang Maldong closed his eyes. ", "Seol Jihu quietly looked out of the window and got lost in thoughts. The scene he saw at White Rose was still vivid in his mind. ", "‘Why was she smiling when she hung herself?’ ", "Ian had compared destiny to something natural like breathing and something unavoidable that people had to ultimately accept, like fatality. ", "Then was it correct to view Phi Sora as being born with the fate of hanging herself?", "‘I don’t know.” ", "Neither did he want to get involved. ", "The one thing that worried him at the moment was the Yi siblings. The fact that he had come with big expectations, only to leave empty-handed left a bitter taste in his mouth.", "As always, he felt that there was nothing easy in life. And as he thought this, his head and shoulders seemed to grow heavier. ", "‘The crown’s weight…’", "As he was pondering over Ian’s words, Seol Jihu suddenly felt something tickle him. It was the black smoke. ", "Confirming that Jang Maldong was deep in slumber through the side of his vision, he whispered. ", "“Flone. You’re back?”", "[I suddenly felt your presence moving away while I was flying around.]", "“I’m sorry. I’ll let you take your time sightseeing the next time we visit.”", "[Sure. I was going to complain, but I guess I can’t.]", "“Why not?”", "[You look exhausted.]", "Seol Jihu rubbed his face. ", "[Did something happen?]", "\"….\"", "[Want me to beat them up?]", "\"N-No.\"", "Seol Jihu hastily shook his head. ", "[It’s fine so tell me.]", "“It’s nothing big.” ", "[Why? What happened. I’m curious. Tell me.]", "Seol Jihu pursed his lips as Flone clung onto him persistently.", "“It’s about work. About an expedition.”", "[An expedition? To where?]", "“I don’t know for sure. They said it was some ancient emperor’s villa…” ", "[An ancient emperor? A villa?]", "The black smoke swayed before turning into a question mark. As Seol Jihu stared at it with amazement…", "[Ah!]", "…it transformed into an exclamation point.", "[No way… Is it the Sacrificium?]", "“Sacrificium? What’s that?” ", "[The villa’s name.]", "Flone replied quickly.", "[You said it was an emperor’s?]", "“Yes.” ", "[The title of an emperor is only given to one that rules over an empire.]", "“And?”", "Seol Jihu tilted his head in confusion as he couldn’t follow the conversation.", "“Flone. Why did you suddenly say the name of the villa?”", "There weren’t just one or two emperors in the past. Also, it wouldn’t be strange for an emperor to own a villa in a resort area. ", "Why did Flone immediately respond after hearing what he said?", "[That’s because the story of the emperor’s villa is an extremely famous tale. I thought of it as soon as I heard.]", "“Come again?”", "[Speaking of which, how did you know? I heard the story from when I was a child.]", "It was only now that Seol Jihu remembered that Flone was someone from hundreds of years ago and that she was from an empire. ", "“Flone, can you tell me this tale in detail?”", "[Hmm…Only if you make a promise.]", "Flone made a condition after pondering for a bit. ", "“A promise?”", "[Yep. It’s not hard to tell you, but I don’t want you to go to the Sacrificium.]", "And what was this now?", "“Why not?”", "[Because it’s a place you shouldn’t go.] ", "Flone repeatedly emphasized in a warning tone. ", "[That’s a place you should never go. Especially living people.]"]}