{"cid": "39", "title": "Chapter 39. Miss Foxy (2)", "content": ["Crash!", "Seol heard the noise of someone falling over, and then, a small commotion rose up from behind him.", "He took a look, and immediately, his eyes widened in surprise.", "The first two things entering his view were a chair and Hyun Sangmin falling and rolling on the ground. Then, he saw Shin Sang-Ah and Yun Seora standing up from their seats in utter shock. And in front of them, four men giggling in an unsightly manner.", "“What are you doing?!” ", "“Don't! Get back!” ", "Just as Yi Seol-Ah was about to step out, Hyun Sangmin shouted at her from the ground.", "“Son of a bitch…. This is really humiliating… Kkeuk!”", "The leader of the group then kicked Hyun Sangmin's midriff as the latter tried to push himself up. Hyun Sangmin fell and rolled on the ground again.", "“Huh, you think this is embarrassing, eh?”", "The leader spoke with a mocking voice, before tapping on Hyun Sangmin's chin with his foot.", "“So, you know all about humiliation, huh. Then why didn't you quietly offer your apology when I asked you nicely? You'd have avoided all this humiliation in the first place. Don't you think so, amigo?”", "Seol stood up from his seat while deeply frowning.", "'Oh Minyoung?' ", "He saw Oh Minyoung sticking very close to one of the men, a burly guy, and cackling like a villain while looking on at what was happening. Her arms across her chest and a gloating expression etched on her face, too.", "“I do feel sorry for you since you look like a worm and all, so I'll give you one more chance. Apologize to those two. Hurry up.”", "“….”", "“I also don't want to do this. But you see, my brothers and I can't really hold ourselves back when someone does bad things to us.”", "The leader's words caused the burly guy to giggle derisively.", "“You apologize from the bottom of your heart and then I'll forget all about today's matter.”", "Hyun Sangmin began gritting his teeth.", "“Fuck…. You’re the guy who invited that bastard?” ", "“What if I am?”", "“What a joke. A guy with a big physique prattling on like a little girl. You think I don’t have a backer?” ", "“Ohh! That's right, you're also an Invited. I forgot.”", "Rather than sounding like he had genuinely forgotten about it, the leader acted as if he couldn't care any less.", "“But, have you ever thought about this before?”", "The leader squatted low to the ground and met Hyun Sangmin's eyes.", "“It's not that your Inviter is running late, it's just him not deciding to show up in the first place.”", "“What?” ", "“Why, you ask? It’s because he could also get humiliated if he tries to step forward like a fool.”", "The leader's husky voice gradually became lower. The knife scar on his cheek wiggled slightly as he grinned, his yellowing teeth revealed to the world as he did so.", "“You'd do well to remember. Never take us Cartel boys lightly. Not every Bronze Marks are equal, got it…?”", "Suddenly, another commotion unfolded behind the leader. When he looked behind him, he found a youth busy pushing past his underlings to come closer.", "“Oh?”", "The leader's eyes opened wider as he stood back up.", "“It's you.”", "The leader raised his hand and waved away his boys as they tried to intervene.", "“What’s going on here?” ", "Seol's cold voice caused the leader to form an interesting facial expression.", "“What a surprise. Not even another Inviter, but the Rookie himself steps forward.”", "'Rookie?' ", "“Mm…. Now that I take a look at you, you do kinda look like a player.”", "Seol continued to glare at the leader. The latter man raised his hands in a shrugging gesture and began speaking in a jovial tone.", "“Oh, this? It's nothing. My little brother over there, he suffered a lot at the hands of this guy here, or so I'm told. That's why I'm just repaying the favor.”", "“You should stop.”", "“Hmm? Is there a reason why I should? I'm just paying back what's owed and there's nothing wrong with that.”", "“Miss Cinzia said so already. Let the matters of the Neutral Zone be bygones.” ", "“Cinzia? Ohh…. That's just some random bitch spewing crap. We are very sensitive towards the matters of our brothers, you see. Haven't you heard, blood is thicker than water?”", "Seol's brows quivered slightly. Did this guy really call Cinzia, a boss from an organization that possesses a great deal of influence in the South, a bitch?", "There were only two explanations for this. Either this guy was a brave idiot, or the organization backing him was as big as Cinzia's.", "“This isn't a matter that an Inviter such as yourself should get involved with.” ", "“I don't agree with that notion at all. Besides, technically, the Neutral Zone also exists as a part of Paradise. Am I right or am I wrong?”", "The leader looked around him and asked, prompting his underlings to guffaw out, including the burly guy and Oh Minyoung. She laughed so hard, she might choke on her own spit at that rate.", "The joke wasn't even all that funny to begin with, but she must’ve been laughing hard just to spite the others. What a disgusting sight it was.", "“Okay. Now, if you're done, I'd like the third wheel to go away. I still have things to do.”", "“I'm not the third wheel.”", "The leader dusted his hands and turned around, only to come to a standstill.", "“What did you say?”", "“I asked Hyun Sangmin for the favor.”", "“Wait a minute. Wait, wait. Wait~~.”", "The leader raised his hands theatrically and suddenly raised a fuss before taking several large strides to get closer to Seol.", "“So, are you saying that you asked that man to torment my little brother? Is that it?”", "“No, I didn't ask him to….”", "“Doesn't matter. You say you are related to this thing, right?”", "The leader took Seol's silence as his tacit agreement and rubbed his hands together, before placing a hand on the youth's shoulder.", "“Hey, man…. This is me giving you my sincerest advice. Do you know what is the most important thing you gotta remember in Paradise?”", "“….”", "“It's what you say. Your words. You gotta watch your mouth around this place.”", "The leader lightly tapped on his lips and continued to speak.", "“I will ask you again, so think long and hard before answering, okay? Doesn't matter what your story is, you said you're not the third wheel in this mess, didn't you?”", "“I already told you that.” ", "When Seol replied without hesitation, a huge grin formed on the face of the leader.", "“Okay. Ok~ay! So, that's how it was. In that case, our story changes a bit.”", "The leader became so happy, he even began lightly humming in pure joy as well.", "“I thought I might get a Bronze Mark as a stooge or something, but now…. A real, bona fide Gold Mark just rolled into my lap. Heh!”", "Then, he sat down on one of the empty chairs and beckoned Seol. Hyun Sangmin was already long gone from his thought process, it seemed.", "“Take a seat. Let me listen to your story. While we eat, no?”", "The leader began shoving food found on the table down his mouth. Seol quietly stared at him, sensing that something wasn't quite right. The way his attitude had changed was one thing, and there was that oily smile of his, too.", "“What are you doing, Rookie? I told you to sit down.”", "More importantly, Seol didn't like the way this guy was acting, as if he knew something about the youth.", "Seol took a glance at Hyun Sangmin, still pinned to the ground. The grinning burly guy was pushing down on him with a foot. Oh Minyoung was to his side, her foot stepping on Hyun Sangmin's hand, also carrying a distorted smile on her face.", "'And why is she enjoying this so much?' ", "Seol couldn't really understand it, but he knew he couldn't do anything at the moment. As long as Hyun Sangmin was held captive, he couldn't make a rash move.", "In the end, he sat down on the opposite side to the leader.", "“Very good…. Oh, where's my manners? I haven't introduced myself yet, right? Name’s Salcido. Olivier Salcido.”", "Salcido reached out with his hand.", "And when Seol also reached out and grabbed the offered hand….", "“!!”", "Suddenly, he was greeted with pain as his hand was being gripped really tightly. Seol hurriedly injected some strength in his hand. Salcido simply gripped even tighter as if he didn't even find it challenging enough to care.", "“Very nice to meet you. What's your name, by the way?”", "“…Keuk.”", "“I said, what's your name, eh? Ehehehe….” ", "Just before he cried out, Seol instinctively circulated his mana. The energy rapidly coursed through his internal Circuit, flowed through his right arm, and arrived at his right hand.", "“Oh?”", "However, Salcido was an Earthling who had stayed in Paradise for over a year and a half already. He quickly sensed the change and used his own mana. His initial plan was to break this new kid's spirit, but he also believed that he'd never lose to a complete newbie who didn't know anything.", "That was how it was supposed to be.", "But then…", "“Wha, what?”", "Salcido gasped out in shock. Not only his own energy was being rapidly extinguished, but Seol's aura was growing bigger and bigger at a frightening rate.", "'I’m losing in both the amount and the flow speed?!’", "Logically, such a thing was completely impossible.", "In the blink of an eye, the situation had reversed. Salcido began sweating buckets as the pressure on his hand grew more and more.", "“Eee….. Eeek!”", "He couldn't even say anything out aloud since he had his reputation to worry about. Meanwhile, Seol simply stared at the deeply frowning Salcido with an expressionless face.", "It was then, the others sensed that something was off. It was unimaginable for a Level 3 Earthling to lose to a youth who was still only at Level 1, but seeing Salcido's complexion turn for the worse, they suspected something did go wrong somewhere.", "Two of the goons accompanying Salcido secretly exchanged signals and nodded their heads. One of them tried to sneak up on Seol, only for his steps to come to a halt after someone grabbed his shoulder.", "“Hello there, friends.”", "It was none other than Hao Win.", "“Who the fuck are you?”\n“I'm a friend of that friend, let's put it like that.” ", "“Is that right? Why don't you remove your hand first, unless you don't want to live anymore?”", "“Ohh, so scary. But I can't do that.” ", "Hearing Hao Win's playful tone, the man's eyes narrowed to a slit.", "“….You an Invited?”", "“Correct answer.” ", "“Whatever. You should know when to quit if you know what's good for you. You'll regret it when you find out who we are.”", "“Maybe. But I don't know who you small fries are. But then….” ", "Hao Win grinned and let off a thin wisp of air. Just as he placed his head near the man's ear….", "There was a loud noise of a table being pushed aside.", "Salcido couldn't hold back anymore and shoved the table upwards, using that momentary confusion to break free from Seol's grasp.", "“You son of a bitch!” ", "Salcido succeeded in pulling his hand back, and he shouted out loudly. However….", "Slam!!", "Seol got to witness the following: the legs of the unsteady table planting back down to the ground, Salcido's face slamming into the table's surface, and a high heel forcing the hapless Cartel man's head into the wooden surface from the back of his head.", "“You finished your breakfast yet?” ", "The voice sounded familiar. Seol confirmed her long legs, as well as the grey H-line business woman's skirt, and raised his head immediately.", "And he saw Kim Hannah retracting her leg and placing her hands on her waist.", "“Kkeuh…. W, which motherfucker did that….?” ", "Salcido frowned deeply and lifted his head with much difficulty.", "“Oh, you haven't? Wanna eat some more?” ", "Unfortunately for him, Kim Hannah reached out faster than a streak of lightning and slammed his face down on the plate of food one more time.", "Clang!", "The impact was great enough for the plate to shatter.", "The banquet area soon fell into utter silence as the new entrant to the banquet made her presence known.", "The burly guy pressing down on Hyun Sangmin stood there blinking his eyes in shock. The mid-boss Salcido was taken care of in one breath, and two of his older brothers were being held back by Hao Win as well.", "The burly man couldn't figure out what was going on, but he also that he shouldn't be standing there doing nothing.", "“You crazy bitch!!”", "So, the burly man tried to hit Kim Hannah with his fist, but…", "Whish! Plonk!", "A spinning dagger flew from somewhere and the burly man's fist exploded into a gory mess, instead.", "“Uwaaaahk?!”", "Salcido's entire body shuddered as he watched the burly man fall to the ground. He managed to move his face to the side and found the woman wearing the business suit pressing his head down to the table. He sucked in his breath after confirming who it was.", "“Kim…. Kim Hannah!” ", "“Hi~. Been a while, no?” ", "She finally released his head and grinned widely. She walked around the table and sat down next to Seol. She then rested her chin on her hand and leisurely stared at Salcido.", "“You're still up to your old tricks, aren't you?”", "“What did you say?” ", "“How brave of you. Just whose Invited were you trying to steal away?” ", "“….I don’t know what you're talking about.”", "Salcido managed to raise his upper torso up, but he was still shuddering noticeably.", "“I was only….”", "“Ahhh, so you're trying to imply that you've been wronged here unfairly, is that it?” ", "Kim Hannah snorted briefly and cut short this conversation.", "“My bad. Okay, so. It's all sorted now, so go on. Get lost.” ", "Kim Hannah dismissively waved her hand about. Salcido just stood there and gnashed his teeth while glaring daggers at her.", "But what was going on here?", "Salcido, who was so full of himself only a minute ago, didn't dare to utter a word of defiance in front of her.", "“….I'll be going then.” ", "“Good idea.” ", "“But, we'll see each other soon enough. I'm thinking, we'll have a chance to meet again pretty soon.” ", "Salcido pushed himself up unsteadily to his feet.", "Unfortunately for him, Kim Hannah didn't plan to let him off that easily.", "“Stop. What did you just say to me?” ", "Her cold, sharp voice entered his ears, but Salcido ignored her and continued to walk away.", "Kim Hannah grinned and beckoned with her finger.", "“Shin Hansung?” ", "“Yes, Noonim.”", "“If that fucker doesn't stop in three steps, gift him with a new breathing hole by his temples, okay?” ", "“Understood.”", "A man with curling hair, Shin Hansung replied while spinning a dagger around before taking on an attacking posture. Salcido's steps came to a halt, then.", "“You goddamn fox, are you really going to do this?” ", "“You said it yourself, didn't you? There's no reason to drag this out. Let's just end it here.”", "“….”", "“Why are you suddenly imitating a mute asshole now? Weren't you planning to go on a war with us?”", "Flinch.", "Salcido shuddered after receiving her cold, hard stare and lowered his gaze.", "“Uhm…. I made a mistake just now. I had no such intentions. I’m sorry.”", "“You’re sorry? Since when were you on the same social standing as me? Did you forget your brain somewhere or something?” ", "“I, I apologize.” ", "“Still forgetting something, aren’t you?” ", "“….I apologise, Ma’am.” ", "“Hng~.” Kim Hannah let out a soft snort and shrugged her shoulders.", "“Okay, fine. But, you weren't planning to leave just like that, were you?”", "“T, that is….” ", "“You should take responsibility before leaving, no? Where are you manners? It's because of people like you that the Cartel is saddled with such rotten reputation.”", "Kim Hannah's pointed criticism caused Salcido's brows to prick up in anger.", "“Better lower your gaze or else.” ", "Of course, he ended up lowering his head again.", "“So, how should we go about fixing this mess…?” ", "Kim Hannah mumbled to herself before shifting her gaze over to the burly man rolling on the ground, clutching his bleeding stump of an arm. She even pretended to be seriously deliberating on something.", "“Okay. You can leave, but not with him. You understand why, don't you?”", "“….”", "“You did interfere first while mouthing some crap about Neutral Zone this and that. I'm just going to reciprocate that.” ", "“Bu, but!” ", "“If you've got a complaint, lodge it to Sinyoung directly, okay?” ", "As soon as she mentioned 'Sinyoung', Salcido's expression looked as if he just saw the scariest demon in his imagination.", "“Sin, Sinyoung?” ", "“But, of course. I'm here because of Sinyoung's directive, after all. Since we're here now, I might as well fix your uncouth manners, too.” ", "“I…. I understand, in that case.” ", "“Hyu, Hyungnim?!”", "The burly man's tear and snot-stained face became frozen in shock. Salcido did his best to avoid meeting that painful gaze.", "“Fine. All sorted, so you can leave now.”", "“H, Hyungnim!”", "The burly man called out in desperation, but Salcido hurriedly left the banquet area along with his goons. It was as if he was making a bid for his freedom with his life on the line.", "“And then…. You.”", "Kim Hannah's next target was Oh Minyoung. When the attention landed on her all of a sudden, Oh Minyoung began retreating several steps.", "“Is anyone among you in a contract with her? If you're here, then I want to talk to you.” ", "When Kim Hannah asked while sweeping her gaze around the crowd, a smart-looking man hurriedly ran up to her side.", "“You're the one?”", "“Y, yes, ma'am.”", "“That woman named Oh Minyoung, I'd like you to leave her to me. I'm sure you have some ideas as to why?” ", "“Y, yes, ma'am. I got a call this morning.”", "The smart-looking man nodded his head repeatedly.", "“Is that so? Well, we wouldn't really do something like this, but my company president is very unhappy at the moment, you see?” ", "“I completely understand. She's his daughter, after all.”", "“Very good. I'll explain to her about the cancellation of her contract so you can leave now. As it was promised to you, you will receive a suitable compensation soon.”", "“Yes, ma'am. Thank you very much.”", "The smart-looking man bowed his waist 90 degrees, before disappearing like the wind from the area.", "“Whew~.”", "Kim Hannah let off a soft sigh, then locked her arm with Seol's.", "“Sorry. Am I a bit late?”", "Looking at her wink like that, Seol forgot all about closing his slack jaw.", "Sinyoung Pharmaceuticals.", "Kim Hannah, the department head.", "Those two facts were the only things Seol knew about her until now.", "But, after witnessing her sort out the situation in the proverbial blink of an eye, Seol got to figure out just a little bit more about the position Kim Hannah occupied in Lost Paradise."]}