{"cid": "78", "title": "Chapter 78. “I don’t want to live like that.” (2)", "content": ["A bit of a rich scene played out on the third floor of Carpe Diem's office. Seol Jihu and his knife-sharp questions continuously probing for the truth; Chohong seriously going through a panicked fluster and waving her hands about in denial. If any Earthling who knew her true personality, the one that got her elected as one of the top three in the Six Crazies, saw this spectacle, then that person would have probably collapsed from the sheer weight of the mental shock he would be subjected to.", "A short while later, Seol Jihu finally stopped interrogating her and his arched-up brows softened just a tad.", "“So, you're definitely saying it's not a serious problem, right?”", "“That's~~ right!! I'm telling you, it's not an easy matter to climb up to high ranks.” ", "“Even then, I feel a bit left out here, you know? I mean, at the very least, we could have butt our heads and try to solve it together. It’s easier to solve a problem with two heads than one.”", "“Come on, I have my pride to think about. It’s a bit embarrassing to ask around for help just because I can't work out a puzzle in a game, right? I’m supposed to be a Level 4, after all.”", "Chohong giggled and hurriedly added something extra.", "“And besides, I just wanted to do this thing with my own power. That way, I can straighten my back and act with some pride when I become a High Ranker. So don't be like that and be more understanding, okay?”", "She laughed and pounded him on his back. The words 'game' got on his nerves for some reason, but he kept his mouth shut. He didn't believe her, but now that she was coming out like this, he didn't have much to say.", "“…I got it.” ", "In the end, Seol Jihu chose to take a step back. Chohong looked noticeably relieved. ", "“Still, if it’s too hard, tell me about it, okay? Who knows? There might be something that I can help you with.” ", "“Let me try my luck for a little longer. If I just can't solve it, then I'll ask you. Well, just like you said, it’s easier to solve a problem with two…. uh, what was it again?” ", "“It’s easier to solve a problem with two heads than one.”", "Seol Jihu formed a bitter smile.", "“Right…. Oh.” ", "Chohong scratched the side of her head before throwing this completely out-of-the-blue question at him.", "“Hey, aren't you gonna go home anytime soon?” ", "“Home? Why are you talking about my home all of a sudden?” ", "“You know, just? Isn't it time you go check out what happened so far back home?” ", "“Not at all. I don't want to. Not going.” ", "Seol Jihu shook his head as if there was no reason to even think about this matter. Chohong stared at him for a little while and sighed softly under her breath.", "“….Got it.” ", "*", "Next day.", "For the first time in a while, Chohong displayed a rather relaxed attitude in the following morning. They had breakfast together, and she even participated in his morning training routine. It was as if she was thinking at least a little bit about him.", "However, that only lasted for a short while. Sometime in the afternoon, she received a call through her personal communication crystal and hurriedly ran out of the office. She didn't even mention where she was going, too. As a matter of fact, she was in such a hurry that Seol Jihu couldn't even think about stopping her and ask.", "'She's definitely hiding something.' ", "He was in the middle of going through his usual afternoon schedule but decided to stop with his training then. He needed his undivided attention on training his abilities as well as his mana, after all. It was already hard to get any sort of improvement even after focusing every little fiber of his being, yet he was now mired in all sorts of distracting thoughts and so, it was rather impossible to get any training done at this rate.", "'Should I go and pay a visit to Maria to wish her well?' ", "He was feeling rather unfocused anyway. Although little, he did feel a bit guilty regarding her situation. He quickly tidied up the first floor and left the office himself.", "'Looks like they’re almost done building that place.’", "As he was about to leave, he noticed that the construction work across the office was almost finished.", "Seol Jihu stopped by at a local diner to buy an armful of food and drinks and went to Luxuria's temple. When he requested permission to visit one of the patients they had, the lady working in the counter displayed a deeply shocked expression.", "“You came to visit who here?”", "“Maria Yeriel.”", "“…That is so wild. Someone like her can have a visitor, too. Wow.”", "The elegant woman wearing the white Priest garb muttered to herself and raised her hand high. A probationary Priest busy sweeping the entrance put the broom down and approached the counter.", "“Will you escort this gentleman to where Miss Shit is currently residing?”", "“Shit-aria?? No, uh, I mean, Miss Maria? I understand.”", "The male probationary Priest replied courteously and guided Seol Jihu.", "The route they took was different from the last time; they didn't head to the residential area. Instead, they entered deeper into the temple grounds where foot traffic became progressively lesser and lesser. After reaching a dark and dinky corridor, the male probationary Priest confirmed which room it was and cautiously knocked on it before bolting straight outta there.", "“….”", "The same thing happened back when Seol Jihu was escorted to the residential area too. Why were they all running away after knocking on the door? Was there a ding-dong-ditch culture here? Seol Jihu thought about all sorts of dumb things as he raised his voice.", "“Miss Maria? It's me, Seol.” ", "He didn't hear any reply. He only heard a soft, subtle sound of chik, chik from beyond the door. He waited for a little bit before cautiously opening the door.", "“I'm coming in.” ", "Kiik… Opening the door led him to an unexpectedly spacious room. It was so clean and tidy that he almost felt guilty trying to compare this place to Maria's former room. And then, his eyes drifted to the white bed and a small-statured girl breathing heavily lying on it.", "“Miss Maria?” ", "Seol Jihu was taken by surprise and quickly approached her to find her golden hair completely soaked in sweat. There was a white towel placed on her forehead, and she barely managed to creak open her eyelids to stare at him from the corners of her eyes.", "“Seol….?”", "“Are you alright? Are you in a lot of pain?”", "“What brings you… here? No, it can't be… Another favor…?”", "“Of course not. I just wanted to pay you a visit and wish you well. That’s all.”", "“…Wish me well?”", "Maria's voice, which sounded as if she was precariously balancing on the edge of life and death only a second ago, suddenly improved by a great deal. And then, when she saw the food Seol Jihu brought along, the light in her eyes transformed immediately.", "“Ah, I was worried for nothing!” ", "Swish! Maria grabbed and threw the towel off her forehead and hurriedly sat back up straight. She wiped away the water on her face with her sleeves and then, snatched the food basket in his hands.", "Just as the youth's expression became utterly dazed after discovering the water spray bottle on a table near the bed, Maria stopped fishing through the food basket and asked him. ", "“Where is my booze? Didn't you bring me one?”", "“You're going through a recovery, you know. So no booze for you. I brought along a bottle of fruit juice, though.” ", "“Eiii, do I look like a kid to you? Where is your common sense?!” ", "“But, uh, I thought you were a kid?” ", "“Stop fucking around! I'm at the ripe ol' age of eighteen, I'll have you know! Who the hell are you calling a damn kid.” ", "Seol Jihu momentarily thought to himself, ‘Huh, so she was eighteen years old, eh. She's still a high schooler, then,’ before being punched in the face by a huge mental shock. She was equivalent to a second-year high schooler in the South Korean education system, yet she drank like a dang sailor??", "“M-maybe, it's because you're a foreigner??” ", "“What on earth are you on about now?” ", "Hng, She snorted unhappily and bit into a loaf of bread with a vengeance. Seeing her grab that bread with both hands and only move her head left and right to tear it off somehow reminded Seol Jihu of an otter eating a clam, and he thought she looked rather adorable right now.", "Nom, nom… Maria's cheeks puffed up when she opened her mouth to speak.", "“Well, I still gotta commend you. I mean, you bothered to come to see me like this when you must be busy out of your mind.”", "“Eh? Uhm, I…. Well, I just came by, you know, because of other stuff….” ", "He meant to say that he came here to wish her well during her recovery and also to build a more friendly relationship with her.", "“Heh, because of other stuff, is it?” ", "Maria smirked as she continued to chew.", "“I hope you aren’t treating me like an afterthought.”", "“No, not at all. I didn't mean it that way.” ", "“Well, I guess it can't be helped. I mean, Carpe Diem must be going through hell right now, anyway…. Nom. Cheer up, okay?”", "What was she talking all of a sudden? Seol Jihu's complexion waned in an instant. However, Maria was too focused on eating the delicious bread to notice the change in his face.", "“Since you bothered to bring these, I shall gratefully accept them. I'm fine now, so you should get going. I saw Chohong's face earlier, and boy, it was no joke, I tell ya.”", "‘Chohong? She was here?’ Seol Jihu was about to ask what Maria was talking about, but his thoughts clicked into place in an instant. He could venture a guess and say that she knew what he didn't know. She seemed to be mistaken about something else as well.", "“….Ahh, well, we came separately. We were supposed to meet up somewhere around here. By any chance, do you know where I might find her?”", "“She's probably in the last room in this passageway.”", "It sounded as if Chohong was quite close by. Seol Jihu bade goodbye while saying that he should get going now. Maria simply raised her hand and waved it. The moment he left her room, though, his steps gained urgency.", "'The last room in this passageway.' ", "The last room located on the left side of the passageway had its door slightly ajar, and a sliver of light leaked out from the open gap. Following his intuition, he killed his footsteps and sneaked a look inside the room. First of all, he spotted a few number of people inside.", "Soft murmurs of people drifted in and out of his hearing. But his wandering eyes were fixed to a single spot. It was a certain woman lying on the sickbed. Perhaps she sensed the gaze on her because her left eye shifted and locked onto Seol Jihu's. At that moment, he forgot to breathe.", "“Mm? Agnes?” ", "Cinzia saw that Agnes was silently looking at the door and shifted her own eyes in that direction. It was right then, the door issued sounds of being flung open. The crowd's attention was immediately shifted over there. Chohong, standing to one side, jumped in surprise.", "“W-What?!”", "“Miss Agnes!”", "Seol Jihu dashed forward without hesitation and stopped before the bed-ridden Agnes.", "Her state was truly wretched. However, the metallic, bitter scent of blood strongly wafted in the air and rendered that simple description wholly inadequate for the situation. Towels soaked in blood were found liberally around the bed itself, and Agnes's entire body was wrapped in thick bandages. Not only that, even her face, with the sole exception of her left eye, was wrapped up tightly. If it weren't for that, he would not have recognized her.", "What on earth had happened to her? Agnes was a powerful Level 6 Archer class assassin only a step away from entering the Unique Rank. She was one of the biggest big-shots in Paradise, and even Kim Hannah personally praised her.", "“Miss Agnes…. Miss Agnes….”", "Like a broken robot, Seol Jihu repeated the same words over and over again. Just from looking, one could tell what he was feeling at the moment, so Agnes shifted her gaze away and let a groan leak out of her mouth. She had moved only slightly, yet the bandages wrapped around her neck was dyed in crimson red in no time.", "“Who the hell is this bastard?”", "“Stop. He's not an outsider. This friend is also a member of Carpe Diem.”", "The latter voice also belonged to another familiar person. It was Ian, currently lying on another sickbed similar to Agnes's. He raised his upper body up and slowly stroked his beard with a bitter face.", "Ian didn’t look so good either. He only looked better compared to Agnes.", "“Master Ian.”", "“How have you been. So, did you get to solve the mystery?” ", "Ian winked with his eye. Seol Jihu was feeling too confused right now. He just couldn't figure out what the hell happened. Meanwhile, Chohong was chewing on her lower lip with a complicated look on her face. He shot a silent glare at her for a second or two before shifting his eyes to somewhere else. He hoped for someone, anyone, to provide a clue.", "After a moment of heavy silence, Cinzia, standing tall with her arms crossed and her index fingers lightly drumming on her arms, let a long groan escape from her mouth.", "“Looks like an apology is in order.” ", "An apology? It was just one single word, yet Seol Jihu was immediately overcome with a sense of ominous foreboding.", "“Chohong didn't wish for you to get involved in this matter, but I….” ", "“Noonim!”", "“Be silent, Chohong. This kid has the right to know, too.” ", "Cinzia rebuked with a low growl and studied Seol Jihu with a pair of animalistic eyes. He addressed her immediately.", "“Please, tell me what happened.” ", "*", "Several days ago, on the third floor of Carpe Diem's office.", "“A mutated Ogre??” ", "Dylan froze up in the middle of lifting his teacup.", "“Correct. The news came from the Federation.”", "“First time I've heard of it. Didn't the Ogre race get annihilated?”", "“This is a freshly hot piece of news. I can't believe it myself, but well, they say their situation has been greatly worsened because of the mutated Ogre's appearance. I hear that they couldn't defend their position and had to abandon the Tigol Fortress in the end.” ", "Tang!", "Dylan roughly put the teacup down.", "“I can't believe it.”", "His opened his mouth wide in surprise, which was quite a rare sight for him. ", "“Isn’t the Tigol Fortress one of the most important strategic points for the Federation? They gave it up that easily?” ", "“That just goes to show how powerful that mutated Ogre is.”", "“What the hell. How did things get to that situation?” ", "The Parasites were a race that fundamentally survived by parasitizing off other lifeforms. It didn't matter whether it was a corpse or not – they relied on taking over and wrestling away the control of bodies to shore up their fighting forces.", "Both the Federation and humans weren't idiots. Once the Beastmen Alliance got destroyed – or, more correctly, after the Parasites used their corpses to parasitize and proliferate in massive numbers – the two remaining forces came up with a new strategy. And that would be to incinerate any remains, whether they be of allies or enemies. They chose to burn them all away because they would become the enemy's combat force if left alone.", "However, the Parasite Queen wasn't sitting around doing nothing. As if to ridicule the efforts of the two forces, she created existences called Nests.", "Originally, the Parasite as a species lacked the ability to conceive and give birth. No one knew just what kind of witchery was involved in this whole thing, but Nests acting like pregnant mothers and new types of Parasites being born from that ability gave incredible shock to other forces.", "That alone was already a massive source of headache, yet now, the supposedly-annihilated race of Ogres made an appearance, too?", "“That Parasite whore is probably telling us that she isn’t gonna sit back and watch the current situation develop.”", "Huuu…. Cinzia exhaled the cigarette smoke and continued on.", "“That bitch is probably worried about one thing. Us and the Federation joining hands.” ", "That sounded plausible. The Federation might have welcomed the Cave Fairies into their coalition, but even then, they were only able to barely hang on against the concerted assault of the Parasites. And that delicate balance was tilting against their favor all because of the mutated Ogre's entrance.", "However, the story might change if the Federation and humans decided to join forces. Although humanity was the weakest of the lot, they were backed by the seven gods representing the Seven Sins. Along with the mass introduction of Earthlings, they could no longer be looked down that easily.", "But, seeing that the situation had become like this….", "“Looks like that bitch is sure of it after the Arden Fortress incident. She has shown us a brand new solution to her problem.” ", "“This would be my first time not wanting to hear about a solution.” ", "Dylan's feigned weakness brought about a quick chuckle from Cinzia, but she continued on regardless.", "“The Federation thinks that the appearance of the mutated Ogre heralds some sort of an evolution in the Parasite's ability to give birth to new life.”", "“Can I take those words as you saying that the number of Nests will increase in the future and brand new types of Parasites will appear?”", "“The latter is correct but not the former.”", "Cinzia shook her head.", "“Dylan. The kind of 'evolution' I'm talking about here isn't enhancing a certain species' already-existing innate traits.”", "“Okay, then what is it?” ", "“It's the change in the method itself.”", "Dylan tilted his head as if he just couldn't get it.", "“Nests are seen as an invaluable resource by the Parasites since even Medusas, the so-called final evolution of their kind, are born from those things. A Nest has never really appeared in a battlefield before, and as the rumor mill goes, there aren't that many to begin with. Do you know why that's the case?” ", "“No, I don't.” ", "“That's right. No one knows. However, there is a reason for everything. Maybe they experience some kind of unknown losses. Whatever the case may be, there is something we don't know yet. If not, Nests would have appeared as a damn army and swept us away a long time ago.” ", "“….”", "“The conclusion? Nests can't be mass-produced. However, what if the Parasite Queen began thinking about that problem this way?” ", "Cinzia's voice became a little higher as she spoke up to here.", "“Is there really a need to increase the number of Nests while suffering from unknown losses?” ", "“Mm?” ", "“If you're talking about the ability to give birth, you can borrow the bodies of other species, no?” ", "Dylan's expression froze up almost instantly.", "“Cinzia, there's no way.”", "“Why not? The ability to give birth….” ", "Cinzia formed a subtle smile and placed a hand on her chest.", "“I possess it.”", "She then pointed at Agnes standing behind her.", "“Agnes here also possesses it. And, even if it's not human females, I'm pretty sure that Paradise is practically overflowing with fertile females. Wouldn't you agree?”", "Dylan shook his head.", "“That makes no sense.” ", "“Why do you think that?” ", "“The main combat force of the Parasites is the corpse army. We know this. Those things take over a body and start controlling it, sure, but it's still a damn zombie and nothing inside of it works anymore. But you’re saying one of its internal organs is still functioning?” ", "“What if you get caught while still alive?”", "Dylan's words of vigorous denial came to an abrupt halt. Cinzia spat the cigarette out and quietly carried on.", "“For example, being taken as prisoners.” ", "“Are you saying there are living prisoners?” ", "“Dylan, you should stop with your lackadaisical thought process. The Empire, the Beastmen Alliance…. the number of nations destroyed by the Parasites aren't just one or two. Just the number of species that lived there, you won't be able to count them at all. And well, I don't think the Parasite Queen is a dumbass who doesn't know the concept of taking prisoners when she's capable enough to devour the Chief Deity of this world.” ", "“Still, that’s hard to believe.” ", "Dylan looked to be at a loss now.", "“Even if we say that your supposition is right, you still need…..” ", "“You should also discard the idea of prisoners being only females while you're at it.” ", "Cinzia spoke, her tone almost entering the territory of ridicule. Dylan now looked as if he had nothing more to say.", "“And so….” ", "Capture living males and females, infect them with Parasites, and transform their innards to whatever the hell they wanted. And then…", "“Extract all the semen from the male until it's dead, and as for the females, repeatedly impregnate them and make them give birth…. Wow, just imagining it gives me the chills. This crisis is a lot worse than anyone can expect, you know.” ", "“That's right. I guess it's time to get to the point of my visit.” ", "Cinzia uncrossed her legs and leaned forward.", "“The Federation has provided us with this information. The solution the Parasite Queen came up with this time isn't a single mutated Ogre. No, it's the mutated Orcs.”", "“Mutated Orcs?”", "“Right. Unlike with Ogres, you can mass-produce the race of Orcs. There are quite a few heads when a litter is born, and the burden on the 'mother body' is on the low side. To top it off, they can become a viable combat force very quickly.”", "“What on earth is this about now?”", "“Listen to me. The Parasite army that has taken over the Tigol Fortress chose not to press their advantage. No, they chose to stay put and bide their time instead. Not only that, they even diverted quite a few of their numbers towards the regions that border human territory. However, they haven't invaded yet. What does this signify?”", "“…Fuck.” ", "Dylan closed his eyes shut.", "“The Federation thinks that the enemy already possesses the ability to mass-produce. If we sit back and simply do nothing, soon we will see the torrential flood of mutated Orcs in truly nonsensical numbers invading this very land.” ", "Strengthen their military forces by changing their previous method – if such a scheme becomes reality, there would be no meaning in the Federation and humanity joining hands. No, you could even say that all dreams and hopes would be lost completely.", "“And one more thing. The facilities to mass-produce their soldiers are all evenly spread around our borders. So, now. Can you finally guess where I'm going with this?” ", "Simply put, they would mass-produce the expendable mutated Orcs and invade humans with them, while the main Parasite force would focus on the Federation. It was at this point Dylan realized the purpose of Cinzia's visit.", "“So, what have the seven kingdoms decided to do?” ", "“They are already making their move. Haramark is no exception. We need to destroy one of the facilities.” ", "“And the army?”", "“Didn't I say it earlier? Parasites have relocated some of their main fighting forces and placed them in several locations near ours. The moment the Haramark army tries something, they will get devoured in no time.”", "“So what’s the conclusion?” ", "“Pick skilled Earthlings to form a small elite squad and infiltrate their camp. That is all.” ", "Dylan rubbed his face.", "“Damn it. I'm telling you, I'd like to get involved in a mission that's not life-threatening once in a while.” ", "“Hehe. I feel exactly the same. In any case. As this matter requires our haste, Agnes has been chosen to act as the header. And from the royal family, the old geezer and Lewd Pink will participate. Also….” ", "Dylan, who was silently listening until then, opened his mouth. ", "“By any chance, can Hugo participate as well?” ", "“Hugo?”", "“I was thinking that I might need a Warrior I'm in sync with.” ", "“Well…. I guess at Hugo's level, it should be fine. Do what you want.” ", "Cinzia shrugged her shoulders.", "“Oh, and also….”", "Dylan finally lifted the cold teacup again and threw another question.", "“Where is that facility located?”", "*", "“And well, they somehow avoided the patrols and got near their target, but….” ", "Cinzia finally ended her lengthy explanation and took a long puff of her cigarette smoke while looking down at Agnes on the bed.", "“Long story short, the mission was a splendid failure. Only two people managed to come back. That's what went down.” ", "Seol Jihu was hoping for the best. Faces of Dylan, Hugo, and Teresa Hussey flashed in his mind. He felt his heart tumble to the floor and hesitantly asked.", "“Which means….” ", "“We can't make that conclusion yet.” ", "Ian interjected right then.", "“I've seen it with my own eyes. Mutated Orcs were roaming around. That means the enemy indeed possesses a facility to mass-produce….” ", "Ian blurred the end of his sentence, but Seol Jihu didn't need to hear the rest to figure it out.", "“They could be held as prisoners.” ", "“…I can't be fully certain of it, but that seems to be the case.”", "Ian formed a wry expression.", "The expedition team was near their destination but got discovered during their infiltration and had to fight their way out of a siege of enemy forces seemingly rushing in from all sides. The only reason Ian managed to come back alive was thanks to Agnes. If it weren't for her desperate struggle, these two wouldn't have been able to break past the siege nor shake off the enemy's pursuit.", "However, Agnes was still a human at the end of the day and there was only so much she could do. They were already fighting against overwhelming odds, and she simply lacked the ability to rescue everyone else when the expedition team members had been separated from each other.", "A short moment of silence later, Seol Jihu raised his opinion.", "“We need to rescue them, don't we?” ", "“We're here to discuss that problem.”", "Ian replied first.", "“Even putting the mission itself aside, we obviously want to rescue them somehow.” ", "“But, then why…..” ", "“But how?” ", "Ian's head faltered as an indescribable expression clouded his face.", "“We formed the best team possible in Haramark and yet, we still failed. Since we were discovered once, their security should have tightened up even further. Unless we risk total annihilation and go for a frontal assault, we estimate that the odds of rescuing them is near zero.” ", "Even the frontal assault presented a problem. The difference between attacking and defending was as great as heaven and earth itself.", "Humans had never taken the initiative to attack first ever since the invasion began. Not only that, they were already in a bit of tight spot trying to defend themselves. But now, they were going to attack the enemy camp? It was already unknown whether the assault would even materialize, and even if it did, it would not be much different than delivering themselves to the open jaw of the tiger anyway.", "“What about cooperating with the Federation?”", "“We already thought about it. They were the ones that gave us the information to begin with, so they must be operating their own infiltration squads, but….” ", "Ian pondered deeply for a while, before shaking his head.", "“They most likely have suffered tremendous losses trying to defend themselves until now. More importantly, judging from the fact that they had to give up on Tigol Fortress, we should consider that the Federation is also having a very hard time as well.”", "Seol Jihu unconsciously gripped his fists tighter.", "To this extent…. Were the differences in strengths this great? Did this mean he had no choice but to watch from the sidelines while sucking on his thumbs?", "“The notion of a rock and a hard place never felt truer in my life before. We're still trying to find a way, yet we can't seem to find an answer.” ", "‘What should I do?’ Seol Jihu desperately combed through his memories. Unfortunately, there was no way he'd remember the contents of a dream he had so long ago.", "'I should have jotted down everything as soon as I woke up.'", "“If only someone like Sung Shihyun was still around….” ", "The dejected Ian lamented with an energyless voice.", "It was then Seol Jihu opened his mouth again.", "“Where?” ", "“Mm?”", "“That facility. Where is it located?” ", "Ian didn't immediately answer but chose to seek out Chohong's response. However, although she looked mighty unhappy right now, she still didn't say anything. No, she simply tutted and avoided making eye contact. Ian guessed what was in her mind and cautiously spoke up.", "“Seol, I must emphasize that this is not a matter that you can interfere with. It's not possible, and it should not be.” ", "“Master Ian.”", "“Please, do not misunderstand me. I'm not looking down on your capabilities. However, both the events of the Forest of Denial and the defense of Arden Fortress were child's play compared to this one. No, more importantly, this matter could be the epoch-changing event that decides the flow of history from henceforth.”", "“You can still tell me the location, can't you?”", "Ian licked his lips a little. He took a bit of time to decide, before…", "“….Well, if it's only the location.”", "He spoke with a helpless expression.", "“It's in Delpinion Duchy.” ", "And, at that moment….", "“It's the royal laboratory.” ", "….Seol Jihu's eyes gleamed brightly."]}