{"cid": "301", "title": "Chapter 301. The Prodigal Son (1)", "content": ["That night, Seol Jihu had a dream. He wasn’t summoned by Roselle but was having a real dream.", "The young Seol Jihu and Yoo Seonhwa were bickering with each other, and Seol Jihu could also see his mother and Aunty Yoo.", "[Hurry up, Jihu.]", "[But Hyung and I are going to play video games without Mom knowing…]", "[No, you can’t. Aunty told you to go to bed. Let’s go to sleep together.]", "[But I want to sleep with Hyung… Do I have to sleep with you?]", "[Yes, you definitely have to.]", "[Why?]", "[Because— my parents sleep in the same room every night. Your mom and dad do the same, right?]", "[Yeah!]", "[That’s why. Think about it. My dad and your dad are biologically male, and my mom and your mom are biologically female.]", "[Right.]", "[And you’re male and I’m female.]", "[Hmm?]", "[That’s why we need to sleep together.]", "[….]", "The young Seol Jihu tilted his head. It must not have made sense no matter how hard he thought about it as he turned his head and looked for his mom.", "Jihu’s Mom was looking at the two children with a pleased expression.", "[Mom.]", "[Yes, Jihu?]", "When she met his questioning eyes, she nodded with a kind smile.", "[You see, Seonhwa told me—]", "[Yes, what Seonhwa said is completely true.]", "[!?]", "[J-Jihu’s Mom?] [1]", "Seonhwa’s Mom stuttered, but it was too late. The young Seol Jihu asked again in surprise.", "[Really?]", "[Yes, of course.]", "[Aha.]", "[Got it? Okay, so go and catch some Zs with Seonhwa.]", "[Okay.]", "Just like that, the obedient young Seol Jihu was dragged to the bedroom by Yoo Seonhwa. As the two children held each other’s hands and laid down on the bed, Jihu’s Mom giggled quietly.", "Seonhwa’s Mom laughed while looking a bit uneasy.", "[What a trouble. I’m sorry, Jihu’s Mom.]", "[Sorry about what?]", "[I always tell her not to do that, but Seonhwa just won’t back down when it comes to Jihu.]", "[Oh my, is it that much?]", "[Yes! Last time, she even asked if I was interested in Jihu and how someone with a family could do something like that. Really, I don’t know where she learned those things.]", "[Oh my, oh my!]", "Jihu’s Mom laughed out loud while clapping her hands.", "[Jeez, Seonhwa’s just so adorable!]", "[Adorable? I’m worried. What if Jihu develops bad habits because of her?]", "[Eiii, don’t worry so much. Seonhwa can just live with him forever.]", "[But still…]", "Jihu’s Mom waved her hand saying that it was okay, but Seonhwa’s Mom looked at Jihu worriedly as Seonhwa sang a lullaby for him.", "On the other hand, the adult Seol Jihu dreaming of the past smiled in joy. Of course, when he woke up, he forgot the dream completely. But he thought it was weird seeing Eun Yuri apologizing to him, saying how she misunderstood him on her own and how she didn’t know his circumstances before.", "*", "The three-month period came to an end. Today was the day the Neutral Zone would end.", "During the completion ceremony, it was customary for the head manager to congratulate the graduates and wish them good luck. However, Seol Jihu took after Cinzia and decided to end the ceremony in a minute. He even left the speech in Kim Hannah’s care.", "Kim Hannah grumbled and said, “Why don’t you just open the door and tell the graduates to go off on their own?” Adding, “If you’re too lazy, just say it. You’re making me do this because you don’t want to.”", "However, the graduates didn’t mind it all that much. The Paradise they had been looking forward to entering was right in front of them, so it would feel strange if boring formalities entered their ears.", "And just like that, the completion ceremony safely ended at breakneck speed. Seol Jihu was satisfied with not hearing, ‘Ah, fuck, why is it so goddamn long? When is it ending?’", "The manager and instructors sent out all the graduates other than Eun Yuri and then left the Neutral Zone after cleaning up the area they were in charge of.", "The other organizations must have finished signing contracts with the newbies and brought them away as it was rather empty outside.", "The only ones they could see were the Earthlings who invited Park Woori and Yoo Yeolmu, Kim Hannah who was negotiating with them, and the coachmen who came to pick up Valhalla as per the contract between them.", "Seol Jihu saw Eun Yuri looking left and right without rest and made her take a seat before taking out a contract. By the time he finished signing a 4-year contract with her, Kim Hannah came back with Park Woori and Yoo Yeolmu.", "“Thank you! We’ll work hard to meet your expectations!”", "“Please take care of us.”", "Seol Jihu spoke while looking at the two men greeting Valhalla’s members.", "“That was quicker than I thought.”", "“The organizations behind them were both enemies with Scheherazade.”", "“Weren’t they suspicious? It wouldn’t be strange for them to think, ‘Why do they want them?’”", "“I just gave a few believable excuses. Well, I guess they aren’t excuses since they’re true. I just said, ‘Our precious Magician wants to continue teaming up with the two of them. So I’m just throwing the idea out there~’ Then once I made the two open their Status Windows, it was easy sailing.”", "Although Kim Hannah still had to put out gold in exchange for them, the amount was a drop in the bucket compared to the time Carpe Diem recruited the Yi siblings.", "Once the matter was over with, Valhalla’s members hopped on the carriage ride back to Eva.", "And the moment the carriage started moving and the clitter-clatter of the wheels rang out, Eun Yuri’s eyes lit up. Inside the full carriage and the clamorous atmosphere, everyone smiled in satisfaction.", "Seol Jihu smiled satisfactorily as well. The grains of sand in the wilderness they were passing by looked like contribution points that had been recovered to a good amount.", "Seol Jihu gently stroked the bag holding the VIP store’s items and stealthily snuggled up to Seo Yuhui’s side. Feeling her hand gently patting the back of his hand, Seol Jihu closed his eyes.", "He felt calm and relaxed for the first time in a while.", "That night, the carriage stopped at an appropriate place to set up camp. Even though they were in a safe zone, there was no guarantee that there wouldn’t be trouble.", "By the time dinner ended, Seol Jihu called out the 2-person night watch teams he came up with.", "Hugo, who was listening quietly, raised an objection.", "“Seol, why are you and Lady Seo Yuhui in the same group? And in the middle of the night, to boot.”", "“Is there a reason we can’t be?”", "“Don’t try to fool my eyes. Do you think I can’t see through your lecherous thoughts?”", "“Lecherous thoughts? Noona would misunderstand if she heard.”", "“Fine, you might be innocent. I trust you. So you gotta change the group for my trust.”", "“What kind of logic is that?”", "“Sigh, who’s the one with lecherous thoughts here? Hey, hey, just change the group. You can be on night watch with me.”", "Chohong, who was walking by, clicked her tongue and offered apathetically. However, Seol Jihu couldn’t let that happen. After all, he had waited so long for this day.", "“No, the night watch groups are final. Got that, Hugo? Yuhui Noona is going to be on night watch duty with me tonight.”", "However, Hugo was unrelenting. He threw a tantrum, saying he wanted to keep a night watch with Seo Yuhui at least once.", "Only when Seol Jihu threatened with his authority as the representative did Hugo lower his tail. It was because Jang Maldong, who hated disregard for authority, stood up with his cane in hand.", "“This is unfair. Just you wait. You think I’ll stop here?”", "Hugo gritted his teeth and ran off. He raced to Seo Yuhui, who was opening her sleeping bag, then told her that ‘Seol Jihu was scheming to be on night watch duty with her.’", "However, his expression immediately turned sour as Seo Yuhui rejoiced instead.", "“Oh my, is that true?”", "She giggled with the back of her hand over her mouth before leaving the tent. Smiling joyfully, she looked at the restless rabbit as if he was adorable.", "Seol Jihu let out a dry cough and turned away. Feeling the strange, hot air flowing between the two, the emotion on Hugo’s face quickly disappeared. Phi Sora placed her hand on the petrified Hugo’s shoulder and shook her head silently.", "Having succeeded in getting rid of the obstacle, Seol Jihu took out the item from the bag and left the tent as soon as his night watch shift arrived.", "Seo Yuhui was already outside. The way she was reading a book by the campfire looked like a scene out of a painting, grabbing Seol Jihu’s attention before he noticed.", "If Seo Yuhui didn’t notice his presence and gesture him to come closer by tapping on the seat next to her, he would have spent the entire night staring at her.", "“Noona.”", "Taking a seat right away, Seol Jihu cleared his throat and called her name. Seo Yuhui held in the laughter that was constantly trying to burst out. Seol Jihu was probably trying hard to reveal it, but even the way he was staring at her was mellow.", "“I have something to give you.”", "“Hmm? What does our little prankster have for me?”", "Perhaps finding Seol Jihu setting the mood adorable, Seo Yuhui giggled while lightly pinching his cheek. However, as soon as Seol Jihu took out the item from his pocket, her smile vanished.", "In Seol Jihu’s hand was a beautiful sculpture of a goddess that was about 20 centimeters tall. Although it looked like a simple souvenir on the surface, Seo Yuhui could clearly feel the immense, sublime divine power it held.", "Even the Daughter of Luxuria, who traveled all around Paradise in her early days and experienced all sorts of mystical things, was surprised by the amount.", "Seo Yuhui could not say anything for a while. In fact, she did not even move.", "Seol Jihu must have liked that reaction as he grinned.", "“It’s Moirai’s Souvenir.”", "He continued bashfully.", "“You said so before, didn’t you? That you would be able to recover if you had Moirai’s Souvenir. That’s why….”", "Barely managing to snap out of her stupor, Seo Yuhui spat out the breath she had been holding in.", "She shook her head vigorously. Calling Moirai’s Souvenir an extraordinary item would be an understatement.", "Only one of it existed in all of Paradise, and bringing it to a temple and offering it to a god could net the giver a tremendous, almost frightening amount of contribution points.", "She knew where Seol Jihu was coming from, but she couldn’t use the item this way.", "“Jihu.”", "“No.”", "She tried to reject him, but Seol Jihu took the initiative. He must have known what Seo Yuhui would say as he forced the item into her hands and wrapped her hand around it.", "Seo Yuhui could feel the back of her hand heat up, so much so that she worried it might get burnt.", "“This is yours. No matter what.”", "“Listen to me.”", "“No, I won’t.”", "Seol Jihu stared straight at Seo Yuhui, his nose practically touching hers in close distance.", "“If you really don’t want it, I’ll take it back. But no one will be using it, including me.”", "He even gave a chilling threat. However, Seo Yuhui knew that these weren’t his true feelings. He was simply expressing them so he would make her take it no matter what.", "Seo Yuhui sighed. If Seol Jihu used it, he could aim to become a Unique Ranker. At the very least, he would be able to instantly raise Eun Yuri’s battle power to a level that was usable against the Parasites.", "But setting aside all these uses, he was trying to give the souvenir to her. In truth, it couldn’t be called inefficient even if Seo Yuhui used it. After all, Valhalla would end up with a Level 8 Priest.", "But she was hesitant because she felt uncomfortable taking such a precious object.", "“Noona, this trip to the Neutral Zone was all for this. I used a gold stamp to invite Miss Eun Yuri just to obtain Moirai’s Souvenir.”", "Seo Yuhui’s eyes widened. Until now, she thought it was for Eun Yuri. But he just denied it.", "“Just because of me?”", "“Just because?”", "Seol Jihu shook his head.", "“I haven’t slept peacefully since you sacrificed yourself for me. It always felt like there was a huge boulder on my chest that I just couldn’t shrug off.”", "It was a bit funny to say that he couldn’t live with debt, but Seol Jihu’s disposition changed to the Golden Rule after entering Paradise. But if somebody asked if he was giving the Moirai’s Souvenir to repay his debt, then he would have to tilt his head.", "He didn’t know why. No matter how much he racked his brain, he couldn’t figure it out. Although he couldn’t put his tongue around it, there was something he couldn’t forget. Just like Teresa, he felt a strong attraction when he first saw Seo Yuhui.", "That emotion was making him do this. It was telling him to give her Moirai’s Souvenir. That he had to protect her.", "Seol Jihu loosened his grip. Slowly taking his hand off, he spoke with a burning gaze.", "“I want you to take it.”", "A short sentence escaped his mouth. But this simple sentence carried many indescribable emotions condensed in it.", "Seo Yuhui slowly closed her eyes. After careful consideration, she slowly stroked the stone statue.", "“…Can I really use this?”", "“You better. Otherwise, I’m going to cling to you and bother you until you do.”", "Hearing this, Seo Yuhui’s determination wavered. That didn’t sound all that bad.", "Seo Yuhui opened her eyes. With a somewhat dreamy expression and a pair of hazy eyes, she stared at the young man in front of her.", "“…Jihu.”", "Seol Jihu’s breath stopped just as he was about to reply. It was because Seo Yuhui had abruptly embraced him.", "“Poor baby. How regrettable. You’re so kind and thoughtful… just why….”", "Seol Jihu looked up furtively within her warm embrace. Under the night sky scintillating with stars, Seo Yuhui’s face truly looked holy as it reflected the starlight.", "Moreover, the affectionate gaze with which she was looking at him was hot enough to melt almost anything.", "“Jihu.”", "Nearing her face even more, Seo Yuhui whispered into his ears.", "Gulp. The sound of Seol Jihu swallowing his saliva rang out loudly. His face and the back of his neck were itching.", "“Our Jihu—”", "A whisper mixed with the sound of breathing brushed his ears. Seol Jihu subconsciously closed his eyes. He might be mistaken, but it seemed like the sound of breathing was getting closer.", "As a delicate fragrance flowed down and melted onto his tongue…", "“Oppa.”", "Seol Jihu’s eyes shot open. The pair both turned at the same time.", "Eun Yuri was walking out of the tent while rubbing her eyes.", "“I just had a dream.”", "She randomly brought up her dream. Yawning until her mouth was almost split open, Eun Yuri said apathetically.", "“The Queen is asking when you’re coming.”", "“The Queen?”", "“I mean Charlotte Aria-nim. She wants you back quickly.”", "“Ah.”", "Eun Yuri must have talked to her in Roselle’s dream world.", "“Why?”", "“I’m not sure. But Teacher sent her back in a hurry, saying that someone was trying to wake her up. Anyway, she sounded pretty urgent…”", "It was only then that Eun Yuri saw Seol Jihu in Seo Yuhui’s arms. She immediately raised her eyebrows.", "The pair slowly separated. Seo Yuhui let out a slight cough before picking up her book upside down and fixing her eyes on it. Perhaps because of the campfire, her cheeks were flushed red.", "Eun Yuri’s eyes rolled around in a circle.", "“I thought I should tell you right away.”", "“…Right. Thank you.”", "Seol Jihu said calmly. Of course, inside, he was crying tears of blood. He couldn’t help but think, ‘I was so close!’", "“Then have a good time.”", "Bowing respectfully, Eun Yuri went back into the tent.", "Next, a cold night breeze blew between the pair. In matters between a man and a woman, a certain mood was one of the most important things.", "Seol Jihu cursed Charlotte Aria for ruining the mood. He didn’t know what happened but felt like he would really start hating her if it was something insignificant.", "“Wheeeeew….”", "Seol Jihu heaved a heavy sigh while putting a cigarette in his mouth. Just as he was about to light it, his eyes met Seo Yuhui’s.", "“….”", "“….”", "A moment later, the two laughed sheepishly.", "*", "Late at night, the carriage arrived in Eva earlier than expected. The group had given the coachmen extra cash to rush back.", "It was because of what Eun Yuri said and also because Charlotte Aria never returned to the dream world afterward. According to Roselle, she was purposely not summoning her due to her unstable mental state.", "Seol Jihu greatly regretted not bringing a communication crystal. Although communication was automatically blocked between the Neutral Zone and the outside world, the tampering incidents in the past had also made the royal families ban bringing personal communication crystals inside.", "Seol Jihu hurried back worriedly, but the city’s atmosphere seemed fine. He couldn’t feel anything like the clouds of war he had seen in Haramark, and the atmosphere even seemed livelier than normal.", "‘Did her anxiety disorder relapse or something?’", "Seeing inebriated Earthlings singing outside, Seol Jihu judged that there was no need to rush and headed back home.", "After watching the newbies amazement by the size of the building, Seol Jihu held a simple welcoming party as planned. The party wasn’t just for the three new recruits, but also for Basler, Oh Rahee, and Kazuki.", "The welcoming party was fun. Everyone ate and drank, enjoying the cheerful atmosphere. Everything was perfect other than Phi Sora getting drunk in the middle, provoking Oh Rahee, and ending up on the floor pulling each other’s hair out.", "“200 silver coins on Red Hair!”", "“I’ll bet 100 silver coins on the Straight Faced Bitch!”", "Maria arranged a betting game. As Seol Jihu was thinking about who to bet on…", "“Representative.”", "He suddenly heard someone calling his name. Kim Hannah was standing behind him with a flickering crystal orb in her hand.", "“It’s from the Eva Royal Family. The royal administrator is on the line.”", "“…That’s from just now, right?”", "“Yes, were there no missed calls?”", "“No, I checked as soon as I got back. There was no lingering light.”", "That was why Seol Jihu figured he could contact them tomorrow morning. But the fact that there was a call less than two hours after their return meant…", "Seeing the ruckus breaking out in front of him, Seol Jihu quietly left. After moving to his office and placing his hand on the communication crystal, Sorg Kühne’s face came on the screen.", "“Sir Kühne?”", "—My apologies. I just heard you returned to Eva. I was going to call you tomorrow, but I thought it might be better to do it now.", "“It’s fine. Did something happen?”", "—I guess you could say that. They made it so that there’s nothing wrong on the surface, but…", "Sorg Kühne smacked his lips.", "“…What?”", "After hearing a brief explanation, Seol Jihu asked back a tone louder.", "“The Federation’s delegation came to visit?”", "—Mn. A member of the delegation seemed to be your acquaintance.", "“Was it Miss Yuirel? She’s a Cave Fairy.”", "—Yes, she said she came as an attendant.", "Seol Jihu furrowed his brows.", "Yuirel was the Fairy General. Among Cave Fairies, she was ranked second. For someone of her position to have come as an attendant, it meant the delegation had someone ranked even higher than her.", "1. In Korea, moms usually call other moms by their firstborn’s name + Mom. Though in this case, Seol Jihu’s name is used rather than his older brother’s (probably for clarity’s sake). "]}