{"cid": "311", "title": "Chapter 311. Preparations (4)", "content": ["Seol Jihu’s heart sank. It was as if a misshaped boulder was dropped into a tranquil lake.", "He wanted to ask whether she was serious, but he could only hold his mouth agape.", "He couldn’t find the words to speak. If Sicilia was an organization that only pursued profits like the Eva Alliance, then Seol Jihu would have been greatly disappointed and even berated them.", "But Sicilia was different. During the previous valley war, they complied with the Haramark Royal Family’s conscription order without complaining and led the Earthlings from the frontlines.", "Cinzia herself had almost died fighting Unsightly Humility, and Agnes had suffered a critical injury of having both legs pulled out.", "If someone were to ask, ‘Are you seeking freedom after performing your duties and responsibilities?’ Then Sicilia could confidently answer, ‘Yes.’", "That was why Seol Jihu couldn’t say anything. As Sicilia was an organization based in Haramark, he didn’t have the justification to drag them into the Federation’s war either.", "But it wasn’t as if he could just give up and leave. As Philip Muller said, they needed the power of the Star of Sloth.", "Seol Jihu broke the silence and spoke.", "“Can you tell me your reason?”", "“Reason, huh.”", "Cinzia watched Seol Jihu’s constantly changing expression with an intrigued face before shrugging.", "“On the surface, it’s because this might be the Parasite Queen’s scheme like the last valley war. Haramark is a city that is on the frontlines, so Sicilia must be present to prepare for an ambush of a detached guerrilla force. Now, as I said, that is only the surface reason… but I suppose you are asking for my true reasoning.”", "Seol Jihu stared at her with a stiff expression, and Cinzia broke out into a grin.", "“Alright, I’ll tell you. It is because I do not want to lead my subordinates into a war that is a guaranteed loss.”", "Seol Jihu bit his lip.", "He knew the Parasites were in an advantageous position. That was the reason he was working so hard to overturn the status quo.", "Cinzia was only making a guess since she did not know all the details, but the way she spoke like defeat was a predetermined outcome made Seol Jihu feel uncomfortable.", "“War Hawks of the Southern Region. That is what some people call Sicilia. Do you know why?”", "“…No.”", "“It is because we won most of the wars we have led and participated in in the recent year. Although we had to compromise once near the end due to an intervention of a third-party, we never once suffered a humiliating defeat.”", "“….”", "“It’s simple. Participate in winning wars and avoid losing wars. I have held true to this principle for any war that is beyond our obligation to join. From the day I founded Sicilia till now.”", "The languid voice continued.", "“Of course, I respect your heroism. I know you are an Irregular as well. But this war just isn’t it, no matter how I think about it. There is not a single appealing point.”", "“But we can’t just sit around and watch. Once the Federation falls, humanity is next.”", "“You haven’t considered both the Parasites and the Federation perishing from this war?”", "Cinzia placed her chin on the back of her interlocked hands and stared at Seol Jihu fixedly.", "“If I was the head of the Federation, I would have given up a mere Tigol Fortress a long time ago. Then I would have planned for the future. That is the best they can do.”", "“You can’t possibly describe Tigol Fortress as a mere fortress.”", "“I can. Yes, I admit that it is of great strategic importance as a connecting point to humanity. But now that the World Tree has withered, Tigol Fortress is nothing but an oversized toy.”", "“Miss Cinzia.”", "“Stop.”", "As Seol Jihu tried to persuade her again, Cinzia cut him off firmly.", "“Do not pester me. When I say no, I mean no.”", "Seol Jihu clenched his teeth.", "“I might have given it some thought had you asked me to help create a situation that could lead to victory. But you want me to send my men to Tigol Fortress without reason? Did you really think I would say yes to a request to send my precious subordinates to their death?”", "Seol Jihu quietly swallowed his saliva. He could feel unrelenting willpower from each of Cinzia’s words.", "“If you really want me to take action, create a situation that would convince me that victory is plausible.”", "“….”", "“Now if you understand that, get up. I am minding my words out of respect for the things you have accomplished thus far, but know that I am being extremely patient with you right now, Representative Seol.”", "She made it clear that she would have kicked him out long ago if he wasn’t Seol Jihu.", "However, Seol Jihu did not get up. He knew Cinzia might reject his request. Although his heart was bitter, he had to aim for the second-best scenario now that he knew the first-best wasn’t possible.", "“…If I could create such a situation first, I would have done so before coming here.”", "Seol Jihu spoke calmly.", "“But the current situation isn’t so good. Even if we try to do something, I don’t think the Parasite Queen will sit still.”", "“Of course. So what?”", "Her tone was curtly asking what Seol Jihu was trying to get at.", "Cinzia hated talking in a roundabout way. So Seol Jihu also cut to the chase.", "“Even if you do not plan to join the war, I would like you to be on standby near the battlefield.”", "“What?”", "“I will revive the World Tree.”", "Cinzia’s eyebrows went up. Seol Jihu finally mentioned this detail, and a silence that was like thin ice descended over the room.", "“…So you’re telling me—”", "Cinzia tilted her head up with a deep gaze.", "“See the status of the battle and confirm the revival of the World Tree before deciding whether to go into war or not.”", "“I am only asking you to be ready to join the battle at a moment’s notice. Even if I succeed in reviving the World Tree, if—”", "“I understand what you’re getting at. You’re worried that the war would be over by the time Sicilia receives news of your success and arrives at Tigol Fortress.”", "“The Star of Avarice said that he cannot guarantee victory even if the World Tree is resurrected. Humanity needs to join hands with the Federation. Every Executor is a vital fighting force whose value cannot be measured.”", "Seol Jihu pleaded earnestly. Cinzia crossed her arms and dropped her head. Unlike before, she didn’t refuse outright. As a Magician herself, she acknowledged the possibility of crossing over to the Spirit Realm through the Astral World.", "Moreover, Seol Jihu had shown her the Seed of the World Tree and Aphriso’s Sedge, proving that his plan was not unfounded.", "“If the World Tree revives….”", "In the past when the World Tree was healthy, Tigol Fortress was an impregnable wall to the Parasites, even withstanding an invasion of 200 Nests and five Army Commanders.", "Of course, the Federation also had to devote all of their manpower in defending the fortress, thus resulting in the current situation from being unable to attend to the Spirit Realm.", "In any case, there was one thing that was certain. And it was that this war could go in any direction if Seol Jihu’s plan worked.", "“…Indeed, the value of Tigol Fortress would increase drastically if your plan worked.”", "Although she couldn’t talk like success was guaranteed, that was where Seol Jihu’s interesting suggestion came in.", "He had asked Sicilia to only stand by near the fortress, waiting until the World Tree’s revival to decide whether to join the battle or not.", "“Enter the battle if victory seems plausible, pull out and return if it doesn’t. Although I’d still have to move my troops, you’re saying you will give the final say.”", "Cinzia replied after thinking for a long time.", "“Not a bad offer. At least, it’s much better than asking us to be meat shields.”", "She smiled blandly and continued.", "“I will have to give it some more thought, but that at least gives me the pretext to lead my men.”", "She returned a positive reply given the much more relaxed conditions.", "“But let me tell you now— Don’t expect us to help just because we are there. I will issue a withdrawal command the moment I think all hope is lost.”", "“Actually, that’s why I want to ask you for a favor.”", "Seol Jihu took a deep breath before continuing.", "“Please let us borrow Miss Agnes.”", "“…What?”", "“We would like Miss Agnes’ help in saving the Spirit Realm.”", "Cinzia furrowed her brows at the unexpected request. At the same time, Agnes’ eyes lit up.", "Seol Jihu originally wanted to bring Cinzia. But that should not be done and could not be done.", "Her position made it difficult for her to make reckless moves, and given Haramark’s characteristics, it was right for her to remain in the Middle World to command the Earthlings.", "That was why he asked for Agnes. If a pheasant wouldn’t do, he’d settle for a chicken. Though Agnes wasn’t as strong as an Executor, her strength was widely recognized in Paradise as one of the best.", "“You told me before, right? That you can lend your strength to create a situation that could lead to victory.”", "Cinzia looked as if she’d taken a blow, her expression as if she’d just been checkmated.", "“You…”", "Cinzia suddenly snorted.", "“Was this your goal this entire time?”", "Seol Jihu didn’t say anything. He only stared at her fixedly.", "Cinzia chuckled.", "“This is why people should be careful with their words. You must have learned a thing or two from that sly fox.”", "“Please. Miss Agnes being there will significantly increase the chance of the World Tree reviving.”", "“Oh, I don’t doubt that. After all, the Evil-Hunting Tarantula’s ability boasts exceptional power in rampaging on a battlefield. There’s just one thing…”", "Cinzia trailed off, the corner of her lips curling up. She looked like she was contemplating her options but also like she was enjoying this situation.", "After a moment of silence, Cinzia spoke.", "“How very difficult. I just can’t be sure. Really, this is the first time I’ve run into a decision as hard as this.”", "She shook her head left and right before glancing sideways.", "“What do you think?”", "“I think it would be a good idea to go.”", "Unexpectedly, Agnes replied right away.", "Cinzia exclaimed, “Hoh! And your reason is?”", "“From what he’s told us, this plan of his seems quite solid. Given that you, Boss, didn’t say anything when the Astral World was mentioned, entering the Spirit Realm through it seems like a realistic method.”", "“And?”", "“I also believe it is a good mission for my current situation. I have been stuck at Level 6 for quite some time now. Seeing this mission to a successful completion might be able to help me take the last step to Level 7.”", "“Is that all?”", "Agnes continued speaking at Cinzia’s neverending questions.", "“Most importantly, if everyone that Representative Seol mentioned comes, then this expedition team would be a one-of-a-kind, never-seen-before in the history of Paradise. The legends whose names are only heard are gathering. I must admit that I’d like to work alongside them.”", "Agnes gave a firm, level-headed response befitting her character.", "Cinzia, who was listening silently, burst out into laughter.", "“You did not mention the dangers associated with going to the Spirit Realm. Is that to hide the heart of a mother who wants to help her troubled cub?”", "Agnes did not reply. She quietly averted her gaze and looked outside the window. Cinzia clicked her tongue and sighed.", "“They say there’s no point in raising a daughter. Now I know what it means.”", "“I’m not your daughter, Boss.”", "“I raised you like one. Well, it doesn’t matter.”", "Cinzia waved her hand dismissively. Then, seeing Seol Jihu’s nervous face, she revealed her teeth in a smile.", "“Fine. Do as you want. There is what I said before, and plus, the person herself wants to go.”", "Seol Jihu’s complexion brightened instantly.", "“Thank you, Don Cinzia. And you too, Miss Agnes!”", "Agnes snorted. She slightly tilted her head up and spoke with a high nose.", "“When will the expedition team depart?”", "“There is no set date, but I’m hoping to go as soon as possible.”", "“Got it. But I need time to prepare, so it will be difficult to leave right away.”", "“Of course. When can I expect you?”", "“A day is enough. I will go to Carpe Diem’s office tomorrow morning.”", "Once Cinzia gave her permission, the slow story progressed hastily.", "“I will need to stop by the stable and borrow a carriage then.”", "“Is there a need to go through all that trouble? Have you stopped by the Haramark Royal Palace?”", "“Not yet. I was planning to go after this.”", "“Then it should be fine. Ask Princess Teresa for the fastest carriage in Haramark. We will get back quicker that way.”", "She had a point. Seol Jihu nodded his head.", "“Then…”", "Agnes pushed her glasses up.", "“I will see you tomorrow.”", "*", "After the meeting, Seol Jihu went straight to the palace. It was to see Teresa for the first time in a while and also to tell her about the outcome of the meeting.", "Teresa was waiting for Seol Jihu on a chair, her arms and legs crossed in a proud manner.", "“Princess!”", "Seeing Seol Jihu, who was delighted to meet her, she snorted loudly.", "“Hmph, that’s funny.”", "“Excuse me?”", "“I put down my pride and begged you not to leave, yet you cast me aside and left anyway. And now you’ve come crawling back… Hoho! The world sure works in funny ways.”", "“….”", "“Why, do I still look like the Teresa who pitifully begged for your love? I’m sorry, but the old Teresa is no longer here.”", "Seol Jihu made a dumbstruck expression.", "Teresa’s lips contorted.", "“That’s right! That’s the face! I wanted to see that regretful face of yours when you eventually came back to me! Oho~ Ohohoho~!”", "She even covered her mouth with the back of her hand and sneered.", "“What are you standing around for? Didn’t you come back because you needed my strength? Come on! It’s your turn now. Get on your knees and beg tearfully, just like I did back then! Say you’re sorry you abandoned me! Say you realized I am a thousand times better than that useless Queen of Eva!”", "Seol Jihu stood still, only blinking rapidly. On one hand, he didn’t have much to say, but on the other, he was seriously concerned for Teresa’s sanity. Perhaps she just ate something wrong this morning?", "As Seol Jihu continued to stare at her worriedly, Teresa’s laughter died down. She glanced at him repeatedly to check out his expression before slowly smacking her lips.", "“….”", "“…Kuhum.”", "As an awkward silence flowed in the air, a small cough rang out. Soon, Teresa got up from her seat and trotted forward in short, quick steps.", "“Oh my! Jihu! When did you get here?”", "She grabbed Seol Jihu’s hands, looking overjoyed. Her change of attitude truly made Seol Jihu doubt his eyes.", "“Long time no see! Did you miss me? I know I did!”", "“Y-Yes. Princess, just now, you—”", "“Ah, don’t mind that. It’s nothing.”", "“No, how can you call it ‘nothing’? Did—”", "“Oops, you found out. You see, there’s another personality hidden inside me. I call her Enchantress or Dark Teresa. She sometimes pops out against my will. Just ignore her. I’ve had this illness since I was young.”", "“Ah.”", "‘I see, so that was Dark Teresa? Then should the current Teresa be considered Light Teresa?’", "“Anyway, how did your talk with Sicilia go?”", "Teresa asked as if she just remembered it. She was obviously trying to change the subject, but Seol Jihu decided to let it go.", "Once he told her how the meeting went, Teresa was visibly surprised.", "“Wow, that much… There are conditions attached, but they’re still moving their troops?”", "She clapped rapidly and talked like Sicilia had agreed to do something insanely generous. It seemed there was a difference in Seol Jihu and Teresa’s perception of Sicilia.", "“That’s great! Since Sicilia is taking action, we should be able to issue a conscription order without difficulty.”", "Seol Jihu bowed slightly.", "“I’m sorry. This would technically put Haramark at greater risk, yet you’re sending your army in spite of it…”", "“Eii, I’ll obviously leave behind some men to defend Haramark.”", "Teresa put on a confident expression.", "“And even if the Parasites invade, we will be able to hold out until reinforcements come. You haven’t forgotten about the valley fortress, have you?”", "Now that he thought about it, Arden Valley had a fortress as well. He had heard about the progress of the construction during his calls with Teresa, and last time he heard, the fortress had become big enough to cover half of the entire valley.", "Of course, no one could guarantee how long it would last against the Parasites, but unless one of the Seven Armies came with their commander, it would at least buy enough time for the troops to withdraw.", "“…I guess you’re right.”", "A thin smile appeared on Seol Jihu’s face. The fortress he had risked his life to defend in the past was proving to be of great help to him.", "“It would be great if you could see Father and General Sanctus before leaving. Unfortunately, neither of them are here.”", "“They must be busy, huh.”", "“Yes. General Sanctus is busy building up our military power, and Father is meeting with the chief of the Equites battalion to convince him.”", "“Equites battalion?”", "“They are the cavalry regiment that used to be the pride of Eva. While Haramark was known for their hoplites, Eva was known for their nimble lancers. Though, they’ve voluntarily disbanded.”", "Seol Jihu exclaimed. Looking back, the first thing Sorg Kühne did after Valhalla became Eva’s partner organization was reassembling the army.", "Eva’s main units had disbanded voluntarily after the death of Eva’s previous king, Campbell Aria. In other words, other than the guard force maintaining public order, the past Eva did not have an army to call forth.", "“Although most of the veteran lancers scattered, a good number of them requested refugee status from other kingdoms. That, of course, includes Haramark. These men were granted refugee status in exchange for entering the kingdoms’ military.”", "“I see.”", "“Yes, so we interviewed the cavalrymen of the old Equites battalion and identified their captain. Father has gone to persuade him.”", "Teresa explained everything in quick succession, then finally gave a wink.", "‘So quick.’", "Seol Jihu couldn’t hide his surprise. He began to understand why Philip Muller was so surprised after hearing about his preparations.", "Seol Jihu didn’t expect the Haramark Royal Family to have done all this on their own. He clenched his fists unknowingly.", "‘So I wasn’t just beating my head against the wall.’", "Back when he was looking for the spring, he felt like he was cutting through obstructing vines without any help.", "But it turned out, he was never alone. The connections he built up until now were coming together one by one to empower him.", "Thinking so, courage surged up from the bottom of his stomach and filled his heart full.", "“They left their home because they were disappointed by Charlotte Aria and enraged by the Eva Alliance’s tyranny. But that doesn’t mean their loyalty to the Eva Royal Family disappeared. Since Charlotte Aria and Eva have both changed, they might choose to— Hm?”", "Teresa stopped in the middle. It was because she felt a pair of rough hands grab her shoulders.", "Next, Seol Jihu’s face slowly closed in, and his forehead touched her own.", "“Wheeeew…”", "A long breath flowing above her head tickled her hair.", "She blinked rapidly in a fluster. But after a moment, a warm smile spread across Teresa’s mouth.", "She felt like she knew Seol Jihu’s intention.", "[My head… pet my head.]", "[My back too.]", "Teresa had done the same thing when the Parasites had raised their army and invaded Arden Valley. Even after the royal family issued a draft call, the Earthlings had been uncooperative.", "At that time, Seol Jihu was the one she trusted and relied on.", "Looking back, it was truly mysterious. When her mind was ready to burst from the complex emotions of worry, fear, and frustration, just burying her face in his chest and feeling his touch had calmed her down.", "Should she say that she felt an unknown sense of security?", "But now, Seol Jihu was feeling a similar emotion as he trusted and relied on her.", "Thinking this, she began to feel good. Teresa slowly raised her hand and gently caressed Seol Jihu’s back.", "Seol Jihu moaned quietly as warmth began to spread on his back.", "“It’s been tough, huh?”", "“No, not at all…”", "“It’s fine. The weight on your shoulders must be crushing you.”", "“…To be honest, yes. But thanks to you, Princess—”", "“I know. Of course, I know. Why wouldn’t I know?”", "Teresa smiled bashfully and got on her tip-toes.", "“Don’t worry so much.”", "Burying his face in her warm bountiful chest, she closed her eyes gently.", "“We…”", "Her faint whisper slowly grew fainter. Then, using the strength she used to pull Seol Jihu in, she spoke in a clearer voice.", "“We will not lose. Not this time, not ever.”"]}