{"cid": "305", "title": "Chapter 305. Guidance (2)", "content": ["The Saintes Mesures of Sidus guided Seol Jihu to the prison within the Eva Royal Palace.", "He didn’t know why it made him come here, but he decided to go in regardless.", "When he opened the door and entered, he came face to face with a man, who seemingly was the prison warden. He stared at Seol Jihu fixedly for two good seconds before shooting up from his chair.", "“Aigo! What’s Valhalla Representative doing in a humble place like this…”", "While Seol Jihu was wondering how to respond, the man continued right away.", "“Ah, did you come together?”", "“…Excuse me?”", "“The earlier visitor went in a while ago. I can guide you inside if you’d like.”", "Seol Jihu nodded his head without thinking. The warden must have misunderstood, but it also sounded like there was someone who came to the prison before him. Someone who was close enough to him for the warden to know.", "“This way, please.”", "Seol Jihu followed after the warden, who was taking his keys off his waist, all the while wondering just who it could be.", "The inside of the prison was surprisingly decent. Seol Jihu was expecting to see dark and damp cells, but the place was actually quite habitable.", "But as they went down to the first floor and then the second floor, the scenery changed completely. Everything beyond a meter was shrouded in total darkness.", "The air was damp and unpleasant, and the walls were covered in moss and looked wet from moisture. Although Seol Jihu had no problem seeing, thanks to eating the Golden Wind Phoenix, ordinary people would have to rely on a torchlight to cross this darkness.", "“Kind of eerie, isn’t it?”", "The warden laughed as he walked ahead.", "“The guards try to avoid going down to the second floor. It kind of feels like something’s going to jump out at you, huh.”", "“Yeah.”", "“Haha, sometimes I feel bad for the prisoners who are in solitary confinement on this floor.”", "Right, it wouldn’t be surprising for anyone to go crazy if they were locked up in this dark and isolated place for long.", "Seol Jihu asked while nodding his head.", "“Is the second floor like a special prison?”", "“Yes. Where a prisoner ends up depends on their sentence. The ones who will get out soon stay on the ground level, and the ones who committed a comparatively heavy crime get locked up on the first floor. To be honest, it’s quite hard to get sent down to the second floor.”", "The man cleared his throat before continuing.", "“The criminals who end up here are people who committed unforgivable crimes against Paradisians and Earthlings, or those who should not be set free in the outside world. They’re generally well-known criminals who end up on the Red Notice.”", "“It must be pretty hard to get out then once you’re here.”", "“Well, it’s not like it’s impossible. You can get out if you’re dead. You’ll just be a spirit then.”", "Seol Jihu chuckled at the warden’s joke.", "“Ah, there she is.”", "They finally arrived at their destination. Following the warden’s finger, Seol Jihu saw a familiar back. Though the hallway was a little dark, Seol Jihu could tell who it was just by seeing her ponytail and office attire.", "‘Why is Kim Hannah here?’", "A question arose in Seol Jihu’s mind, but he halted his steps.", "“Thank you. I’ll take it from here.”", "“Yes, sir. I’ll leave the door open until you come up.”", "The warden nodded courteously before turning around and walking away. Seol Jihu stealthily walked over to the other side.", "Kim Hannah looked a little strange. She was standing in front of a tightly shut prison door without moving an inch. She must be in deep focus as she didn’t notice Seol Jihu walking up behind her.", "After weighing his options…", "“Yo!”", "Seol Jihu spoke loudly as he poked Kim Hannah’s back.", "Surprisingly, Kim Hannah didn’t yell or scream. But judging by how she went stiff and hissed out a gasp, she was definitely startled.", "Seol Jihu asked while being disappointed by her reaction.", "“What are you doing here?”", "Kim Hannah’s head creaked back, clearly lost for words. Perhaps because daylight didn’t enter this place, her face looked pale.", "“You… you…”", "Kim Hannah shook in a mixture of surprise and anger before finally heaving out a sigh.", "“Ehew. I almost died from a heart attack. I should be asking you that question. What brings you here?”", "“I have something to do.”", "“Something to do?”", "“Yep. What about you? What were you doing?”", "Saying so, Seol Jihu walked closer to the rusted iron door.", "“Hey, hey.”", "Kim Hannah tried to stop him, but Seol Jihu was already peeking inside the cell through the rectangular hole used for serving food.", "“…Euk.”", "He furrowed his brows immediately afterward. The first reason was that a foul stench mixed with all kinds of odors wafted out. The second reason was that he could only see black and red colors.", "At that moment, the reddish-black color blinked. Realizing that it came from a bloodshot eye, Seol Jihu stepped back in a fright.", "“Save me!”", "The door shouted. No, a voice was heard from inside.", "“Save me. Save me! Please let me out! I was wrong. Please, please…”", "A desperate voice mixed with sobbing rang out. As Seol Jihu stared at the door in a daze…", "“Ah, jeez…”", "Kim Hannah pressed her forehead with a hint of frustration. Her reaction was like someone whose embarrassing secret was revealed.", "After a moment of silence, Kim Hannah grumbled.", "“…I was enjoying my hobby.”", "“?”", "“Don’t say anything. I definitely told you about it and even got permission.”", "“Permission?”", "“Jung Sua, I mean.”", "[That Jung Sua. Can you let me deal with her?]", "[I’m going to make her shit blood.]", "‘Ah.’", "Seol Jihu finally realized why Kim Hannah was here, what she was doing, and just who was imprisoned in this cell.", "It was the previous representative of Evangeline— Jung Sua.", "Seol Jihu knew she was in prison. He just didn’t know she was on the second basement level. Calming down, he looked at the door once again.", "“Save me… Please let me out…”", "“….”", "To be honest, she didn’t really look like Jung Sua. It might be because he could only see a small part of her, but the way she clung to the door and mumbled endlessly, a screw seemed to have gone loose in her head.", "“Wow, just how much did you torture her?”", "“I never tortured her.”", "Kim Hannah replied in a deadpan voice.", "“I didn’t lay a single finger on her. It’s just that…”", "She paused and hesitated for a long time before spitting out the truth helplessly.", "“I changed the condition of her cell a little.”", "“Condition of her cell?”", "Seol Jihu looked past the bawling Jung Sua and studied the cell. He immediately became lost for words.", "He was wondering why it smelled so bad. The floor of the cell was wet with wastewater, and all kinds of filth and trash were floating in the pool.", "He couldn’t see anything other than that. Not even a bed.", "‘So this is where all that foul stench is coming from….’", "Seol Jihu’s stomach churned just by imagining eating and sleeping in such an enclosed filthy cell.", "“Anyway, why are you here? Do you have business with her?”", "Seol Jihu snapped out his daze at Kim Hannah’s question. Why did the Saintes Mesures of Sidus guide him to Jung Sua? What did she know?", "“I’ll do whatever you say… I won’t enter Paradise ever again… That’s right! You can just kill me!”", "Seol Jihu stared at the blabbering Jung Sua. To be honest, he didn’t really expect her to know something. Even though she was the representative of an organization, as an Earthling, she was nothing more than an ordinary opportunist.", "But it was then.", "‘Wait.’", "The name of a woman suddenly crossed his mind. Evangeline Rose, the original founder and representative of the now-disbanded organization.", "Jung Sua pursued only her own advancement of status, but Evangeline Rose was different. Though the effectiveness of her methods was debatable, Seol Jihu had heard on multiple occasions that she was an Earthling who truly worked for the interest of Paradise.", "In that case, the story was different. After Evangeline Rose’s death, Jung Sua successfully took over the empty representative position. This meant that Jung Sua had a fairly large authority within the Evangeline organization before Evangeline Rose’s death.", "There was no way a bottom-rung member would be smoothly promoted to the highest position, even if Charlotte Aria supported her. It was likely that Jung Sua had at least a team leader’s position.", "In other words, Jung Sua must have watched Evangeline Rose from a close distance.", "‘The Guardian of Eva, huh…’", "Looking back, it wasn’t just once or twice that this happened. Whether he liked it or not, after he moved to Eva, what Seol Jihu was trying to do was invariably intertwined with what Evangeline Rose tried to do, like when he busted the Eva Alliance or when he recruited Eun Yuri.", "So there was at least a little chance that this matter was related to Evangeline Rose as well.", "In that case, there must have been something she was working on, even if it was only a little bit.", "Seol Jihu spoke, recalling the question he raised a long time ago.", "“There’s something I want to ask.”", "“Yes, yes!”", "Jung Sua nodded her head crazily. She looked ready to answer anything.", "“I’ll be straightforward. Do you know why Evangeline Rose participated in the Banquet?”", "“The Banquet…?”", "Jung Sua’s face contorted pitifully.", "“I-I have no clue. I don’t think anyone knows why. Evangeline Rose always acted on her own….”", "She wasn’t wrong about that.", "[Unni’s personality was like that. She didn’t trust others easily and always tried to do things alone.]", "Evangeline Rose’s younger sister described her as a lone hero as well.", "[She was indeed an outstanding person. But to tell you the truth, I did not like her that much.]", "[Evangeline Rose was an Earthling who had principles and also the ability to achieve her goals.]", "[But she… how should I say this…]", "[She did not have any expectations. Rather than leaving it to you guys, I’d rather take care of it myself. She was always like that.]", "Sorg Kühne said something similar too.", "So, Seol Jihu decided to broaden the range a little more.", "“Tell me if you have a suspicion or a guess. Even if it’s not about why she participated in the Banquet, it’s fine as long as it’s related.”", "“I don’t know. I really don’t know anything… Anything related, anything related….”", "Seol Jihu could feel the anxiousness in her voice. Jung Sua scowled. She was murmuring repeatedly while racking her brain. It seemed she really wanted to escape this place.", "But no matter how long Seol Jihu waited, the clue he wanted did not appear. It didn’t look like Jung Sua was hiding anything either.", "‘…Maybe I guessed wrong.’", "Just as the disappointed Seol Jihu turned around and thought about looking for other clues, Jung Sua’s eyes suddenly shot open.", "“T-The Magician!”", "She shouted as if to grab onto a lifeline that was disappearing.", "Seol Jihu paused.", "“Magician?”", "“Y-Yes! The Magician! Adam Galaev! That person tried to stop Evangeline Rose from participating in the Banquet!”", "“Adam Galaev…”", "Kim Hannah, who was quietly watching until now, chimed in.", "“He worked inside the Evangeline organization in the past. He was more like an honorary member than an official one.”", "“You’ve heard of him?”", "“Yeah. But one day, he left Evangeline for an unknown reason. This was long before the last Banquet opened, so it doesn’t really make sense time-wise…”", "Seol Jihu glanced at Jung Sua, who was still clinging onto the door.", "“No, not at all!”", "Jung Sua hurriedly shouted.", "“It’s true that he and Evangeline Rose went separate ways, but they didn’t break off completely! They continued to exchange letters afterward! Evangeline Rose might not have replied, but I know she received them! I saw them with my own eyes!”", "“Hmm. What did the letters say?”", "“I-I don’t remember well… Something about the Banquet being ineffective… That they should join hands… He was basically saying that his method was correct, but I’m not sure exactly what he meant…”", "Jung Sua stammered with doubt, but Seol Jihu’s ears perked up.", "‘Method.’", "[Well, I really can’t blame her given the state of the government affairs back then, but I think it was wrong of her to part ways with the one and only Magician just because she did not agree with that person.]", "Come to think of it, Sorg Kühne had said something like that as well.", "Seol Jihu finally found a lead. Of course, he would need to dig deeper into it to be certain.", "“Letters…”", "“Yes, yes. You said anything is fine, right?”", "Jung Sua looked relieved once Seol Jihu showed signs of being interested. She let loose a long sigh and regained her composure slightly.", "“Can you tell me more? About the letters, I mean.”", "“Ah… mmm….”", "Jung Sua pretended to be in conflict before speaking in a furtive voice.", "“If you can let me out…”", "Seol Jihu’s face changed colors.", "“I-I mean! I don’t really remember well! So if I go out—”", "Jung Sua continued in a fluster, but Seol Jihu turned away. He didn’t have the energy to deal with Jung Sua’s hard-to-get play. Since there was an expert on the scene, entrusting the matter to her and backing off seemed best.", "“Kim Hannah.”", "Perhaps judging that this was no longer a private place, Kim Hannah fixed her posture.", "“You heard everything I said just now, right?”", "“Yes, Representative.”", "“Even the tiniest detail is important. Dig out everything she knows about Evangeline Rose.”", "Jung Sua’s complexion distorted miserably.", "“You can do it, right?”", "“Of course. But—”", "“Don’t worry. I’m about to leave.”", "Hearing this, Kim Hannah shut her mouth. It seemed she didn’t want others to see her enjoying her hobby.", "Seol Jihu turned back.", "“Wait! Wait! I’ll tell you! Please don’t go! Don’t leave me alone with this person!!”", "Jung Sua belatedly shouted, but Seol Jihu left without hesitation.", "*", "It was late at night when Kim Hannah returned. Seol Jihu expected her to take a few days, so she came back earlier than he expected.", "She said she could have come back even earlier but got delayed to investigate something.", "“These are Evangeline Rose’s personal items. Jung Sua’s infatuation with role-playing came in handy.”", "Kim Hannah spoke as she placed down a bag on the table.", "Seol Jihu gave it a glance.", "“Role-playing?”", "“Yes, she must have thought she needed to know Evangeline Rose well if she were to play out her role. That’s why she was keeping all of her personal items under the pretext of transfer of duties.”", "“Keeping them where?”", "“In the temple storage. Ah, she also had some hidden assets, so I retrieved them to add to Valhalla’s company fund.”", "Kim Hannah smiled sweetly, saying that she took everything from Jung Sua’s temple storage in exchange for letting her out.", "Seol Jihu marveled. He ordered her to dig every last detail out of her, and Kim Hannah did exactly that.", "“Where’s Jung Sua?”", "“I sent her off properly. That was the promise. Well, what happens to her on Earth is none of my business.”", "Kim Hannah made a suggestive comment before rummaging through the bag. Was Seol Jihu mistaken in thinking that she ‘sent her off properly’ to the afterlife rather than home?", "“First, these are the clothes and underwear that Evangeline Rose wore while she was alive. Her jackets are here too.”", "Kim Hannah said as she took out several clothes.", "“Don’t joke now.”", "“I’m not joking. You said grab anything and everything, right? For the record, a capable Archer can discover many clues just from what someone wears.”", "“…Really?”", "After thinking about it for a moment, Seol Jihu nodded his head, thinking that it made sense.", "“Call Ayase Kazuki over. An Archer of his caliber should be able to tell us something. And also—”", "Kim Hannah looked askance after saying calmly.", "“I thought somebody would like it.”", "“Do you think I’m a pervert? I don’t enjoy any random girl’s clothes, you know.”", "Kim Hannah stared fixedly at the protesting Seol Jihu. Though she had many things she wanted to say, she shook her head.", "“Anyway, there are all kinds of items here… but you should probably look at this first.”", "Kim Hannah placed her hand on the table. Three neatly folded papers were sitting on it.", "“These are the letters Jung Sua talked about.”", "The letters Adam Galaev sent Evangeline Rose.", "Right, these were what Seol Jihu wanted. Scanning them briefly, he noticed they were quite long.", "Seol Jihu quickly started reading.", "—To my beloved Evangeline Rose, I’ve thought about a lot before picking up my pen. Even then, I had trouble writing my first few words. The reason I am writing this letter is in hopes that you will change your mind. Perhaps you already have.", "", "I know how much you care about Paradise and what you are seeking to accomplish in Eva. I am the same. Although our opinions clashed and we went our separate ways, I believe our ultimate goals have not changed.", "I want to talk to you again.I am waiting for you.", "A. Galaev", "—I received your letter well. I understand that you will not change your mind about participating in the Banquet. I also understand that you do not trust my plan. But setting the Banquet’s danger aside, I still believe that the Dissonant Wish is unable to fulfill our wish. In a way, it seems we are both the same.", "", "What I want to tell you is that you need to trust others more, especially those who share your values and wish for your well-being.There is a limit to how far you can go on your own. Recently, I have been experiencing that personally.", "To tell you what I have been up to, I am still investigating the past incident. The plan you said lacked credibility has shown some progress.There is still some time until the Banquet opens. Please hold off on your decision until then.", "A. Galaev", "—Beloved Evangeline Rose, I apologize for the late reply. I must admit, reading that you will no longer reply has made me sad. But I did not stop working because of it. As a result, I managed to find an excellent assistant. ", "", "I found the Priest girl from the Temple of Invidia who solved the incident back then. Although I had to jump through a few hoops, I managed to talk to that child’s older brother. I have no doubt that this girl will help me complete my plan.", "As I said in the previous letter, I hope that you can trust me more.", "You said so yourself in your letter. That things have been working out in strange ways recently. That we need to act in haste.", "I do not know how Haramark’s recent valley war affected you mentally. But if I may give you a piece of advice, it is that you are not the only Earthling who is working for the future of Paradise.", "Of course, I fully agree that we need to act urgently. But I do not think you need to bear any unnecessary risk.", "Evangeline Rose, I beseech you for the last time.I need your help for my plan to work. I am sure you know what this means.", "We need her help.", "A. Galaev", "‘It smells alright….’", "Seol Jihu smacked his lips. He could tell they were talking about something critically important, but the real substance was missing.", "“As you can see from the letters…”", "Kim Hannah spoke as soon as Seol Jihu put down the last letter.", "“Nothing is written in detail. Since the matter demanded secrecy, it seems they avoided talking about the specifics on purpose.”", "Then, Kim Hannah pointed to a section of one letter.", "“But it isn’t as if we don’t have a clue.”", "“Clue.”", "“Yes. I might not understand the specifics, but I can find the people involved.”", "Come to think of it, the Magician mentioned an assistant, even going as far as to say he and Evangeline Rose needed her help.", "The question was who exactly this girl was.", "“Coincidentally…”", "Kim Hannah continued, just as Seol Jihu was about to fall into a dilemma.", "“I believe I know who this assistant is.”", "“…Hm? Really? How?”", "“Do you remember what you requested me to do back in Haramark?”", "“?”", "“Didn’t you tell me to look into two people?”", "Seol Jihu rummaged through his memories before going “Ah.” The Heaven-Slaughtering Star and the white headband girl. He had completely forgotten about them until now.", "“Wait, what do those two have to do with this?”", "“They’re the assistants mentioned in the letters.”", "“Are you sure?”", "“Yes, I’m certain.”", "Kim Hannah said firmly.", "“I looked into it when you asked me back in Haramark. I just couldn’t hold back my curiosity. I know they made contact with this Magician from back then.”", "Kim Hannah spoke with emphasis.", "“I do not know the details, but it is certain that Adam Galaev made contact with this Invidia Priest. I confirmed this when I was still in Sinyoung, and more importantly, the time they met and the time the second letter was sent matches perfectly.”", "Kim Hannah finished her long explanation by adding that she was late because she stopped by the Assassination Guild to confirm.", "“Then…”", "Seol Jihu spoke in a daze.", "“We’ll need to find those two.”", "“I thought you’d say that, so I already made the request.”", "Kim Hannah winked while smiling bashfully."]}