{"cid": "386", "title": "Chapter 386. Mockumentary (2)", "content": ["“What a surprise.”", "Tak. Roberto Servillo said as he closed the recovery room’s door.", "“She was okay with you touching her back. It seems she has changed a lot.”", "“What do you mean…?”", "“Ah, you didn’t know?”", "When Seol Jihu asked, feeling confused, the bishop turned his head and replied.", "“Lady Seo Yuhui avoids uncleanliness so much that it nears mysophobia. She detested even the slightest touch from foreign things.”", "“Really?”", "“Hmm, it looks like this is the first time you’ve heard of this… I guess it wouldn’t hurt for me to tell you. Do you remember how I told Lady Seo Yuhui that I disinfected my hands before coming here? In the past, whenever she had an unavoidable reason to be touched by someone, she made sure they didn’t have a speck of dust on their hands.”", "The bishop raised his left hand and smiled.", "“She even wiped her hands at the end of every battle. It’s certainly odd, but she took care of it meticulously so that it didn’t bring harm to others.”", "It was hard to believe that Seo Yuhui was such a clean freak.", "Suddenly wondering what Seo Yuhui was like in the past, Seol Jihu tilted his head.", "“It’s hard to believe, isn’t it? I felt the same way when I opened the door. For someone who avoided making contact with others like a plague to be hugging a man…”", "The bishop shook his head.", "“Though there was a period of inactivity, I still cannot get used to it. She changed so much that she’s like a different person… Ah, let’s go.”", "The bishop started walking in the middle of his speech.", "Where was he going?", "Seol Jihu was somewhat nervous, but he followed him without showing it outwardly.", "The corridor was longer than he thought. There was no end in sight even after walking for several minutes without talking.", "“Come to think of it, wasn’t there a huge welcoming party in Valhalla not too long ago?”", "While they were walking for some time, the bishop suddenly asked.", "“Ah, yes. How did you know?”", "“Representative Seol returning to Paradise has been the talk of the town for a while. To tell you the truth, I was jumping from joy when I heard the news. Initially, when I heard that you were gone for eight months, I was worried that you retired from Paradise.”", "The bishop then added with a hearty laugh, “What would we do if the only one capable of combating the Parasites disappeared?”", "“To be honest, it wasn’t the time to be throwing a party.”", "Seol Jihu smiled bitterly.", "“I invested eight months of time and returned empty-handed… But I couldn’t really say no when it was obvious that my friends were throwing the party to cheer me up.”", "“Returning empty-handed after investing eight months of your time…? Did something important happen?”", "“…It was about Yuhui Noona.”", "The bishop stopped.", "“Ah, I see…”", "He turned and started walking in the left corridor.", "“It sounds like you’ve been searching for a way to save Lady Seo Yuhui these past eight months, but failed.”", "“I did find a way.”", "Seol Jihu sighed.", "“It’s just that it couldn’t come to fruition… I guess I did fail if you put it like that.”", "“Aha.”", "The bishop nodded slowly.", "“So that’s why you said sorry… Hmm. There’s something I’m curious about now. May I?”", "“Yes, go ahead.”", "“Did Representative Seol really want to save Lady Seo Yuhui?”", "Seol Jihu frowned. This question suddenly came out of nowhere.", "“…Pardon? Yes, of course.”", "“Do you really mean that?”", "The bishop asked again as Seol Jihu replied in a fluster.", "Seol Jihu made a displeased expression.", "“…I don’t know why you’re saying this all of a sudden, but I wholeheartedly wanted to save Yuhui Noona. She saved my life before, and it’s also my fault that she is in her current state.”", "“If you really mean that…”", "The bishop glanced back slightly.", "“Pardon my bluntness, but was there a need to go that far?”", "“…Excuse me?”", "The bishop stopped. Before anyone noticed, the duo had entered a small, quiet room.", "“What I mean is…”", "The bishop slowly turned around and looked at Seol Jihu.", "“You already have an item that could heal Lady Seo Yuhui, so was there a need to be away for eight months?”", "He seemed to be reproaching Seol Jihu.", "Seol Jihu looked at the bishop in a daze before furrowing his brows.", "“…Are you perhaps talking about Moirai’s Souvenir?”", "The bishop nodded his head frighteningly.", "“Don’t misunderstand. I found out about it while I was searching for a way to save Lady Seo Yuhui. I remembered the item being in the VIP store of the Neutral Zone, so I had my subordinates check. It turned out that someone already purchased the item. I believe the buyer’s name was Eun Yuri.”", "The bishop gave a sharp look.", "Seol Jihu closed his eyes and sighed.", "“I would have used Moirai’s Souvenir… if I still had it.”", "“Does that mean you no longer have it in your possession?”", "“That’s right. Moirai’s Souvenir was expended in the last war.”", "“At Tigol Fortress, you mean?”", "Seol Jihu shook his head.", "“No, I used the item in the Spirit Realm.”", "The bishop’s eyes widened.", "“At the time, I believed the Parasites had six Army Commanders and expected five to go to Tigol Fortress. In other words, I judged that at least one Army Commander would be inside the Spirit Realm, so I took Moirai’s Souvenir to deal with the Army Commander there.”", "“To deal with the Army Commander inside the Spirit Realm?”", "“I’m sure you know it too. The reason that Army Commanders usually have their divinities sealed.”", "“Of course. When they release it, they can display power rivaling a god on the basis of terrifying holy power, but the duration is short and they need a long time to recover afterward…”", "“Exactly. Moirai’s Souvenir was a secret weapon that aimed for this weakness. After pushing the Army Commander to a corner and forcing them to release their divinity, we planned to inject the near-infinite amount of holy power that Moirai’s Souvenir carried and amplify the fundamental imbalance in the Army Commander’s energies.”", "“Hoh, that’s quite the method… And what was the result?”", "“I’m standing here, aren’t I?”", "Seol Jihu smacked his lips.", "“Unfortunately, there were two Army Commanders inside the Spirit Realm. Not one. We had no choice but to use Moirai’s Souvenir.”", "Seol Jihu continued calmly.", "“You may not know this, but our success in saving the Spirit Realm was a miracle that resulted from a series of coincidences. We were on the brink of complete destruction and had to use every card in our arsenal to survive.”", "The bishop nodded his head.", "“So that’s what happened… Not much is known about what happened in the Spirit Realm, so this old man misunderstood.”", "“No, it’s fine…”", "“Before I apologize, there’s one more thing I’d like to ask.”", "Seol Jihu furrowed his brows, but the bishop continued unfazed.", "“I believe Representative Seol has received an incredible amount of contribution points from this war. So I’m wondering…”", "As the bishop trailed off suggestively, Seol Jihu shook his head again.", "“If you’re asking why I didn’t use contribution points to save Yuhui Noona, I can only tell you that I didn’t have enough.”", "The bishop’s eyes lit up.", "“Is that so? That’s surprising.”", "“Have you used a Divine Wish before, bishop?”", "“No, I’ve never amassed contribution points to that degree.”", "“I’ve used it once before.”", "“To revive that Magician named Eun Yuri, correct?”", "‘So he even knows about that?’ Seol Jihu murmured inwardly before continuing.", "“Yes. it was thanks to the contribution points I gained by personally killing Undying Diligence in the Arden Valley War.”", "“Mm. Then how come this time—”", "“Do you know on what basis contribution points are given out?”", "“I doubt you’re asking for the obvious answer…”", "The bishop thought for a moment before doing a double-take.", "“But—”", "“It wasn’t me, but Eun Yuri who bought Moirai’s Souvenir. The Priests within my organization were the ones who used it. And it was Mister Ayase Kazuki who forced Raging Temperance to unleash his divinity.”", "Seol Jihu seized the initiative before the bishop could say anything.", "“The same goes for the other items used in the last war. To be honest, I didn’t do much. Passing through the Astral World? It was thanks to the Halep siblings. Reviving the World Tree? Mister Marcel Ghionea risked his life to achieve that. I probably don’t need to mention the Tigol Fortress War.”", "The bishop’s head spun.", "This wasn’t too hard to believe given that Seol Jihu was only Level 5, but this was also the man who had killed the First Army Commander.", "But at the Arden Valley War, Seol Jihu had used an Awakening Skill using his life as collateral, and Seo Yuhui’s current state was a direct result of trying to save him from death.", "Seol Jihu’s explanation made perfect sense if, as a result, both Seo Yuhui and Seol Jihu could no longer use the Awakening Skills they did back then.", "“Of course, I received some compensation. I did contribute to a good degree in that war, after all.”", "Still, his contribution was a lot more indirect compared to personally killing Undying Diligence. As a result, the contribution points he received were far less in comparison.", "That was Seol Jihu’s explanation.", "“People around me hail me as a hero, but… I’m really just an average guy who got incredibly lucky.”", "Seol Jihu spoke self-mockingly with a bitter smile.", "The bishop listened quietly before replying.", "“…Can you tell me what you have been up to these past eight months?”", "Seol Jihu smoothed down his face with his hands as if he was tired of the bishop’s unceasing questions.", "“…I tried to infiltrate the Empire.”", "“The Empire… You mean the Parasites’ territory?”", "“Yes. I wanted to use my remaining contribution points to facilitate Yuhui Noona’s recovery. Since I didn’t have enough to use a Divine Wish, I had to think of another method. So I pleaded with Gula, asking her to tell me how to save Yuhui Noona in exchange for contribution points.”", "“You said you found a way?”", "“Thankfully, yes. Gula told me of a location where a large number of offerings are buried. It was in a region where the old Rothschear Clan, known as the Spear of the Empire, resided.”", "“Rothschear? Isn’t that one of the Four Great Clans of the old Empire and the clan that was wiped out by the Gorgonu Clan?”", "The bishop spoke as if he didn’t expect to hear the name ‘Rothschear’.", "Seol Jihu also stared at the bishop with a look of surprise. It seemed he wasn’t just capable in politics, but was also well-versed in Paradise’s history.", "“The Rothschear Clan’s offerings… That makes sense. They were the ones who served Castitas…”", "As the bishop murmured to himself, Seol Jihu suppressed the impulse to clutch onto the pendant that was shaking inside his clothes.", "“Trying to infiltrate the Empire must mean that this location is within the Parasites’ territory.”", "“Exactly.”", "“Why didn’t you take anyone with you? This hardly seems like a place you should go alone.”", "“It’s not that I didn’t have anyone to ask. But I couldn’t force myself to drag my comrades who were already worn-out from war. I also judged it was better to move with a few people rather than a large group.”", "“Ah, you must have thought the Parasites wouldn’t be on guard after their huge defeat.”", "“My biggest oversight was thinking that they wouldn’t recover so quickly.”", "After reaching this point, Seol Jihu heaved out a deep sigh.", "“…Is that enough?”", "The bishop didn’t answer. He was simply rubbing his chin with his head lowered. This seemed like a subconscious habit that came out while he was ruminating.", "“Hm, hm, hmm, hmmmm.”", "He tilted his head left and right before turning to Seol Jihu.", "“My, my…”", "A faint smile seemed to be hanging on his face.", "“It looks like I owe you an apology.”", "He seemed strangely satisfied.", "“It wasn’t that you didn’t try to help. You simply couldn’t. I understand now. I honestly wasn’t thinking so highly of you before, but now that I know the full story… I apologize. I am sincerely sorry.”", "The bishop continued.", "“If I may give an excuse, didn’t you hear that I wanted to meet with you?”", "“…I did.”", "“I’ve been wanting to discuss the matter regarding Lady Seo Yuhui with Representative Seol for a few months now. Since I would be taking a sizable loss, I had to make sure Representative Seol was someone I could trust, so that was why I asked so many interrogative questions.”", "“Loss?”", "“Yes. Anyway, I’ve confirmed Representative Seol’s sincerity. Since there is no use apologizing with mere words, I will show my sincerity as well.”", "The bishop smiled and spoke.", "“Have you heard of Gorad Boga?”", "Seol Jihu shook his head.", "“It refers to the location in this world that was ruled by its first god after their birth. It is a legend that has been passed down since the Mythical Era, long before the time of the Empire. On Earth, this place would be similar to the legendary city of Atlantis or the City of God.”", "“City of God…”", "“As a land that was once ruled by a god, it naturally carries miraculous energy. To Priests who use holy power rather than mana, this is the most ideal place.”", "“Are you talking about areas like Mount Peléeom’s volcanic region?”", "“Ah, the place Lady Seo Yuhui visits often to pray. Yes, that is correct. It’s great that you have an idea. But the place I am talking about is incomparable to that place. The density of vital energy should be hundreds of times greater at the very least.”", "Seol Jihu’s eyes widened.", "“H-Hundreds of times?”", "“Think of it as a small achievement I made while Representative Seol was working hard.”", "The bishop smiled thinly and then cleared his throat.", "“Getting right to the point, I’ve found the place that is presumed to be Gorad Boga. No, I’m certain. I went there personally using the excuse of offering prayers.”", "The bishop glanced at Seol Jihu who was clearly excited.", "“I’ve never seen anything like it. It was like lumps of highly concentrated vital energy were scattered everywhere like ordinary rocks. It should be more than enough for Lady Seo Yuhui to fully recover.”", "“Is that true?”", "“Yes! But—”", "The bishop coughed.", "“Before I tell you its location, I need you to promise me something.”", "“A promise…?”", "“No worries. It’s not anything difficult.”", "The corner of the bishop’s mouth slowly curled up.", "“Please tell Lady Seo Yuhui this.”", "Then, his voice suddenly lowered.", "“That it was Representative Seol who found out about this place.”", "Seol Jihu blinked at the unexpected request.", "“Of course, she might wonder how you found this place. I will hand over all the details that you might need.”", "“…Uh…”", "The more bewildered Seol Jihu looked, the thicker the bishop’s smile got.", "“Why… do I need to do that…?”", "“Well, it’s fine even if you don’t.”", "The bishop replied firmly as Seol Jihu raised a suspicion.", "“It’s just that the trouble we went through will have been for naught. Because Lady Seo Yuhui will refuse to go if you tell her the information came from me.”", "“Pardon?”", "“It’s because I am someone who lost her trust. Lady Seo Yuhui will never give her trust to someone she has turned her back on once.”", "Seol Jihu stood in a fluster at the bishop’s honest confession.", "“Fufufufu, don’t be so surprised. Didn’t you know this already?”", "“?”", "“What kind of person I am and what relationship I have with Lady Seo Yuhui. Didn’t Miss Foxy tell you all about it?”", "Seol Jihu’s complexion sank as the bishop hit the nail on the head.", "“That’s right. I am not a fan of Lady Seo Yuhui. In fact, you can even say that I hate her.”", "The bishop admitted.", "“But I am sincere in wanting to save her. I can only keep my position if that wench dies. If I was thinking something so foolish, I would have assassinated her rather than wasting my energy to find Gorad Boga. Don’t you think so?”", "Seol Jihu’s aura sharpened in an instant.", "The bishop seemed to like this change in attitude as he showed a satisfied smile.", "“People rarely walk by here. Why don’t we talk a little more comfortably.”", "The bishop clasped his hands behind his back and slowly circled around Seol Jihu with his clacking shoes.", "“You must be curious why an ugly, power-hungry, old man like me is trying to save Lady Seo Yuhui, or if I am scheming to entrap the two of you.”", "Clack.", "“I will be open and straightforward. It’s simple. It is because I recently understood why Lady Seo Yuhui returned from her retirement and because I fully support the goal that she is trying to achieve.”", "Clack.", "“To be honest, I didn’t understand at first why someone without any desire suddenly came back and what she was trying to achieve…”", "Clack.", "“That wasn’t all. After going so far as to put a protective order on her residence in Scheherazade, she suddenly decided to move to Haramark and look after a Warrior of Gula who was a known Irregular. The questions I had only grew by the day.”", "Clack.", "“But now, I finally understand why she did all those things. My eyes lit up and shot open, really. Ah! Why didn’t I notice this earlier!?”", "The clacking of his shoes stopped.", "Before he noticed, the bishop was standing before Seol Jihu.", "“She must have been longing for the past just like me. The time when Baek Haeju, Seo Yuhui, and Sung Shihyun were active in Paradise.”", "“….”", "“That was truly an era of glory! Of course, they say that there is no flower that remains red for ten days… but isn’t it normal for flowers to bloom and wilt?”", "The bishop took another step toward Seol Jihu.", "“Two out of the three people from back then have reappeared in Paradise. While one has betrayed humanity, there is a man in front of me who surpasses Sung Shihyun! Character! Strength! He is flawless in every aspect!”", "Chilly laughter rang out.", "“It is time that the flower blooms again. The return of the Legend of Paradise, the reappearance of the Beholder of the Divine Vestige, and the coming of a new hero, the Son of Gula—all the conditions have been met! Once I realized this, I had to save Lady Seo Yuhui no matter what.”", "After saying all this…", "“…With this, I’m sure you’ve noticed my true intention.”", "The bishop slowly reached out his hands toward Seol Jihu.", "“…What will you do?”", "He placed his hands on his shoulders and asked with a furtive voice.", "“I babbled on, but it’s simple, really.”", "“….”", "“Don’t you want to save the woman you love?”", "Seol Jihu subconsciously took a deep breath.", "The hands that were on his shoulders felt like crawling snakes.", "“Don’t you want to save the person who risked her life to save yours?”", "At the same time, a chill went down his spine.", "It was because he finally came face-to-face with the naked truth of Earthlings who only chased after their own benefits.", "“It isn’t difficult. All you have to do is reach out and grab onto the opportunity. It is incomparably safer than something as absurd as infiltrating the Parasites’ territory.”", "Seol Jihu bit down on his lower lip.", "He fell silent with a conflicted look.", "Then, he slowly said.", "“Does a place like Gorad Boga… really exist?”", "Perhaps judging that the fish had taken the bait, the bishop tightened his grip unknowingly.", "“I may be worrying unnecessarily, but do not doubt Goddess Gula. The value of a place, where a god has directly appeared in the Middle World, simply cannot be described. It may be on par with a Divine Wish. It is only natural that Representative Seol could not find out with contribution points.”", "He then added, “But — I found out about this place through sheer luck. With my own strength.”", "Seol Jihu, who was about to turn around, stopped in the middle and shut his eyes.", "His breathing gradually turned rough before — kddk! — the sound of him gritting his teeth rang out.", "Soon…", "“…Where is this place?”", "A suppressed voice eked out.", "The bishop’s burning gaze regained its original color. His eyes curled into a smile.", "“It seems you and I are on the same page now.”", "“….”", "“That’s right. A person has to be flexible! That’s the kind of man I like!”", "Only then did he take his hands off Seol Jihu.", "“Haha, actually, it takes some time to get to that place from Eva, so something unsavory might happen during travel. But, I have a way of taking care of that problem.”", "The bishop raised his left hand and pulled out the ring on his finger.", "It was a ring with an emerald-colored gem. Anyone could tell at first glance that it was not an ordinary accessory.", "“This is a holy artifact I received when I became a Level 6. It carries a large amount of vital energy, so you won’t have to worry about running out of holy power during travel.”", "The bishop shook the ring a couple of times before taking out a transparent crystal from his pocket.", "“I will give you this as a token of our promise and call you later. I will see you then.”", "He carefully placed the crystal on Seol Jihu’s hand. Then…", "“Representative Seol? Let me be clear. There is nothing that I want.”", "He suddenly clutched Seol Jihu’s hands and spoke.", "“Please save Lady Seo Yuhui. Then continue fighting the Parasites like you always have been and triumph. That in and of itself will be of huge help to me.”", "“….”", "“Well, if this matter continues weighing on your mind, you can tell me the location of the buried offerings later. I am giving you my prized ring and location of Gorad Boga, so shouldn’t I enjoy a snack or two as well?”", "The bishop revealed a thick smile and then let go.", "“Then I will take my leave first.”", "He then took a few steps back before standing up straight.", "“Do take care of me from now on, Sir Future Star of Gluttony and Gula’s Preparatory Apostle.”", "The bishop bowed politely at Seol Jihu and then left the room with a hearty laugh.", "*", "It was about ten minutes after the bishop left that Seol Jihu turned around.", "After standing like a stone statue for a long time, Seol Jihu slowly crossed the corridor.", "Seo Yuhui wasn’t inside the recovery room. She had apparently returned to Earth due to a problem with her body.", "Seol Jihu left the temple with a stiff expression.", "During the entire walk home, his expression was dazed and his footsteps were without strength.", "But the moment he entered Valhalla, his attitude changed completely.", "Color returned to his complexion, and his footsteps became light.", "“Huhu, a gift? You didn’t have to…”", "He even juggled the ring while humming joyfully.", "But before he could enter through the front door, Seol Jihu had to stop.", "Kim Hannah was staring at him fixedly at the entrance.", "“…Why are you looking at me like that?”", "“Because you look like someone who picked up money from the ground on his way home.”", "Hearing this, Seol Jihu changed his attitude again.", "He returned to the enervated appearance he had when he left the temple.", "“What about now?", "“Mm… like a male protagonist who joined hands with a devil to save the woman he loves but is still shocked by the whole thing?”", "Seol Jihu burst into laughter at Kim Hannah’s assessment.", "“That’s problematic.”", "“Why?”", "“I wanted to look like a man who would stop at nothing to save the woman he loves.”", "Kim Hannah chuckled.", "“How was it?”", "“Don’t even mention it. I thought I was going to die.”", "Seol Jihu heaved out a sigh and marveled.", "“He kept asking one question after the other with some shitty excuses… He really has a talent for making people tired. I’ll give him that. Thankfully, it didn’t seem like he knew how divinity worked.”", "“He’s quite the snake, isn’t he?”", "Kim Hannah snickered.", "“That guy’s pretty famous on Earth too. He climbed up the social ladder while seeing all sorts of dirty things from a young age. It’s better to have him find out rather than putting on a poor performance.”", "“Now that I’ve met him, I can tell exactly what you’re talking about. He touched my shoulders, and it was like snakes were crawling all over me… Ugh!”", "“Anyway, how did it go?”", "Seol Jihu shrugged and showed Kim Hannah the crystal and the ring.", "“What’s that ring?”", "“He gave it to me as a token of our promise. He said it’s a holy artifact he received when he became a Level 6. He told me to give it to Yuhui Noona.”", "“Oho. So he took a step back to confirm whether you were serious, but he’s confident.”", "Kim Hannah smiled in satisfaction.", "She sauntered up and patted Seol Jihu’s butt as if to praise him for performing so well in front of that snake-like, old man.", "“Where do you think you’re touching?”", "Seol Jihu flinched and protested, but Kim Hannah only snorted in response.", "“What do you think I’m doing? I’m praising you. Good job! Go rest and ease up.”", "Seol Jihu looked at her dumbfoundedly before looking down.", "Though covered by her H-line office skirt, he could see her well-shaped hips under her slender waist.", "Seol Jihu reached out stealthily.", "Tap, tap.", "“Yeah, you did well too.”", "Kim Hannah jumped.", "“Ah, hey! Are you crazy!? Where do you think you’re touching?”", "“Ye who does not permit thy butt shall not covet another’s butt.”", "Pang! Seol Jihu spoke solemnly before rushing up the stairs with Ethereal Shift.", "Despite Kim Hannah screaming from the lobby, he moved quickly.", "‘Hmm, Kim Hannah’s not bad either…’", "Recalling a certain evil butt, Seol Jihu rubbed his hand and then paused as soon as he stepped into his office.", "His grinning eyes quickly scanned the room.", "“….”", "He slowly closed the door and locked it before smiling toward the desk.", "“You’re here.”"]}