{"cid": "385", "title": "Chapter 385. Mockumentary (1)", "content": ["Under the pitch-black sky without any stars, pale moonlight from a full moon fell through the tree branches upon the dark city.", "The desolate streets in the middle of the night were deathly still, except for the incessant chirping of insects.", "Tak.", "A window of a room on top of a building suddenly closed shut, and a black curtain was pulled closed behind it.", "As even the moonlight was shut off, darkness swamped the room.", "“Forgive me. The insects were annoying.”", "“…”", "“Don’t they sound just like crickets? They sound like something boiling—”", "An elderly voice was heard from the direction of the window…", "“How long do I have to wait?”", "…While a different voice was heard from the center of the room.", "It was a low voice that was neither aged nor young.", "“That same question again. Why are you in such a hurry?”", "The voice accompanied by low laughter moved from the window towards the center of the room.", "“There’s no helping it. At this rate, the Parasites will treat humanity as its main enemy. No, they might already think so.”", "“I suppose. The outcome of the battle at Tigol Fortress was surprising, both for us and for the Parasites… But isn’t it fine? Since they’ve won the war—”", "“Fine? Enough with the jokes.”", "The dignified voice sharpened.", "“Do you think that the Parasites will perish just because of one or two defeats? No, absolutely not. The Parasites' forces are immortal. All they have to do is remake however much they lost each time.”", "The slightly angry voice continued.", "“That’s not all. The revival of the World Tree? An alliance with the Federation? All is vain in the face of absolute power. Half of the Federation’s core army was annihilated when the Parasite Queen unleashed her aura just once.”", "“Hmm. It’s hard to believe, but I’ve heard that as well.”", "“If that’s what she is capable of when she hasn't completely descended, then when she recovers her full powers…”", "The fiery voice began to soften.", "“…Ever since that bastard from the Sung family switched sides, the possibility of her recovering her divinity has risen.”", "After a moment of silence, the voice continued calmly.", "“When that day comes, humanity is done for. They won’t even be able to hold out as the Federation did.”", "“Well… That’s true.”", "The man who had been listening quietly gave a chuckle.", "“If everything happens the way you think, then our current situation could certainly be described as a crisis.”", "He then continued.", "“…Only if everything goes as you say, that is.”", "“You make it sound like that won’t be the case.”", "“No, no, you misunderstand me. There’s nothing wrong with being vigilant. Only, isn’t it better to focus on what’s happening now than to worry about what hasn’t happened yet?”", "“What do you mean?”", "“I agree that the Parasites won’t leave humanity alone anymore. But that means they will now have to deal with two camps at once. That will certainly put a lot of pressure on them.”", "“Damn it! Don’t you think I know that already?”", "The frustrated voice exploded out.", "“Don’t you think you’re being too optimistic? Our victories up until now have been mere coincidences. Our goalkeeper miraculously managed to block the ball after our mindless defenders let every attacker slip past them.”", "“Huhu….”", "“From now on, humanity will be subject to many fierce attacks. Do you think we’ll be able to block them all? I assure you, the answer is no. And if we let the Parasites cross the goal line even just once, we’re done for.”", "‘If you can’t attack, you can’t score.’ Through this analogy, he pointed out that humanity was in no position to attack the Parasites.", "“Please calm down. I think you misunderstood me.”", "The elderly voice was still calm, as opposed to his partner’s.", "“I didn’t mean that we should resist the Parasites. What I’m trying to say is….”", "The wrinkles around his mouth deepened in the dark.", "“We should put ourselves in their shoes for a moment. You’re right. The Parasites will win if they can score just one goal, but they keep failing by a hair's breadth. Can you imagine how frustrated they must be?”", "“…”", "“Let’s think this way. So there they are, all frustrated and restless when suddenly a player from the opposing team scores an own goal. How would they feel about that player?”", "“…”", "“Perhaps we could use the current situation to our advantage. People never appreciate help when they’re thriving. It’s when they’re in a crisis that they truly appreciate a gesture of help.”", "“You say all the right things, but….”", "There was a sneering sound.", "“Do you not find yourself hypocritical? You say one thing and do another.”", "“There’s an Asian proverb that says, ‘first knock on the stone bridge before crossing it.’”", "The elderly voice remained calm regardless.", "“It’s my favorite proverb. I believe people my age can easily relate to it as I myself have experienced it. In many cases I thought the bridge looked as sturdy as it could be, only to find out later that it was defective.”", "“Ha. Have you ever heard of this saying? ‘Time is gold.’”", "“The enemy isn’t stupid.”", "Suddenly the aged voice grew stern.", "“It’s not that I haven’t looked into it. But the more I looked into it, the more confused I became. I know it’s been almost a year, but that’s not enough reason to move forward with our plan.”", "“So you’re saying you won’t do anything until all of your questions have been answered?”", "“Yes, and rightly so. Please recall that even the Parasite Queen couldn’t stop him, a mere human. A coincidence? A miracle? Perhaps. Even so, I won’t be able to rest until I know we have a countermeasure against this so-called miracle.”", "Only then did he let out a small sigh.", "“…We only have one chance.”", "After a moment of silence, the figure in the dark got up with a soft rustle.", "“There will be no second chances. We have to prove our worth on the first try.”", "Creak.", "With those words, the sound of a door opening was heard. Light flashed into the room before quickly disappearing.", "“Prove our worth on the first try… Could it be…?”", "The other figure seemed to have realized something and quickly left as well.", "The empty room became quiet again.", "Only the faint chirping of insects remained.", "*", "Seo Yuhui finally returned.", "She had to go back to Earth in the first place because her health was so poor that it deteriorated each second she spent in Paradise.", "As if to prove that wasn’t an excuse, Seo Yuhui’s face paled the moment she stepped out of the warp gate.", "She fell almost immediately and tumbled down the stairs.", "Seol Jihu, who had been waiting for her next to the warp gate, tried to approach her only to be beaten by the other members.", "Having experienced similar situations in the past, they moved quickly and efficiently.", "Kazuki carried Seo Yuhui on his back and the rest either scanned the surroundings or cleared the way to the recovery room.", "The recovery room was full of offerings that the members of Valhalla had collected for months.", "When Kazuki laid Seo Yuhui on the bed, Luxuria’s Priests who had gathered in advance of her arrival chanted their spells in unison.", "Whoosh!", "A huge lump of light soared from the pile of offerings and struck Seo Yuhui.", "To see about a dozen priests standing around the altar with their arms extended towards Seo Yuhui as the holy power extracted from the offerings showered down on her— the sight was almost magnificent.", "Seol Jihu stared into the room from the hallway with a nervous look.", "He couldn’t believe that such an enormous amount of holy power was tantamount to pouring only a few drops of oil on the dying embers.", "‘…Hmm?’", "Seol Jihu suddenly frowned.", "Why did he think Seo Yuhui was still a patient?", "He had most definitely given her Moirai’s Souvenir.", "But even after reminding himself of that fact, Seol Jihu still felt worried.", "Seo Yuhui’s fair skin seemed devoid of any life, making her look like she was dead.", "Twitch!", "The way her fingers trembled and her body arched in a spasm kept him on the edge of his seat.", "When blood began to drip from her nose and mouth, his anxiety reached its peak.", "‘Perhaps….’", "It finally occurred to him that Seo Yuhui’s life might really be at stake here.", "It was true that he had given her Moirai’s Souvenir, but he never witnessed her using it.", "If that were really the case, he couldn’t put his mind at ease.", "Because that would mean she was carrying out this plan of hers with her life on the line.", "Seol Jihu bit down on his teeth and clenched his fists.", "Meanwhile, Kim Hannah nodded her head while seeing Seol Jihu’s acting.", "‘He’s better than I thought.’", "His pleading eyes and uncomfortable gestures were all too natural.", "Kim Hannah fully believed Seol Jihu was acting given his relationship with Seo Yuhui and their previous conversation when he asked her to teach him how to act.", "Soon, by the time holy power was fully sucked out of all the offerings, Seo Yuhui’s treatment came to an end.", "The Priests all took a deep breath and left the recovery room.", "Seol Jihu stopped one Priest and asked him about Seo Yuhui’s condition.", "“Mm… Right now, Lady Seo Yuhui is kind of like a glass bottle with holes.”", "The male Priest said as he wiped off the sweat from his forehead.", "“You can think of the water inside the glass bottle as lifeforce. It should be holy power, but because she does not have any holy power left in her body, it is taking her lifeforce instead.”", "“Then…”", "“Thanks to all the offerings you brought, we managed to fill up the glass bottle with water… but because of the holes, the water is quickly leaking out even as we speak.”", "“….\"", "“What we can say for certain is that it will be impossible to fill up the holes until she pays off the holy power that she owes. The problem is that we have no way to estimate just how much more she needs…”", "The male Priest said dejectedly and sighed.", "He then bowed slightly and stepped away.", "Seol Jihu stood still for a long time before slowly stepping into the recovery room.", "Click.", "He closed the door and walked closer.", "Seo Yuhui had her eyes closed with a peaceful expression.", "Her disheveled silky hair and her picturesque figure were sprawled on the altar, and she looked weak and pure like a peach blossom that was about to fall.", "Seol Jihu knelt next to the altar and carefully grasped Seo Yuhui’s hand.", "He could feel the tenderness of her hand, but it was also frighteningly cold.", "Placing his hand on her ice-cold forehead, Seol Jihu slowly closed his eyes.", "*", "How much time went by?", "‘?’", "Seo Yuhui woke up, feeling that something was out of place.", "Her body was held tightly, but it felt rather safe. A gentle warmth was enveloping her body like the times when she was being hugged by her father as a child.", "Seo Yuhui’s eyelids slowly fluttered open, and her eyes immediately widened.", "The touch of slender yet robust muscles could be felt.", "Looking up stealthily, she saw a face that was deep asleep.", "It was the face she always dreamed of seeing.", "Now realizing that Seol Jihu was sleeping with her in his embrace, her nape quickly reddened.", "\"Jihu….\"", "She whispered his name, but there was no reply. He seemed to have fallen asleep while watching over her.", "'It’s warm…'", "Burying her face in Seol Jihu’s chest, Seo Yuhui’s expression soon turned strange.", "It felt good, but the feeling that something was out of place didn’t disappear.", "Thinking about it carefully, she figured out why.", "‘I like the change of pace, but…’", "Seo Yuhui placed her hands on Seol Jihu’s shoulders before smoothly pulling him down.", "‘I like this more.’", "Tightly hugging Seol Jihu’s head as it rested on her chest, Seo Yuhui smiled sweetly.", "“Jihu, my cutie~ Noona really, really wanted to see our Jihu~”", "While Seo Yuhui rubbed her cheek on Seol Jihu’s head and enjoyed the rising feeling of satisfaction, Seol Jihu rustled as if he was being suffocated.", "“H-Hmm?”", "What’s gotten into him?", "Seo Yuhui was bewildered.", "In the past, he would have blissfully smiled before digging his face into her chest.", "Now, it seemed like he was trying to distance himself from her.", "Just when she was about to feel sad, Seol Jihu’s eyes shot open.", "Seeing that Seo Yuhui was awake, he sprang up.", "Seo Yuhui also slowly raised herself into a sitting posture. The warm gazes of the man and woman met.", "It was a reunion after almost a full year.", "However, to Seol Jihu, it was like seeing her for the first time in 7 years. Seo Yuhui was also aware of this fact after hearing about it from Baek Haeju.", "\"…Noona….\"", "Seol Jihu called out in a hoarse voice with a blank face.", "\"…Yes….\"", "Seo Yuhui nodded while smiling and making an expression as if she understood everything.", "\"Noona…!\"", "\"Yes…!\"", "\"Noona!\"", "\"Yes!\"", "In the next moment, the man and woman emotionally wrapped themselves in each other’s embrace at the same time.", "They clung to each other like magnets and shared the joy of a touching reunion.", "\"I missed you, I really did.\"", "\"Me too, me too! I missed you so much that I bought and raised a white rabbit!”", "\"Huh? A white rabbit? What’s that about?”", "\"I don’t know. Anyways, are you fine? Your trials were hard, weren’t they?”", "Over ten minutes went by, but neither side even thought about pulling away.", "In fact, they clung onto each other even more.", "\"Kuhum….\"", "That was until they heard a dry cough.", "Seol Jihu and Seo Yuhui turned to the side simultaneously.", "An old man stood by the door, wearing a fancy Priest’s robe embroidered with golds. He was giving them an uncomfortable look.", "“…Excuse me. I knocked multiple times and spoke up, but there was no answer. It didn’t look like it would end any time soon, so…”", "Perhaps, they went a little too far.", "The man and woman slowly pulled away with reddened faces.", "The old man chuckled. It was a gentle smile that was reminiscent of Ian’s.", "“The two of you never cease to amaze me.”", "Seol Jihu’s eyes widened.", "The old man was talking like he had seen him before.", "The old man did a double-take.", "\"Ah, my apologies, I haven’t introduced myself yet. I’m Roberto Servillo. I serve Goddess Luxuria. Though I am still inexperienced, I am the acting bishop.”", "\"Ah, I’m…\"", "\"I know. Anyone in Paradise that doesn’t know Representative Seol would be a spy.”", "Roberto Servillo winked.", "“I know this is only our first meeting, but may I check up on Lady Seo Yuhui’s condition?”", "\"Of course. Rather, please do.”", "Seol Jihu immediately took a couple of steps back.", "“I disinfected my hands before coming, so please bear with me for just a moment.”", "Roberto Servillo said with a smile and then placed his palm on her back.", "After a few minutes, he pulled away with a sigh.", "\"How is she?\"", "Seol Jihu asked in a hurry.", "Roberto Servillo’s complexion darkened.", "\"…It’s not good.\"", "\"Pardon?\"", "\"The holy power we injected just a moment ago is already showing signs of running out. It’s leaking out even faster than before. Lady Seo Yuhui should know this better than anyone else.”", "Seo Yuhui didn’t say anything. She showed no change in emotion at all.", "\"I regret to say this, but at this rate…”", "Roberto Servillo smacked his lips before continuing quietly.", "“I believe it is best that she return to Earth this instant.\"", "The atmosphere in the room quickly died down.", "Seol Jihu was at a loss for what to do. He turned to Seo Yuhui and then lowered his head.", "\"Noona… I’m sorry. I tried my best, but…”", "Seo Yuhui showed a sorrowful expression without saying anything.", "Roberto Servillo rubbed his chin while looking back and forth between the speechless man and woman.", "“Hmm. If it’s alright with you, I would like to talk with Representative Seol for a bit.”", "\"With Jihu?\"", "Seo Yuhui blinked twice.", "Then…", "\"Yes. Don’t worry. It won’t take long. I simply need to have a word with—”", "\"Ah…!\"", "While Roberto Servillo was talking, she suddenly dropped her head and clutched onto her chest.", "\"Noona! Are you okay?”", "Seeing her in pain, Seol Jihu rushed toward her.", "As he held her in his arms with the old man behind him, Seo Yuhui slowly raised her lowered head.", "At that instant, Seol Jihu could clearly see.", "From Seo Yuhui’s pain-wrought face, her eyes furrowed and then smoothed out.", "Almost like she was blinking.", "[The day we meet again.]", "Twice while looking at Roberto Servillo.", "[When enemies are around us.]", "And then once while looking at him.", "[I will blink at you three times.]", "Seo Yuhui blinked her eyes three times."]}