{"cid": "413", "title": "Chapter 413. Omen (4)", "content": ["“The reason you are so confused is that many events are intertwined like spiderwebs.”", "It was true. A lot had happened in a short period of time.", "“The complexity of the situation suggests that many people are after you…. Anyway, the situation surrounding you can be classified into two categories.”", "Eun Yuri continued with her fingers still up.", "“The first category is Sinyoung. The assault incident has already been settled, and the incident on Earth has been concluded with the discovery of Jung Minjong’s body. But…”", "Eun Yuri cleared her throat.", "“It feels too hasty to assume that everything has been handled. I’m sure you’re wondering what role Yun Seohui played in the said events.”", "Eun Yuri pinpointed Seol Jihu’s innermost thoughts.", "Did Yun Seohui plan the assault? Did she really not know about it? Or did she know, but chose not to stop it? These questions lingered on Seol Jihu’s mind.", "If he had the ability to read minds, he would most definitely have read Yun Seohui’s.", "“I see why you and Hannah Unni forced Yun Seohui to resign. She’s impossible to read, so it’s safest to limit her influence as much as possible.”", "Seol Jihu nodded quietly.", "“Honestly, I don’t get Yun Seohui either.”", "Eun Yuri remarked, tilting her head slightly to one side.", "“She’s a mystery…. There’s one case I believe Yun Seohui could be the culprit, but for my assumption to be true, she has to have the mind of a 5-year-old….”", "Seol Jihu gave a light chuckle.", "“I wouldn’t have cared about Miss Yun Seohui in the first place if she were that young.”", "“Don’t you know? Sometimes kids can be scarier than adults.”", "Eun Yuri refuted and then lowered a finger.", "Children usually don’t have a sense of right or wrong as developed as adults do.", "Recalling the time when his brother threw his bike off the balcony of their third-floor apartment because he was ‘bored’, Seol Jihu gave a small nod of agreement.", "Then he shifted his gaze back to Eun Yuri.", "She still had one finger up.", "“The second category is the trial to become the Apostle of Gluttony. You completed your plan by bringing down Sinyoung but nonetheless failed to pass the trial. Because there still is a problem that hasn’t been dealt with. That’s what Gula-nim said, right?”", "“Well, yes….”", "Seol Jihu listened to her attentively before suddenly speaking up.", "“Why did you divide these events into two categories?”", "He asked, tilting his head.", "“I think we should group these two incidents together.”", "“You’re right, they do have something in common. These incidents both began with the Valhalla Assault Incident.”", "Eun Yuri nodded and then opened her eyes wide.", "“But technically, the assault was only the beginning of everything that followed. I think what happened after the incident should be regarded as two separate events.”", "“Why?”", "“Because….”", "Eun Yuri’s voice thinned, and after a moment of silence, she shrugged her shoulders.", "“I think that’s what Gula-nim was hinting at.”", "Seol Jihu looked more confused.", "Eun Yuri stared at him with her signature nonchalant eyes and gave a mysterious smile.", "“You’re an engineering major, right?”", "“Yes.”", "“I think sometimes you just think too hard. When you solve a problem, you expect each step to be logical and precise, like math.”", "Eun Yuri let out a muffled laughter and slowly got up.", "“I don’t mean it’s bad, but…. I’m not exactly at the age to be giving life advice to others, but in my experience, sometimes illogical and abnormal events happen in life. Especially when it comes to feelings and words.”", "She walked lightly past the desk and arrived next to Seol Jihu.", "Eun Yuri stared down at Seol Jihu as he stared up at her.", "The two stared at each other for a while before Eun Yuri gave a small sigh and rushed at Seol Jihu, wriggling her hips into the chair that he was sitting in.", "“M-Miss Eun Yuri?”", "“Come on, scooch over…. Alright.”", "Eun Yuri successfully took over half of the chair and smiled triumphantly.", "Then she grabbed a piece of paper on the desk and picked up a pen.", "“I’ll try to simplify it for you, Mr. Engineer.”", "She pulled the paper close and her hand began to move.", "She wrote the words ‘Sinyoung’ and ‘Trial’ across the white paper in elegant handwriting.", "“Gula-nim’s words were about the trial.”", "Eun Yuri tapped the word ‘Trial’ with the tip of her pen and drew an equals sign (=) next to it.", "“Lead humanity’s change. Humanity still bears a grave problem, and because of that, the change is not complete…. Okay, so let’s first define what humanity is. Who does humanity include in Paradise?”", "Eun Yuri spoke like a teacher addressing a class.", "Seol Jihu answered almost immediately.", "“Earthlings.”", "“That’s right, Earthlings are one of them. And the other?”", "“The other? The other… Paradisians?”", "“Correct. Which means….”", "Eun Yuri paused and wrote down the words ‘Paradisians’ and ‘Earthlings’ next to the equals sign.", "“To lead humanity’s change means to lead both the Paradisians’ and Earthlings’ change. Next….”", "Eun Yuri continued.", "“From here on out, I’ll approach the problem with reverse calculation and the process of elimination.”", "“Reverse calculation?”", "“It’s not hard. It’s actually very simple. It’s what we do when we solve critical reading problems. When we don’t know what the answer is just by reading the passage, we start by eliminating the least likely answer from the choices we’re given.”", "Eun Yuri spun the pen once in her hand and then started writing again.", "—Humanity = Paradisians and Earthlings.", "—The reason why the trial isn’t complete = Because humanity’s change isn’t complete.", "—The reason why humanity’s change isn’t complete = Because humanity has a serious problem.", "Eun Yuri placed parentheses around the word ‘humanity’ in the last sentence.", "“What happens if you replace this word with the one defined earlier?”", "“Because Paradisians and Earthlings have a serious problem…. Ah.”", "Seol Jihu suddenly came to a revelation.", "Eun Yuri smiled softly.", "“Didn’t Gula-nim say something else?”", "“Those who have changed are only a fraction of the total….”", "“I acknowledge that you have forcefully changed Earthlings to some extent.”", "Eun Yuri finished his sentence and drew a diagonal line over the word ‘Earthlings’.", "All that was left now was ‘Paradisians’.", "“This is where Gula-nim gave you an important hint.”", "Eun Yuri turned her head to Seol Jihu.", "“You were close in terms of physical distance.”", "“…”", "“Which Paradisians have you talked to in the last few months?”", "“…”", "“Charlotte Aria, Sorg Kühne, Roe Scheherazade, and the attendant who came to see us just before we left Scheherazade…. That’s not that many. Do you think Charlotte and the royal administrator are traitors?”", "Seol Jihu shook his head.", "“That leaves us with two people. Roe Scheherazade and her attendant.”", "Eun Yuri jabbed the word ‘Paradisians’ with her pen point and finished her explanation.", "The End.", "Eun Yuri came up with a solution so easily to the problem Seol Jihu had spent days trying to solve.", "Seol Jihu stared down at the paper.", "It wasn’t like he had nothing to say.", "“Miss Eun Yuri. But—”", "“I know what you’re thinking.”", "Eun Yuri interrupted him as if she already knew what he was about to say.", "“‘To some extent’ means ‘not entirely’. So why did she take Earthlings out of the equation so hastily? And, about the Paradisians, we don’t know the exact range of the ‘physical distance’, so why?”", "‘Right?’ Eun Yuri threw a glance at him.", "Seol Jihu closed his mouth.", "“And this is my answer to your question. You’re right, Earthlings may not have changed completely. The contract is only the start, after all.”", "“But, to be precise, Earthlings’ change is still a work in progress. Just like how Sinyoung is in the process of fulfilling its commitments.”", "Basically, she was saying that the success of the plan would have to be judged later because the results had not yet come out.", "“And about the physical distance. You’re right again. We don’t know the exact range. So let’s assume that a random civilian you’ve passed on the street is in fact a traitor.”", "“What can that civilian even do? I don’t think the Parasite Queen would coax a human who has absolutely no influence in Paradise unless she’s gone nuts.”", "“And the word ‘close’ means a short distance away. Isn’t Scheherazade, besides Eva, the only city you’ve recently visited?”", "She was right. According to the records Ian wrote, the Parasite Queen only showed interest in humans who could be useful to her, and of all the Paradisians Seol Jihu recently came in contact with, only a few met that standard.", "Eun Yuri let out a small sigh.", "“Like I said… sometimes you think too hard.”", "“I understand why. Our enemies are strong, so you have trained yourself to consider all possibilities and prepare in advance.”", "“But I think you should think intuitively this time.”", "Because….", "“Gula-nim and you are linked by a strong trust.”", "Protecting the world from the Parasite Queen was the duty of the Seven Sins.", "If they were to fail in their mission, they would undoubtedly get devoured like the Seven Virtues.", "Because their own existence was at stake, they had every reason to help Seol Jihu fight the Parasite Queen.", "“One thing I learned while studying magic under Teacher is that words have mystical powers.”", "Eun Yuri stared calmly at Seol Jihu.", "“A soft answer turns away wrath. Sometimes the same word changes meaning depending on the context. You say one thing, and others will interpret it in hundreds of different ways.”", "For example, ‘take responsibility’ could be interpreted in many ways. It could be a marriage proposal, a reminder to fulfill one’s duty, or something entirely different.", "“I’m sure that not only Gula-nim but also the rest of the Seven Sins are eagerly waiting for you to pass the trial.”", "“So isn’t it likely that she gave you a hint, hoping you would notice while avoiding affecting the law of causality as much as possible?”", "Seol Jihu closed his eyes in deep thought.", "Eun Yuri stared at him for a while before carefully speaking.", "“And, more importantly…. Did you not feel it?”", "“?”", "“When we were leaving Scheherazade. I had a bad feeling then….”", "Seol Jihu flinched.", "He remembered it as well.", "On their way back, he felt nervous for no particular reason and uncomfortable even after he returned.", "Like something bad was about to happen in Scheherazade.", "Who knew Eun Yuri, who had an aptitude for ESP, felt the same way?", "“At the time I thought I was just imagining things, but talking to you reminded me how I felt that day….”", "Seol Jihu became more and more convinced that Eun Yuri was right.", "“Anyway, I won’t say I’m right. But I think it’s worth giving it a shot.”", "“…”", "“While trying, you may come across new clues, and even if that’s not the case, it’ll definitely narrow down the possibilities.”", "At this point, Seol Jihu could no longer find a reason to dispute.", "The fact was that he felt Eun Yuri was right.", "In retrospect, it wasn’t just the fact that his Innate Ability didn’t work on her that was strange about Roe Scheherazade.", "[Are you… not going to destroy Sinyoung?]", "[It must have been that child… Even though we’ve been close friends since we were kids….]", "[It’s not just the Earthlings.]", "What she said….", "He thought she was referring to the attendant who betrayed her, but….", "After sorting out his thoughts, Seol Jihu slowly opened his eyes.", "The view had opened out before him.", "It was a great choice for him to talk to Eun Yuri.", "She didn’t say the answer, but she taught him the direction in which to move forward from where he was stagnant.", "Seol Jihu spoke with a nod.", "“I understand what you’re trying to say. We’ll have to investigate Roe Scheherazade and her attendant first.”", "“That won’t be hard. All you have to do is leave a trace of Teacher’s mana on them. Your flirting skills will make it easy.”", "Eun Yuri smiled, and….", "“Or… if you’re still worried, we could narrow down the suspects further.”", "She said in a secretive voice.", "Seol Jihu’s eyes opened wide.", "“How?”", "“Through variables.”", "“Variables?”", "“You know, like a calculator that can calculate an extremely complex mathematical problem in the blink of an eye.”", "“I didn’t know I had something like that.”", "Seol Jihu tilted his head in question.", "“Of course you do. But its effect will vary depending on how you use it…?”", "Eun Yuri suddenly paused and turned her gaze to the door.", "Seol Jihu did the same.", "Thumping footsteps echoed from the hallway and the door burst open.", "“Hey, you here?”", "The person who had come into his office was none other than Chohong.", "She glanced about the office and stopped when she saw the pair of man and woman glued to each other in the same chair.", "“…Were you guys having fun?”", "She asked, slowly lifting one of her eyebrows.", "“No. Not at all.”", "“No. Not at all.”", "The pair denied simultaneously and looked at each other.", "Chohong snorted.", "“Like hell, you’re not. Since when did you two become an item? I thought you didn’t like it small?”", "Small?", "Eun Yuri blinked in confusion and suddenly flinched.", "Then she quickly covered her chest with her arms and glared at Chohong.", "“What’s going on? You didn’t even knock.”", "“Ah, it’s just that you have some guests.”", "Chohong gestured behind her with her thumb.", "“Guests?”", "“Yeah. Miss Foxy has them now. I tried to wait until you were done here, but you were taking way too long. She asked me to tell you to come quickly if you aren’t too busy.”", "Guests, at this time of the year?", "‘Who are they?’", "Curious, Seol Jihu turned to Eun Yuri.", "But of course, Eun Yuri didn’t know any better.", "“Anyway, if you’re not busy, you should go greet them. I’m sorry to interrupt, but you can have sex anytime.”", "Chohong remarked bluntly when she saw the pair exchange a look.", "Seol Jihu and Eun Yuri quickly jumped out of the chair and pulled away from each other in opposite directions.", "*", "He was told that Kim Hannah took the guests to the cafeteria on the 10th floor.", "She seemed to have treated them to a meal while he was talking to Eun Yuri.", "He didn't have a clue as to who these guests might be, so he asked Chohong about them only to be given an unsatisfactory answer.", "“I don’t know.”", "“What?”", "“Don’t ask me. I ran into them by sheer coincidence when I went to the cafeteria to eat. Miss Foxy saw me, and she asked me to bring you immediately.”", "Chohong said a slightly discontented voice.", "This would mean that Kim Hannah decided it was best to keep the guests’ visits secret.", "Seol Jihu quickly climbed the stairs, and as he arrived at the cafeteria, his eyes widened.", "He saw Kim Hannah waiting for him, leaning against the wall, Seo Yuhui walking out of the kitchen with a tray in her hand, and two shabby-looking men sitting at a table hurriedly pushing a spoonful of the rice soup into their mouths.", "“There’s more. Eat up.”", "“T-Thank you.”", "Seo Yuhui handed them an extra bowl of rice and soup, and one of them took the bowl with both hands and put it on the table.", "The speed at which they were eating was incredibly fast like they’d been starving for days.", "‘I feel like I’ve seen them somewhere before….’", "He watched the two men eat when suddenly one of them took off his hood, which had covered most of his face because it got in the way of him eating.", "The man stuffed rice into his mouth to the point where one of his cheeks bulged out, grabbed radish kimchi by hand, and took a big bite.", "Seol Jihu’s eyes widened.", "“Ah.”", "The man heard that sound and stopped.", "He turned to Seol Jihu, standing near the entrance of the cafeteria, and stood up from his seat with a hiccup.", "“Y-You’re here….”", "Stuttering, he quickly tapped his friend, who was still busy shoveling food into his mouth.", "“Huh? Those guys….”", "Chohong also remembered them.", "“Aren’t you those bastards from before? Are you crazy? Who do you think you are, showing up here like nothing happened?”", "She rolled up her sleeves and was about to jump at them but suddenly stopped.", "Seol Jihu was pulling her arm.", "His grip was so strong that her arm was almost sore.", "“Ow…! Hey, hey! I get it! I’ll stop. I….”", "Chohong grumbled and Seol Jihu loosened his grip.", "He turned his eyes to the two men as they carefully rose from their seats.", "When their eyes met, the two lowered their heads in a hurry.", "“It’s been a while.”", "Seol Jihu spoke quietly.", "“Mister Pavlovici. Am I correct?”", "“Y-yes, yes.”", "The guests were none other than the Pavlovici brothers who had picked a fight with Seol Jihu at a pub in Haramark.", "There were four of them back then, but now there were only two.", "“This is a surprise. I didn’t know you’d come.”", "“Back then….”", "Pavlovici wiped his mouth with his sleeve and swallowed what was in his mouth.", "Then he continued.", "“I made a promise to you, the Representative of Carpe Diem. I mean—Valhalla.”", "He spoke carefully, surveying the look on Seol Jihu’s face.", "“I’m here to keep that promise.”", "Seol Jihu’s eyes slowly scanned the man, who clearly seemed nervous.", "Pavlovici’s promise.", "[Pwease… hwep us….]", "[We arr sowwy. We’ll do ash you shay. Pwease hwep us…!]", "[Pwease! We’ll pway back thish debt bwig!]", "Please, we’ll pay back this debt big.", "“…I spared your lives back then.”", "Seol Jihu spoke, stroking his chin.", "“If you’ve come to keep your word… does that mean you’ve come to save my life?”", "Pavlovici hesitated briefly before shaking his head.", "“Honestly… I don’t know if this has anything to do with your life.”", "And then….", "“However.”", "With a serious expression….", "“I’ve brought you the news that’s just as big.”", "He spoke in a careful yet confident voice.", "Seol Jihu raised his chin and took a quick breath.", "He turned his gaze to Eun Yuri, who had followed him to the cafeteria.", "A variable had occurred.", "A variable that he did not expect and the enemy could not have known either.", "A variable that, as she said, could shorten the process of reaching the answer."]}