{"cid": "235", "title": "Chapter 235. Follow Me, I’ll Carry You (2)", "content": ["“We’ll set out around dinner time. I told him I wanted to meet him privately, but you can just follow me.”", "“I can?”", "“There’s no other choice. It’s best to limit information as much as possible until we meet him. He’s a sly one, that guy.”", "Considering that this was coming from Kim Hannah, Seol Jihu immediately had a high opinion of him.", "“Anyway, this is a good opportunity for us to recruit a Priest… Do you have anyone in mind?”", "Someone immediately popped into his head.", "“Miss Maria.”", "“I thought you’d say that. Wait then. Let’s cast a net before we go to Eva.”", "‘A net?’", "Kim Hannah disappeared into her room once again.", "This time, Seol Jihu followed her.", "When he entered, he saw Kim Hannah trying to call someone with a communication crystal she took out from her handbag.", "Soon, a light flashed.", "—Oh? Now, who is this!?", "Maria’s chattering voice burst out.", "—The bitch who got chased out of Sinyoung like a defeated dog!?", "“You wanna die?”", "When Kim Hannah growled fiercely, Maria paused.", "—Sorry…", "“Never mind.”", "Kim Hannah glared at the crystal and spoke in a bored tone.", "“Run over to Carpe Diem’s office, pronto.”", "—What? Is that where you are now, Unni?", "“I’ll give you 10 minutes.”", "Kim Hannah hung up after delivering a very one-sided message.", "Was Seol Jihu mistaken in thinking he heard a loud ‘Fuck!’ before the call ended?", "*", "After summoning Maria…", "“Do you want to enter our team?”", "Kim Hannah cut straight to the chase before Maria could even sit.", "Maria, whose butt was just about to touch the couch, paused awkwardly. She didn’t say anything out loud, but her face was quite clearly saying, ‘What kind of dogshit bullcrap are you spouting?’", "“Relax your face, hun.”", "Maria instantly fixed her expression at Kim Hannah’s warning, but she still maintained a suspicious look.", "“What are you saying out of the blue? It’s the middle of the day and you’re already drunk, Unni? Is it because you needed alcohol to wallow in your sorrows?”", "“My mind is crystal clear, so just answer my question.”", "“Uhm, can you at least explain the situation…”", "“Carpe Diem is going to move to Eva soon to become an organization. We want a Priest. There, end of explanation.”", "Kim Hannah fired out word after word before resting her chin on the back of her hand.", "“Your answer is?”", "“Organizatioooon? Carpe Diem is leaving Haramark?”", "Maria reacted a moment later with a completely gobsmacked face.", "Soon, she nodded her head reluctantly.", "“True… Carpe Diem does have many High Rankers and a ton of money…”", "“I didn’t call you over to hear your comments. If I ask you again, you know it will be the third time, right?”", "Maria let out a shrill Hiiik! before shrinking back.", "“I’m sorry… please spare me… anything but my money….”", "She even began to rub her hands together and plead.", "Just what had happened between them for Maria to shake like a mouse in front of a cat? Especially when not even Agnes fazed Maria’s spirit!", "While Seol Jihu was wondering, Maria barely managed to snap out of her terror. Twirling a strand of her hair with her index finger, she mumbled quietly.", "“You already know, Unni. I don’t like being affiliated with a group. Plus…”", "“I know, I know. Just say yes or no.”", "Maria glanced at Seol Jihu before answering.", "“…No.”", "“Okay, we understand. You can go now.”", "Kim Hannah shooed Maria away as if she was being annoying.", "Maria’s eyes widened. Judging from her expression, she seemed to be thinking, ‘She’s letting me go this easily?’", "“I-I can go? Really?”", "“Jeez, do you think I’m going to butcher you or something?”", "“Fuck, if you have any conscience, you shouldn’t say… o-okay. I’ll leave. I’ll leave, alright?”", "Maria hastily got up from the couch.", "“If you want, I can introduce someone to you.”", "“No thanks. Recruiting someone you recommend will only end up biting us in the ass. It’s fine, so close the door behind you as you leave.”", "Maria stole furtive glances at Kim Hannah while darting out of the office.", "As the door half-closed behind her…", "“Ah, Jihu.”", "Kim Hannah suddenly spoke.", "“The expedition that you recently went on. I need to ask you something about the inheritance of the ghost inside the pendant.”", "“The Rothschear House’s inheritance?”", "“Yeah. You said there are a few more of them, right?”", "Seol Jihu readily acknowledged it.", "“Yeah, we found the Rothschear’s secret techniques last time. Including the offerings, account book, fortune, and place that Flone wasn’t sure about, there are four left.”", "“Oh~ They’re separated by category?”", "Kim Hannah exclaimed with a slightly loud voice.", "“So you’re saying the inheritance you got this time is only the tip of the iceberg?”", "“That’s what I’ve been told…”", "Seol Jihu gave Kim Hannah a strange look. Why was she asking him all these questions all of a sudden?", "‘Ah.’", "Looking back at the front door just in case, Seol Jihu was immediately taken aback.", "The door wasn’t fully closed. It looked like it was, but upon closer inspection, it was still open by a small gap.", "Rough breathing that could be heard behind it was the cherry on top.", "It didn’t take a genius to figure out who was behind the door, especially with a few strands of blonde hair peeking out.", "“Iya~ Just hearing it makes me itch with anticipation. For our next expedition, we should definitely go to the site with Rothschear’s fortune. We’re in need of money to build this organization, anyway… Ah, where is this chilly air coming from? Why is it cold all of a sudden?”", "With that, Kim Hannah raised her right hand and held up the index, middle, and ring fingers.", "3, 2, 1… she began to fold them one by one as if to count down.", "The moment her last finger went down…", "Tatatata!", "Small footsteps rang out, imitating the sound of someone climbing up the stairs, and then the door burst open.", "Seol Jihu could clearly see at that moment — Kim Hannah snorting before looking back with a ‘surprised’ face.", "“What? Why are you back?”", "Kim Hannah asked nonchalantly.", "“Haa… haa… I left something here by mistake.”", "Maria collected her breath while panting.", "“You left something? What exactly?”", "“Uh… right… w-what was it again?”", "Looking left and right with a serious expression, she paced around the room meaninglessly.", "“What was it again? I think I dropped it somewhere around here…”", "She scrunched her long slender eyebrows, kneeled down, and began to look more carefully.", "“Just tell me. If it isn’t important, just go. I’ll look for it later.”", "“I could never. It’s super expensive.”", "She didn’t even remember what she lost but said it was expensive.", "Seol Jihu, who was staring at Maria with a dumbfounded expression, cleared his throat seeing Kim Hannah gesture at him with her chin.", "She was signaling him to keep talking.", "“Yeah, I agree. The account book is buried in the Empire, so we can’t get our hands on it, but the fortune is—”", "“Hey, hey!”", "Kim Hannah freaked out and cut him off.", "“Are you mad? Why would you say that here?”", "‘You’re the one who made me.’", "Seol Jihu chuckled inwardly.", "Suddenly curious, he looked back at Maria. As expected, she had stopped searching for her nonexistent belonging and was straining her ears, obviously trying to listen in.", "Soon, she stealthily turned her head sideways and made a devious face.", "“What are you talking about?”", "Kim Hannah shooed her away.", "“It’s nothing an outsider should know.”", "“Aii, outsider?”", "Maria crawled toward them before squeezing herself in between Kim Hannah and Seol Jihu. Looking back and forth between the two, she babbled on.", "“Unni, Oppa, are you going to leave me out like this? Are you really going to make me sad?”", "“Screw off.”", "“Don’t be like that~ Don’t you know that I’m practically a part-time member of this team? What is it~ What expedition are you talking about~”", "With Maria asking so persistently, Kim Hannah slicked back her bangs and sighed.", "“It’s nothing. We have no way of being sure whether it’s really there. And even if it is, the available loot probably won’t even reach a quarter of the Pagoda of Dreams’ result.”", "One of Maria’s eyebrows perked up. Suspicion was plastered all over her face.", "It was then.", "[No!]", "Flone suddenly shot out of Seol Jihu’s pendant.", "“Fwucuwckck!”", "The startled Maria fumbled down while squealing like a pig. But Flone completely ignored her plight and shouted.", "[We told you it was there! You might not know because you didn’t go, but other people saw it!]", "Hearing this voice, Kim Hannah was greatly taken aback.", "“Miss Flone, I’m not saying I don’t trust you.”", "She glanced at Maria and tried to stop Flone, but the latter continued.", "[And what? It probably won’t even reach a quarter? That’s wrong too! There’s a mountain of fortune there! Are you looking down on the Empire’s duke family, the Rothschears?]", "At that moment, a light flickered past Maria’s eyes.", "“Ah…”", "Kim Hannah pressed her forehead with a frustrated groan.", "“…Oi.”", "When she lowered her voice, Maria quickly shot up.", "Kim Hannah spoke with a chilling gaze.", "“I’m warning you. If you say even a peep about this expedition…”", "“Who do you think I am!?”", "Maria jumped.", "“Did you find what you were looking for?”", "“Huh? Oh, uh, yeah.”", "“Then leave.”", "“Okay, okay, I’ll leave. But…”", "Maria stole a glance at the sulking Flone, then spoke as carefully as possible to avoid incurring Kim Hannah’s wrath.", "“Unni, can you include me in that expedition?”", "Kim Hannah immediately glared at her.", "“Are you kidding? We’re preparing to register as an organization, so we have heaps of things we need to spend money on, and we’re busy taking care of our own members. Why would we do that for you, an outsider?”", "“Don’t you need a Priest?”", "“We do, but we’ll only take an insider to the expedition.”", "“I just need to become an insider then.”", "“What?”", "Kim Hannah was certainly an expert. She didn’t bite right away and scoffed instead.", "“Didn’t you say no before?”", "“When did I say no!?”", "Maria surprisingly yelled.", "“What I said was, um, to give me more time because it was so sudden. Yeah~ That’s what I meant!”", "She waved her hand around and delivered a passionate speech.", "A nose ring if hung on the nose, an earring if hung on the ear.", "Seol Jihu was quite impressed by Maria’s skill at changing her words.", "Kim Hannah still looked annoyed. To be more precise, her face seemed to be saying, ‘Even if it’s not you, we can find ourselves a good Priest.’", "“So what, you’re joining?”", "“No— jeez, why is everyone in such a rush?”", "Maria cleared her throat.", "“Um… you got a contract…?”", "Kim Hannah muttered, “Obviously,” while reaching into her handbag.", "After reading the contract, Maria’s face scrunched up.", "“Four years? What about a three month one? Six months? Or even a year?”", "“This bitch, is she out of her mind?”", "Kim Hannah spat out angrily before striking down Maria’s complaint.", "“You must have gone mad. We’re taking you on expeditions of such scale. And here you’re trying to milk us dry and then bail on us in a few months?”", "“But four years is still a little too much…”", "“Shut it. Jihu never set proper conditions because he’s a pushover. As long as I’m here, I won’t sit still and watch him piss his pants.”", "Kim Hannah spoke flatly and held her chin up.", "“A man can lead a horse to water, but can’t make it drink. If you don’t want to, then don’t.”", "Maria bit her lower lip, unable to say anything.", "She looked reluctant but still put the contract away.", "“When are you leaving Haramark?”", "“Soon. We’re going to Eva today to check out available land.”", "That meant Carpe Diem had already passed Eva’s screening process.", "Maria smacked her lips for a long time.", "“…Okay…”", "In the end, she turned around with a plainly visible internal conflict before leaving through the door.", "She seemed to have left this time for real.", "“Heh.”", "[Heh.]", "Kim Hannah and Flone smirked while watching the front door.", "‘Heh?’", "He understood why Kim Hannah was smirking, but why Flone?", "Soon, the two women looked at each other and smiled.", "Kim Hannah put her palm out first.", "“Good.”", "[Yeaaah!]", "Clap! Flone and Kim Hannah high-fived.", "“You really know how to spice up the situation, huh. I’m impressed.”", "[Hmph, I may look like this now, but back when I was alive, I reigned over the noble social circle, which raged with invisible cannonballs and inaudible bullets. Don’t underestimate me.]", "From the sound of it, Flone must have been intrigued by Kim Hannah’s scheme and had given her a hand.", "Seol Jihu scratched his head.", "“You really think Miss Maria will fall for it?”", "“If it were in the past, it wouldn’t have worked in the slightest. But she just tasted a large sum of money, thanks to you. How could she not follow you?”", "[Ufufufu, her mind is probably telling her ‘no’, but her body should be more honest.]", "“Hah! Now that’s a way to put it!”", "Hoho! Haha!", "Seeing the two cackling women, Seol Jihu began to feel bad for Maria.", "“We cast the net, so all we have to do now is wait. Alright, let’s go to Eva. Follow me.”", "Kim Hannah led the way, merrily trudging toward the front door.", "Seol Jihu hurriedly chased after her.", "“Hannahemon…!”", "“Ah, jeez!”", "*", "Kim Hannah and Seol Jihu left by a carriage that day and arrived in Eva a few days later. Kim Hannah guided Seol Jihu skillfully as if she had been here several times before.", "Their destination was a good-looking building on Eva’s main street.", "It was the headquarters of Eastern Spring Merchants, one of Eva’s organizations.", "Led inside and guided to a room, they were met with a potbellied man putting on an air of importance.", "He looked at Kim Hannah and gave a coarse smile.", "“Iya~ You live and learn. Who knew Miss Foxy of all people would contact me fir…st?”", "He spoke in an arrogant tone, but blinked his eyes in confusion seeing the young man walking in along with her.", "It was the same for Seol Jihu. He carefully examined the surprised man before saying.", "“Ah, you’re from…!”", "If he was remembering correctly, this man was the leader of the poachers whom the team met during their last expedition.", "The leader also recognized Seol Jihu, and his jaw dropped to the floor.", "“Heuk!”"]}