{"cid": "415", "title": "Chapter 415. Omen (6)", "content": ["The Parasite Queen Expulsion Plan.", "Seo Yuhui thought it was feasible when she first heard about the plan from Sung Shihyun.", "The Parasite Queen had taken along five of the seven Armies to attack Tigol Fortress.", "Furthermore, the remaining two armies were nowhere to be found in the Middle World.", "While it was highly optimistic, she thought that sneaking into the empty Empire to find the Imperial Oath was doable.", "However, the idea shattered into pieces as soon as they entered the Parasites’ territory.", "Searching the Queen’s residential area out of all the Parasites’ territory was a far more difficult task than they had imagined.", "They felt like their energy was being sapped just by walking. It could be said that the very soil they stepped on was their enemy.", "Furthermore, they had no idea how enemies kept appearing everywhere they went despite them trying their hardest to conceal their presence.", "When they met an Army Commander that they thought was absent from the Middle World, they thought it was over.", "If it wasn’t for Sung Shihyun’s trick successfully deceiving Exploding Patience, they definitely would have been wiped out.", "While there were many dangerous moments where their hearts almost burst out of their chests, the expedition team of the most elite Earthlings somehow arrived at their destination.", "That was how they found the Imperial Oath that they desperately looked for and inherited the rightful authority over it after awakening the remnant will of the Chief Deity.", "And at that moment, they activated the Imperial Oath.", "With this, their mission was complete.", "\"…Is it over?\"", "A young man who nocked a chained arrow to his bow muttered in a weak voice.", "He listlessly stared at the three stele pieces that had combined into one and were now blazing with white light.", "It was the Star of Pride, Sergio Carrillo.", "The Parasite Queen, whose name was practically synonymous with terror, had been driven out of Paradise as of this moment.", "It was only natural for him to doubt as he knew just how powerful the Parasite Queen was as a being, with powers dimensions apart from them.", "\"Now it’s really…”", "\"Shut the fuck up, moron.”", "Just as he was about to confirm again, a temperamental voice cut him off.", "Sergio Carrillo’s face twitched.", "\"What?\"", "\"You crazy bastard. How dare you set a death flag? Are you trying to kill us all?”", "Sung Shihyun spat as he sat on the floor of the stone chamber, catching his breath.", "Sergio Carrillo frowned.", "\"What bullshit is this all of a sudden?”", "\"Do you want to fucking die? It’s not over yet so don’t go thoughtlessly running your fucking mouth.”", "\"Now, now, why are you two fighting again? It’s a good day today.”", "As the atmosphere between the two became rough, a burly man with wounds all over his body stepped up as if it was a normal occurrence.", "It was the Star of Wrath, Wu Lei.", "Sergio Carrillo snorted and turned his head.", "\"We’ll have to wait to find out if today will be a good day or not.”", "Sung Shihyun also let out a snort.", "\"Then let’s confirm it.”", "A tired voice intervened.", "A pale-faced Sergio Carrillo took out a communication crystal from his pocket.", "\"The Federation should still be at war with the Parasites. The royal family of Haramark should be reachable.”", "\"Why bother. Just ask the stele over there.”", "Sung Shihyun raised himself up and stopped his steps in front of the shining stele.", "\"Old Man Chief Deity. Are you still there? You are, right?”", "Then uncharacteristically looking slightly nervous, he took a deep breath before asking.", "\"The oath, it’s properly been activated, right? Right?”", "All eyes were focused on the stele.", "After a minute that seemed like ten…", "[Yes, the oath has been activated.]", "A grand voice rang within the stone chamber.", "Sung Shihyun, who had been intently staring at the stele, widened his eyes.", "A smile finally appeared on his face.", "\"Euha, hahahaha! Hear that? I told you it was a good day!”", "Wu Lei also burst into laughter.", "Philip Muller, who was sitting on the wall striking a sorry figure, quietly let out a relieved sigh.", "\"Good! Did you hear that? Yuhui? Haeju?”", "Sung Shihyun clenched his fist.", "\"Kyah! Old Man Chief Deity, so you ended up being of some help in the end, huh?”", "[Euk!?]", "“I’ve been cussing you out all this time, wondering how much of a retard you must have been to get eaten by the Parasite Queen…. I’m sorry. I apologize.”", "It was then. Just as he was just about to grasp the stele with a smiling face…", "Kwaaaaah!", "Intense darkness suddenly poured out from within the stele.", "The darkness quickly devoured the light, and Sung Shihyun fell backward with a scream.", "\"Aaack!\"", "As he rolled on the floor, grabbing his hand with which he had tried to grab the stele, Seo Yuhui swiftly unleashed holy power.", "\"What happened?”", "Baek Haeju shouted.", "However, no one could open their mouths to respond as everyone was equally shocked.", "[The Goddess of Parasitism…!]", "After a brief pause, a hurried voice came out of the stele.", "[She found the location of the oath…!]", "[My power…! How could she have already…!]", "After barely calming down, Sung Shihyun opened his eyes.", "\"What are you saying all of a sudden? You said the oath was activated!”", "[She’s taking over my consciousness. I’ll soon be…!]", "The Chief Deity’s voice began to fade.", "Sensing that things were going awry, Sung Shihyun braced his sword.", "Drawing out a white sword qi, he fiercely swung his sword at the stele veiled in darkness.", "Tekang!", "However, the stele did not budge.", "Rather, the sword qi rapidly disappeared as soon as it came into contact with the darkness, leaving behind only a meaningless metallic ring.", "\"Fuck…!\"", "Sung Shihyun cursed, and as he was about to slash out with an even powerful sword qi, he suddenly hesitated.", "\"…Wait a moment. Since I inherited the authority… If I destroy the stele with my own hands, will the oath be nulled…?”", "Sung Shihyun blankly blinked his eyes before his expression gradually distorted.", "No matter how he looked at it, it wasn’t a good choice.", "In the unlikely event that the oath did get nulled, then he would have made a fool out of himself, not to mention that the stele didn’t even get scratched after receiving his fully-powered swing.", "\"Damn it, just what’s going on?”", "Sung Shihyun yelled.", "\"Old Man Chief Deity! What the hell happened?\"", "[Run…! Parasites…! This way…!]", "However, only unintelligible phrases were heard from the stele.", "[The Goddess of Parasitism… must never… regain the stele…!]", "\"W-What? What are you saying?”", "[Hide the stele…! So it can’t be found…!]", "The voice became fainter.", "[In a place that can suppress this darkness…!]", "After squeezing out the last sentence, the voice suddenly stopped.", "The light on the stele blinked out at the same time.", "\"…Old Man Chief Deity?\"", "Sung Shihyun called out many times, but the Chief Deity’s voice could no longer be heard.", "Only the stele with darkness dancing on top of it, as if signaling its location, was left.", "Before long, the stele split into three pieces again with a loud crack before falling on the floor.", "\"Damn it!\"", "Sung Shihyun threw his pure white sword on the ground.", "His face that had been full of happiness was now replaced with despair.", "\"This shitty Chief Deity! He can’t do anything right! I should have known from the start! This fucking son of a bitch!”", "\"….\"", "\"And the Parasite Queen, that goddamn bitch! Isn’t it common sense for her to fuck off after all this?”", "While the angry Sung Shihyun shouted into the void, Sergio Carrillo tightly gripped the communication crystal.", "\"…The Parasites are retreating.”", "\"They say that the Parasite Queen who was at the forefront of the battlefield suddenly vomited blood and collapsed.”", "Hearing those words, Sung Shihyun stopped yelling.", "\"You mean, the oath wasn’t completely ineffective then?”", "\"It looks to be the case. She wouldn’t have suddenly collapsed otherwise.”", "Sergio Carrillo let out a deep sigh.", "\"Also, the Parasites are retreating back to the Empire at full speed, ignoring the Federation’s pursuit.”", "Everyone’s faces froze stiff.", "They remembered the Chief Deity’s last warning.", "\"…Anywhere.\"", "Philip Muller powerlessly looked at the stele that was broken into three pieces.", "\"It’ll be a good idea to take those and be anywhere that’s not here.”", "No one else spoke, but they all shared the same mind.", "Seo Yuhui was the first to take action. She took out several sheets of white cloth with magic circles inscribed on them before drenching them in holy water and blessing them.", "Then, she wrapped each piece of the stele in multiple layers of cloth before tying them in a sack.", "A moment later, the expedition team hastily left the stone chamber with the stele.", "They were luckily able to return without any accident, but hiding the stele posed a problem.", "Even though Seo Yuhui kept pouring holy power onto the stele, the three pieces relentlessly emitted darkness.", "According to the Chief Deity, the darkness served as a beacon to inform the Parasite Queen of its location.", "In other words, if it was left as it was, they would become targets of the Parasite Queen who was trying to regain her divinity.", "The expedition team racked their heads for a solution.", "They tried putting them into the Unique Ranker’s Dimensional Pocket, but they couldn’t hide the darkness’ energy.", "They tried hiding it in the temple storage, but the Seven Sins refused, saying that the darkness contained a part of the Parasite Queen’s consciousness and could possibly corrupt them.", "In the end, the expedition team couldn’t come up with a solution, so Sung Shihyun, Baek Haeju, and Seo Yuhui each took one piece of the stele.", "The three of them agreed to each find a suitable place and hide the Imperial Oath so no one could find it.", "It was to prevent the Parasite Queen from recovering, even if the pieces were taken from one or two of them.", "And so, while Seo Yuhui took the stele and traveled around all of Paradise, she accidentally chanced upon a suitable place to hide the piece.", "Though there wasn’t a living god there, the power of a god lied dormant there.", "Just like that, Seo Yuhui headed to Scheherazade…", "*", "\"So… Noonim, you hid the stele in a place called Gorad Boga managed by the Scheherazade Royal Family?”", "Chohong asked as soon as the story was over.", "\"Yes. I received permission from Roe Scheherazade to enter Gorad Boga. I thought it would be safe there, but…\"", "Seo Yuhui didn’t continue and closed her eyes.", "'No way.'", "Seol Jihu realized what she was worried about.", "What if Roe Scheherazade became a traitor?", "Obviously, the queen of Scheherazade would never have switched sides in the beginning.", "However…", "'Perhaps…'", "If Seo Yuhui hid the stele inside Scheherazade Royal Palace, and Roe Scheherazade’s mentality had gradually weakened since that day because of it….", "\"You’re right. As Unni said, Gorad Boga itself doesn’t seem to be much of a problem.…”", "Eun Yuri murmured as if she had realized something.", "Seo Yuhui nodded with difficulty.", "\"Right. They’re not aiming for Gorad Boga but the stele inside it. And that unidentified woman…”", "Her voice hinted she was praying that the woman was not Roe Scheherazade.", "Seol Jihu clenched his teeth.", "It was hard to say it was Seo Yuhui’s fault.", "Knowing her, she would have placed the utmost caution.", "But despite that, what if Scheherazade’s queen turned traitor?", "[Are you… not going to destroy Sinyoung?]", "Roe Scheherazade must have wanted it herself.", "Seol Jihu let out a soft groan.", "It felt like the scattered puzzle pieces were clicking into place, one by one.", "\"Noona, since Sung Shihyun went over to the Parasites…\"", "\"It won’t be wrong to say that they already have a piece of the stele.”", "Seo Yuhui bit her lip.", "\"If they manage to get the piece within Gorad Boga, they would have two in their hands.”", "Seol Jihu began to feel the urgency.", "The feeling of having only one life left was completely different from having two.", "No, they might already be down to only one.", "They couldn’t rule out the possibility that the Parasites already found the remaining piece.", "\"Miss Baek Haeju knows where the remaining piece is, right?”", "\"Yes. But I only know that she hid it in a place she coincidentally found that’s neither in the Federation or the human territory. We promised each other not to reveal the places.”", "Seol Jihu closed his eyes.", "He asked after quickly organizing his thoughts.", "\"Can the stele in Gorad Boga be taken out immediately if one wished to?”", "\"No. That’s impossible, even for me.”", "\"What about Roe Scheherazade?”", "\"That should be the case for her too.”", "Seo Yuhui shook her head.", "\"The two-layered formation within Gorad Boga is an extremely powerful divine spell that can hold strong for several days, even if the ones striking it are gods. Not even Scheherazade’s royal blood can freely enter that place. Back then, I only barely managed to send the stele piece in after expending a great amount of contributions points and holy power.”", "Seo Yuhui paused for a moment before continuing.", "\"And… I didn’t immediately leave Gorad Boga after successfully sending the stele inside. After receiving permission from Roe Scheherazade, I set up a powerful barrier as well.”", "\"A barrier? In Gorad Boga?\"", "\"Yes. I prayed for a hundred days inside the ruin to set up a barrier. I even left behind a holy artifact to keep it semi-permanent.”", "\"What kind of barrier was it?\"", "\"It was the strongest spell I knew back then. I’ll be notified if anyone tries to forcefully break the barrier. And it’s not easy to break the barrier through normal methods.”", "Seo Yuhui continued.", "\"To release the barrier, an offering has to be sacrificed. Not just any ordinary offering, but a special one.”", "\"By a special offering, you mean…\"", "\"…A human.\"", "Seo Yuhui briskly replied.", "Seol Jihu’s mouth dropped open.", "\"Wait a minute. Then the reason she gave Pavlovici the map was to…”", "\"It was probably because they needed a sacrifice. Of course, a single person would have been nowhere close to enough, so she suggested bringing his comrades.”", "Seo Yuhui sighed.", "\"I know that it’s wrong to use methods that require human sacrifices… But I had no other choice. That stele is something that should never be handed over to the Parasites.\"", "Seol Jihu nodded.", "The issue at hand wasn’t whether things were moral or not.", "Seo Yuhui had devoted a hundred days to place a powerful barrier in case something went wrong.", "It was somewhat reassuring.", "\"Then the stele is doubly protected then. Even if your barrier breaks, another layer is protecting Gorad Boga from within so it won’t be easy getting in.”", "Seol Jihu’s voice lightened a bit.", "\"That’s right, but… nothing is certain.”", "Seo Yuhui’s face, however, remained dark.", "“Roe Scheherazade has the Royal Oath.\"", "\"?\"", "\"The Royal Oath is a pledge that even gods cannot disobey. If they break my barrier and use the Royal Oath to disable the barrier within Gorad Boga…”", "Seol Jihu’s face became stiff.", "He hadn’t thought of that method.", "While Seo Yuhui’s worry was the worst possible scenario, it was still possible.", "Having thought up to that point, they had no more reason to hesitate.", "They knew what they had to do.", "\"I’ll contact the organizations in Scheherazade.”", "Kim Hannah was already setting down several communication crystals on the table.", "\"If human sacrifices are necessary, then it’ll be best if no one is allowed to go near the palace. I’ll also ask them to keep watch on Roe Scheherazade.”", "\"Do it without letting Roe Scheherazade find out, and just to be safe, Sinyoung as well.”", "\"Of course.\"", "After seeing Kim Hannah nod her head, Seol Jihu looked back at Seo Yuhui.", "\"Noona. Can you bring Miss Baek Haeju back to Paradise somehow? The sooner the better.”", "\"I’ll go right away.\"", "Seo Yuhui immediately got up from her seat.", "And that very evening, Baek Haeju entered Paradise.", "*", "That night.", "In the middle of a calm and tranquil sea where no wind blew, a small wave suddenly broke out.", "A tremor rippled out in the jet-black ocean as a shadow quietly surfaced above the water.", "A head matted with dark-purple hair and a pair of goat horns quickly scanned the area.", "After cautiously looking around for a long time, it spread the pair of black wings on its back and carefully broke out of the water.", "That wasn’t the only place.", "Shadows stealthily slipped out from multiple spots in the waters around the city.", "[Everyone… You know what to do, right?]", "An elegant yet mysterious voice was transmitted to all the shadows that revealed themselves.", "A smile full of white teeth flashed within the darkness as if the silence over the sleeping city was to its liking.", "[Quietly, thoroughly…]", "At that moment…", "[And quickly…!]", "The succubi led by the Sixth Army Commander, Vulgar Chastity, simultaneously spread their bat wings."]}