{"cid": "325", "title": "Chapter 325. Immediate Battle (4)", "content": ["Zoooong.", "A deafening sound rang in his ears. It was a noise that Seol Jihu had never heard before in his life and something that was hard to describe with words.", "Its effect was immediate.", "\"!\"", "The Unicorn’s four limbs were twisted all of a sudden, causing it to collapse on the ground. Raging Temperance finally showed signs of urgency.", "\"Keuh….\"", "It let out a short groan while its body lightly swayed. It looked as if it was being subjected to a tremendous amount of gravity.", "\"Euhhh!\"", "At that moment, a third of the flock of Nightshades that it had previously released could be seen being absorbed back into it.", "Raging Temperance managed to steady himself.", "\"Heheh… Heheheh…!\"", "It let out a suppressed laugh while sweating.", "\"I was wondering what you were up to… but it was only a curse of the Seven Sins?\"", "\"You expended so much effort to manifest yourself here… yet you only managed to limit my abilities?\"", "Avaritia did not reply. She only sent a mocking glare towards it, cold enough to make everyone in the area feel its chill.", "\"Truly laughable, Avaritia!\"", "Though the Unicorn laughed with great arrogance, anyone could see that it was forced laughter to mask its bluff.", "In other words, Raging Temperance himself was telling them that the curse was effective.", "\"Hmph. It doesn’t matter. Even if I can’t do anything about the Authority, I can just recover the divinity I’ve lost.\"", "Following that, another third of the Nightshades around the Unicorn were absorbed.", "—Good. The movement speed of that perverted Unicorn should have significantly dropped now.", "Seol Jihu could hear Baek Haeju’s mental transmission.", "His eyes widened when he found out the nature of the curse.", "There was one reason that the Fourth Army Commander could toy with their expedition team after their first clash, and that was its other-worldly movement speed that could not be followed by human senses.", "However, a limit was now placed on its mind-blowing speed. In other words, the power of the Fourth Army Commander was greatly weakened.", "Of course, while it might still have abilities that it had yet to expose, things were undeniably looking better for the expedition team.", "—The Whacko Archer will make an opening for us.", "‘Whacko Archer?’", "—When she does, launch a surprise attack with your Spear of Purity. There’s no need to injure it. It’ll be enough if you can just make it retreat.", "She continued saying things he didn’t understand.", "—The spear you’re holding in your hands is an incredible treasure. It might even be a stronger divine weapon than my Tathagata Spear.", "Seol Jihu subconsciously clenched onto his Spear of Purity after glancing at the green spear Baek Haeju was holding.", "—It doesn’t look like you can draw out its true power, but I’m sure of it. The Unicorn looked like he was desperately trying to avoid that spear of yours. You should be able to make him retreat with it.", "Seol Jihu nodded his head.", "A moment later, his comrades started to move.", "When the Archers’ started shooting, signaling the start of their plan, the Warriors who had sneakily surrounded the Unicorn charged towards it all at once.", "\"Tsk tsk.\"", "The Unicorn remained nonchalant, mocking them to try as they would.", "Instead of retreating, it waited for them to come near before easily sending Chohong, who charged at it while under her Manifestation ability, flying using its horn.", "“Valhalla!!”", "With its hind legs, it violently kicked up Hugo, who was aiming for its back, and reared in response to Oh Rahee, who was rushing toward it at a frightening speed. It bent its forelegs in a 90 degrees angle in preparation to stamp her into mush.", "It was at that moment.", "“Hup!”", "When the Fourth Army Commander reared, a shadow suddenly materialized behind its back. With one arm tightly wrapped around the Unicorn’s neck and two legs strapped across its body, it was none other than Hoshino Urara.", "Seol Jihu finally realized who the Whacko Archer was referring to.", "“Hoshino-style Secret Ultimate Move! Ura Charge!”", "Shouting that, she slid the katana she was holding in her left hand down the Unicorn’s neck.", "Or rather, she tried to.", "Just when she was about to stab down, the Unicorn glanced at Hoshino Urara, who was mounted on its back before violently shaking its body.", "“Eueeeeeeh!?”", "As the Unicorn desperately began to struggle to shake her off, Hoshino Urara became a flag fluttering in a storm. It was struggling so violently that Oh Rahee couldn’t easily approach it anymore.", "“Ack!”", "Hoshino Urara, who was thrown off in the end, gaped open her mouth. It was because the Unicorn stomped its hoof down on her shoulder.", "“Unghhhhhk!”", "The pain of muscles tearing and bones breaking swept over her. No matter how much Hoshino Urara tried to endure it, she couldn’t help letting out a suppressed moan.", "\"Huhu. A perfect ending for an insect like you.\"", "“Eeek! Ehugh! Euk! Ungghhk!”", "\"Just scream, won’t you? Hahahaha.\"", "The Unicorn ridiculed her to his heart’s content as he watched the greatly distressed woman. However, the Unicorn’s face gradually became sour the more Hoshino Urara was in pain.", "She definitely was in agony. She was, but…", "“Teh! Tehtik! Tehtititi! Teik!”", "\"…\"", "Listening to her began to disgust the Unicorn. It somehow began to get ticked off looking at her scrunching her face up like a Hahoe mask and letting out strange noises through a puckered mouth.", "It almost felt like it was being teased. No, it was sure she was ridiculing it.", "\"This fucking bitch—\"", "The Unicorn suddenly grew angered for no reason and raised its forelegs again.", "\"I’ll crush that foul mouth of yours!\"", "And as it was slamming its legs down…", "“Tehti?”", "Hoshino Urara suddenly opened one eye. As soon as she saw the frustrated and pissed-off horse head, she immediately looked towards her left and shouted at the top of her voice.", "“Do it now! Right now!”", "\"What?\"", "The horse head urgently swung to the side.", "\"?\"", "But there was nothing. It couldn’t find anything that would pose a threat.", "“Just kidding!”", "Hoshino Urara grinned before grabbing her shattered shoulder and rolling away. When the Unicorn saw Hoshino Urara again…", "“Save me!”", "…She was already running away after freeing herself from under it.", "Silver threads shot towards her from afar as if Agnes were trying to help the injured girl.", "\"This…!\"", "The angered Unicorn crouched down. It meant to chase after the insect that gave him humiliation before the fast-approaching threads snatched her from its grasp.", "That was what it tried to do but…", "The Unicorn suddenly froze in place, right as it was about to kick off the ground. It suddenly felt a mighty surge of holy fluctuations from its right.", "When it quickly turned its head around, it could see Baek Haeju in a stance, gathering energy.", "\"Damn it!\"", "It occurred to the Unicorn at that moment that it was forgetting the two beings it should have been wary of.", "The Unicorn furiously ground its teeth but still turned to face Baek Haeju before retreating several steps away from her.", "That was why it couldn’t see it.", "The threads that Agnes had released brushed past Hoshino Urara and were flying straight toward it in the direction it was retreating in.", "It wasn’t even aware of the incoming attack.", "This was because Raging Temperance’s attention was not only on Baek Haeju but also on Seol Jihu, who launched a surprise attack according to Baek Haeju’s mental transmissions.", "\"You treacherous bastards!\"", "The Unicorn grit its teeth.", "It was actually fuming inside because it had been deceived, but on the other hand, it also felt that they were laughable, thinking that their attempted ambush was all they had been aiming for.", "Only, it couldn’t ignore the divine spear overflowing with sword qi imbued with the Anti-Evil attribute, so it quickly backed away.", "Even though its movement speed was restricted under the curse of the Seven Deadly Sins, it wasn’t an idiot that would let itself get hit by obvious attacks.", "Saak!", "The diagonal spear strike narrowly swished past its snout. The Unicorn snorted seeing Seol Jihu’s body passing by in front of its eyes.", "Determined to launch its counterattack this time, it powerfully struck the ground with its legs. And the moment when its four hooves were firmly planted on the ground…", "\"!\"", "…Spider webs stealthily appeared out of nowhere and tightly bound its limbs.", "Immediately following that, a wave of sacred light swept down the lines and dyed all the threads in a pale white color.", "“Haat!”", "Agnes flung her hands apart with a loud shout, causing the legs of the Unicorn that was bound unawares, to be forcibly spread apart in the air.", "\"Trifling actions!\"", "But the Unicorn soon became astonished after it tried twisting its body.", "\"W-What!?\"", "Normally, the threads should have burst all at once. However, the situation was completely different from before.", "Tuk, tuk, tuk, tuk.", "A few threads were still breaking, but the rate of them being cut down was noticeably slower. The threads maintained their tension while the white light they were dyed with was preventing the threads from breaking.", "\"Just how…!\"", "The Unicorn panicked and turned its horse head around before discovering the cause.", "Seo Yuhui, the Star of Lust and the apostle of Luxuria, was transmitting holy power to Agnes by placing her hands on her back.", "And.", "Seol Jihu, who had brushed past the Unicorn, suddenly turned around and powerfully kicked the ground. He rushed like a charging tiger at the Unicorn that was helplessly stuck in midair, unable to move an inch.", "It was the perfect chance!", "Perhaps because he was aware that he couldn’t miss this opportunity, his mana circuit started burning a level hotter.", "\"Euhhh!\"", "He accurately thrust his spear towards Raging Temperance, who was caught in an unexpected situation.", "The Spear of Purity exploded out with a golden light, far more vivid than ever, and arrived at the Unicorn’s long neck.", "At that instant!", "Kang!", "Blue sparks erupted out amidst golden arcs of electricity.", "“…”", "Seol Jihu, who thought everything was finally over, had his face grow blank.", "The spear couldn’t pierce through its neck.", "To be precise, the spear was stopped before it could even touch the Unicorn’s neck. Taking a closer look, he could see a bluish film of light covering its body.", "It was that barrier that had protected it from Philip Muller’s magic once.", "While it wasn’t in the shape of a hemisphere like that time, a barrier was definitely covering its body. The Unicorn must have instinctively activated it at the moment it received the unexpected attack.", "The barrier seemed to be caving in bit by bit, but it looked like it wouldn’t be pierced through in a matter of seconds.", "It was a hard opportunity to come by. To retreat or not to retreat. All sorts of thoughts flashed in his mind.", "Seol Jihu and the Unicorn exchanged dazed glances for a second before the Unicorn opened its mouth and revealed its protruding teeth.", "\"Hah!\"", "Dududuk!", "The threads restraining its right leg were ripped apart.", "\"Die!\"", "It screamed while striking down its right hoof at Seol Jihu’s head.", "\"Iyat!\"", "However, its blow missed by a hair’s breadth just as it was about to crush Seol Jihu’s head. It was because a dark smoke suddenly flew towards its leg and caused it to change its trajectory.", "\"What’s it this time…!?\"", "The Unicorn’s face scrunched up when it found a female ghost desperately clinging onto its leg.", "At that moment, Seol Jihu’s eyes started to shine. He clenched his teeth and put more strength into driving in the spear with his hands. As he did so, the Spear of Purity began emitting electricity and started to vibrate.", "\"Damn it!\"", "Feeling the imminent danger, the Unicorn ignored Flone and hastily broke the threads around its left leg. Once freed, it kicked it towards Seol Jihu, who was giving it his all.", "However, instead of the sound of a head bursting, the sound of metal clashing rang out.", "The Unicorn focused its eyes on the shield, which was glowing white from having received Seo Yuhui’s holy power, that suddenly slipped in from the side out of the blue and blocked the blow.", "“Keu—”", "The moan was let out by none other than Phi Sora. She had re-entered the fight after having been knocked unconscious when she received a heavy blow early on before recovering a little, thanks to Maria’s treatment.", "“Ughhh!”", "Despite the blood dripping down her nose, Phi Sora managed to raise her long sword. When her blade became wrapped in flames, she slammed it towards the Spear of Purity with all her might.", "A clear metallic ring echoed out as sparks flew.", "“Pierce through! Please pierce throuugghh!”", "Kang! Kang!", "She let out a yell and crazily swung down her long sword multiple times. And because of the added force, the Spear of Purity really did start to advance bit by bit.", "\"You, you fucking bitch!\"", "The appalled Unicorn repeatedly kicked with its leg, but Phi Sora fiercely held onto her shield that was strengthened by holy power.", "She tenaciously resisted the blows and kept swinging her arm while leaning against Seol Jihu.", "And when the flaming sword struck down another time on the Spear of Purity, a blood-red long sword stuck against it at a terrifying speed and stacked on top of the two weapons.", "“Hold your shield properly! You dumb bitch!”", "Oh Rahee shouted while pressing her blade down with both hands.", "“Euaaah!”", "Chohong’s Thorn of Steel also struck down on top of the pile.", "“For Valhalla!”", "And the moment Hugo rushed to them to heavily swing the halberd which he had been carrying on his shoulders…", "Chung!", "A jarring noise like that of glass cracking rang in their ears.", "Seol Jihu’s eyes suddenly widened.", "Beneath the Spear of Purity, pinned underneath four other weapons, was a small gap on the blue barrier. It was a very tiny gap, but it was a crack nonetheless.", "“Keuuuu!”", "Seol Jihu clenched the spear shaft as he gritted his teeth.", "His internal circuits were already so hot that they were almost on the verge of melting and his mana was raging inside of him like a storm.", "Despite this, Seol Jihu scraped up all the energy left in his body and focused everything he had at the spearhead.", "“Euaaaaaaaaah!”", "And a second later, Seol Jihu could clearly feel it.", "The barrier, which had persistently endured up till now, cracked, and the sensation of what felt like his spear lightly piercing through a solid log was transmitted up his hands.", "“Ah…!”", "Seol Jihu’s mouth gaped open.", "It wasn’t his imagination or a hallucination.", "The Spear of Purity was sticking out of the Unicorn’s body. It had finally broken through the barrier!", "Seol Jihu yelled at the top of his voice through his opened mouth.", "“Baek Haeju-ssi!”", "At the same moment, Baek Haeju’s figure quickly narrowed the distance between them.", "As she calmly stretched out her arm, all the aura that had been flaring out about her, spilled into her spear. When she was done, the aura gathered at the tip of her spear and condensed into a point that was smaller than the fingernail of a baby’s pinky.", "And then.", "Baek Haeju’s Tathagata Spear brushed past all the weapons, squeezed through the gap made by the Spear of Purity, and finally pierced into the body of Raging Temperance.", "\"Uuuuk!\"", "Boom.", "With the sound of something exploding inside it, the Unicorn’s body inflated like a pig. When it swelled until it looked like it was about to explode, a green aura began spilling out of its body like meat juice oozing out of a steak.", "It was only then that Baek Haeju replied to Seol Jihu’s call for her.", "“Jihu!”", "In the next moment, holy water flowed out from her body like river water bursting through a dam, while an overwhelming lightning energy poured out like thunder from Seol Jihu’s.", "The two auras began to fuse together as if they were rubbing against each other before they completely harmonized in a perfect union!"]}