{"cid": "209", "title": "Chapter 209. Slave Hunt (3)", "content": ["A short shadow shot out of the wavering field of reeds. Seol Jihu looked up as he pulled his arm back instinctively.", "‘Uek!’", "He was about to throw the spear when he suddenly furrowed his brows.", "It was because the glaring sun shone down on his eyes as if it had been waiting for this moment.", "And because the speed of the mysterious shadow far surpassed his imagination, he couldn’t see it properly.", "Something black brushed past his field of sight. That was the only information he could gather at that moment.", "In the next moment, Marcel Ghionea chased the target with narrowed eyes and prepared himself to pull the trigger.", "However, Teresa’s eyes simultaneously widened.", "“Wait!”", "Along with a high-pitched scream, Teresa quickly extended her arm out.", "Drrk!", "“Ah!”", "Marcel Ghionea muttered in a fluster after firing about four bolts. Because Teresa had suddenly pushed him, his balance was shaken and his aim was ruined. The bolts all flew off their intended mark.", "“You—!”", "Marcel Ghionea grit his teeth and looked back at Teresa. It was then.", "“Ueh!?”", "A child-like voice suddenly rang out from above.", "The figure crossing through the air flailed before falling down. Although the crossbow bolts had missed their target, they had formed a fire net that blocked the shadow’s movements.", "The target attempted to change its course in a startle but had failed and fallen instead.", "Just as Seol Jihu, who was looking at Teresa in surprise, moved his gaze in the direction of the voice—", "“Uuu… wuuuu….”", "“?”", "He doubted his eyes, furrowing his brows strongly and staring at the sobbing thing that just fell on its face.", "First, it seemed to be about 30~40 centimeters tall. Judging by its cute little hands and its tiny feet, it was a child without a doubt.", "The problem was this.", "“What the heck?”", "Chohong blurted out as if she lost interest, then walked up.", "“Miss Chohong! Wait! Don’t just walk up…!”", "Teresa stopped Chohong, but Chohong continued walking. The groaning child must have felt her presence as it looked back in a startle.", "“H-Human! Here too…!”", "Despair filled the child’s small beaded eyes.", "“No, no…!”", "The child flailed around, trying to get away as much as possible.", "‘Can’t she just get up and run?’", "She must have been too shocked to think rationally. The child looked rather pitiful, but Chohong sauntered up uncaringly. After glancing at the child’s face and butt, a light flickered in her eyes.", "“Ha! Ears and tail?”", "Right, to everyone’s surprise, the child’s ears were covered in soft, cushiony hair, and a thick, brush-like tail was attached to her pants.", "“Iya~ Who would have thought I’d see a Beastman here?”", "Chohong exclaimed in awe before grabbing the child, who was fumbling around on the ground.", "“Uwah! Uwaaaaah!”", "The Beastman child struggled in fear, having been pulled up by her leg.", "“Argh, stay still!”", "Because the child was resisting harder than she expected, Chohong furrowed her brows and reached out. Once she grabbed her stiff tail tight, the Beastman child stopped resisting instantly.", "“Awuuu….”", "She shuddered as though she had just been electrocuted before sagging down. Chohong chuckled like an idiot.", "“I heard the tail is the weak point of some Beastmen. I guess it’s true.”", "“Mommy….”", "From the Beastman child’s tightly shut eyes, bead-like teardrops fell down.", "Chohong was slightly taken aback. She only saw the situation as grabbing an animal on the side of the road.", "“Mommmmy…”", "“….”", "She felt a bit disgusted with herself, like she had become some sort of a third-rate villain.", "“I told you to wait!”", "Teresa’s sharp voice rang out from the back. She sounded extremely angry. Chohong didn’t know what to do seeing the Beastman child crying in her hand.", "“Take your hand off her tail! Now!”", "Teresa quickly ran forward and snatched the child out of Chohong’s hand.", "“Sorry, did that scare you? It’s okay now, alright?”", "She hugged the child gently and consoled her, but the child was already in a state of panic and did not show any sign of calming down.", "Biting her lip softly, Teresa looked back at Kazuki and asked.", "“Mister Kazuki, where are we exactly? Did we cross the border?”", "Kazuki looked around, then replied.", "“I’m not sure. In a broad sense, we should be at the very center of the border region. We haven’t crossed the border yet though.”", "“So we’re on the human side of the border region.”", "“Yes.”", "Kazuki replied with clarity.", "Teresa nibbled on her lower lip.", "“What happened? Why is this child…”", "She blurred the end of her speech before looking up at everyone and shouting.", "“I think we should stop for a bit. First—”", "“Princess.”", "Kazuki cut her off. Then, he glanced to the side.", "Teresa went “Ah” as she looked at Seol Jihu.", "“Seol…!”", "Seol Jihu snapped out of his daze at her pleading voice.", "He had only read about the Beastmen in text. As this was his first time seeing one, he had been staring at the child in a daze. He collected his mind before speaking.", "“We’ll take a short break.”", "The expedition team took a break near the carriages. Kazuki stood guard, while the others gathered together and watched Teresa and the Beastman child.", "Teresa had taken the Beastman child and walked a good distance away. Given how anxious she was, Teresa decided it would be better to get her away from other humans.", "“Beastman… and a child Beastman, at that. Who would have thought?”", "Marcel Ghionea muttered as if he was making an excuse.", "“She was so fast that I thought she was a wild lynx.”", "“Well, it was right not to let your guard down. Some Beastmen are strong from a young age.”", "Hugo tapped Marcel Ghionea’s shoulder while chewing on a piece of beef jerky.", "“Is this your first time seeing a Beastman?”", "Phi Sora nudged Seol Jihu’s side and asked. Seol Jihu nodded his head blankly.", "“Stop staring so much. Can’t you see you’re scaring her?”", "Phi Sora was right. Even though Teresa was doing her best to console the child, the situation was still the same. No one knew why the child was panicking so much, but she was rejecting humans to the point of getting spasms.", "The only solace in the situation was that she had finally stopped crying.", "Seol Jihu took his eyes off the child and asked.", "“What race of Beastmen is that child?”", "“Uh… not sure. We can’t really tell from her ears. But from her tails…”", "Phi Sora scratched her neck hard.", "“She’s from the fox race.”", "The one who answered was someone Seol Jihu didn’t expect— Maria. She licked her lips endlessly and stole furtive glances at the Beastman child.", "Seol Jihu tilted his head.", "“Fox race?”", "“Earthlings call them the Foxmen. As they look like foxes, their official name is Vulpes. Because of their unique nine tails, they’re also called Nine Tail.”", "Seol Jihu’s eyes widened once he heard her detailed explanation.", "“You surprisingly know a lot about them.”", "“Of course!”", "Maria raised her voice before making a circle with her thumb and index finger. Then, she shouted with an innocent face.", "“Beastmen are lucrative!”", "“They’re… lucrative?”", "Maria nodded strongly.", "“Yes! Especially a Foxman, who are especially few in numbers. A child Foxman? They would practically be a blank check, mufufufu.”", "Maria laughed insidiously before glancing at Seol Jihu. She seemed to be asking, ‘So? You interested?’", "A wry look crossed Seol Jihu’s face. She was clearly suggesting that they sell this child Beastman off.", "‘Then… we’d be treating her as a slave.’", "Seol Jihu’s brain could neither accept nor allow it. In the first place, he had a tacit alliance with the Federation. He didn’t need to confirm with anyone to know what they would think if they found out. In fact, the incident might even blow up to a full-blown show of force.", "“I really hope it’s not a big deal….”", "Kazuki muttered quietly, exacerbating the uneasiness Seol Jihu was feeling. Seol Jihu asked, just to be sure.", "“Mister Kazuki, I may be worrying unnecessarily, but…”", "“Yes.”", "Kazuki replied without taking his eyes off the child.", "“If you’re asking if there are people kidnapping Beastmen and selling them as slaves, the answer is a definitive yes.”", "Seol Jihu had guessed as much. Rather than saying ‘No way’, he simply shut his mouth.", "Humans were willing to attack each other for the sake of personal benefits. Who was to say they wouldn’t touch the Federation?", "“It’s not just the Beastmen. Dwarves, Cave Fairies, Sky Fairies, and even Fallen Angels. I wouldn’t say slave hunting is prevalent, but there is most certainly a black market for it. Naturally, poachers provide the products.”", "“Those goddamn bastards…”", "Seol Jihu clenched his teeth. Humans should be begging to cooperate with the Federation, so what bullshit was this?", "“Do the Royal Families know? If they do—”", "“Some Royal Families have legislation banning the act, and they severely punish anyone who’s caught. Haramark is a good example.”", "Seol Jihu turned to Teresa reflexively. Her efforts seemed to have paid off as the Beastman child was calmly resting in her embrace. She had her head dropped with a glum look, though.", "“But the Eva Royal Family, which is closest to the Federation, has a slightly different stance. They’re… a bit vague about it.”", "“?”", "“They’ve put out a royal decree banning the act… but that’s it. They simply ignore the issue, as if it doesn’t exist.”", "“They’re ignoring the issue?”", "“I personally think there are two reasons.”", "Kazuki calmly explained his reasoning.", "“The Eva Royal Family has very little regal power. The public sees Eva as an ideal kingdom where Earthlings and the Royal Family have a cooperative relationship, but it’s more correct to say that Earthlings have a tight control over authority. Moreover, because their ruler is young, it’s said that an Earthling rules in their place.”", "Seol Jihu’s ears perked up once information about Eva came out. As he planned to move there soon, he couldn’t help but be curious.", "“Also, the Eva Royal Family doesn’t see the Federation in a good light.”", "“Why?”", "“It hasn’t been long since the Federation and humanity formed their tacit alliance. Although I’ve never seen it personally, people say their relationship used to be just as antagonistic and hostile as with the Parasites. We know for a fact that they’ve gone to war before… and the Eva Royal Family was at the head of that war.”", "“….”", "“Most importantly, the current ruler of Eva, Queen Adora, lost her father and mother, the previous King and Queen, in the war against the Parasites, and lost her one and only older brother in the war against the Federation.”", "Kazuki sighed.", "“Of course, it’s not like I don’t understand where she’s coming from, but for a ruler of a nation to ignore such a pressing issue….”", "“Oh please, give me a break.”", "At that moment, Phi Sora, who was quietly listening to the conversation, cut in.", "“You’re framing the issue like it’s the humans’ fault. But we have something to say about that too.”", "What did she mean by this?", "“You know that the Beastmen Alliance doesn’t see us favorably, right?”", "“I do.”", "“Then how can you say what you just said? What do you think is the reason that the slave hunt became a thing in the first place? It’s because Earthlings kept disappearing in the border region! That’s what set us off and made us fight back.”", "“It hasn’t been revealed which side started first.”", "“Fine, we’ll leave it at that. But you can’t deny that people went missing.”", "This was the first time Seol Jihu was hearing any of this. It had to be an issue from long before Seol Jihu ever entered Paradise.", "“Is that true?”", "Seol Jihu cut in.", "Phi Sora crossed her arms and nodded her head in affirmation.", "“Yes! I know it’s true! For the record, I’ve participated in a reconnaissance of Eva’s border region when I was in White Rose.”", "“What was the result?”", "“There were countless trails going in, but very few trails coming out. This was in the border region of the Federation and humanity, since Tigol Fortress was blocking the Parasites. How are we supposed to interpret this?”", "Seol Jihu stole a glance at Kazuki, who was maintaining his silence.", "Phi Sora cleared her throat.", "“Dear, I’m not saying that I’m correct. I’m just telling you not to think so one-sidedly.”", "“….”", "“Think about it. If humans were 100 percent at fault, do you think the Federation would stop at just strengthening their security? No, they would have pulled out their swords and barged in. Their lukewarm reaction means that they have a guilty conscience.”", "She had a point.", "Seol Jihu smacked his lips.", "“But that Beastman is just a child…”", "Phi Sora replied firmly.", "“Don’t underestimate her. Even adolescent Beastmen have a terrifying battle prowess. Strong reproductive ability and being powerful from a young age are Beastmen’s traits!”", "“That’s not always the case.”", "The moment Phi Sora emphasized that they shouldn’t be compared to human children, Kazuki rebutted.", "“I agree that their growth speeds rival the Orcs, but their reproductive ability depends on what subrace they belong to. The Foxmen are well-known for having a low fertility rate and thus cherishing each of their members. If we kill her or take her back with us, there’s a huge chance it will become a diplomatic problem.”", "“Who said we should kill her? I was just—”", "Kazuki and Phi Sora bickered on and on.", "‘Interesting.’", "The opinions on this issue were more varied than he thought, clear evidence that the relationship between the two nations was complicated.", "Seol Jihu glanced at Teresa again.", "‘What should I do?’", "He remembered what Jang Maldong said.", "That there was a chance they might run into the Federation since they were going to the border region. That it was important to deal with the situation appropriately.", "‘He said it was an excellent decision to bring Princess Teresa along.’", "After thinking about the matter in-depth, Seol Jihu walked forward slowly so that the Beastman child would not be startled.", "When he got near, the child flinched and trembled. Teresa looked up at Seol Jihu with a slightly exhausted and troubled expression.", "“I’m sorry. I revealed my identity, but she’s still worried… It looks like something horrible happened to her.”", "Looking fixedly, Seol Jihu slowly squatted down and got on the same eye level as the child. The Foxman child, whose limbs had gone limp, slowly raised her head.", "‘Wow, look at her nose.’", "It wasn’t sharp like a human’s. Seol Jihu had a strong urge to lick the child’s black, fox-like nose. Looking at her glistening eyes, a gentle smile spread across his face.", "Then, he started a conversation.", "“Boo!”", "“?”", "…It couldn’t be helped.", "Although his teammates had warned him about her potentially being a threat, Seol Jihu loved children by nature. This was because he liked their reaction when he made fun of them or pranked them.", "“Look at this.”", "What Seol Jihu took out after talking amicably was— gum. He had brought it from Earth to chew on when he was bored.", "‘I didn’t think I’d use it like this though.’", "After peeling it, he waved it in front of the child’s face, then plopped it into his own mouth.", "Nom, nom.", "“Puu—”", "He blew air into the gum and made a bubble. As expected of bubblegum, a bubble the size of his head quickly formed.", "“Oh, my? What’s that?”", "Realizing Seol Jihu’s intentions, Teresa quickly chimed in.", "“Tada~”", "When Seol Jihu brought the bubble close…", "“Uuun, uuuun!”", "The Foxman child frowned and waved her hands at a loss for words. When her nails brushed the surface of the bubble, it popped with a boom and went splat on Seol Jihu’s face.", "Not knowing that it would burst so easily, the Foxman’s eyes widened.", "“Ack!”", "Seol Jihu fumbled with his face exaggeratingly. He then took off the gum and giggled.", "When Teresa covered her mouth and also giggled, the corner of the dazed Foxman child’s mouth twitched ever so slightly.", "“How could you~? I blew a bubble for you. Wuuuu, it’s so sticky…”", "Perhaps finding Seol Jihu pulling the gum off his face funny…", "“Heehee.”", "Though faint, the child broke out into laughter for the first time.", "“What do you think? It’s pretty cool, right?”", "The Foxman child nodded cautiously.", "Seol Jihu smiled timidly and handed her a gum.", "“You wanna try too?”", "The Foxman child blinked. Curiosity clearly glimmered on her face.", "Teresa, who was watching quietly, was startled on the inside. The child’s stiff ears and tail slowly relaxed. Next, her ears folded halfway and her tail began to wag. The Foxman child’s mentality was clearly changing.", "“Sniff, sniff.”", "Perhaps still a little suspicious, she put her nose against the gum and smelled it for a long time.", "Teresa was a bit nervous, but Seol Jihu was calm. He didn’t force the child in any way and waited patiently.", "Soon, the Foxman child grabbed the gum and bit down. She took a deep breath after sucking the juice out.", "Seeing her reaction, Seol Jihu asked with a bright smile.", "“Sweet and tasty, right?”", "Nod, nod.", "“Don’t suck on it and chew. You’ll get more of the sweetness that way.”", "The Foxman child obediently began to nibble. She must have really liked the intense sweetness as her nibbling didn’t stop for a while.", "“Wow…”", "Teresa subconsciously let out an exclamation of awe. She had such trouble calming the child down, but Seol Jihu had succeeded instantly. As she didn’t know Seol Jihu’s talent for taking care of children, she couldn’t help but be surprised.", "“Chewing on gum helps you relax. Many athletes chew gum before going into games.”", "Seol Jihu explained as he took the splattered gum off his face. The Foxman child stared at Seol Jihu fixedly before puffing her cheeks out like a balloon.", "“Huuuu…”", "She blew hard, but only air came out. Seol Jihu burst into laughter.", "“Haha! You have to put your tongue in the gum and blow air in between. Stu~pid!”", "The Foxman child got angry.", "“I’m not stupid!”", "“Oh?”", "The child spoke for the first time. Seol Jihu shut his mouth and smiled mischievously.", "“You’re not?”", "“No, I’m not.”", "“Really?”", "“I’m not stupid!”", "“Okay, if you’re not Stupid, then what’s your name?”", "The Foxman child became flustered as if she didn’t expect the conversation to go this way. Seol Jihu grinned and reached out with his hand.", "“My name is Seol—”", "He stopped himself short of saying ‘Jihu.’", "“I’m Seol.”", "He had a feeling that the name ‘Seol’ might be known in the Federation. In the next moment, the Foxman child’s eyes widened to a circle.", "“Seol?”", "“Yes, Seol.”", "“Human… Seol?”", "“Yep, that’s me. What’s your name?”", "Seol Jihu asked, but no reply came back. The child simply looked up at him absent-mindedly.", "‘Did I do something wrong?’", "Just as Seol Jihu was scratching his cheek, the Foxman child asked again.", "“The Adversary? Are you really Seol the Adversary?”", "Cough. Seol Jihu let out a light cough.", "The Adversary? Seol Jihu had been wondering where this cringey nickname came from.", "‘So it was the Federation?’", "Anyways, the important thing was that this Foxman child knew who he was. Seol Jihu didn’t let this opportunity go.", "“Oh, you know me?”", "“Un! The human who killed the First Army Commander!”", "The Foxman child clenched her fists and shouted zealously.", "“Hehe, that’s embarrassing. It was nothing big, really.”", "“Whaaaat? Nothing big? Really?”", "“Of course! First Army Commander? Sure, his title is cool, but that’s it. I almost killed two more Army Commanders, but they ran away with their tails between their legs.”", "“Uwoah…!”", "The Federation and humanity might not be on good terms, but could they hate each other more than they hate the Parasites?", "Hearing Seol Jihu’s heroic tale, the Foxman child dropped her jaw in awe.", "“But I heard they’re super strong….”", "“Well, they are. It was hard even for me because those dirty bastards came at me simultaneously.”", "Seol Jihu nodded his head.", "“I ended up winning… but to be honest, it got a little dangerous. If it weren’t for the Federation’s help, I wouldn’t be here right now.”", "“Un, un! I heard that the Sky Fairies gave you the Elixeer!”", "The Foxman child clapped her hands together and shouted. Judging from her reaction, this story must be quite well-known in the Federation.", "“Yep. It was thanks to my good friends at the Federation that I miraculously survived.”", "“Friends? Human, friend?”", "“Of course! The Federation is my precious friend!”", "Seol Jihu gave a thumbs up while winking.", "‘Stop smiling, Princess.’", "To be honest, it was incredibly embarrassing. Although the Foxman child’s sparkling pupils made Seol Jihu uncomfortable, he endured the embarrassment and decided to play along.", "“I see, then…”", "A relaxed look spread across the Foxman child’s face as she let out a sigh of relief.", "“Since you’re our friend, you’ll send me back?”", "“Of course! My friend, Mikael, is there. We’ll send you home safe and sound, so don’t worry.”", "“Wow, Mikael-nim…?”", "When Seol Jihu mentioned the name he dug up from the corner of his mind, the Foxman child looked assured, and a bright smile bloomed on his face.", "Next, Seol Jihu turned to Teresa, who was busy suppressing her laughter with her head dropped.", "Over to you Princess.", "Teresa barely managed to stop her laughter and slickly cut in.", "“Hey, can you tell us how you got here? This is the border region, but it’s pretty far from the Federation’s territory.”", "Hearing this, the Foxman child became sullen. But unlike before, she didn’t keep her mouth shut.", "“I don’t know. I just…”", "After remaining silent for a long time, she carefully said.", "“I heard there was a ritual happening at the Pagoda of Dreams today… so I secretly followed the Sky Fairies with my younger sister…”", "‘Pagoda of Dreams?’", "Light flickered on in Seol Jihu’s eyes.", "Tigerman has been changed to Foxman (previously mistranslated). Tiger and Fox have the same character in Korean (I didn't double-check the Hanja that was given since tiger is a lot more commonly used). Now it makes more sense with how they're called Vulpes! Sorry about that.", ""]}