{"cid": "80", "title": "Chapter 80. “I don’t want to live like that.” (4)", "content": ["Just as Chohong expected, the meeting was stuck in the same place, going nowhere. But it was difficult to call these people incompetent in this case. This was a gathering of individuals who excelled in their own professions, but with their opponent being what it was, even they couldn't help but be lost like this.", "And that was precisely why the entrance of Seol Jihu and his unexpected solution came across as a light of salvation, a slim ray of new dawn's light breaking through the darkness itself.", "“This is amazing. Truly amazing.”", "Ian continued to express his admiration with the face of a man completely entranced. Not a trace of his previous mischievous streak could be seen from the meaningful light flickering within his eyes. Like a drowning man grasping at straws, the old man clutched at the floor plan as if he wanted to bore a hole through it with his eyes.", "“Although it's not bidirectional like 'Warp', but two different locations are connected by bending the space in one direction. It may be unsophisticated, but still, what a surprising solution to a problem. Wait! This would increase the load, so the restrictions are…. Damn it! I knew it…” ", "Ian continued to mutter to himself while the pen in his hand scribbled without rest on a piece of paper.", "A certain man studying the old man formed an expression full of apprehension. He glared on with sharp eyes as he silently chewed his lips.", "“How considerate, all the explanations are already provided too. So, it seems the maximum weight limit in one transfer is one ton. If you consider the weight limitation when coming back, then the number of people…. No, this isn't it. How about splitting up and transferring multiple times…. God damn it! Then that's going to impact the mana needed to maintain the circle….”", "“Master Ian.” ", "The man couldn't endure it any longer and called out. Ian broke away from his fervent calculations and raised his head.", "“Can we trust this information?” ", "“Hmm….” ", "This suspicion was entirely justified. After all, this information was simply too brilliant for a Level 2 Warrior to bring in. They were left frustrated and helpless by the current situation, yet out of the blue, the impossible puzzle was suddenly solved like this? Should he say that the circumstances had improved too much now? Indeed, it was understandable where his suspicion was coming from.", "“You're right. I'd like to meet this man and have a chat….” ", "Ian spoke in a hopeful-sounding voice, but Seol Jihu shook his head.", "“He's already secluded himself. And he isn't keen on coming out of his seclusion any time soon.”", "“In that case, it can't be helped, then. This much is already a great deal of help, anyway.” ", "Ian readily accepted it. The man watching on opened his mouth again.", "“I admit that this is a very good plan. However, there is still an element of risk here. What if this is a trap….”", "“I know what you're worried about.” ", "Ian abruptly cut that man's words off.", "“We've been rash and hasty once already. Rest easy, for I shall make sure to pore over every little detail. With my skills, I should be able to judge the authenticity of this plan without a problem.” ", "The man backed off without any further complaints after hearing those words. Meanwhile, Ian carried on.", "“We have something else to worry about instead. The important thing is – we got ourselves a feasible plan now. We have no time to lose.” ", "Riiip, Ian tore the paper he was jotting down on and handed it over to Cinzia.", "“This is the coordinates of the hideout in the Arden Mountain Range. Please contact the royal court and ask them to search for the location.” ", "“No need to contact them.” ", "Cinzia used a graceful hand movement to snatch the paper away and turned around to leave.", "“We have a few fleet-footed people in our group if that's what you're looking for. Three, four days should be enough.”", "“Anything will be fine, but you need to hurry.” ", "Cinzia wordlessly left the room. Ian let his gaze linger in the direction she had disappeared to, before shifting his attention back to Seol Jihu with some excitement on his face.", "“You've made a significant contribution.” ", "“Not at all. It's too early to say that.”", "Seol Jihu was humble in his reply.", "“I don't agree with that assessment at all.”", "Ian let a sigh escape from his mouth. He felt truly rueful right about now. If only they had this information at hand for their first mission….", "“And then, even this item called rudium, too…. If everything goes according to plan, we might even be able to pull this off quite easily. I can express my gratitude in many ways, but they simply won't be enough for the contribution you made.”", "“We can't be too optimistic yet. There are a lot of variables in this plan.”", "That was undoubtedly true, but still, their current situation had improved by several folds compared to the first infiltration attempt. It wouldn't be an exaggeration to say that Seol Jihu had done way more than what was required of him already.", "Ian hesitated slightly, exchanged glances with Chohong, and finally worked up enough courage to speak up.", "“Mm… Seol?” ", "“Yes?” ", "“You see, I'm planning to make a full report of your excellent work to the royal family. Even if the mission ends up in failure.”", "“?” ", "“Of course, if we do succeed, then I shall ensure that your contribution is recognized first and foremost. No one should be able to put their names before yours. With the exception of that Mage in seclusion, that is.” ", "What was he trying to say here? Seol Jihu could only tilt his head.", "“So, what I want to say is….” ", "Ian spoke the following words with some difficulty.", "“…What you have done for us so far is more than enough already.” ", "Only then did the youth understand Ian's words. The old man was saying that there was no real need for Seol Jihu to participate in the mission itself.", "“Will I be a hindrance to you all?” ", "Ian pondered that for a second or two before shaking his head with some conviction.", "Technically, he would not be a hindrance. Both the transfer magic and the rudium formed the core of this mission – a mission where battle wasn't the main goal, but the rescue was. Since speediness was a necessity, there was a good chance that the Festina Earring attached to the youth's ear could play a vital role.", "Was that all? He was also a member of Carpe Diem and that alone meant he had enough pretext to participate. And, if he were to assert his position as the original planner of this mission, then it'd become even more difficult to reject his participation. Finally, the lack of Earthlings volunteering to go meant that the team was in desperate need for any extra hands they could find.", "“Since I won't be a hindrance…”", "Seol Jihu pocketed the rudium. The significance of that action was pretty loud and clear. Ian could only form a wry chuckle.", "“So, you mean to come with us.”", "“I want to go.” ", "“You're truly an indecipherable fella…” ", "Ian shook his head helplessly.", "“If that's what you've decided, then I won't stop you. However, you need to be careful when we get there.” ", "He sighed in lamentation and returned his gaze back to the paper in front of him. Seol Jihu nodded his head to show that he got it.", "*", "Just as Cinzia had said – the message of her people finding the hideout located in the Arden mountain range arrived three days later. Ian confirmed the state of the magic circle via the communication crystal, took another thorough look at the plan again, and finally gave his go-ahead.", "There were six people they had to rescue.", "Richard Hugo, Level 4.\nAyase Yui, Level 5. \nEdward Dylan, Level 5.\nErica Lawrence, Level 6.\nIbrahim Ali, Level 5.\nTeresa Hussey, Level 5.", "The rescue team was quickly formed, but the number of people was kept down to six. This was simply because in case all six captives were rescued, they needed to consider the maximum weight limitation when trying to make their way back.", "Of course, the idea of splitting up the members to send them through the magic circle had been brought up, but that presented a problem. The issue was with the mana, or rather the lack of it.", "Ian calculated and then calculated some more for several days, and the number he came up at the end was six people. In all honesty, just trying to maintain the magic circle for 30 minutes was strenuous enough for him to worry about potential side effects on his physique. So he decided that, rather than eating into already-too-short mission time, they should minimize the number of people participating.", "And so, the rescue team consisted of Ian, tasked with activating and maintaining the transfer magic circle; Seol Jihu and Chohong, tasked with infiltration itself. The three remaining members included a Level 5 Archer acting as the header along with a Level 4 Warrior and a Priest. ", "Since the goal of the mission was clear, none of these people were pressured into participating. No, only those who volunteered were accepted. And those with deep personal connections to the captives, people determined to successfully carry out the rescue, had been chosen.", "Once the mission was green-lit, one or two people began showing a sense of urgency. However, Ian didn't rush things. Depending on circumstances, prompt actions had to be taken, but since he already tasted failure because of being hasty, he couldn't help but be even more cautious than before.", "So, several potential situations were thought up of based on the information Seol Jihu brought in, and only after enough number of simulations were run did the group depart for the Arden mountain range.", "*", "The hideout was nestled rather cleverly within one of the valleys of the mountain range. It was only as big as an okay-sized bachelor flat. Other than the square altar in the middle of the space with all sorts of geometric shapes carved on the top to create a magic circle, there wasn't anything of note in this room.", "Even if only six people were participating in the mission, the accompanying staff personnel were rather large in numbers. Since the conditions of the six captives were unknown, a camp was set up in case of a medical emergency. Not only that, an actual physician had been invited and several guards had been added to the group too, so the whole area had become rather bustling in no time at all.", "“Think of this magic circle as an automatic revolving door.”", "Ian opened his mouth to address the rescue team.", "“The moment it activates, the door will continue to slowly spin around. We need to finish our business within 30 minutes and return quickly. If not, the door will close, and we won't be able to return.”", "Once this door closed, you'd need 72 hours before it opened again. Everyone here had heard that countless times during the mission briefings until they felt almost fed up by it.", "“I was thinking of getting ready right about now. But, have you all prepared in your hearts?” ", "“Yes.” ", "The Archer tasked with the header's role replied.", "“What are you supposed to look for as soon as entering the lab?” ", "“Search the vicinity and choose between wait, stay hidden, or withdraw.” ", "“Very good. Remember, everyone. Regardless of your circumstances, if my own situation proves to be bad, I will not hesitate to return alone.” ", "Ian warned the group in no uncertain terms and took large strides deeper into the hideout. Then, he laboriously bent down.", "“It might take some time to activate the magic circle with my measly skills. So, you should loosen up and get yourselves ready. Ah, but don't wander off too far.” ", "Seol Jihu didn't move from the spot, though. Gripping the spear tightly, he stared deeply at the magic circle. The nervous tension he felt forced his heart to pound even harder, and he simply couldn't move.", "It was him who said he'd go. If he wanted to, he could back out now. But, rather than letting himself get swallowed up by the power of fear….", "'It's like I'm standing in front of the mission noticeboard again.' ", "While recalling the familiar memory, he activated 'Nine Eyes'. When he did, he got to witness the once ash-colored altar slowly change its hue.", "'It's yellow!' ", "Seol Jihu clenched his fist tightly. Of course, he knew very well to be just as cautious with 'Attention Required' as with any other colors. As its name implied, make one wrong move, and the color could change to orange, red, or even black in an instant.", "But, regardless, the color he could see right at this moment was yellow. Considering that he was about to step into the heart of the enemy's camp, this proved that the odds of success were not completely zero.", "He deactivated Nine Eyes and began firming up his resolve one more time. As he was doing that, though, a pale-faced man emitting cold, hostile air like there's no tomorrow approached him. He had run into this man multiple times during the strategy meetings.", "This man was a rather handsome fellow possessing a sharp countenance with a pair of affable eyes. Also, he just so happened to be the Level 5 Archer tasked with the role of the header.", "“Thanks.”", "He expressed his gratitude almost right away, leaving Seol Jihu to blink his eyes in confusion.", "“Thanks to you, I at least have a shot now. If we do rescue them, I'll properly express my gratitude then.” ", "“We're in the same boat, anyway. Don't worry about it. Someone important to you is on the other side?” ", "The Archer nodded his head at the youth's polite inquiry.", "“My younger sister, Ayase Yui.” ", "“You didn't go with her the first time?” ", "“I told her not to go from the get-go. But then, she got blinded by the number of contribution points on offer and ended up tagging along….” ", "The man's eyes narrowed to a slit. Huuu, He sighed softly and shook his head.", "“In any case. I'm taking on the role of the header of this rescue team, and Master Ian has taken on the leader role. But…. I plan to consider your opinion as much as ours as well.” ", "Seol Jihu didn't know how to reply and could only pucker his lips in an “Oh”. It was his first time meeting someone so refreshingly open like this.", "“You are the one who came to us with the plan, not to mention possessing the rudium, too. And I heard that you even contributed greatly during the battle of the Arden Fortress….”", "He continued to speak about this and that, before he took a look behind Seol Jihu and suddenly extended his hand.", "“My name's Ayase Kazuki. Let's do our best.”", "“I'm Seol.”", "Ayase Kazuki lightly shook hands with the youth and turned around to leave. Almost right away, there was a sound of fabric rustling behind Seol Jihu's back, so he sneaked a glance and his eyes opened up wider almost immediately. There was someone quite unexpected standing there.", "“M-Miss Agnes?”", "“In the end, you decided to go.” ", "Agnes was looking at him while somehow standing upright.", "“But, I thought… Weren't you still in recovery?” ", "“I've received a focused, intensive treatment, so I'm healed enough to take a stroll, at the least.” ", "Now that he took a closer look, she seemed to have improved a great deal than before. At the bare minimum, her entire body wasn't wrapped tightly in thick bandages anymore.", "“But, still. You haven't fully recovered yet. What if your wounds flare up again?”", "“There is a medical center set up in the camp, so you don't have to worry. Besides that….” ", "Agnes's eyes were narrowed, the glint within them getting sharper.", "“Are you really going?” ", "“Yes.”", "“You know that you can back out now if you wanted to, yes?” ", "“Even you're saying the same thing, Miss Agnes.”", "A wry smile formed on Seol Jihu's lips. The thing was, even though the participants had been decided a while ago, Chohong still gave enough hints of wanting to see him back out of this mission. She didn't come out straight and say it, but still, it was pretty easy to tell.", "“I'm just curious.” ", "Agnes slowly pushed her glasses back up her nose before carrying on.", "“Now that I think about it, you also did something similar back in the Neutral Zone.” ", "'I did?' ", "“But, why?” ", "In all honesty, even Seol Jihu himself had no confidence to answer that question clearly and concisely.", "He knew full well why others wanted him to back out of this mission. After all, it was far too difficult and dangerous for a Level 2 Warrior to take on. If it weren't for all his achievements so far, he'd not be able to get a foot in the door, regardless of being the original planner or not.", "Even after that point setting aside, what Agnes wished to know had more to do with his fundamental reason.", "For instance, Ian was participating because he felt responsible. Chohong was doing this because of loyalty. As for Ayase Kazuki, it was for his sister, and the other two participants all had their own personal reasons, too. They all had a reason to participate, even if that meant they had to put their lives on the line.", "“Since your rewards are guaranteed whether you go or not, it can't be about greed. And, you haven't been a part of Carpe Diem for as long as Chung Chohong, either. So, why did you volunteer for this mission?” ", "“Because I don't want to do that.”", "Seol Jihu threw that out there without much thought. Seeing Agnes's eyes grow larger, though, he realized his mistake and quickly continued on.", "“Well, I… I'm not sure. It's just that, Miss Agnes, what you said sounded like the beginning of a compromise.” ", "“That wasn't my intention. But, compromise isn't always bad.” ", "“Oh, no. It's just what I think. Don't mind me.” ", "He waved his hand around and mumbled something hastily. Even if it was Agnes, there was something he just couldn't bring himself to tell her.", "'….Because, my emotions are making me do it.'", "It was telling him to go.", "If he were to speak from his heart, then well, Seol Jihu hated making compromises. More specifically, he grew to hate the idea of it after experiencing that dream. It was all because of his gambling addiction.", "He knew that it was bad. He knew that he shouldn't be doing this. He knew that what he did was wrong. Even then – just one more time. Just one more time, and after that, one more time…. Didn't he become a broken mess in the end after making one compromise after another?", "Now was the same, too. He knew that he didn't really have to go. He knew that he had already done what was expected of him. He even knew that, if he were to keep stepping forward without realizing his own limits, then sooner rather than later, he might end up getting burned real bad.", "However, didn't Gula say it? The future was not that easy to change. That he'd have to go through unimaginable trials and tribulations. That he needed to exceed his own limits.", "He instinctively felt it. He felt that the moment he started thinking, 'Isn't it okay to back away since I've already done enough to create this situation? No one's going to look down on me now, right?', he'd soon be compromising himself once more.", "The first time would be difficult, but from the second time onwards, it'd get easier. If he kept reaching compromises every time he faced a situation similar to this one, then…. In the end, he'd go back to how he was. Such a thought strongly bubbled up in his head. This would be more or less like him drawing a line on the sand denoting his own limitations and not willing to cross it.", "And so, Seol Jihu decided to never reach a compromise with himself, at least with his emotions.", "Like now.", "“I don't want to live like that.” ", "Seol Jihu formed a refreshing smile.", "“That's what I think.” ", "“….”", "Agnes didn't seem wholly convinced. However, she wasn't going to dissuade him from going because of that. In the end, she quietly closed her eyes and accepted his explanation.", "“…I understand.” ", "A brief moment of silence later, she carried on.", "“If your mind is made up to that extent, then there is nothing more I can say.” ", "Agnes spoke in a serious tone of voice before abruptly lifting her top up.", "Seol Jihu was taken aback from the sudden strip show and was thrown into confusion, but then, a deep frown quickly formed on his face. Although new flesh was growing over it, seeing how deep the wound on her ribs still was, he could tell it must've been incredibly serious.", "“I didn't lose my hope even when the battle actually commenced.” ", "Agnes finally continued on after showing him the wound.", "“Several mutated Orcs tried to rush us, but they weren't difficult opponents at all.” ", "Agnes's tone sounded too neutral for an excuse. No, she was simply conveying what happened in a calm voice.", "“I can definitely be certain of one thing that, during the battle, I had never let my guard down once. Meaning, I had focused all my being to keep an eye out on our surroundings.” ", "Her voice became lower and hushed, causing Seol Jihu to inadvertently pay even more attention than before.", "“But, just one shot.” ", "Agnes spoke up to there and stopped.", "“…One shot… is it?” ", "Seol Jihu asked back, confused.", "“That's the best I can describe it.”", "Agnes shook her head.", "“I heard something similar to a gunshot, and everything before my eyes became 'white'. When I came to, there was this hole in my ribs.” ", "Agnes pointed to the wound. Seol Jihu swallowed his saliva.", "“I was able to barely stand back up thanks to the Priest's timely healing spell. But, even with a Colossal healing spell, the wound couldn't be healed completely. That attack made me feel the approach of death for the first time in a long while.” ", "“It couldn't be healed with a Colossal spell??” ", "The 'Cure Colossal Wounds' – a divine spell that perhaps best represented the Chief Priests, one of the High-rank classes available to the Priests walking on the paths of a specialized healer. It was an incredibly difficult spell that Maria actually collapsed from using it just once.", "But then, that very spell was used right after she was wounded and still didn't work? It was truly an unbelievable story.", "It was around then that he heard a bit of commotion. Rays of bright light were creeping along the floor, by his feet. Ian had finished activating the magic circle.", "“Looks like it's time for you to go.” ", "Agnes slowly lowered her top.", "“Thank you for your advice.” ", "“Please, do not forget. Be mindful of the unseen sniper.” ", "“I'll definitely keep that in mind. And I'll also see you 30 minutes later.” ", "Seol Jihu bade goodbye and hurriedly walked away. He grasped the large shield being handed to him and stepped into the glowing magic circle.", "Soon, four Warriors and an Archer holding large shields surrounded the Priest and the Jihu from the front, back, left, and right to form a protective formation. Ian slowly stood back up in the middle of the magic circle.", "“The preparations are complete. We will be transferring in 50 seconds, so if you have something to say, now should be a good time to do so.” ", "“Hey, stop trying to jinx us and let's get this show on the road already!” ", "Chohong angrily yelled out.", "More people came closer to the circle to spectate. Meanwhile, Seol Jihu began counting down in his mind. As he counted, he wasn't sure where to look, so he stared at Agnes. Her eyes of worry, something she was doing her best to mask, gave him a feeling of comfort for some reason.", "'41, 42….' ", "As the 50-second mark grew ever closer, the light emitted from the magic circle grew brighter and brighter.", "'47, 48.' ", "And a short while later….", "'49, 50!'", "Just as he finished counting to 50….", "Hwaaaahk!!", "The magic circle suddenly rotated and the world seemed to spin at the same time. Several swirling voices confused his hearing, and his vision was being dyed in pure whiteness. As the feeling of being endlessly sucked in overwhelmed his senses, he worked his butt off not to let go of the shield.", "Soon, though, the sensation of the spot below his navel suddenly being yanked down smacked him and then, everything around him darkened."]}