{"cid": "127", "title": "Chapter 127. Seol Jihu (4)", "content": ["Once the frightening conference came to an end, the following matters progressed smoothly.", "The 78 members of the majority were split into seven teams around the highly acclaimed organizations, while the 32 members of the minority were distributed evenly into each team.", "The organizers didn’t forget to split up Audrey Basler and the five members of her team, and once the six people to enter the Plaza of the Dissonant Wish were chosen, the preparation was over.", "Hugo was chosen from the Alliance team, and Oh Rahee was chosen to become the person in charge just as she wanted.", "Although missing a battle-specialized High Ranker and three Level 4s left a hole in their forces, there wasn’t anything they could do about it.", "Standing in front of the Plaza of Sacrifice, Seol Jihu pressed down on his chest. Focusing on his pounding heart, he collected his breath.", "He had only now taken the first step. To lead the participants to the scene he had drawn in his head, he had to overcome a few more obstacles.", "The first conquering of the Plaza of Sacrifice had to be achieved with as little damage as possible, and the six people entering the Plaza of the Dissonant Wish had to come back safely.", "It would be a lie to say he wasn’t worried, especially since he couldn’t manage everything directly.", "However, the die had been cast. Now, he had no choice but to believe.", "Seol Jihu stared at the 6-person group waiting in front of the Plaza of the Dissonant Wish before taking the lead and making his way into the hole in front of him.", "*", "All 104 people entered the Plaza of Sacrifice. Unlike the first time they entered it, they were organized into a formation.", "It was the result of a rule being established.", "The seven teams entered in order and marked the door they were put in charge of. Naturally, a circular defensive wall was created.", "Soon, the doors opened, and black shadows began to appear. The Archers who had their weapons pre-loaded immediately attacked, but their arrows failed to penetrate the edges of the arena.", "Gasps rang out when they fell to the ground after hitting what seemed to be an invisible wall. If the participants focus-fired the monsters as they were stepping out of the doors, the fight would definitely go much smoother. However, the Plaza of Sacrifice had cast an invisible barrier as if such a thing was not allowed.", "In the end, the participants had no choice but to watch the enemies leisurely walk out and surround the arena.", "Seol Jihu furrowed his brows when he caught sight of the monsters’ appearances. They were two meters tall, and the way they were full of muscles from head to toe, it felt wrong to simply describe them as muscular.", "The tendons on their log-sized neck bulged out, making anyone watching sigh. Colorful war paint adorned their faces, and tusk-like fangs protruded out from their mouth.", "At first glance, they looked similar to the mutant Orcs Seol Jihu had seen in the laboratory. However, the color of their skin was different. The mutant Orcs had ash-grey skin, while the monsters in front of them were painted green.", "“Orcs?” Kazuki’s voice rang out. With a rare, flustered face, he was unable to hide his nervousness.", "“Impossible. The Orcs went extinct more than 10 years ago….”", "The Orcs of Paradise once boasted a powerful tribal nation capable of easily overwhelming the human kingdoms. The race that had gone extinct after the fall of the Empire was alive?", "It was hard to believe, but the Orcs didn’t seem interested in waiting for them to collect their thoughts.", "Soldiers carrying adult-human-sized shields stepped out to the front. The ones carrying spears stood behind them, followed by Orcs carrying longbows.", "Two Orcs especially caught everyone’s attention. They were at least a head bigger than other Orc Warriors and boasted much bigger bodies.", "There was even an Orc wearing a flabby black robe while holding a faded wooden staff. Its long, white beard was especially telling of its aged wisdom.", "“Looks like we should assassinate that one first….”", "Seol Jihu could hear Kazuki’s murmur. While the young man was watching the Orcs march out into the arena, he suddenly felt something touching his back.", "“Seol.” Kazuki pointed at another door and quickly continued, “I want to send Chung Chohong to the Orc Champion. Will that be okay?”", "He seemed to be referring to the two giant Orcs. One had come out of the door the Alliance team was in charge of, while the other had come out from another door.", "The team in charge of that entrance consisted of several Level 4s but had no High Rankers. The teams were formed under the guideline of equally splitting up the 32 minority members, but since everyone agreed to move members around depending on the situation, sending Chohong over shouldn’t be a problem.", "However, Kazuki bothered to ask Seol Jihu, and Seol Jihu knew the reason.", "“What nonsense is that?”", "“If I remember correctly, Orc Champions are elite bodyguards of the Orc Lord, which rivals a Unique Ranker in power. At the very least, they should be as strong as Lioner heads, though they’re likely to be stronger.”", "“But why do I have to go? Why can’t you?”", "“Chohong.”", "Chohong was arguing with Kazuki when Seol Jihu’s soft voice made her pause.", "“No, I mean….”", "“We barely managed to grab this chance.”", "His somewhat desperate voice put her at a loss for words.", "“Please.”", "Chohong realized that this wasn’t the time to be stubborn. She let out a long sigh.", "“…I’ll come back as soon as I kill that bastard.”", "“You don’t have to.”", "“Why?”", "“Because Kazuki, the Priest, and I will kill ours first.”", "Hearing this, Chohong chuckled. She then turned to Audrey Basler, who was staring at the Orcs with a gloomy face.", "“Oi, come here.”", "“….”", "“Come here, I said…. Is there a worm stuck in your ear?”", "Chohong swung her hand angrily. Snake Eyes ended up being smacked in the head and looked back dumbfounded, but Chohong simply glared back.", "“Man, this bitch’s eyes get on my nerves every time I look at them. Hey, didn’t I tell you not to open your eyes like that?”", "Audrey Basler looked as if she had been wronged, but Seol Jihu ignored her plight and glared at her coldly. He saw it as a good chance for her to walk in her victims’ shoes. Perhaps she might learn how the 32 minority members felt from the insensitive remark she made at the conference.", "“Remember. I’m in charge of you until the end of the Banquet.” Chohong growled before quickly taking off with the back of Snake Eyes’ neck in her hand. Soon, two people came over to the alliance team in exchange - the white headband girl’s nameless older brother and a lean young man with a bow.", "“Thank you. Things were looking dark for us…. Thank you so much.” The male Archer bowed his head and expressed his gratitude. He seemed to be touched because a High Ranker specialized in battle had been sent to help them.", "Once the team members successfully switched, Seol Jihu quickly returned to analyzing the situation. The enemies seemed to have finished coming out as the plaza doors were closed.", "He could count around 120 Orcs, which was fewer in number compared to the 150 Lioners the participants had to face. However, considering that the plaza’s difficulty should be the same, this wasn’t something to be happy about.", "Unlike the Lioners that continuously charged in, each Orc was equipped with dazzling armor, and the group was marching uniformly like a well-trained army.", "When the old, robed Orc standing in the middle waved his staff left and right, the white part of the Orc’s eyes turned crimson and drool began to flow down from their mouth.", "Their already-vicious faces became a step thicker with belligerence, and they began to strike the ground while roaring out.", "The Orc Champions raised battle-axes in each of their hands and opened their mouths wide.", "KUOOOOOOOO!KUOOOOOOOO!", "Two terrifying howls resounded in the plaza. Because of the enclosed area, the Orc Champions’ roars echoed frighteningly. Just their screams delivered an ear-splitting and skin-slicing pain, causing everyone to scowl. Because of the endlessly continuing howls, a few people even failed to carry their weight and staggered.", "Seol Jihu furrowed his brows at the unpleasant sensation of his brain shaking. But in the next moment, he found his mind and body calming down.", "This wasn’t because of his Ice Spear’s calming effect. What he was feeling wasn’t the spear shaft’s coldness. Instead, a warm energy was traveling through him and soothed his tense body.", "Seol Jihu let out the breath he had been holding in. Then, he heard a soft chant. Turning around subconsciously, he saw the robed Priest reaching out toward him and chanting quietly.", "The howls stopped. Seol Jihu realized that the invisible barrier disappeared.", "“They’re coming,” Kazuki muttered briefly.", "Immediately, the Orc Archers all raised their bows and nocked their arrows. In return, the human Archers fired their arrows, as if they had been waiting for this moment.", "The arrows from each side crossed paths before raining down like a sudden shower.", "The Orcs all got on one knee behind their shields, while the Priests also cast the barrier they had readied. As both sides had been prepared for this exchange, none got injured.", "However, this was only the signal for the start of battle.", "Krrrrrng! Orc Warriors shot up as the Orc Champions raised their war battle-axes. When they began to march forward, maintaining their initial formation, the humans also roared and shot forward.", "Finally, a seven-front battle started.", "In front of Seol Jihu were 18 Orcs. After running in with his shield out in front, he extended his spear at the nearing Orcs.", "Before his spear made contact, one Orc Warrior tilted its shield slightly, parrying the attack and pushing the spear away. Seol Jihu was startled by the Orc’s delicate technique but soon regained his composure.", "He might have let go of his spear in the past, but he was different now.", "He grit his teeth, tightened his grip on the spear shaft, and swung down.", "Chweeeek! When the blade of his spear severed the Orc’s helmeted head in half, the Orc dropped his shield. However, before he could enjoy the pleasant sensation on his hand, several spears flew forward from behind the falling Orc.", "Seol Jihu was about to quickly fall back when several small disks radiating white light covered him, and they flung away the spears that were about to skewer him. Even Seol Jihu was surprised when he saw this.", "That had been the first time he saw so many barriers generated at once.", "That wasn’t all. The Orcs that were about to attack again froze.", "‘Movement freezing!’", "Seol Jihu didn’t miss this opportunity. He stabbed his spear into the neck of a struggling Orc, and then sliced off the head of a teeth-bearing Orc standing next to it.", "Even as he continued to swing his spear, he couldn’t hide his shock. The barriers were one thing, but fighting such powerful Orcs for a long period of time seemed impossible without a terrifying amount of mana.", "‘As long as they stay like this….’", "There was no easier target than one frozen still. Seol Jihu accurately aimed for their vital spots, and the once-confident Orcs dropped like flies.", "Seol Jihu had sent four Orcs to the River Styx just like that, but his attacking paused in the next moment.", "It wasn’t that something happened to him.", "He only felt a stimulating glare. However, that was enough to make him feel a terrifying pressure.", "He quickly fell back, distancing himself from the Orcs. As soon as he looked around, his body froze stiff.", "From nearby, the Orc Champion was staring at him fixedly. Now that he was looking at it up close, it looked even bigger than before.", "Right, the pressure it gave off was truly overwhelming.", "It felt like just staring at it made his bladder crumple up. Moreover, its crimson eyes dyed in madness retained great curiosity at the human warrior slaughtering its subordinates.", "The monster grinned and pointed its dual battle-axes at him. Seol Jihu reflexively raised his spear. Next, the Orc Champion took a step forward. It was then—", "Boom-!", "From a single leap, an air-severing sound exploded out. In a split second, the Orc Champion got within an arm’s reach of Seol Jihu. It spread its arms out and leapt forward like a leopard.", "Kakang, kakang! Sharp noises struck his ears. Terrified out of his senses, Seol Jihu darted back before even figuring out what happened.", "No, it was more correct to say he was ‘pushed back’.", "‘How?’", "However, the Orc Champion continued to charge forward as if it refused to give the young man any time to think. What drove Seol Jihu even crazier was that he was retreating in a straight line, while the Orc Champion was chasing him in a zigzag. Even so, the distance between them wasn’t getting any wider.", "The Orc Champion’s movements didn’t suit its huge body at all.", "Taking irregular footsteps left and right, it struck with its dual axes haphazardly. The constant flashing of the axes made Seol Jihu’s mind reel.", "‘Keuk!’", "He put strength into his eyes and barely managed to grasp the situation. The white disks had protected his body multiple times from the Orc Champion’s lethal attacks. When he thought about how he would be minced meat without the white disks, he felt a chill run down his back.", "‘He’s strong.’", "Krrrr!", "The monster suddenly stopped charging and turned its dissatisfied gaze to the center. It knew it could have finished off the human warrior. Since the white disks were hindering it at crucial moments, it couldn’t help but get irritated.", "When it turned back to Seol Jihu again, it wore an apathetic expression like it was looking at a small fry. Almost as if it was done with Seol Jihu with the previous exchange, it frowned with a bothersome look before letting out a short roar.", "Wiing, wiing, wiing! Blade-like winds shot out from the battle-axe in its right hand. Just as Seol Jihu barely fixed his posture, he felt himself trembling from the sharp wind.", "He shook off his fear with effort and focused on the enemy in front of him.", "But how was he supposed to beat it?", "The difference in their physical level didn’t need to be mentioned, and he could hardly read its attacks. Still, he refused to be pushed around endlessly.", "Thud, thud. Seeing the giant body running forward, he summoned the Blessing of the Circum and, with a side-step, extended his spear in a sweeping manner. He planned to use the Orc Champion’s straight charge against itself, but the Orc Champion perked up its brows and snorted.", "Thwack!", "The moment a dull impact struck the spear shaft, Seol Jihu’s arms were pushed backward along with his body.", "He was stunned, both physically and mentally.", "Never mind the pain seemingly tearing his hands apart; it wasn’t as if he let his guard down. He had given it his all. But a single, terrifying blow had paralyzed his arms and left his mind stunned.", "Then, before he could do anything…", "Boom!", "An explosive sound rang out on his face."]}