{"cid": "401", "title": "Chapter 401. To Change (3)", "content": ["Eva’s queen used the Royal Oath and received the authority to modify Earthlings’ status windows.", "This news spread through every city in less than two days, turning them upside down.", "As Earthlings were used to a freedom that came without any cost, they were all dumbfounded by the news.", "They were happily watching the fire from across the river, so it was no surprise that they were confused when the fire suddenly spread across the river and swept over them.", "Of course, the ones who reacted the strongest were the Earthlings within Eva.", "Despite Charlotte Aria’s strong declaration, they did not back down so easily. They mobbed the palace and protested every day.", "A small minority wondered if there would be a repetition of the past Haramark Civil War.", "However, their worry turned out to be unfounded.", "While it was true that the Haramark Royal Family once attempted to do the same and failed to suppress the backlash of angry Earthlings, the current situation was totally different than the past.", "Haramark in those days did not have a single backer and was surrounded by enemies on all sides. In contrast, the current Eva had the support of Paradise’s strongest organization, as well as a group of other supporting organizations.", "That wasn’t all. Influential organizations of other cities were maintaining their silence.", "Faced with this news, which was like a bolt out of the blue, ordinary Earthlings could say nothing to change the situation.", "At the end of the day, they were reaping what they sowed.", "They remained silent when Carpe Diem was attacked by an unknown group in the past.", "They remained silent when Valhalla attacked Paradise’s influential organizations.", "And now, they were being attacked, but no one was left to stand up for them.", "“Fuck!”", "A man had gone to the royal palace to protest and complain today as well, but after being chased out without any gain, he threw his weapon on the ground angrily.", "He wanted to storm back in, strangle the queen, and force her to undo the changes, but he knew too well that his neck would be sent flying into the air the moment he stepped another foot into the palace.", "The man sighed and glanced at the people who had gone to protest alongside him.", "Today, there was a red-haired woman on duty, spinning a longsword in her hand while carefully watching their every move. Her eyes were gleaming with anticipation as she swallowed her saliva and watched just when they would cross the line.", "They were warned that if they came to bother the queen again with this problem, they would be made as examples of her new authority.", "It seemed like they had no choice but to accept this new change.", "“…What should we do?”", "Someone asked in a restless voice.", "There were at least a couple dozen people in the group, but no one was speaking out.", "“…I guess we have no choice.”", "After a long silence, the man spoke helplessly with a dejected expression.", "It really didn’t seem like there was anything they could do to change the situation.", "It was then.", "“What was that?”", "A grumbling man spoke curtly.", "“If they’re going to go ahead with this, then why don’t we show them!?”", "“Show them?”", "“Are you just going to sit still and do nothing? We’ve gotta at least show them that we aren’t retards!”", "People’s eyes widened at the man’s outburst.", "“It’s not like Eva is the only city!”", "The man snorted.", "In a way, he was right. It wasn’t like they were members of an organization that was rooted in Eva. Individual Earthlings that lived like vagabonds in inns could easily move to another city without incurring a huge loss.", "If they didn’t like Eva and its new change, they could simply leave it.", "In truth, they knew that Charlotte Aria wasn’t wrong. However, having something taken away always felt shitty. And when that something was a right they had been enjoying for free, they might understand with their heads but their feelings couldn’t accept it.", "“Yeah! Why don’t we leave then!? Let them be happy on their own!”", "When one person agreed in a fit of anger, other people began to agree as well.", "“That’s right! If you can’t stand the heat, you just have to get out of the kitchen!”", "“Let them beat the drum all they want! See if we care!”", "“Hear, hear! Let’s show them that even a worm will turn if you step on them!”", "“They must think we’re dogs that will bark at their every command! What was that? Leave? That brat, does she think we won’t!?”", "People began to buzz, determined to leave Eva.", "A few of the more impatient ones immediately went back, packed their belongings, and signed contracts with carriages.", "Many Earthlings must have found the change unacceptable as there were hundreds of people who were loading their bags onto carriages.", "“Valhalla’s representative sure is a rookie.”", "A man got in a carriage and remarked with a relieved look.", "“He’s the perfect example of a child who grabbed hold of power by chance.”", "“Yeah. Who cares if you’re strong? Does he think the royal families did nothing until now because they’re idiots?”", "A man who got in the carriage with him commented as well.", "“Just when people were starting to cheer him on, he does this. Anyway, I’m sure Scheherazade will be full of people from now on.”", "“Aye, it’s better to be with traitors than to live as slaves.”", "“I can’t wait until next week comes around! The city will be empty! And only the cold wind will blow on the streets!”", "“Who knows? Maybe he’ll beg us to return! We’re sorry. We’ll withdraw the new changes, so please!”", "“Hell, I’m going to need more than that to change my mind. Ah, maybe if the Star of Lust lets me have my way with her!”", "Boisterous laughter burst out from the running carriage.", "Feeling better from having vented their rage, the man opened the carriage door.", "“Aigoo, Eva, this is goodbye.”", "After muttering in a carefree manner with his head peeking out, he looked back.", "It was then.", "“…Huh?”", "The man exclaimed as he stared at the city that had now become a tiny dot.", "“W-What the heck is that?”", "He shouted with a look of disbelief.", "“Hmm? What’s up?”", "“W-Wait! Stop the carriage!”", "“What’s wrong?”", "The other man peeked his head out of the carriage and stared in the same direction as the first man.", "Then, he made the same dumbfounded face.", "“That’s…”", "There was a long march where the two men were staring.", "“Fallen Angels, Cave Fairies, Sky Fairies, Beastmen, and Dwarves…?”", "“W-Why is the Federation here?”", "Indeed, the members of the Federation were marching in a long line.", "A long, endless line was headed towards Eva.", "One of the men activated the Archer class’ basic skill, Thousand-Mile Eyes, and saw the foreign races laughing and chatting in an excited manner.", "At the very least, it didn’t look like they were coming to seize a city.", "They looked more like a large-scale delegation that was on a cultural mission to establish friendly relations.", "“W-What the hell’s going on?”", "“Oi! Turn the carriage back! Hurry!”", "A strange phenomenon occurred.", "Carriages that left the city turned around and began to return one by one.", "*", "“Mmm! Euhmm!”", "Charlotte Aria collapsed as soon as she returned to the palace after using the Royal Oath at the temple. Perhaps because she completely expended her mental energy, her body burned with a high fever for two days.", "Seol Jihu was protecting her by her side, nursing her all throughout the night.", "“Mm! Mmmmm!”", "Drenched in sweat like someone doused in rainwater, she trembled like a leaf in a storm.", "Seol Jihu soaked a towel with water before wringing the water out and carefully wiping Charlotte Aria’s forehead.", "“I’m… sorry….”", "Charlotte Aria muttered weakly as if she was ashamed of showing such a weak appearance.", "Seol Jihu smiled silently.", "“I…”", "Charlotte Aria panted with hot breaths and then asked carefully.", "“How was I…?”", "“?”", "“Did I… do well…?”", "“…It would be presumptuous for me to say.”", "“I-It’s fine… so tell me…”", "Seol Jihu smiled brightly and brought his face closer to Charlotte Aria’s.", "“You were incredibly cool.”", "He whispered into her ears.", "“And sexy.”", "…Sexy? As in, beautiful to the point of provoking sexual pleasure?", "Pong! White steam popped out of Charlotte Aria’s ears.", "“I-Insolent…! You dare to talk to a queen that way…”", "Charlotte Aria’s face flushed red, and she covered herself up with her blanket.", "Seol Jihu laughed quietly.", "At that moment, a messenger came with news of the Federation’s arrival in Eva.", "However, Seol Jihu did not leave right away.", "He stayed by Charlotte Aria’s side and gently caressed the blanket where her head should be placed.", "“You can go if you want…”", "Feeling his touch, Charlotte Aria peeked her head out of the blanket and murmured quietly.", "Seol Jihu only chuckled and continued moving his hand.", "“Why are you laughing…”", "Charlotte Aria pouted but closed her eyes at his gentle touch. Soon, her small nose let out faint breathing sounds.", "One hour later, Seol Jihu slowly took his hand off and got up.", "Was Roselle praising her in the Dream World?", "Seeing Charlotte Aria grinning happily in her sleep, Seol Jihu quietly closed the door.", "*", "Members of the Federation visited a human city.", "The goal of the visit…", "[First, as of today, Eva will formulate a restoration of relationships with the Federation.]", "[Going beyond a simple alliance, Eva will become a pillar of support for Tigol Fortress and take on the role of mutual assistance with the Federation.]", "…was the fortification of Eva.", "Going a step further, it was to discuss the cornerstone of the Federation and humanity’s permanent partnership.", "Here in this city called Eva.", "The Federation’s greatest advantage was the existence of the powerful Tigol Fortress, but it was also their greatest weakness.", "Though it wasn’t as if their other borders weren’t secure, they weren’t as fortified as Tigol Fortress.", "In other words, the moment Tigol Fortress fell, it would only be a matter of time before the Federation’s entire territory would be captured. This would naturally bring about a huge disaster to humanity by expanding their battlefront.", "This wouldn’t be a problem if Tigol Fortress was truly an impregnable wall, but Tigol Fortress had already been captured once. Judging this issue to be of high priority, the Federation’s upper echelon had made a request to Seol Jihu after the end of the war one year ago.", "They wanted to inquire about fortifying Eva to the level of Tigol Fortress and establishing a mutually cooperative relationship so that they would have a safe place to retreat to, should Tigol Fortress be conquered again.", "Of course, Seol Jihu had no reason to reject their offer.", "He was already concerned with how obsessed the Parasite Queen was in trying to take over Tigol Fortress. It didn’t seem like a bad idea to take this opportunity and make sure she would not even dream of touching Tigol Fortress.", "In fact, he saw this as a necessity.", "And with things turning out this way, Eva’s Earthlings leaving the city was none of his concern.", "Because even without them, the foreign races would live in Eva alongside humanity. And he knew very well that such cowardly Earthlings were far weaker and disloyal than the foreign races, who were brimming with hatred against the Parasites.", "It wasn’t just Eva either.", "Other cities would soon repeat Eva’s proclamation, and members of the Federation would go to those cities as well.", "And so, Scheherazade would have to make a decision.", "Either to lower their head and follow the trend or…", "‘To be destroyed.’", "Seol Jihu walked while humming inwardly.", "The welcoming ceremony must have ended while he was putting Charlotte Aria to sleep as he could see several foreign races walking about.", "“Is this where we’re going to live from now on?”", "“Un! It’ll be much safer here!”", "“Uwoah!”", "Two young Foxmen were holding each other’s hand and exclaiming with hopeful looks.", "Upon closer look, Seol Jihu noticed they were Haeryeo and Haeya.", "He felt strange seeing members of the Federation running around inside a human city.", "People who did not know of the background story stared at them in a daze, and people who knew it came out to the streets and greeted the Federation members.", "It was like he was seeing a repeat of the festival at Tigol Fortress the night before they left.", "Just as Seol Jihu smiled contentedly, his eyes shot open.", "“Ah…!”", "He saw a striped puppy crossing the streets with its chin and tail standing tall. It seemed like it was enjoying being at the center of attention.", "Behind this striped puppy was a group of six white and yellow rice cakes.", "“P-Puppy!”", "“…Kiing?”", "They must have noticed Seol Jihu as they flinched.", "They then twinkled their tiny, bean-like eyes, stuck out their tongues, and came running while wagging their tails.", "Spin, spin. As the little fuzzballs began to circle around Seol Jihu’s legs, Seol Jihu’s eyes spun as well.", "When the black-striped rice cake stood on its hind legs and nudged his calf, he couldn’t help himself any longer.", "“Ya little nuggets!”", "Who told you to be so cute!? Seol Jihu shouted inwardly before instantly bending down and hugging the tiny fuzzballs that were hopping around in joy.", "“I wanted to see you guys so much! You have no idea how much I missed your fur and fat.”", "Fur? Fat? The little fuzzballs tilted their heads, but seeing how delighted Seol Jihu was to see them, they licked his face.", "While they were rubbing their faces together, a dry cough rang out.", "“Yo.”", "A largely built foreign race individual with a mane around his face, the Beastman King White Tiger, raised his hand and gave an awkward greeting.", "Seol Jihu turned his face, which was still buried in the fuzzballs, and sent the Beastman King a fierce glance.", "“…I have a favor to ask of you.”", "“It’s been a… hmm?”", "“Can I hold onto these guys for a bit? It’s fine even if it’s only when I sleep!”", "White Tiger blinked in a fluster. Then…", "“…Hoh, how bold.”", "He looked like he was impressed.", "“To say such a thing on sight… Hmm, I suppose it’s okay. As a hero and a male, such spirit is only natural! Fine! I shall allow you to sleep with my daughter!”", "White Tiger guffawed joyfully.", "“I’m not a particularly strict parent anyway. But try to hold off for a few months. I want to see my grandkids too, but you should wait at least until she reaches adulthood….”", "Seol Jihu had no idea what was going on, but he was happy to know that he could stay with the little fuzzballs.", "“You’re getting ready to mate so soon?”", "At that moment, Gabriel appeared while throwing her silver hair back.", "“Ah.”", "Seol Jihu finally came to his senses, though he held onto the struggling fuzzballs tighter.", "“Welcome.”", "“It’s been about an hour since we arrived.”", "“I should have come out to greet you… Sorry. The queen is a little sick.”", "“It’s fine. Eva’s royal administrator treated us well. I saw her speech too. To be honest, it made me see her in a new light. Tell her it was an excellent speech befitting of the position of queen.”", "Gabriel smiled.", "“Anyway, thank you. It was getting crowded. There’s finally some space to breathe.”", "Right, the Federation’s territory was smallest among Paradise’s three forces.", "Five races were living together in what should only be enough for only one or two races to live in, so it was impossible for the Federation not to be crowded.", "The Beastman race had once decreased in population to the point that extinction was a real concern, but thanks to a few species being so fertile, they had regained their past prosperity to a degree.", "Only, the period between pregnancy and birth wasn’t long, and a single mother might give birth to eight or even twelve babies at once.", "Since Beastmen grew quickly, it was good for the Federation which was in need of soldiers, but as there had been no serious wars for the past year, they had been in need of new territory to handle their exploding population.", "“Anyway, if you’re that sorry, just open a few more cities for us later.”", "Gabriel smiled.", "“Don’t worry. There’s a great place called Haramark.”", "“Haramark isn’t bad. Though, we should first properly settle into Eva and show that we can be of help… Hmm.”", "Gabriel smacked her lips in the middle of talking.", "Seol Jihu tilted his head.", "“Why? Is there a problem?”", "“I wouldn’t call it a problem… but I do need to ask for your understanding.”", "Gabriel smiled bitterly and explained.", "Once she finished, Seol Jihu hurriedly walked to Valhalla’s building, where he saw a group of stumpy people gathered together.", "It was the Dwarves.", "They all had uncomfortable looks on their faces.", "Vidalif, the Dwarven King, was especially so. He wasn’t just showing his displeasure.", "He was looking around in all directions with a bright face while his hands were shaking uncontrollably like a patient with an obsessive-compulsive disorder.", "‘Was he like that before?’", "Seol Jihu recalled Vidalif being calm and collected at the meeting.", "“Ah! There he comes!”", "A few of the Dwarves who recognized Seol Jihu ran up.", "“O Hero, our king is furious!”", "“What happened? Did someone do something?”", "“No, no, our king is angry because of this city!”", "The Dwarf shook his head.", "“Pardon my manners, but those city walls and this building… How can you build them like this?”", "“….”", "“How… Just how….”", "Seeing how much they were at a loss for words, it seemed they received quite a culture shock from seeing buildings that humans built.", "Next, the Dwarf grabbed Seol Jihu’s arms and pleaded.", "“Could this building be where our hero lives?”", "Seol Jihu nodded his head unwittingly.", "“Oh no… Then may we ask for a favor?”", "“A favor?”", "“Let us remodel his building!”", "The Dwarf shouted.", "“With a building of this size, it should only take us a few days! So please!”", "“….”", "“We understand that we might be coming off as unreasonable, but please try to understand our side. We, especially our king, are of the mindset that everything that is handmade should be perfect…!”", "From what Gabriel said, the Dwarves were a race that, if three white bricks were aligned when building the left wall, they would not be content until the right side was also aligned with three white bricks, all without the slightest error.", "Despite the sudden request, Seol Jihu put on a serious face. He empathized with Vidalif.", "He also measured exactly 550mL of water when making ramen. Not even 550.0001mL was acceptable. He measured 550mL with pinpoint accuracy.", "This was the spirit of a master craftsman.", "Though it might not seem like much, insignificant details were often the difference between an average creation and a masterpiece.", "When it came to making noodles, Seol Jihu’s talent went beyond a simple genius to the level of an ‘extraordinary genius’. As such, he could empathize with Vidalif, who was titled God’s Blacksmith.", "“…It would be my honor.”", "“Thank you!”", "The Dwarf’s complexion instantly brightened, and he turned around in a hurry.", "Soon, Vidalif extended his hand out like a general commanding his men to charge forward.", "“Uwaaaaaah!”", "“Iyaaaaaah!”", "The entourage of Dwarves took out their tools and charged toward Valhalla’s building, roaring.", "Clank, clank! Swinging their tools at frightening speeds, they began to remodel the building as if to destroy something that should not exist in this world.", "“W-What’s going on?”", "Phi Sora rushed out with her longsword at the sudden warcry and looked around.", "Sssk, sssk! Seeing the Dwarves starting their remodeling from the garden, she made a dumbfounded face.", "“We’re in the process of fortifying Eva.”", "Seol Jihu spoke casually.", "“Huh? I thought you were going to repair the walls or something.”", "“Buildings also. We’re going to modify all buildings into ancient golems that can fight in times of emergency.”", "“What? This is the first time I’ve heard of this… Is that even possible?”", "“Think of Tigol Fortress’ structure. Their entire walls can move. What’s to say the Federation can’t create some golems?”", "“Ah! Now that you mention it…”", "Phi Sora stamped her left palm with her right fist.", "Seol Jihu glanced at her awkwardly.", "She was just too easy to trick.", "“With this, Valhalla’s building will be going through an evolution! All we have to do is watch.”", "Seol Jihu spoke solemnly. Then—", "“Anyway, they said it won’t take long. Why don’t we enjoy these guys and wait.”", "He grabbed one of the fuzzballs in his embrace and chomped down on its plump stomach.", "“Kiing!”", "“Hmm….”", "A satisfied smile bloomed on Seol Jihu’s face.", "This was the taste he had been longing for!", "As Seol Jihu nibbled, the striped fuzzball flailed from being tickled.", "“…What are you doing?”", "Phi Sora looked at him weirdly, and Seol Jihu handed her a yellow rice cake.", "“Try biting down. They’re delicious.”", "“Delicious…? What? You’re going to incur divine punishment.”", "Phi Sora took the yellow rice cake in bewilderment and blinked.", "Who are you? The little fuzzball was panting while twinkling its curious black eyes. She had to admit, it was adorable.", "When she came to her senses, she found herself lightly biting down on the fuzzball’s fluffy yellow fur.", "“Oh?”", "Phi Sora’s eyes widened.", "“T-This is great. So soft and warm like a rice cake you just took out of the steamer…”", "“Right? It’s the kind of taste you want to hold onto at all times.”", "Seol Jihu bit down on a white rice cake that was squirming to save its friend.", "Pffffffft! Meanwhile, Phi Sora blew on the yellow rice cake’s stomach.", "“Kiing….”", "The white and yellow rice cakes shook strongly before drooping down like rags."]}