{"cid": "122", "title": "Chapter 122. Timing Game (2)", "content": ["The sand fell down much quicker than Seol Jihu anticipated. No, it actually wasn’t all that different from a normal hourglass. But because of the sudden turn of events, everything seemed more urgent.", "As the silence continued to stretch, everyone studied each other carefully. There wasn’t a single person here who didn’t understand the conditions. Every single one of them was on the lookout for any sort of change.", "A full minute went by as everyone stood idly. The sand had already fallen to the point where it was starting to be noticeable.", "“Damn!”", "“Fuck….”", "All sorts of grunts flowed out. People’s contorted faces distorted even further, to the point where they began to look like demons.", "The conditions were shitty enough by themselves, but there was even a time limit? Whoever created this stage had to be screwing with the participants on purpose. Otherwise, would they have needed to force the situation this much?", "In any case, about a tenth of the sand had already trickled down. In other words, they had to make some sort of a decision in the next nine minutes.", "Eventually, someone who wasn’t able to stand the tension spoke up, “Everyone go in!”", "With a woman’s shout as the starting point, the once silent plain became noisy.", "“It says at least six people need to enter. There is no limit on the number of people that can enter!”", "The woman was suggesting that everyone work together to conquer the Plaza of Sacrifice. It was the fairest method given the situation they were in.", "However, this argument was only agreeable on the surface. It was difficult to expect all 166 people to come to an agreement with the same intention.", "“Mm…. All of us going in is a bit….” A man standing near the woman rubbed his chin. “Only six people need to go in to activate the plaza. Wouldn’t it be better to pick six people to enter the left pit and have others enter the Plaza of the Dissonant Wish…?”", "The man's argument was also reasonable. However, it was too idealistic.", "“Then how are you going to select the six people to enter the Plaza of the Dissonant Wish?”", "“Well….” The man tried to say something but stopped and blinked repeatedly.", "The woman clenched her teeth with an irritated look. “…That’s not all.” Perhaps because of her clenched teeth, a suppressed voice rang out. “We know that the Plaza of Sacrifice has a ‘static’ difficulty, but we won’t know whether it’s a 1 or a 100 until someone goes in. Unless someone wants to volunteer, it’s fair for everyone to go in.”", "“….”", "“So let’s do that first. We’ll need to confirm the difficulty before we can decide on anything.”", "The man couldn’t say anything at the woman’s strong assertion. Although he found the idea difficult to swallow, he couldn’t think of anything to say because the argument was logical.", "“Then….”", "“We won’t be going in.” At that moment, another man spoke up. The woman frowned as she restlessly checked the hourglass.", "“God damn it…. Can’t you see that hourglass? We have to hurry!”", "“Why would we go in when we don’t have a reason to?”", "When the man didn’t back down and fought back, the woman became stunned.", "“What? You say you don’t have a reason to go in?”", "“Yep. I and the three guys behind me came to quit after Stage 2 anyways.” The man spoke with commanding confidence. “The four of us will return to Paradise after getting the Dissonant Wish. We’re not interested in Stage 3 at all. The ones who are can fight or join hands or whatever. That’s none of our concern.”", "He looked around to the left and right, and his three comrades nodded their heads in agreement. Some people also pitched in, agreeing with the man’s sentiment.", "The man wasn’t wrong in thinking this way either. After all, people had their own reasons for participating in the Banquet.", "A vast majority of people wanted to get to Stage 3 to obtain the ‘Harmonious Wish’, but there were quite a few who knew their place and wanted to stop after Stage 2.", "As such, ‘those who want to go to Stage 3 can work things out, and leave out the ones who want to quit after Stage 2,’ was a valid argument.", "“You’re hilarious.”", "Only if Stage 2’s exit was separate.", "Oh Rahee stared at the man who announced nonparticipation with a mocking smile.", "“You say that after reading the conditions…. Are you boasting how retarded you are?”", "Just like Oh Rahee pointed out, for the man’s argument to stand, the exit to Paradise and Stage 3 had to be separate. In addition, there had to be a way to monitor which exit one took.", "The problem was that neither of these requirements was satisfied.", "[Stepping on the red portal on top of the altar will transport the challenger to Stage 3 or Paradise…]", "‘Or’ was the keyword. Since there was no way to tell where the participant would end up after stepping on the red portal, the people who were aiming to enter Stage 3 would never just sit by.", "“Interesting. How did a brainless monkey like you pass Stage 1?”", "“What did you say!?”", "Oh Rahee’s unique, condescending manner of speech enraged the man who was speaking triumphantly.", "“Say that again, you motherfucking whore….” Muttering with a grim face, he attempted to create a hostile atmosphere. However….", "“Uuup!” Oh Rahee moved like the wind and blocked the man’s mouth with her left hand.", "“Whore?”", "“Uuuuup!”", "She curled her fingers until the man’s cheeks sunk in. Next, she slowly raised him into the air. A bizarre scene played out of a burly man being held up by a slender woman.", "“What do you think you’re—”", "One of the man’s comrades quickly took out his bow and arrow, but… Clang! He couldn’t finish his sentence either.", "Oh Rahee’s right hand moved like a bolt of lightning and sent his bow flying. The Archer who was about to nock his arrow stared at the longsword in her right hand and became stunned.", "Oh Rahee snorted as if she found them to be a joke before looking back up at the man in her left hand.", "“If you’re going to be shameless, be more subtle about it. Seeing you act so proud makes people angry.”", "“Uuuuk!”", "The man’s struggling feet slowed down as if Oh Rahee’s glaring eyes had drained him of all energy.", "“Do you want to shut up and enter? Or do you want to think again after I break your chin?”", "When she released a little bit of her strength, the man became relieved of the terrifying pressure and could finally breathe again. He coughed a few times before barely managing to collect his breath. With a face stained with fury, he opened his mouth, “You…!”", "“Ah, whatever.” Oh Rahee grinned. “A beast that doesn’t listen just needs to be beaten a few times.” She grabbed his face again before stomping toward the Plaza of Sacrifice and extending her arm above the pit.", "“Go in there and wait, little doggy.”", "“Mmmp! Mmmmmp!”", "“You sure know how to bark~”", "The moment she let go, he would fall into the pit without a doubt. The man struggled desperately as if his life depended on it. However, Oh Rahee remained unmoving.", "Seol Jihu swallowed his saliva as he watched the man flail helplessly. Despite Oh Rahee going so far, no one stepped up to stop her. The man’s comrades only watched in a daze, and others who previously agreed with the man fell silent.", "Oh Rahee couldn’t be the strongest of the 166 people here. There had to be someone who could contend with her. But since there was no way an Earthling of such caliber wasn’t aiming for Stage 3, not stopping Oh Rahee could be taken as a silent sign of agreement.", "‘Still….’", "[Oh Rahee’s Status Window]Summoned Date: 2015. 09. 18Marking Grade: BronzeSex/Age: Female/25Height/Weight: 168.8cm/54.2kgCurrent Condition: HealthyClass: Lv 5. Imperial ChevalierNationality: Korea (Area 1)Affiliation: Blood LineAlias: Top Graduate, Cunt, One Slash Killer, Blue-eyed Sword Demon", "[3. Physical Level]Strength: Intermediate (High)Endurance: Intermediate (Low)Agility: High (Low)Stamina: Intermediate (High)Mana: Intermediate (Intermediate)Luck: Low (High)", "Remaining Ability Points: 2", "[4. Abilities]1. Innate Abilities (0)2. Class Abilities (6)—Heart and Soul [Intermediate (High)]3. Other Abilities (2)", "After checking Oh Rahee’s Status Window with the color of observation, he finally understood why she was so confident. Her physical stats and abilities were extraordinary. Seol Jihu was drawn to her Class Ability, Heart and Soul, the most.", "It seemed like an ability that couldn’t be acquired through contribution points.", "‘Maybe, she is one of the ‘true’ High Rankers Master Jang mentioned.’", "Seol Jihu realized just how great of a monster he worked with in Stage 1. It was then.", "“Please stop.”", "As Oh Rahee was about to drop the man into the pit, a woman spoke up to stop her. She was a beautiful, blonde-haired woman wearing glasses that gave her a graceful, intelligent look.", "This was the first time Seol Jihu saw her, but his surroundings quickly buzzed with whispers. From what he could pick up, the blonde-haired woman was ‘Evangeline Rose’, a Grand Pathfinder just like Kazuki. In other words, she was a High Ranker.", "“Who the hell are you?” Oh Rahee asked with a face that seemed to ask, ‘What retard is it now?’ Despite Evangeline being a High Ranker, it seemed she had no interest in her.", "“Let him go.” Evangeline Rose spoke simply as if to avoid unnecessary fighting, “We will go in first.”", "For a moment, Seol Jihu doubted his ears.", "“What?” It was the same with Oh Rahee. She tightened her grip on the man, whom she was about to drop.", "Evangeline Rose continued, “I’m not saying we will go in for free.”", "“?”", "“The twelve of us will enter and scout the difficulty of the Plaza of Sacrifice. In exchange, we would like these two to enter the Plaza of the Dissonant Wish. Of course, they won’t be coming back to Stage 2. They’ll be leaving through the red portal.” Hearing her clear, silvery voice, Seol Jihu realized her move was more calculated than altruistic.", "Reading her comrades’ Status Windows with the color of observation, Seol Jihu found out that most of them were Level 4s, with the two who were left out being Level 2s.", "It seemed they were part of the same organization, having brought the weaker members as a way of getting experience. But now that the situation was heading in a bad direction, they seemed to want to send the low-leveled ones home.", "“And what if they get sent to Stage 3?”", "“Well, they’ll have to escape on their own. There’s nothing we can do about that.”", "“That doesn’t sound like something a worried mother would say.”", "“We only know that ten people can enter Stage 3. There’s nothing that says it’s first-come-first-serve. Either there is a condition we don’t know about or it’s random. Regardless, we can’t do anything about luck.”", "When Oh Rahee asked in a provocative tone, Evangeline Rose struck back with calm.", "“Besides, we’re not saying we will use all of the six available slots. Since we’re bearing the risk of being the first party to enter the Plaza of Sacrifice, wouldn’t it be fair to give four of the six slots to us?” She stealthily increased the slot they would take from two to four.", "“…Hnng.” Oh Rahee hummed as though her interest had been piqued. She looked around the field, seemingly to check what the other spectators were thinking about. No one was voicing a word of complaint.", "Taking their silence as a sign of agreement, Oh Rahee smirked before looking back at the trembling man.", "“This is the correct way of being shameless. Watch and learn.”", "She flung her arm, throwing the man away like a piece of trash. The man crashed on the ground and immediately crawled away from the pit in terror.", "‘She picked a good time,’ Seol Jihu admired inwardly as he looked at the hourglass, which only had 3 or 4 minutes remaining.", "Evangeline Rose had used the fact that they were running out of time to offer a deal. It was only possible because the group currently lacked information.", "By entering the Plaza of Sacrifice first, thereby stopping the hourglass and obtaining information, they had succeeded in sending some of their comrades into the Plaza of the Dissonant Wish.", "Those left on the field would have to risk their chances of entering Stage 3, but they would gain information about the difficulty of the Plaza of Sacrifice without having to risk danger.", "In truth, Evangeline Rose’s decision was a gamble and an adventure. Of course, she was a High Ranker, and judging by the equipment her comrades were wearing, they seemed to have ample experience. The team balance wasn’t bad either.", "‘But wouldn’t it be too dangerous with just twelve people…?’", "“Does anyone want to join us? You can also fit two people into the Plaza of the Dissonant Wish.” Evangeline Rose seemed to agree to Seol Jihu as she raised her voice and asked.", "Seol Jihu glanced at Kazuki. He was watching silently, seemingly with no desire to volunteer. Seol Jihu expected as much from Kazuki. He was the type of person who never stepped forward unless he was certain.", "After a moment of continued murmuring, ten people volunteered additionally. The condition was the same. Eight of them would join the advance team while the other two would leave through the Plaza of the Dissonant Wish.", "Evangeline Rose seemed to think this was enough people as she nodded her head. Filling all six spots for the Plaza of the Dissonant Wish would cause more headaches, and there wasn’t enough time remaining anyways.", "Thus, the twenty-person advance team disappeared into the left hole. When no one else entered for a few seconds, the Plaza of Sacrifice must have thought that was it.", "Koong! The entrance closed shut with a loud thud.", "Soon, the closed pit on the right opened up. The four people who were given the opportunity to leave hesitated for a moment before noticing dozens of gazes on them and hurriedly disappearing into the Plaza of the Dissonant Wish.", "There were spots left. Two people could still enter the right pit.", "However, no one dared to move. The man who was threatened by Oh Rahee was still shivering in fear, showing everyone what would happen if they acted on their own.", "Soon, the sand finished trickling down, and the hourglass flipped over.", "After quietly watching the first ten minutes play out, Seol Jihu thought Evangeline Rose’s method wasn’t so bad. As no one in his temporary alliance was weak to the point of needing to be sent back, that only gave them a greater edge in picking out potential teams to cooperate with.", "The problem was finding a trustworthy team. However, this problem caused little to no trouble.", "‘The Triads… and there was another team, right?’", "The other two organizations Kazuki allied with were coming in handy. But in any case, confirming the difficulty of the Plaza of Sacrifice was the top priority.", "‘Since six was the minimum number of challengers…. Twenty should be more than enough, right?’", "Although he thought this, it was nothing more than an assumption. Just because the monsters in Stage 1 were weak, it didn’t mean that monsters in Stage 2 also had to be weak.", "‘The Golden Rule.’", "Seol Jihu stared at the two pits emitting a reddish-golden light and quietly waited for the advance team to emerge.", "*", "How much time went by?", "It felt like several tens of minutes had already passed. Just as the people standing around waiting were beginning to get bored…", "Koong! The sound of a door opening finally rang out, followed by a closing sound. The Plaza of the Dissonant Wish had been shut down the moment the Plaza of Sacrifice opened up.", "The crowd had been standing away from the pits to avoid being misunderstood. But when they sensed this change, they hurriedly gathered around the left pit.", "Seol Jihu followed Kazuki and slowly walked forward. Everyone waited for the advance team to come up. However….", "“…What?”", "“Why aren’t they coming up?”", "The door had opened, but the advance team didn’t emerge no matter how long they waited.", "“Maybe they’re severely injured and can’t jump up?”", "Someone made a suggestion, while another cusped their hands over their mouth and yelled. However, only a vacant echo resounded.", "Just as a shadow of apprehension and nervousness was cast over everyone’s faces….", "“Ahhh!”", "Someone’s index finger that was pointing at the pit quickly went up.", "Something had suddenly shot up from the pit. The thing that looked like a human body drew an arc in the air before crashing down on the field. That wasn’t all. The pit continued to spit things out, almost as if it was coughing out food that was stuck in its throat.", "Tk! Roll…!", "Something round with fluttering hair rolled on the ground and stopped in front of Seol Jihu’s foot. When he subconsciously looked down, he couldn’t help but gasp in shock.", "After all….", "“C-Corpses—!”", "What he saw was a severely damaged head.", "‘Evangeline Rose?’", "Just what had happened? Her long, silky hair was cut sparsely, and its previously dazzling, blonde color was dyed crimson. Not only that, more than half of her tall nose was shaved off, and her intelligent, sagacious eyes gone as if they had been dug out.", "Looking at the tears of blood flowing down from her eye sockets, Seol Jihu groaned inwardly.", "‘Her neck….’", "Her neck was twisted and cut off like a churro. Judging by her distorted expression and crumpled mouth that revealed her uvula, he could tell how much she had struggled in pain before she died.", "Ssssss-! Then, when sand began to trickle down from the stopped hourglass, everyone became stunned.", "The advance team had returned as viciously damaged corpses.", "The hourglass’s sand had begun to fall once again.", "It was very clear what these two phenomena were suggesting.", "[Exit automatically opened once all enemies eliminated or no challengers remain.]", "All twenty members of the advance team had died in the Plaza of Sacrifice.", "In other words….", "‘But they had a High Ranker…!’", "The remaining 142 people had started off with the worst possible move."]}