{"cid": "356", "title": "Chapter 356. A Hero In Paradise, But on Earth (1)", "content": ["Kim Hannah sharpened her mind as Jang Maldong stared down at her coldly.", "The smile on her face disappeared, and she instantly became expressionless.", "She stood tall and clenched her teeth as she stared at the enraged Jang Maldong.", "Just as Jang Maldong was about to take her silence as an affirmation, Kim Hannah spoke up.", "“That’s… a misunderstanding.”", "“A misunderstanding?”", "“Yes. I know what you are trying to say, but you’re mistaken.”", "Kim Hannah said firmly and straightforwardly.", "Jang Maldong scoffed.", "“I did not think you were so incompetent, Miss Kim Hannah.”", "“I appreciate your compliment, but…”", "“Of course, Seol Jihu is the one who spent the money carelessly. But was it so hard to give him a word of advice? That he should take only a little bit home at a time because his family might get suspicious?”", "“That’s—”", "“Fine. Let us suppose you did not know Jihu would act so thoughtlessly. Right, you might feel that you’re being unfairly accused. But I want to know. This incident worsened Jihu’s already bad relationship with his family, so what was the reason that you forced him to visit them with wine?”", "“I admit that the way I approached the problem was wrong. But—”", "“Yes, it was wrong. It was very wrong. But that isn’t what I am asking.”", "Jang Maldong said in a seething voice.", "There was a reason he was pressing her so much.", "The most important step in resolving a problem was the way it was handled initially.", "In a way, the problem with Seol Jihu’s relationship with his family could have been solved smoothly. Even if it wouldn’t have been easy, it at least could have improved to a much better state than it currently was.", "But because Seol Jihu took the wrong first step, his family relationship had deteriorated to an almost irreversible state.", "Examining why it became so bad, the cause could be found in Kim Hannah’s intervention.", "Of course, she might be innocent.", "But Jang Maldong had to suspect her at least a little bit because he knew how meticulous she usually was.", "That perhaps, Kim Hannah had led the situation to worsen with some purpose…", "“At the time, I thought that was for the best.”", "Kim Hannah spoke at that moment.", "“Do you remember the Delphinion Duchy Laboratory incident?”", "Jang Maldong raised an eyebrow at the sudden mention of a past event.", "He certainly knew about the incident but could not understand why she was bringing it up.", "“It wasn’t just that incident, actually. The Forest of Denial expedition, the Arden Valley Baiting operation, the Delphinion Laboratory Infiltration mission… Jihu constantly put himself in situations of extreme danger that other low-leveled Earthlings would not even think of. Without even telling me, his Inviter.”", "Kim Hannah’s voice was calm and collected as she recounted the past, and she continued with a firm voice.", "“It might have been a coincidence the first or the second time. But when the same thing happens a third time, it can no longer be a coincidence. While adapting to the unfamiliar environment quickly, Jihu was falling into Paradise quicker than anyone else. From all the way back then.”", "“So you’re saying you did what you did because you were afraid of his Paradise addiction?”", "“Because what I feared became a reality.”", "Kim Hannah smacked her lips and answered.", "“I told him over and over again that Paradise was not where he belonged, but he didn’t listen. In fact, whenever he went back to Earth, he looked like he wanted to return to Paradise as quickly as possible.”", "Kim Hannah sighed.", "“It was complicated. Jihu acted carelessly and escalated the severity of the problem, but then he avoided the problem and tried to go back to Paradise… I judged that his relationship with his family would become irreparable if left alone, so I made him visit them using the wedding anniversary as an excuse. Because at the time, his family was the only place on Earth where he might find peace.”", "Jang Maldong flashed his eyes glaringly but still listened silently.", "“You might think it was too hasty, Master Jang, but Jihu did not show any withdrawal symptoms that addicts often experience. He didn’t even mention anything about gambling after experiencing everything he went through in Paradise. It was as if he was never a gambling addict to begin with…”", "Kim Hannah was saying that the rate at which Seol Jihu got addicted to Paradise was beyond anyone’s imagination.", "“Jihu was reluctant to leave once he entered Paradise. I did think that it would be better if he took the time to get closer to his family, but that conflicted with him hurriedly needing a place of rest on Earth. In the end, I decided it was better for him to meet his family rather than growing farther apart.”", "“….”", "“Of course, I admit that I was too hasty. That was my mistake.”", "“I see what you’re saying.”", "Jang Maldong raised his chin and looked down at Kim Hannah.", "“But am I wrong in thinking that you are trying to package what happened in your favor?”", "“Master Jang.”", "“Even a monkey can fall from a tree, but Miss Foxy making a mistake? I find that too hard to believe on its own.”", "“I am human too. I’m not saying what I did was right, but I can’t be perfect all the time. Otherwise, I would still be holding onto my position in Sinyoung rather than being in this place right now.”", "Kim Hannah smiled faintly.", "“Looking back, I’ve always made mistakes when it came to Jihu.”", "She cleared her throat and continued.", "“If I may reveal my honest thoughts… you’re right. I tried to control Jihu.”", "“Control?”", "“Don’t think too badly of it. The Jihu from back then had a slew of problems both in Paradise and on Earth.”", "Kim Hannah continued.", "“I know that the current Jihu has accomplished great things that make him comparable to the legends of Paradise. But if you set them aside and only look at him as just another person, Jihu is the type of guy who needs a meticulous producer. I’m sure you understand what I mean as his master.”", "Then, Kim Hannah smiled bitterly.", "“But… Jihu couldn’t be controlled.”", "“….”", "“I felt it in my gut the first day we came to Eva. That Jihu could not be controlled. My mistake was in realizing this too late.”", "Kim Hannah let loose a deep sigh. Jang Maldong didn’t say anything. He simply kept Kim Hannah bound to the same spot with a silent gaze.", "“…I’m sure you know.”", "Jang Maldong spoke up after a moment of silence.", "“But I cannot see you, Miss Kim Hannah, in a good way.”", "“Yes, I‘ve had the feeling that you do not like me.”", "“I’m sure you know why. When you allied with the Triads and acted without saying a word to Jihu, I didn’t say anything because I knew it was for his own good… But I’ve always felt uncomfortable about it.”", "“I understand. There are other members that hate me for that matter as well. I did it, fully aware of the consequences.”", "“Yes. I know what you’ve done for Jihu so far, and so I’ll overlook the matter with his family as something that you judged to be in his best interest. But know that this will be the last time.”", "Jang Maldong emphasized that there would not be a next time.", "That this was his bottom line and he would not sit still if she tried to interfere again.", "Kim Hannah was no fool, and she quickly understood his intention.", "“If you want to prove your innocence, you will have to show me through your actions. Especially when it comes to the matter regarding Jihu’s family.”", "“You don’t have to worry about that. Jihu already told me last time that he would take care of it on his own. I agreed with him as well.”", "“I hope you take responsibility for those words.”", "That was all.", "Jang Maldong took his eyes off Kim Hannah once she gave the affirmation that she took her hands off of Seol Jihu’s family matter.", "He turned around and continued walking.", "He had mixed feelings all the way until he arrived at the Valhalla building.", "Seol Jihu was the only thing on his mind.", "It was then.", "Jang Maldong caught sight of someone as he went inside while still deep in thought.", "Phi Sora was sitting in the lounge area, eating a sherbet.", "An idea must have sparked inside Jang Maldong’s head at that moment as he suddenly raised his voice.", "“Sora!”", "“Whadda what!?”", "When he suddenly shouted, the joyously humming Phi Sora threw the spoon in her hand in a startle.", "She turned to the side, furrowed her brows, and spat out a breath.", "“Grandpa?”", "“Come here for a bit.”", "“Why’d you shout!? You scared the living crap out of me!”", "“Since when were you so easily scared? Anyway, get over here! I need to tell you something.”", "“Ugh, I was in such a good mood too… What annoying job is he gonna make me do this time…”", "Phi Sora grumbled, but still got up obediently and followed Jang Maldong.", "“So, what is it?”", "“Do me a favor.”", "“A favor? You? From me?”", "“Listen up.”", "Jang Maldong explained slowly, and Phi Sora couldn’t hide her shock.", "“W-What?”", "“Do you think you can do it?”", "“Well, it’s not like I can’t… but why me?”", "Phi Sora was about to protest when she saw Jang Maldong’s heated gaze and shut her mouth.", "“…Argh, dammit! But I fought with that son of a bitch!”", "Phi Sora scratched her head and scowled.", "*", "Seol Jihu got up from bed rather late the next morning.", "He couldn’t sleep all night.", "What Jang Maldong said to him kept lingering on his mind.", "He couldn’t help but have immature thoughts like ‘but we won the war’ or ‘I worked harder than anyone else’. But Seol Jihu eventually shook off these thoughts.", "Jang Maldong had taught him selflessly until now, and what he said wasn’t really wrong either.", "Regardless, a day had already gone by, and he had to return to Earth by the end of it.", "“…Man!”", "Sighing, Seol Jihu climbed up the stairs when he suddenly caught sight of a beautiful, red-haired woman coming down.", "Coincidentally, their eyes met.", "“Uh….”", "The woman’s eyes widened.", "A faint smile spread across Seol Jihu’s face.", "Just looking at Phi Sora cheered him up a bit.", "He was feeling a little down, and now he had the perfect person to prank.", "Of course, Phi Sora reacted in a completely different way. She immediately furrowed her brows and scowled. And just as she attempted to assume indifference and walk past him, Seol Jihu clung onto her.", "“Miss Phi Sora~”", "“Screw off.”", "“Eii, Madam Phi, why are you so angry~?”", "“I told you to screw off.”", "Phi Sora shot back in a sharp tone.", "However, Seol Jihu didn’t back down.", "Squeeze, squeeze.", "He skillfully massaged Phi Sora’s shoulders and fawned over her.", "“Stop! Where do you think you’re touching? Get your hands off me this instant!”", "“Eii, what are you sulking for? So petty.”", "“What was that?”", "“Now, now, have you had breakfast? You haven’t, right? Let’s go.”", "He grabbed Phi Sora’s hand and pulled her up the stairs.", "Phi Sora went with him, pretending to give in. Seol Jihu had come to her just when she was wondering how she should strike up a conversation with him.", "They arrived on the tenth floor.", "Because it was time for breakfast, several people were already sitting together, chatting away noisily.", "Seol Jihu brought Phi Sora to a seat, then went straight to the kitchen.", "Shortly afterward, he walked out with a plate.", "A bowl of steaming ramen was placed on the table.", "Seol Jihu then placed a small plate of kimchi and a bowl of white rice, finishing the Seol Jihu Ramen Special.", "Phi Sora was taken aback.", "“Oh right, you advanced to Level 6, right?”", "“…Yes.”", "“Congratulations. What’s your class name? I know it used to be Royal Guard…”", "“It’s Duke.”", "“Iya~ That’s a cool name. Ah, the noodles are gonna get mushy. Go ahead.”", "With a silly smile, Seol Jihu pushed the bowl of ramen toward her.", "Phi Sora looked noticeably uncomfortable, but her body was honest.", "Gulp. With the sound of swallowing saliva, she gave in to the temptation and picked up the chopsticks.", "“Dammit, do you add drugs to the ramen or something? Why is it so damn good?”", "She grumbled as she picked up a waterfall of ramen with her chopsticks.", "Slurp, slurrrp.", "Seol Jihu smiled beamingly as he saw Phi Sora eat with a tasty sound.", "Finding this gaze uncomfortable, Phi Sora glanced up and looked at Seol Jihu.", "“I’m gonna say this in advance.”", "She spoke indifferently with her cheeks stuffed with ramen.", "“Don’t think this is all it takes to calm my anger.”", "“Does that mean you don’t want to eat my ramen from now?”", "“Agh, fuck, that’s not what I mean. I’m saying you should show some sincerity after angering someone so much.”", "Phi Sora corrected Seol Jihu as if the prospect of never eating his ramen again terrified her.", "Seol Jihu tilted his head.", "“Sincerity?”", "“Yes, sincerity. For example…”", "Phi Sora gave a sidelong glance.", "“You and I met on Earth once before, right?”", "“Yes, at the pork belly place.”", "“Great. Then go on a little picnic with me.”", "“…Come again?”", "“Aren’t you going to Earth anyway? You should tag along with me on a trip while you’re at it. Let’s see, where do I wanna go…”", "Phi Sora recalled the conversation she had with Jang Maldong last night while pretending to think.", "[There’s a place you need to take Jihu to.]", "[It’s…]", "“I’ve always wanted to go to Hawaii.”", "Phi Sora shrugged.", "“It should be summer on Earth right now. Why don't we go to the beach together? There’s a place called Waikiki that’s famous for its beach resorts.”", "The smile on Seol Jihu’s face disappeared as soon as Phi Sora said this.", "His expression stiffened frighteningly like he just heard a load of nonsense.", "‘I guess it’s true that he hates going back to Earth.’", "Phi Sora was inwardly astonished.", "“…Hawaii? Out of the blue…?”", "Soon, just as Seol Jihu said with a smile—", "“What, what? You guys are talking about a beach trip? I wanna go!”", "“Me too! Where are you guys going?”", "Hugo and Chohong appeared out of nowhere and joined the conversation.", "“We already decided on a place. Hawaii. Grandpa decided, actually.”", "“Huh? That old man did? Really? Then this is going to be the first time I’m seeing him on Earth.”", "Before anyone noticed, more and more people began to gather around Seol Jihu.", "Seol Jihu stared in a daze as they chatted in excitement.", "“Seol, Seol, you’re going too, right? We’re meeting on Earth for the first time?”", "Hugo asked with a beaming smile.", "Seol Jihu didn’t answer.", "“Seol?”", "“….”", "“Seol? Seol! What’s wrong? Are you sick?”", "Hugo nudged him with his elbow.", "“Ah.”", "Seol Jihu finally snapped out of his daze and replied.", "“I don’t know….”", "“Eii, don’t skip. This is a group bonding activity! You should be there as Valhalla’s representative!”", "“Group bonding activity, huh. I just don’t know if we need to meet on Earth. We can’t even speak the same language there.”", "“Who cares? It works out once you meet. I’ve met Dylan and Chohong before, and that’s what happened.”", "“That’s a good idea, going on a vacation together. Everyone’s going back to Earth anyway. Chances like this don’t come up often.”", "Kim Hannah chimed in as well.", "“Aha! Miss Kim really knows what she’s talking about!”", "“Hawaii has a hospital specialized for Earthlings, so I can make preparations right away. I know an acquaintance there. Of course, that’s only if the representative gives me permission…”", "Everyone turned to Seol Jihu at Kim Hannah’s words.", "Seol Jihu simpered.", "“I just don’t get it.”", "“Don’t get what?”", "“I mean, you guys always go on a vacation after something big happens. Do you really need to?”", "“Well, it’s not like we need to…”", "Chohong shrugged.", "“But what’s there to not get? Isn’t it just part of having fun?”", "“Having fun?”", "“Yeah. What’s better than having fun to forget bad memories?”", "‘Bad memories?’", "Seol Jihu frowned. His gaze seemed to be asking for an explanation.", "“Think about it. We just had a huge war. How many times did we almost die? Can you forget all about it?”", "“….”", "The answer was no.", "War wasn’t an everyday thing, and with how impactful it was, Seol Jihu would never be able to forget it.", "Perhaps until he breathed his last breath.", "“But we won.”", "“Winning aside… Never mind. What’s important is that Paradise left us with unforgettable memories, whether good or bad.”", "Chohong continued.", "“So we need to make them fuzzy before they really take root in our heads. With Earth’s memories, of course. Replacing them with other memories of Paradise would be no good.”", "“….”", "“And actually, you might need this more than anyone else. Of course, you don’t need to go on a trip. People have different ways of preparing for death in Paradise… So, is there anything you do in particular?”", "Seol Jihu closed his mouth. He suddenly remembered how Phi Sora worked part-time to look back on her life on Earth.", "But what about him?", "“If you don’t, just come with us on this beach trip. It’ll be fun to see each other on Earth for once. We can curse each other out all we want since we won’t be able to understand each other anyway.”", "“Right, right! It’s more fun than you think! So? You’re going, right, Seol?”", "Hugo interfered tactlessly.", "Seol Jihu licked his lips until letting loose a deep sigh of frustration.", "He understood what they were saying, but he couldn’t empathize with it at all.", "In fact, doubts emerged within him.", "“…You guys must not like life in Paradise that much, huh.”", "A quiet murmur flowed out.", "Chohong furrowed her brows, and the smile on the excited Hugo’s face faded away.", "“Hey, that’s not what we mean.”", "“Yeah, yeah, I get what you mean. Yes, a beach trip sounds nice. People who want to go should. Preparing for the worst-case scenario is good too. I acknowledge that.”", "Seol Jihu took a roundabout way to say they should not force someone into going if they didn’t want to go.", "“Sounds good? Then let’s go with that. Oh right, I haven’t told you guys about the fruit and the divinity, right?”", "Seol Jihu nodded his head and changed the subject in a bright voice.", "“Listen up. It’s hard to say anything about the divinity, but the fruit is amazing. This thing’s effect is…”", "However, he had to stop as everyone was staring at him fixedly. A few had dazed looks, and a few were casting suspicious glances.", "This was no surprise given Seol Jihu’s very obvious strange attitude.", "Even the dull Hugo noticed that Seol Jihu was trying to change the subject.", "“Uh… Seol.”", "Hugo carefully spoke up after a brief moment of silence.", "“Do you hate going back to Earth?”", "“…No, it’s not that I hate it.”", "“Then do you not want to see us?”", "“Hugo.”", "“I just… we spent a long time together in Paradise… so I wanted to meet you on Earth too…”", "Hugo murmured dejectedly.", "Seol Jihu shut his eyes tight.", "*", "In the end, it was decided that Seol Jihu would go back to Earth.", "Although he didn’t give a definite answer on whether he would go on the trip, it seemed like almost everyone else agreed.", "Kim Hannah went back to Earth, saying she would make preparations.", "By the time the sun went below the horizon, Valhalla’s building became rowdy.", "Seol Jihu and others left the building after wrapping up a few matters in Paradise.", "On the way to the temple.", "Everyone was busy chatting about the upcoming trip, but only Seol Jihu remained silent.", "In truth, everyone knew.", "Seol Jihu, who had been running around after the war pulling pranks left and right, was now all serious and quiet. He even looked a little angry.", "Though the furtive glances annoyed him a bit, Seol Jihu didn’t show it.", "He acknowledged the need to go back to Earth.", "But being thrust into it was…", "‘No.’", "Seol Jihu smiled bitterly as what Jang Maldong said kept surfacing in his mind.", "He couldn’t deny it.", "Because the mysterious rage and anxiety he was feeling now were the same emotions he felt when he didn’t have any money and couldn’t gamble.", "Unless he was being forced like he was now, he probably would not even think about going back to Earth.", "He acknowledged this…", "Seol Jihu walked while suppressing his displeasure, and before he noticed, he had arrived at the temple.", "“If you’re going straight to Hawaii in Area 4, set your coordinates accordingly. As for the rest, send us a mail, alright?”", "Phi Sora waved her hand in front of the warp gate.", "“Ou! See you guys in Hawaii!”", "Hugo shouted excitedly.", "Seol Jihu didn’t say much. He sighed for the umpteenth time and walked up the stairs.", "Though he heard someone calling his name, he didn’t look back and dived into the wavering, sea-colored portal.", "It was his fourth return trip to Earth."]}