{"cid": "453", "title": "Chapter 453. The Second Coming of Gluttony (3)", "content": ["The situation took a sudden turn.", "Sung Shihyun, who was rampaging as if he owned the world, fell. Vulgar Chastity was struck down by the lightning bolt, and Unsightly Humility had also stopped his advance and was dazedly looking up at the city wall.", "It wasn’t just the three Army Commanders. Every parasite ravaging Haramark stopped their attack. Not only that, but they were also slowly backing off.", "They were half acting out of instinct, but it was also because the fear was passed down from the Nests and the Army Commanders.", "It was all because of one man.", "“He really…”", "He really came back.", "Teresa was at a loss for words seeing Seol Jihu standing on the city wall.", "She thought it was over. She thought the war that had gone on for more than 20 years would finally end today.", "With humanity’s defeat.", "That was what she thought, but…", "“Uk….”", "At the end of her despair, the light of hope that seemingly flickered off rekindled again.", "It was a brilliant golden light that drove the darkness away.", "“Keuk… heuk…”", "The tears she had been holding in finally began to fall. Her eyes were tightly closed as her lips trembled faintly. It was because all sorts of indescribable emotions that went beyond simply happiness raged inside her.", "It wasn’t just Teresa.", "“Hmph….”", "Phi Sora’s eyes also welled up with tears.", "“You should have come earlier….”", "She sniffled and wiped her tears with her finger.", "“Huha… huhahaha!”", "Chohong laughed like she lost her mind.", "“Oppa’s here….”", "Eun Yuri closed her eyes with a relieved look.", "“Representative…!”", "And Marcel Ghionea slammed his fist on the ground and shot up excitedly.", "“Uwoaaaah!”", "Hugo, who was sprawled on the ground, picked himself up with a roar.", "“F-Fuck!”", "Maria cursed.", "“Iya… Captain Seol!”", "Hoshino Urara also shouted with a broad smile.", "“You’re back, Captain Seol!”", "While everyone expressed their happiness in all sorts of ways…", "“….”", "Seo Yuhui closed her eyes quietly, though her eyes trembled as if she would burst into tears at any moment.", "The Seol Jihu Effect was incredible. Just his appearance made humanity’s and the Federation’s morale skyrocket.", "On the other hand, the Parasites’ morale was plummeting all the way down to the deepest depths of the earth.", "Koong!", "Vulgar Chastity became speechless, seeing Sung Shihyun fall from the city wall to the ground. Unsightly Humility was the same.", "“What…”", "What the hell do we do? was what both the Army Commanders were thinking.", "Strictly speaking, only a single person had joined the fray. But it was a different story if that person was Seol Jihu. To the Parasites, the Brightest Star was no different than an all-purpose strategic weapon, one that far surpassed the Seventh Army Commander.", "It was simple, really. The Parasites had devised a sophisticated trap that dragged the Brightest Star into it. Three Army Commanders then took turns wearing him down, yet they still failed to defeat him.", "Seol Jihu held on even when Sung Shihyun and Twisted Kindness joined the fray, and it wasn’t until all six Army Commanders simultaneously attacked that his death was barely finalized.", "But now, they weren’t in the Empire’s territory and only three Army Commanders were present. To top it off, Seol Jihu was in his peak condition. Furthermore….", "“Uk!?”", "Unsightly Humility winced in the middle of his thoughts. It was because he felt a terrifyingly dense mana sweep past his body. Not once, but five or six times.", "‘Just now….’", "How could he not know what it was? It was the same attack that partially destroyed him and his army before. Unsightly Humility turned around in shock and roused his energy to prepare for a terrifying explosion.", "However, in the next moment, Seol Jihu abruptly raised his arm. A dazzling electric discharge erupted from the bottom of Seol Jihu’s feet and gathered at the tip of his spear.", "Pzzt! Golden electricity sparked from the white spear blade pointing toward the sky.", "Seol Jihu’s Unique Spatial Ability — Thousand Thunder, Hell Severing.", "Krrr, krrrrr! Thunder rumbled once again.", "Just as Unsightly Humility did a double-take…", "Tzzzzzzzzzt!", "Thousands of lightning bolts accompanied by a roaring thunder struck down on the land.", "Boom! And following suit was a deafening roar that rippled out in all directions.", "Seol Jihu’s Unique Spatial Ability — Supernova Explosion.", "Behind Seol Jihu, a sun-like orb rose from the earth. Its surface cracked open, and its condensed energy brimmed over. Golden waves rippled out in all directions.", "With two of Seol Jihu’s strongest abilities being used consecutively, it was a calamity on the level of massive natural disasters to the Parasites.", "Hell descended in Paradise. The golden wave spread out at an alarming rate and devoured the groups of parasites that were stunned from the lightning strikes.", "The lightning energy not only destroyed the parasites’ physical bodies but it also ravenously guzzled them down. Rather than losing strength over time, the energy became denser the more it ate, sending out more ripples.", "With the chain effect, the screams ringing out from the surroundings stopped before long.", "‘Impossible…!’", "Unsightly Humility, who was holding on with all his might, doubted his eyes at the scene of boundless chaos unfolding in front of him. Seol Jihu’s energy was getting stronger the more it destroyed its enemies, and meanwhile, it did not harm even a hair on his allies.", "Both Sung Shihyun and Twisted Kindness were incapable of such a feat. It was proof that Seol Jihu obtained an Authority rivaling Godslaying, and also reached the level of existence needed to use the Authority freely.", "All by walking a different path than the Army Commanders.", "[Second Army Commander.]", "It was then. A familiar voice entered Unsightly Humility’s ears.", "‘This voice….’", "It was the Third Army Commander, Abhorrent Charity’s voice.", "He had been watching from afar, hurriedly intervening once the situation turned awry.", "[We don’t have much time. Listen well. From now on…!]", "Same time.", "“Hm…”", "Seol Jihu nodded his head after looking around. This was enough cleanup.", "Seol Jihu jumped down from the city wall right away. Sung Shihyun was in a complete daze. His brain was ringing just from a single punch. This was the first time he was feeling such dizziness since he became a parasite.", "‘I….’", "Sung Shihyun blinked in a half-awake state.", "‘What am I…’", "When he came to his senses, he realized he was subconsciously circulating his divinity to the point it turned his body hot. His skin was stinging with a scorching pain.", "‘No….’", "His blurring vision focused.", "‘There’s no way… that I…’", "He saw someone jump down from the city wall.", "‘Lost…!’", "“Get up.”", "Sung Shihyun’s eyes shot open. Veins popped up on the hands that were touching the ground. He clenched his fists, scraping up dirt.", "“Kuheu…!”", "Sung Shihyun picked himself up with a grunt. He was in a sorry state, to say the least. His neck was stretched out, and his scorched skin had cracked up and revealed his red inner skin.", "With white smoke rising from the black soot covering his charred wounds, he looked no different than a beggar. Only, his eyes revealed a fearsome glint, peeking out of his lowered head.", "“That’s more like it.”", "Seol Jihu grinned with the spear shaft resting on his shoulder. Sung Shihyun did not say anything. He creaked his head to the side and then swung his right hand forcefully.", "Chwararak! His white longsword, which was buried in the ground, flew into his hand. Sung Shihyun then pointed at Seol Jihu and fixed his posture.", "Seol Jihu gestured at him with his spear.", "“Come.”", "Sung Shihyun raised his head. At the same time, he kicked off the ground hard. Rushing in at breakneck speed, he swung his longsword fiercely.", "“Are you joking?”", "Seol Jihu read the movement of the sword perfectly and swung his spear shaft in the same spot.", "Clang!", "Sung Shihyun’s body shook strongly. Losing in terms of pure strength, he couldn’t help but furrow his brows.", "‘There’s no way…’", "Tong! Sung Shihyun moved behind Seol Jihu just as he was about to collapse.", "“What are you doing?”", "Their eyes met. It meant Seol Jihu was seeing through his movements perfectly despite his instantaneous speed.", "Sung Shihyun brandished his sword like a thunderbolt striking from the east and west simultaneously. The problem was that Seol Jihu’s spear was hitting his chin up before his sword could stab his neck.", "Puk! With a dull sound, Sung Shihyun’s jaw tilted back. His arms also tilted up to the sky.", "‘There’s no way…!’", "Sung Shihyun’s face became dazed as the view of the sky flashed before his eyes.", "“Keeuuu!”", "He scraped up his divinity as soon as he landed on the ground. A clear light shot out of his body and undulated like waves. Then, just as an orb gathered at the tip of his sword and bubbled up to explode…", "“Aaaack!”", "A piercing scream burst out, and a fountain of blood shot out from his shoulder. Sung Shihyun’s right arm, which held the sword, fell to the ground and flopped around.", "Sung Shihyun grabbed onto his bleeding right shoulder and fell to his knees. Sensing that the Spear of Purity’s Authorities had returned, Seol Jihu had severed Sung Shihyun’s arm with a Mind Spear.", "“Don’t look at me like I somehow wronged you.”", "Seol Jihu said with a grin.", "“You knew how this fight would turn out before it even started.”", "Sung Shihyun couldn’t deny this. Detonating an orb of divinity was a new technique he came up with, but he knew things would only be a continuation of what happened on top of the city wall.", "Anti-evil energy, Godslaying, Gluttony… Seol Jihu’s mana, which formed perfect harmony with all sorts of evil-destroying energy, would simply devour his attacks.", "It wasn’t as if he didn’t know, but…", "Sung Shihyun clenched his teeth until they were on the brink of breaking. Knowing something and acknowledging something were two completely different things.", "“Heh…”", "Sung Shihyun got up. After staggering left and right a couple of times, he dropped his head.", "“…What?”", "After a brief moment of silence, a growling voice leaked out of Sung Shihyun’s mouth.", "“Just what… is it…”", "“?”", "“Just what’s the reason…!?”", "Did he give up already? Seol Jihu’s eyes flashed with a glint.", "“I… I was the strongest Earthling!”", "Sung Shihyun huffed.", "“I was at the center of attention from the start, and I lived up to everyone’s expectations! Executors! And even Baek Haeju! I surpassed them all until I could look down on them! There wasn’t anyone stronger than me!”", "Sung Shihyun was crying. Strength, agility, mana—he was defeated in all aspects. He shed tears as if he couldn’t believe this situation and glared at Seol Jihu.", "“Now I even became a parasite…. I fully digested Diligence’s divinity…! Yet, how can you be… stronger…!?”", "He threw a tantrum like a child. Seol Jihu spat out a sigh watching this. He then activated his Future-Gauging Nine Eyes.", "[Sung Shihyun’s Status Window]", "[1. General Information]Summoned Date: 2013. 03. 22Marking Grade: GoldSex/Age: Male/27Height/Weight: 178.6cm/72.8kgCurrent Condition: HealthyClass: Lv 7. Pinnacle-Rank Mana SwordsmanNationality: Korea (Area 1)Affiliation: N/AAlias: Son of a Bitch, Jackass, Traitor, Defector, Sexual Harasser, Motherfucker, Dick, Loser", "[2. Traits]1. Temperament—Scummy (Despicable and contemptible)—Show-off (Likes to put on airs to flaunt himself)—Tenacity (A deeply rooted temper of wanting to endure pain and struggles)—Sexoholic (Always concerned with sexual relationship between a man and a woman)—Competitiveness (Desire and mindset to win)—Cruel (Is lacking or has no humanity)—I Am My Own Lord Throughout Heaven and Earth (Believes that he is not inferior to anyone else in the world)", "2. Aptitude—Prodigy (A rare talent that is rarely seen in the world)—Cold-blooded (Tries anything and everything to achieve his goals)—Unrelenting (Confidence that does not bow down to authority and physical strength)—Sixth Sense (The ability to analyze situations by intuition rather than relying on an analysis of the thought)", "[3. Physical Level]Strength: PinnacleEndurance: EXAgility: PinnacleStamina: EXMana: Half-GodLuck: Intermediate (Low)", "Remaining Ability Points: 0", "[4. Abilities]1. Authorities (2)—Divinity (Grade Unknown)—Super Regeneration (Special)", "2. Innate Abilities (0)", "3. Class Abilities (8)—Secret Art: Sword Qi Wave (Pinnacle)—One With Nature: One With the Sword (Pinnacle), Flying Sword (Pinnacle), Formless Sword (Pinnacle)", "4. Miscellaneous Abilities (1)—Intuition (Special)", "[5. Level of Cognition]Turncoat (Someone who betrayed others’ loyalty and changed sides) / Despairing / Chaotic (Many things are jumbled up and is impossible to unravel)", "Seol Jihu turned off Sung Shihyun’s status window. He felt there was no point in reading any further.", "“You know, there’s something that a friend of mine said to me.”", "Seol Jihu began to speak.", "“That the Army Commanders, who have been bestowed divinity by the Parasite Queen, are monsters that are hard to defeat with a human’s strength.”", "And also, to become a monster just like them in order to defeat them.", "“He said there’s nothing to be afraid of once you meet a condition… especially you.”", "“Who!?”", "Sung Shihyun shouted.", "“…There’s a guy.”", "When Seol Jihu gave a chilling smile, Sung Shihyun flinched.", "Right, there definitely was a guy like that, a man who was not given the Godslaying Authority, a man who was not chosen to become an Executor, yet managed to kill an Army Commander with nothing but his strength alone.", "“I didn’t really understand him back then…. But, after being forced to accept a divinity, I finally understood.”", "Seol Jihu continued.", "“Well, I can see where your confidence is coming from. Becoming a parasite improves your physical body and vitality significantly, and other external powers like the Parasite Queen’s Authorities must have made you feel empowered.”", "“External powers? I fully digested a divinity!”", "“I wonder if that’s true.”", "Sung Shihyun frowned at Seol Jihu’s comment.", "“It was obvious for the other guys, but in the end… you and Twisted Kindness were no different.”", "“We’re no different…?”", "“I’ll give you an example… When I rose to Level 9, Gula-nim bestowed the class name, Divine Spear, to me.”", "At that moment, Sung Shihyun’s brows shook from great shock.", "“I assume Level 10 will be Spear God. What do you think the difference is?”", "A spear that has the power of a god, and a god that has complete authority over something.", "The two names were similar but had entirely different meanings.", "“The point is this. You might be able to control the mana flowing in your circuit without trouble… but it doesn’t change the fact that you have Diligence’s divinity, does it?”", "Sung Shihyun’s expression stiffened.", "“I would have acknowledged it if you formed a new divinity that holds your, Sung Shihyun’s, essence… but that’s not the case here.”", "Sung Shihyun became speechless. He wanted to refute, but he couldn’t find anything to say.", "“Half-god is putting it nicely. You obtained divinity by inheriting the qualification that Diligence originally had. Isn’t it the case that you yourself haven’t reached that point yet?”", "“Keuk!”", "“You ceased to be human but haven’t quite reached the level of godhood. Rather than a half-god, it’s probably more accurate to call you a flood dragon that wasn’t able to rise to become a dragon.”", "Sung Shihyun shook at Seol Jihu’s clarification.", "“Being so arrogant when all you did was steal someone else’s achievement and pretend like it was yours… can it get any more shameless than that?”", "“Then what about you!?”", "“Yep, I’m the same.”", "Seol Jihu acknowledged it readily.", "“That’s why I have nothing to fear from you. Look, you’re powerless when the divinity you’re so confident about is useless.”", "Sung Shihyun’s eyes widened.", "In reality, the two of them were exactly alike. Just like how there was a difference between the Divine Spear and Spear God classes, there was a clear difference between someone in the Half-god rank and someone in the Divine Beginning rank.", "Seol Jihu just didn’t feel the need to explain it.", "“So if you understand that, then come, Pinnacle-Rank Mana Swordsman.”", "When Sung Shihyun heard these words, a frightening glint appeared in his eyes.", "“You…!”", "Not only did Seol Jihu preach arrogantly, but he had also poked Sung Shihyun’s reverse scale.", "“You son of a biiiiiitch!”", "He pulled out his sword from his severed right hand and roared in anger.", "Kwang!", "A terrifying energy sprouted up around him.", "A white cluster of light slithered out in multiple directions like snakes and charged toward Seol Jihu. As they gushed out while crossing paths, they dyed the area white.", "“….”", "In this blinding light, Seol Jihu felt a strange sensation envelop his body.", "He was familiar with it. He had felt it once before, and because he had been yearning for it, it felt all the more familiar.", "It slipped out of his hands last time due to the Parasite Queen’s meddling, so Seol Jihu vowed to grab ahold of it this time.", "Activating the Spear of Purity’s Authority, Seol Jihu smiled and jumped forward.", "“!”", "In the next moment, Sung Shihyun dropped his jaw in astonishment. Not only did Seol Jihu purposely enter his range, but he was also making all of his attacks flow by.", "‘No way…!’", "It wouldn’t have been so shocking if he was devouring his divinity like before. But now, relying solely on his spear, he was shortening the distance like an immortal who was out for a walk in the clouds. Such an awe-striking display would provoke fear in anyone.", "Sung Shihyun gripped his sword instinctively. There was no time to worry about the next move. Completely disregarding what would happen to his body, Sung Shihyun released more energy in a final stand.", "More than a dozen beams of light shot out of his body and bloomed like a lotus. Then, they all struck down at one spot.", "However, Seol Jihu fluidly brushed past even this, just like how the sun rises when the moon sets, like how water flows from top to bottom—simply like it was a matter of fact.", "Sung Shihyun saw all this with a dazed face. The hand that was holding onto the sword trembled. He felt like he was fighting boundlessness itself, and he was showing off his strength in front of a vast, endless sea.", "Inside this ultimate boundlessness, Seol Jihu looked free and unperturbed. The possibility that gave birth to this freedom was also boundless. He moved his body and used his skills at will.", "The scene of mind, technique, and body acting in such perfect harmony was beautiful enough to earn the admiration of any spectator.", "Sung Shihyun could not even fathom the depth of this realm.", "“I… I was a legend too…!”", "In his fit of anger, Sung Shihyun shouted in jealousy and envy.", "“Who’s the one who saved humanity multiple times from the brink of ruin? Who’s the one who forced the Parasite Queen to the Corrupted Throne!? It’s me! I made achievements that don't lose out to yours!”", "Seol Jihu finally broke through the light and stepped in front of Sung Shihyun.", "“Who the hell are you anyway!?”", "Whoosh! Sung Shihyun swung his sword and cut down.", "“I’m supposed to be the main character…!”", "He did a double-take in the middle of his shouting. Although the sword cut Seol Jihu in half, the feeling in his hand was void.", "‘Ethereal Shift!?’", "Sung Shihyun turned around instantly and flinched. His intuition, which was based on sixth sense, sent powerful warning signals. It was telling him that this wasn’t Ethereal Shift.", "Just as he turned back forward, Sung Shihyun ducked his head low, following his instinct. He felt like a spear was flying toward his head. It wasn’t until he looked down that he realized it was Seol Jihu’s trick.", "It was because a second later, Seol Jihu was looking at him after having returned from the Spirit Realm. With his two legs kicking off the ground and his spear pointed at Sung Shihyun.", "In that instant, Sung Shihyun could distinctly feel the boundlessness in front of him compressing down layer by layer and ultimately forming a single point.", "Level 9 Divine Spear, Class Ability — Trinity Harmony.", "I can’t dodge it. Sung Shihyun’s sixth sense told him so.", "“Ah….”", "His face sunk in despair.", "…In truth, he already knew. That Seol Jihu would have killed him multiple times already if he wanted to. He knew from the moment Seol Jihu returned.", "Sung Shihyun just did not want to admit this. Because…", "[Supernova, a large nova that is millions or even billions of times brighter than an ordinary star.]", "[The Brightest Star… an infinite star with a growth speed and potential that not even a god can estimate.]", "The moment Seol Jihu, who had been irritated to the extreme, revived…", "[The most frightening thing about that star is its limitless potential and frightening growth rate.]", "[Once it explodes with light, it expands in size while evolving at a terrifying speed.]", "[In the time you do a double-take, this star surpasses everyone’s expectations and shoots forward. By then, it would be too late to catch up to it.]", "[That is the reason I am so fearful and wary of the Brightest Star.]", "…He would be back stronger than ever before.", "So much so that no one could ever irritate him again.", "“I…!”", "Seeing the spear blade rushing toward him, Sung Shihyun’s face contorted.", "“I’m also…!”", "Pk! The golden energy pierced Sung Shihyun’s stomach and came out the other side.", "This wasn’t sword qi. It was far too large to be considered sword qi. If he had to describe it, it was more like an essence formed from an infinite number of sword qi condensed together.", "Sung Shihyun’s feet flew off the ground.", "“Kyak…!”", "Skewered by a giant pillar, he went up into the air, struggling, while vomiting blood.", "Seol Jihu’s arm shook violently. Next, Sung Shihyun’s body, which was wrapped up in a brilliant golden light, bloated up like a pig.", "Level 9 Divine Spear, Secret Art — Reinforced Sword Qi Explosion.", "BOOM!", "Then, his body exploded magnificently."]}