{"cid": "312", "title": "Chapter 312. The Eve (1)", "content": ["After being charged with Teresa Energy which didn’t lose out to Seo Yuhui’s even a bit, Seol Jihu was able to regain some strength.", "Before they parted, Teresa made a request. She didn’t ask for anything difficult, but to just put his stamp on a contract.", "Suspicious that it might be a marriage contract, Seol Jihu meticulously read through its contents before widening his eyes.", "“Princess. This is…”", "“Observatio Vitae.”", "Teresa explained.", "“It’s basically a contract that allows you to observe another’s lifeforce. It lets you know the person’s condition no matter where they may be.”", "“Then will it show whether I’m dead or alive?”", "“Yes. If nothing happens to you, the contract will remain the same, but the more critical your condition becomes, the hotter it gets. And when the person’s life force disappears, the contract will burn up into a handful of ashes.”", "Seol Jihu nodded his head. He felt like he knew why Teresa took out this paper.", "‘It’s not a bad idea.’", "The movement of humanity’s key figures including Teresa was strictly based on the outcome of his plan. If the prerequisite condition, the Revival of the World Tree, failed, it would be like hitting a rock with an egg as Cinzia had put it.", "It was the worst-case scenario that he didn’t want to imagine, but if that really happened, then a fast retreat was their best move. This was where the contract came in handy.", "“I understand.”", "Seol Jihu placed his stamp on the contract without further hesitation.", "Teresa, who was looking at him with a slightly sad face, carefully spoke up again.", "“Yes. And there’s another sheet underneath that. Stamp that one too…”", "Seol Jihu carefully looked over the other contract as well… Before he threw away the stamp he was holding in great fright.", "Teresa’s voice became sharp.", "“What are you doing? Why aren’t you stamping it?”", "“I mean, what’s this forced child-making… How do you even do that?”", "“It’s fine. Today is an unsafe day for me so there’s a high chance. We can do it.”", "“What? Whether it’s a safe day or an unsafe day… why would we need to do that?”", "“Because if something happens to you, then I won’t have any reason to live anymore. But if we have a child, I’ll barely be able to cling onto my life. I’ll be able to live while looking at a child that looks just like you.”", "Seol Jihu was speechless seeing Teresa nod to herself while commenting on how it was an amazing idea.", "“Princess! Shouldn’t you be cheering for me to return safely?”", "“Of course, I’ll be cheering for you!”", "“Then what’s this contract!?”", "“What, huh? What’s so wrong about it!?”", "“Are you really going to be like this!?”", "“Yes! I’m a realistic woman! Didn’t you know!?”", "In the end, the man and woman got into another fight despite meeting each for the first time in a while.", "However, a quarrel between husband and wife was like cutting water with a knife. After arguing for a while, the two smiled as if nothing happened before parting.", "*", "It was evening by the time Jang Maldong returned.", "Seol Jihu exchanged greetings with Park Woori and Yoo Yeolmu, whom he hadn’t seen for a while.", "They both looked happy to see him, but they soon shakily escaped to their rooms. Their faces were filled with fatigue, showing how hard Jang Maldong worked them.", "Eun Yuri was the same, but she remained to hear Seol Jihu’s story.", "“You’re taking on yet another difficult task.”", "Jang Maldong sighed after hearing his explanation.", "The salvation of the Spirit Realm.", "Not to mention the average Earthling, even the Federation deemed the task as impossible.", "Seol Jihu did manage to come up with a method, but Jang Maldong couldn’t help but worry for him. Despite that, however, Jang Maldong knew that it was something that had to be done.", "“You have to be careful.”", "“Don’t worry. I have more people helping me than you think.”", "“Alright. I suppose that’s good news in the midst of all this.”", "Like always, the two ended their conversation in a simple manner and rose from their seats. Jang Maldong advised him to get some rest, but Seol Jihu still left his office.", "He wanted to visit the pub — Eat, Drink and Enjoy — that he hadn’t visited in a while.", "He told them he would go by himself, but Eun Yuri furtively followed him. She silently trailed after him with the face of wanting to say something.", "Seol Jihu didn’t mind her.", "He sat at the log table and chatted away whatever that came to his mind, like how her training had been and whether she had visited this pub before.", "“This pub was my first starting point.”", "After draining a mug, Seol Jihu spoke with a tipsy voice while looking around him. His voice was slightly drowned out by the loud rackets of the Earthlings that filled the pub.", "“This is where everything started. I joined Samuel’s team as a porter, got in contact with Carpe Diem, went to the Forest of Denial and met Flone…”", "“Mhm.”", "“That’s not all. It’s just, everything that ever happened took place at this pub. I drank here while looking for a teammate because of some request and got in a fight for no reason at all. Well, things were like that.”", "“…”", "“But do you know what comes to my mind whenever something happens?”", "“No.”", "“Ah! Will I—”", "He felt like he was now drunk talking, but Seol Jihu didn’t care and continued.", "“Will I be able to… come back here… with my friends… and laugh and talk… and drink together again…?”", "Eun Yuri, who had been silently eating the snacks on the table suddenly froze.", "“Will I, or will I not… Who knows what will happen this time…”", "Seol Jihu let out a giggle while smiling tiredly.", "“It’ll be nice if I can this time, too… Ah.”", "The moment when he suddenly shoved his hand into his pocket…", "“Oppa.”", "Eun Yuri quietly spoke.", "“Yeah?”", "“That expedition… can I—”", "“No.”", "Seol Jihu refused her without listening to the end.", "“I’ve grown much stronger since the time you saw me at the Neutral Zone. My physical level has risen and so did my magic abilities.”", "Eun Yuri attempted to appeal her inclusion in the upcoming expedition but…", "“I know. I know that you’re amazing, Miss Eun Yuri.”", "Seol Jihu shook his head.", "“But we already have a Magician in the expedition team. Not to mention, a very outstanding Magician at that.”", "“There’s nothing wrong with having two Magicians on your team. I won’t hold you back.”", "Seol Jihu raised his face.", "“That’s not what I mean.”", "His voice suddenly became low.", "“That’s not the problem.”", "Eun Yuri, who had been leaning forward to hear what he was saying over the loud noise, suddenly trembled.", "Seol Jihu’s face that was tipsy just a moment ago had abruptly changed. A pair of intoxicated eyes glinting with a blue light was staring at her.", "This was the first time Eun Yuri saw Seol Jihu’s other face.", "“The Star of Avarice is a man who stands at the peak of all currently existing Magicians and is an Executor chosen by a god.”", "“…Yes.”", "“Even someone like him cannot guarantee his survival… That is the nature of this expedition.”", "“…”", "“Miss Eun Yuri, do you think you can do better… no, do as much as he can?”", "Eun Yuri was unable to respond.", "While it was true that she was a genius in the field of magic, she still had long ways to go before she could even be compared with Philip Muller.", "“…No.”", "Eun Yuri quietly replied.", "“Right?”", "Seol Jihu finally relaxed his expression and grinned.", "“Learn a little more and train a little more. I’ll take you along even if you don’t want to in the future.”", "Saying that, he finally took out his hand from his pocket.", "“On that note!”", "Tang! He put down something in front of Eun Yuri. It was a piece of ice that was emitting a frigid chill.", "Eun Yuri rapidly blinked her eyes in surprise before her eyes began to shine when she saw a flower encased within the ice.", "“It’s the Essence of Ice.”", "Eun Yuri stared at Seol Jihu with a reserved gaze.", "Misunderstanding her actions, Seol Jihu gave an awkward smile.", "“I’m sorry. I should’ve given this to you right after our match in the Tutorial. I’ve been so busy that I completely forgot about it.”", "Eun Yuri became conflicted. She wanted to have it, but she wasn’t sure if she could really receive it.", "However, having decided in his heart already, Seol Jihu didn’t take back his words.", "“Take it. I already have an Essence of Soma. I considered giving this to someone else, but no matter how I thought about it, giving it to you seemed to be the best choice. Think about it, just how powerful would your large-scale magic become if it’s imbued with the power of extreme ice?”", "When Seol Jihu convinced her while passionately gesturing with both his hands for her to take the Essence of Ice, Eun Yuri finally accepted it, pretending to give in.", "“I’m supposed to help you melt the essence and fuse with it, but unfortunately I don’t have the time.”", "“It’s fine. I’ll figure that much out by myself.”", "“Alright. Since anti-evil magic was one of the schools of magic in the past, Lady Roselle should know something about it.”", "Seol Jihu grabbed his forehead. The alcohol was making his head dizzy and causing him to trip over his tongue.", "“Ehh… We should go now. I need to leave early in the morning tomorrow.”", "He got up while bracing himself against the table. He gazed at the exit with drowsy eyes while muttering to himself.", "“Why does the door look so far away…”", "Eun Yuri blankly gazed at Seol Jihu, who was unstably staggering out. He looked as if he’d fall anytime soon. Eun Yuri, who had been fidgeting with the ice, was about to get up but suddenly hesitated.", "She didn’t know why, but Seol Jihu’s resolute ‘No’ had flashed past her mind.", "But her hesitation only lasted for a moment. She made a determined face before she quickly rose from her seat to run after him.", "She stood next to the faltering Seol Jihu and grabbed his body.", "“I’ll support you.”", "“Uh… I’m really okay…”", "“It’s because you don’t look okay. I’m fine with it so please lean against me.”", "“I see, I see. This feels much better. Thank you.”", "Seol Jihu let loose a sigh that smelled of alcohol after saying that he owed her a favor.", "“I thought I’d be fine…”", "He smacked his lips before continuing.", "“I thought I could do it somehow, but… Sometimes I get so tired like today…”", "Eun Yuri chewed her lips when she heard him say ‘tired’.", "“Don’t worry too much.”", "She unconsciously gripped his arm a little tighter and spoke with a confident voice.", "“I’ll help you. No matter what it takes.”", "*", "The next day, Agnes visited the office early in the morning as promised.", "After a brief farewell to four people including Jang Maldong, Seol Jihu got onboard the carriage prepared by the royal family with Agnes.", "Because it was a carriage drawn by eight Horuses, the carriage soon became a small dot on the horizon.", "When it completely disappeared from their sights, Jang Maldong let loose a deep sigh before turning his body.", "“Hmm?”", "He widened his eyes when he saw someone behind him.", "Park Woori and Yoo Yeolmu were returning back to the office, but Eun Yuri remained standing there, endlessly gazing in the direction the carriage had left for with quietly blazing eyes.", "“…No matter what.”", "Ignoring the frost creeping up her hands, she tightly clenched the flower that was encased in ice.", "*", "Seol Jihu called Philip Muller on his way back to Eva. It was to inform him of the results of his meeting with Sicilia.", "Philip Muller also shared his progress with him, but what was interesting was that they weren’t much different from his own results.", "Like the Star of Sloth, the Star of Pride and the Star of Wrath accepted under the condition that they successfully revive the World Tree.", "Their only comfort was that they managed to receive the promise of the royal families of both their cities to order a draft call and support them when a war broke out.", "In the end, everything depended on their expedition. The fate of the Federation and humanity depended on whether they succeeded or not.", "Would they survive once again, or would they perish just like this?", "Seol Jihu’s shoulders felt heavier once he thought about that. Feeling his heart grow heavier as well, he began to vacantly stare at the rapidly changing scenery outside the carriage.", "“You’ve changed a little.”", "He suddenly heard a voice. Seol Jihu looked at Agnes with his rabbit-like eyes.", "“Me?”", "He pointed at himself.", "“Yes.”", "Agnes lightly nodded.", "“People say men are molded by their position. I guess that is true.”", "“…How so?”", "“Who knows.”", "Agnes glanced at him while giving a slight smile.", "“At first, I thought you were just a mischievous little prankster… But I see that you know how to be serious. I am looking at you in a new light now.”", "Seol Jihu looked as if he still didn’t understand what she was talking about.", "Agnes shrugged her shoulders.", "“It’s not a bad thing. It’s praise. That’s right. A man needs to have a serious side to him. Well, I might be the only one who feels like this as I’ve watched you since the Neutral Zone.”", "Seol Jihu tilted his head. Then again, he did quit gambling.", "“I’m not really sure…”", "Just as he trailed off his words, something caught his eyes.", "To be exact, it was the tight and plumpy area that boasted an elastic line below Agnes’ waist.", "Ting, ting, teng, teng. Happy to see the frying pan he hadn’t seen in a long time, Seol Jihu brightly smiled and spoke to it.", "“That’s right. Is that what you think too?”", "“Just where do you think you’re talking to?”", "Agnes’ voice suddenly became sharp.", "“That’s not it. It’s just that I haven’t seen it in a while. I thought I should greet it.”", "“Will you shut up!?”", "Agnes suddenly froze while being angry and hurriedly checked her Status Window to see if any ridiculous nicknames had been added.", "Seol Jihu giggled while looking at Agnes, who was quickly scanning the air.", "“Oh, you’re laughing?”", "“M-Miss Agnes?”", "“Is this funny? Is this funny to you!?”", "Of course, it didn’t take long for the laughter to soon turn into a squeal of a dying pig.", "*", "A procession of creatures of the dark dyed the whole heaven and earth black.", "At the end of the long procession were Medusas with their squirming snake hair.", "Every time a groan was heard, Bugs and Cockroaches poured out. Behind them was a giant fish-shaped monster that had tentacles sprouting from all over its body.", "The Temerator.[1]", "Every time it gaped open its mouth, Parasites poured out of its mouth and gills. If Medusas were the final evolved form of middle-rank Parasites that gave birth to lower-rank Parasites, then Temerators were the final evolved form of upper-rank Parasites that gave birth to middle-rank Parasites.", "And behind it was a monster the size of a building whose entire body was covered with spikes. When its body suddenly expanded to the verge of exploding, a mammoth-like monster with nine heads slipped out.", "The name of the monster that quickly returned to its original size like a deflating balloon was Regina. They were the final evolved form of the pinnacle-rank Parasites that gave birth to upper-rank Parasites like demons or hydras.", "Behind the Regina were Nests that almost numbered 300, their bodies bulging as if breathing.", "Nests were categorized into lower-rank, middle-rank, upper-rank, and pinnacle-rank based on their accumulated nutrition, births, and experience.", "They weren’t much to look at when they were lower-rank, but they became able to give birth to Medusas when they evolved to middle-rank and to Temerators when evolved to upper-rank. When they evolved to the pinnacle-rank, their pollution ability reached the peak while simultaneously becoming able to give birth to Reginas.", "In other words, the Nests were the foundation of the Parasite army, the source of their infinite troops.", "It was no wonder that the Nests were treated like treasures amongst the Parasites since they were containers that held the Parasite Queen’s most important Authority — Life Creation and Pollution.", "Adding onto the corpse army composed of multiple species gained through their wars, the heavens and the earth became dyed in an ash-gray color.", "The Parasite Queen shuddered, breathing in the rotting stench that covered the entire Empire.", "It would have been great if things ended here, but this wasn’t the end. The Parasite’s main force — the Seven Armies — responsible for causing the Federation and humanity to fall into despair, had to be included in the calculations.", "[Finally, everyone is here.]", "The Parasite Queen’s confident voice rang out as she looked down from the Corrupted Throne.", "In the grand hall stood many individuals that emitted strong auras, awaiting her command.", "Excluding ‘Raging Temperance’ who was sent to wipe out the remnants of the Spirit Realm, all six Army Commanders were gathered in one place.", "1. The author loves to use Latin words. Temerator comes from the Latin verb temero, meaning \"to pollute, violate, defile, contaminate.\"  "]}