{"cid": "241", "title": "Chapter 241. The Secret of the Nine Eyes", "content": ["Seol Jihu woke up in the morning and heaved himself up with ease.", "Although he had tired himself out last night to the point that he could barely stand, after a night’s sleep, his exhaustion had disappeared like it never existed.", "He was even brimming with refreshed vitality.", "It must be because of the ample miraculous energy flowing in the valley.", "“Udadada!”", "As he twisted his body side to side, his joints cracked and Seol Jihu grinned.", "Jang Maldong as well as Yi Sungjin, Phi Sora, and Hugo were still wandering about in their dreams.", "He couldn’t see Seo Yuhui.", "‘Did she go somewhere to pray?’", "With everyone being busy training (or helping them train in the case of Jang Maldong), Seo Yuhui was the only one with spare time.", "This didn’t mean that she was just playing around with nothing better to do.", "Taking everyone’s harsh training into account, she prepared nutritious meals three times a day and also handled washing their sweat-drenched clothes. She did most of what could be considered housework.", "She also played with Seol Jihu from time to time and prayed to Luxuria to recover her strength in the remaining time.", "Divine energy gathered from prayers was only a drop in the bucket in what she had to pay back, but it was better than nothing.", "Leaving the tent, Seol Jihu took in a breath of fresh air to clear his drowsy mind, then sat cross-legged on the ground.", "One habit he had developed while focusing on training his technique was paying greater attention to Mana Circulation.", "No, perhaps it should be called Mana Cultivation now.", "As a result of investing his time into the Righteous Heart technique, Seol Jihu was able to experience the meaning of ‘purer mana producing greater strength.’", "He had never paid attention to it and actually experienced it naturally while training.", "Even when he was using the same amount of mana, he would travel farther with Flash Step, and the energy of his Thrust, Strike, and Cut would be a stage stronger.", "According to Jang Maldong, his mana would only get purer as he ranked up in the Righteous Heart technique. Furthermore, the purity of his mana would reach 100 percent when the Righteous Heart technique reached the Pinnacle rank.[1]", "Just thinking about it made him excited.", "Right, there were all sorts of ways to get stronger, and he already had several methods in his grasp. It was just that he had not utilized them until now.", "‘Good.’", "After cultivating his mana for two hours using the Righteous Heart technique, Seol Jihu stood up feeling refreshed.", "Now would be the time for him to start the day’s training by putting on sandbags and going on a run…", "But for some reason, Seol Jihu grabbed his javelin and took a fighting stance. Rousing his mana, he slowly closed his eyes and focused on inner meditation.", "He was already devoting most of his time to training, so much so that it would be difficult to find any moment when he wasn’t training. But a person’s greed really had no limits.", "There was one goal Seol Jihu really wanted to achieve during this training trip.", "Sword Qi.", "It was an ability on a completely different dimension than Aura, which was simply imbuing one’s weapon with energy.", "Furthermore, sword qi was what separated Level 4 Warriors and High Ranker Warriors apart.", "Simply producing sword qi would greatly enhance a weapon’s durability and sharpness, and the added destructive power would be incomparable to Aura.", "‘Just pouring in mana isn’t the correct answer.’", "At first, he thought Sword Qi was similar to Aura in that all he would have to do was infuse mana until it became visible on the outside.", "But there was one thing Seol Jihu had overlooked. That the store-bought javelin wasn’t the Ice Spear.", "Only after breaking four javelins did he realize this wasn’t the right method.", "There was no way an ordinary spear could endure mana at the terrifying High (High) rank.", "Then what should he do to learn Sword Qi?", "He couldn’t figure it out even after giving it a long thought. So he went to Phi Sora to ask for advice, but she wasn’t of much help.", "It might be different if she had learned the technique using contribution points, but those who learned high-ranking skills on their own each had their own way of manifesting sword qi. Phi Sora said she was only able to manifest it after achieving One With the Sword.", "When Seol Jihu asked for a more detailed explanation, she got angry, saying that she learned it naturally by expanding on the feeling of becoming one with the sword. To Seol Jihu, it was still cryptic.", "In the end, he was left with only one choice.", "‘I should remember the sensation.’", "To rely on his muscle memory.", "When one consolidated a specific motor task into memory through repetition, the body would remember it and move instinctively. It was just like how the muscle would contract after being burned out and before the brain could assess the damage.", "Technique and mana were like that too. The more one used them, the easier it would get to reuse them.", "And in Paradise, this was reflected through an increase in rank.", "According to what his comrades said, Seol Jihu had apparently displayed a terrifying martial prowess that far surpassed anyone’s wildest imaginations.", "Just by emitting his energy, he would cause the surrounding air to seethe, the heaven and earth would crack and vibrate, and he would shoot out dozens of sword qi blades like they were toys.", "Although he found it hard to believe, there were more than a few witnesses.", "In that case, Seol Jihu figured his body should at least remember it.", "After all, even if his mind couldn’t remember, Future Vision had used his body to carry out these skills.", "‘I feel like I’m just at the tip of grasping it…’", "Seol Jihu relaxed and emptied his mind.", "10 minutes passed by, 30 minutes passed by, then an hour passed by.", "He reached the state of being free from all thoughts and ideas.", "His focus reached the pinnacle, and in his state of perfect egolessness, he erased all idle thoughts.", "He concentrated his entire nervous system into the flow of mana as he retraced his memory.", "“….”", "How much time went by?", "Nothing of note occurred, but Seol Jihu had not moved an inch. It was almost starting to look like he was sleeping.", "It was then. Twitch. His mana, which was flowing through his circuit, suddenly changed.", "‘My mana…!’", "For a brief moment, it squirmed like a flood dragon preparing to ascend to being a true dragon. Then, it abruptly shot up before slowly gathering into a shape.", "The moment Seol Jihu sensed this shape bolt toward his javelin, his eyes shot open.", "“Uek!”", "A flash of light dyed his vision white. Seol Jihu shut his eyes reflexively and made a dumbfounded expression as soon as he opened them back up.", "‘Did a golden light just flash in front of me?’", "He couldn’t be sure whether he had actually seen it. Perhaps he was mistaken.", "Regardless, the instantaneous process he experienced just now was still clear in his mind.", "Seol Jihu pressed his temple and fell into thought. Rather than focusing on the cause of the phenomenon, he focused on ‘why’ it happened.", "‘Don’t think about it too hard.’", "The javelin was breaking because it couldn’t withstand his energy.", "The Ice Spear was easier to use because the magical enchantment on it allowed it to withstand more energy, but it should break all the same if the energy it took in surpassed its limit.", "He might be able to solve the problem of the javelins breaking by purchasing a weapon with high durability, but he didn’t think he could evolve Aura that way.", "Meaning, he had to solve the problem he was facing.", "The energy that could transform even ordinary weapons into a powerful weapon. That was what Sword Qi was.", "In other words, he had to reach the level of not breaking the store-bought javelin even when he infused mana strongly.", "‘Now that I think about it… why did mana gather into a shape just now…?’", "The split-second sensation that he felt during the state of egolessness became his guiding compass and pointed him in a new direction.", "Soon, Seol Jihu’s eyes shot open.", "‘Ah!’", "Thinking about it now, how was his body containing such powerful energy unfazed? After all, steel should be far stronger than his physical body.", "The answer was the mana circuit. His mana was staying in his body because it was moving through the mana circuit.", "After reaching this conclusion, Seol Jihu quickly grabbed a javelin.", "Before the sensation became faint, he moved his energy following what he just felt.", "First, he gathered up his mana. Just like rolling up a snowball, he slowly increased the size of the clump before manipulating it into a shape like kneading a lump of clay.", "‘This is harder than I thought…’", "Now that he was consciously trying to do it, it was quite difficult.", "Releasing mana externally and forming a throwing spear wasn’t easy either, but manipulating it into shape internally was also difficult.", "After toiling away for some time, Seol Jihu finally manipulated his mana into the shape of a stringed ring.", "Seol Jihu held the javelin tight.", "‘From here…’", "As if to swing a whip, he released the ring he created toward the javelin.", "The ring inserted itself into the javelin before reaching the tip of the blade and taking a U-turn back to its original spot.", "All according to Seol Jihu’s will.", "And as the ring of mana returned to Seol Jihu’s mana circuit after making a circle inside the javelin…", "Woong.", "A faint vibration was transmitted to his hand along with a strange resonance.", "Seol Jihu subconsciously tightened his grip on the shaft.", "Because he felt it.", "The method Seol Jihu coincidentally thought of was simple. If his body was withstanding his mana due to the circuit, then he just had to make one inside the javelin.", "Of course, he couldn’t actually make a circuit, so he worked to make a pathway that the mana could flow through.", "From his circuit to the javelin, then from the javelin back to his circuit. Once he made the connection, he felt a noticeable difference.", "‘So this is the feeling…’", "He couldn’t say he became one with the javelin as he simply felt like he was sharing a circuit with the javelin.", "But he finally began to understand what Phi Sora meant by expanding on the feeling of becoming one with the sword.", "Since he succeeded in forming the connection, now it was time to test the result.", "As he carefully trickled his mana into the javelin, a smile bloomed on his face. Although the javelin had taken in more mana than it could withstand, it was holding out without breaking.", "This was because mana wasn’t burdening the javelin by staying inside, but was instead circulating around the javelin through an internal pathway.", "The pathway handled most of the pressure, and with Seol Jihu maintaining a certain level of energy, the javelin was feeling far less pressure than before.", "Seol Jihu didn’t stop, slowly increasing the amount of mana while hastening the speed of the circulation.", "The javelin began to vibrate more intensely…", "Ttring!", "And his view became clear along with a short alarm.", "“….”", "Seol Jihu stared at the javelin at a loss for words.", "A vivid golden light was undulating above the tip of the blade. It wasn’t wavering like that of Aura, but was shooting up like the shape of the javelin blade.", "This was… Sword Qi.", "“I did it….”", "Seol Jihu muttered blankly.", "The only reason he succeeded through this method was because of his consistent use of mana since the Neutral Zone.", "The result was an epic success.", "But in the next moment, the javelin blade crumbled.", "“Ah!”", "Seol Jihu shouted in disappointment but soon acquiesced.", "He had only lessened the pressure on the javelin. Its capacity was the same, so there was a limit to how much mana it could take.", "It was the same for the mana circuit.", "When mana rampaged around, it would begin to melt the circuit. This was what happened during the war.", "Thinking along this line, it wasn’t difficult to understand why the javelin crumbled. What was important were the messages blinking in the air.", "[Class Ability ‘Aura (Intermediate)’ has evolved to ‘Sword Qi (Lowest)’.][Innate Ability ‘Future-Gauging Nine Eyes’ responds to the new evolution of the ability!][Class Ability ‘Sword Qi (Lowest)’ has evolved to ‘Sword Qi [Intermediate (Low)]’.][Please check your Status Window.]", "Seol Jihu grinned as he read the messages.", "With this, one of the questions he had, when he became a High Ranker, was answered.", "‘Future Vision didn’t disappear.’", "It was just fused into the Nine Eyes.", "Seol Jihu lowered his arms and tilted his head to look at the sky.", "Before he noticed, the sun had peeked its head over the horizon, and the world was bright. The gently blowing morning breeze felt more refreshing than ever before.", "“Come eat!”", "Seo Yuhui’s voice rang out at the perfect time.", "Seol Jihu turned around with a beaming smile.", "*", "Gulp, gulp.", "“Puuuu!”", "Water shot out of Seol Jihu’s mouth.", "As soon as he raised his head out of the stream water, he shoved it back in. He seemed to be drinking water judging by the way his Adam's apple was bulging in and out.", "Seol Jihu drank the frigid stream water until his teeth hurt from the cold, and only then did he raise his head out of the water.", "Droplets of sweat and water fell from his face.", "‘It’s only been 30 minutes…’", "Seol Jihu had added a new regimen to his daily training routine.", "And that was to train sword qi.", "Since it was unlikely that his opponents would wait in the middle of battle, he had to train how to quickly form the mana ring, connect his weapon and circuit, and then materialize sword qi.", "The problem was that he was having trouble maintaining sword qi, not just forming it.", "Setting aside the fact that it unexpectedly consumed a large amount of mana, it wasn’t so easy to move while using sword qi.", "‘Again.’", "Seol Jihu smiled bitterly as he broke his eighth javelin. If he moved intensely even a little bit, the flow of mana would also get intense and the javelin would explode like a balloon.", "‘I finally understand why higher-level weapons skyrocket in price.’", "Divine weapons and intelligent weapons lessened the burden on their owners by eliminating this problem.", "But Seol Jihu wasn’t that worried as he could use the Spear of Purity as soon as the Arcus Spirit acknowledged him. Given its status as a divine weapon, he had no doubt it could easily withstand his mana.", "Seol Jihu shook his head hard before getting up.", "He still had many faults, but he couldn’t help but get a little pleased seeing himself improving every day.", "‘It really felt like I achieved some great enlightenment…’", "Suddenly gaining insight in the middle of meditation and rising to a higher realm was a martial arts novel cliché.", "Of course, Seol Jihu didn’t actually think he achieved some great enlightenment. He simply thought he got lucky.", "No, perhaps he should be thanking his Nine Eyes.", "Looking back, his growth was following the path of luck’s way ever since he took the Awakening Ceremony in the Neutral Zone.", "Even for the abilities he was learning for the first time, Future Vision was responding and boosting them to higher ranks.", "The only thing that was different now was that it directly helped him learn an ability, albeit minutely.", "Seol Jihu was able to find the cause of this phenomenon in the explanation of the ability.", "[A being who experienced the next world transformed his consciousness into emotions and stored it in the realm of subconsciousness. As the ability recalls what has ‘already happened’, it is closer to ‘gauging’.]", "By remembering matters of the future more accurately, the emotions stored inside him would react more intensely.", "Seol Jihu suspected that this mysterious change was the result of Future Vision fusing with the Nine Eyes.", "Or perhaps he had simply gotten ahold of the trick through the experience of using sword qi during the war.", "Whether it was the former or the latter, if this conjecture was true, Seol Jihu was really receiving a tremendous buff. After all, he was able to more swiftly learn the abilities his future self learned.", "Of course, this was only a conjecture, and he would need more case studies to be sure.", "‘I’m sure Future Vision is helping me learn the skills I know I learned before. Taking Flash Thunder for example…’", "What class did his dream self have?", "A Lancer? Or a Mana Lancer?", "Seol Jihu pondered for a while before turning back and walking. After about 10 minutes, he began to hear Jang Maldong’s shouting.", "This was proof that he was getting closer to the campsite.", "Soon, Seol Jihu saw Jang Maldong shooting his hand up and signaling at something.", "Next, Phi Sora, who was standing at the top of a small hill, pushed down a large man-sized boulder.", "Doom, doom, doom, doom…!", "The boulder began to roll down the gradual slope, Yi Sungjin standing at the foot while holding a body-sized iron shield in front of him.", "BOOM! The boulder and the shield collided.", "The boulder wasn’t that fast, but Seol Jihu could imagine the force it carried due to its size.", "“Keeeeeeeeeu!”", "Yi Sungjin was gritting his teeth, pushing against the boulder.", "“Left!”", "Once Jang Maldong shouted, he twisted his hip and parried the boulder to the left. The boulder slowly brushed past Yi Sungjin’s side.", "“Rest!”", "Yi Sungjin fell on his butt. Seol Jihu could only imagine how difficult his training was by his incessant pants and grunts. But judging by the fiery light in his eyes, he must be enduring with grit.", "‘He’s working hard.’", "Seol Jihu called out while telling himself to gift Yi Sungjin a good shield once they returned.", "“Miss Phi Sora!”", "Phi Sora, who was coloring a stone while squatting down on the hill, glanced down.", "“What?”", "“Can you help me train my Intuition?”", "“Can’t you see that I’m helping already?”", "Phi Sora immediately became pissy. Well, she was dragged to this place against her will and was being forced to help out all day. Seol Jihu really couldn’t blame her for being irritated.", "“Go help! I can train Sungjin by myself.”", "Still, when Jang Maldong told her to do something, she reluctantly did so while grumbling.", "Phi Sora trudged over with a bucket full of stones.", "“Goddammit. Hey, can we take a ten-minute break? I need to color a few more stones anyway.”", "Seol Jihu shrugged as he had no reason to refuse.", "After a brief moment of silence, Phi Sora, who was sprinkling green powder on a fist-sized stone, asked.", "“Where have you been running about recently?”", "“Excuse me?”", "“Don’t pretend like you don’t know what I mean. I know you disappear for a couple of hours every morning.”", "‘Was that bothering her this entire time?’", "Seol Jihu had yet to reveal he learned Sword Qi. Of course, he had a reason.", "“It’s fine, isn’t it? Master hasn’t said anything about it either.”", "“….”", "Phi Sora closed her mouth, seemingly having nothing to say in response. Still, she was a bit doubtful.", "She had beaten him so severely, yet Seol Jihu acted as if he didn’t mind in the slightest.", "His dignified attitude was worthy of praise, but seeing the speed of his recent growth, Phi Sora was worried he would catch up to her shortly.", "But then again, anyone would think so if they saw how much Seol Jihu trained in a day.", "“I’m just training by myself.”", "“Cheapskate. Isn’t it fine to tell me?”", "Phi Sora pouted, but Seol Jihu only gave a broad smile.", "How surprised would Phi Sora get if he told her he learned Sword Qi before becoming a True High Ranker?", "But he planned to keep this under wraps for now.", "All for the day of his revenge.", "*", "Late at night.", "—So, what do you think?", "“Un….”", "—Do you think we can put it off until later?", "“Un….”", "Nod, nod…", "Kim Hannah saw Seol Jihu dozing off through the communication crystal and laughed. She had contacted him to discuss something urgent, but the so-called leader was about to fall asleep.", "—Jeez, are you that sleepy?", "Seol Jihu raised his head. Then, he waved his hand with half-closed eyes.", "“Sorry, sorry, I’m just really sleepy right now…”", "Seol Jihu remembered a few things he heard, like how it was difficult to find workers because the house was rumored to be cursed, and how they refused to work at night even if Kim Hannah paid them extra.", "But he didn’t remember anything afterward. His head was already doused in drowsiness, half in sleep.", "—Well, you do look tired.", "Kim Hannah smirked. Knowing how tired he must be from training, she didn’t blame him in the slightest.", "—You look like you want to sleep, so I’ll just give a quick summary. The underground training room you wanted is going to be hard. A hot spring gushed out while we were digging to expand the space.", "Seol Jihu nodded while giving a big yawn.", "It was a bit of a shame that they couldn’t make an underground training room, but right now, Seol Jihu wanted to collapse in his sleeping bag more than anything else.", "—You know how there are many volcanos around Eva, right? I think that’s the reason. Anyway, since things turned around this way, I think it would be nice to make the basement into a hot spring bath. What do you think? Sound good? It’ll help you sleep too.", "It sounded like Kim Hannah was luring him. Seol Jihu nodded his head.", "“Do whatever you want….”", "With that, he dropped his head all the way.", "Soon, the sound of deep slumber eked out.", "Seo Yuhui, who was quietly watching from the side, hurried over with Seol Jihu’s sleeping bag.", "“Please excuse him. He’s been training for 20 hours every day…”", "—Oh my, 20 hours?", "“You have no idea how tough his training is either. But the way he finishes all his training without a word of complaint… it’s really admirable. I’m so proud…”", "Seo Yuhui gently stroked Seol Jihu’s head.", "Kim Hannah said with a smile.", "—Well, he’s been dying to train for a while. I’m glad he’s enjoying himself. He’s working hard~", "“Fufu, I went to the stream today, and he was playing in the water naked with Sungjin. You don’t know how surprised I was.”", "—Oh my. He really doesn’t know any shame, does he? He’s a grown-up man too.", "“Eii, our Jihu’s butt is super cute. It’s so plump… Ah, Jihu, come inside~ Be a good boy~”", "Seo Yuhui coaxed Seol Jihu into his sleeping bag, then turned back to the communication crystal and twinkled her eyes.", "“Anyway, hot spring, you said? Is that true?”", "—Yes! Of course! I was surprised too by how intense the water shot up.", "“Hot spring… Just thinking about it is nice~”", "—Isn’t it? Don’t worry. I’ll make it the greatest hot spring in Paradise…", "While the night deepened, the two women chatted endlessly.", "Meanwhile, Seol Jihu was catching his breath on Seo Yuhui’s thighs.", "Mm, mm. Murmuring in his sleep, he gave a pleased smile. It was as if he was having a wonderful dream.", "And he really was having a dream.", "A dream of becoming a Level 10 Spear God and sweeping away all the Army Commanders and bringing the Parasite Queen into submission.", "*", "Time flew like flowing water, and three months and ten days passed.", "The day the group had to return to Haramark dawned.", "Kim Hannah had contacted them yesterday while they were busy training to let them know that construction was only ten days away from finishing.", "She wanted them to come back to Haramark to pack up and start preparing their move.", "Of course, the valley’s scenery hadn’t changed even after three months. Everyone continued to train until a carriage came to pick them up.", "“Hnng.”", "A sunglasses-wearing woman arrived at the valley and let out a nasal hum. She had come where she was told to come.", "Soon, Kim Hannah found a tent in the distance and started walking.", "And just as she was starting to get close to the campsite…", "“….”", "Kim Hannah doubted her eyes.", "1. Highest has been changed to Pinnacle to make it sound better! "]}