{"cid": "308", "title": "Chapter 308. Preparations (1)", "content": ["‘I figured as much.’", "Given that she stayed locked up in an enclosed cell without a single ray of light, it wasn’t so absurd that she wanted to get out by any means.", "But Hoshino Urara was a Red Notice criminal who committed a serious offense. Due to the nature of her crime, she couldn’t be set free so carelessly.", "To be qualified to make the decision, one would have to be Eva’s queen, the royal administrator, or the representative of Eva’s royal partner.", "‘This is where Adam Galaev must have gotten stuck.’", "He would have had to borrow Evangeline Rose’s help to free Hoshino Urara, so he must have been in a bind at her constant refusal.", "But Seol Jihu was different. He was the undisputed number one figure among the Earthlings of Eva. Both the royal administrator and the queen of Eva trusted him.", "If Seol Jihu requested for Hoshino Urara to be freed, there was a good chance that they would consider it seriously.", "Of course, the best-case scenario was still to have Hoshino Urara spit out the truth before he would have to resort to that.", "That was the reason he brought Kim Hannah. Since she could pry the information he wanted out of Jung Sua, he figured she would be able to do the same this time.", "“Kim Hannah.”", "Seol Jihu gave Kim Hannah a suggestive glance. But Kim Hannah was surprisingly making a troubled expression.", "With how she usually took care of matters like this, what he expected to hear were the words, ‘Yes, Representative.’ But now, she was only smacking her lips with her eyes narrowed slightly.", "“What’s wrong?”", "When Seol Jihu asked, Kim Hannah breathed out a light sigh.", "“She’s going to be a bit difficult.”", "Seol Jihu was taken aback. He had never seen Kim Hannah so unconfident before.", "“We’re in a disadvantageous spot. We have something to lose, but she doesn’t. Moreover—”", "Kim Hannah shook her head and continued.", "“Hoshino Urara is one hell of a crazy. She was well known even before the indiscriminate massacre for her eccentricity.”", "“R-Really?”", "“Yes. You’ve heard of the Six Crazies, right? Money Demon, Slaughter Maiden, Haramark’s Slaughterer, War Hawk, and Intermittent Explosive Disorder. Among them, Hoshino Urara is famous as an evolved form of Claire Agnes. Because this girl’s trigger is always on.”", "Seol Jihu wanted to ask why she conveniently left out one of the Crazies, but decided against it.", "“So our only option is to ask the royal family for help?”", "“I believe that is the easiest and least time-consuming method.”", "Seol Jihu glanced at the woman sprawled on the ground in dissatisfaction.", "‘…I guess there’s no other choice.’", "In the end, he turned and left.", "*", "“Unacceptable!!”", "An icy word of command rang out.", "Seol Jihu looked straight ahead in a startle. He had gone to seek an audience with the queen to request for Hoshino Urara’s release but was rejected firmly.", "“Hoshino Urara is a Red Notice criminal who has committed grave sins against the city of Eva. As she killed both Paradisians and Earthlings alike, she can be seen as an even greater danger. How can you raise the matter of releasing this terrorist when we do not know when and where she will rampage again!?”", "She continued.", "“I understand where you are coming from, but I am the queen of Eva. I must prioritize the safety of my people above all. As such, I cannot grant royal permission.”", "She even gave a reasonable argument.", "Seol Jihu stared at Charlotte Aria sitting on her throne radiating fury, then turned stealthily to the royal administrator. Sorg Kühne was just as taken aback as Seol Jihu, his face clearly saying, ‘Did you eat something wrong, Your Majesty?’", "The queen’s normal response would have been, ‘Mm~ Okay, Jihu~ Do whatever you want~’", "But today, her reaction was different than usual, almost like she was bitter about something.", "“Y-Your Majesty, this is Representative Seol’s request. He must have his reason to ask for Hoshino Urara’s release. Perhaps the matter should be considered more carefully…”", "Sorg Kühne bowed in a hurry.", "Normally, Charlotte Aria would be supporting Seol Jihu. It kind of felt like the roles were reversed.", "“Mm… Indeed, Representative Seol’s contributions must be taken into account…”", "Charlotte Aria closed her eyes and deliberately pretended to think. She sighed in the next moment before speaking as if it couldn’t be helped.", "“If you must insist, I will reconsider. As you know, Hoshino Urara is a very dangerous individual. My heart is pounding, just imagining a Red Notice criminal walking about in Eva.”", "“Yes.”", "“But what you say also makes sense. This is certainly not the time to be arguing. It seems we must compromise.”", "“Compromise?”", "Charlotte Aria nodded her head in a grand motion.", "“Given the circumstance, I can permit the release of Hoshino Urara. But you shall also be tasked with the duty of easing my heart.”", "“What exactly do you mean by that…?”", "“It’s simple. You are to stop by the palace every day and seek an audience with me. You shall then give a report on Hoshino Urara’s actions and conditions.”", "Charlotte Aria then emphasized that he must not miss a single day.", "Seol Jihu tilted his head. It didn’t sound unreasonable, but something felt off. And so, he threw out a bait.", "“I understand. But since Your Majesty is busy researching Lady Roselle’s discipline, may I report to the royal administrator on such days?”", "“No! You cannot!”", "Charlotte threw a fit although this was a reasonable suggestion.", "“You must report to me. Must!”", "“….”", "Seol Jihu stared at Charlotte Aria fixedly. The royal administrator did the same.", "Feeling the two men’s endless gazes, Charlotte Aria averted her eyes.", "“N-No, I…”", "She then muttered in a crawling voice, regaining her usual timid attitude.", "“I meaaan…. You knoooow… He hasn’t come to see me recently… and he’s not there even when I go to Valhalla….”", "In other words, she was sulking and took the opportunity to scheme so that Seol Jihu would go see her more.", "“Whew…”", "The royal administrator let loose a long sigh as he watched the immature queen twiddle her thumbs. He lamented, wondering how she could mix such a selfish ulterior motive with governing.", "“Y-You two may do as you wish…”", "However, Sorg Kühne swallowed the sigh back down, taking the queen’s newfound ability to mix a lie within a truth in high regard.", "After a short silence, Sorg Kühne turned to Seol Jihu and asked.", "“Is that really the only way?”", "“Yes.”", "Seol Jihu bit his lip.", "“Other alternatives are torturing or coaxing the information out of her, but it’s unknown whether those will work. The biggest problem is time. Every second is important…”", "The administrator’s complexion turned grave at Seol Jihu’s earnest request. Although releasing a Red Notice criminal would normally be impossible, the situation called for exactly that.", "There was a part of him that agreed with the big picture Seol Jihu was trying to draw.", "[After stabilizing Eva, I plan to improve humanity’s relationship with the Federation.]", "Recently Seol Jihu had been trying to fulfill his second promise. He couldn’t ruin it, even if he couldn’t help him with it.", "Sorg Kühne gently closed his eyes and recalled their first meeting. Next, he thought about the current state of Eva.", "Shortly afterward…", "“…There’s no helping it.”", "After a long silence, Sorg Kühne gravely nodded his head.", "*", "Hoshino Urara’s release was decided.", "The decision of setting a Red Notice criminal free was unprecedented in Eva. Unsurprisingly, a huge commotion broke out in the prison.", "Because of one person.", "“Hurry! Hurrrrry!”", "Hoshino Urara rolled her feet in excitement after seeing Sorg Kühne standing in front of the steel door. Her excitement was understandable since she probably wasn’t expecting much.", "Hoshino Urara’s twinkling eyes reached climax once Sorg Kühne put the key in the hole.", "“Huhahahaha! I’m finally leaving this prison!”", "She burst into laughter as her pupils flashed in madness.", "“Wahahahaha! The moment I get out of here— Baldy! You’re first!”", "Sorg Kühne jolted and took the key back out.", "“No! Wait! I was just kidding! I swear! I’ll be a kind, virtuous person! I’ll become a saint!”", "When he put the key back in…", "“Ohohohoho! Kidding, my ass! You sons of bitches! You dare to trap me in here? You dareeee!! Muahahaha, the time to exact my vengeance has come! Let the blood festival begin!”", "When he took the key back out…", "“I’m sorry! I’m sorry! Please just let me get out of here! I will offer my body and soul to Eva! All hail Your Majesty the Queen! Hail! Hail!”", "Putting it back in…", "“Die! Die! I’ll let you taste true misery! Uryaryaryarya!”", "Putting it back out…", "“Salute! Salute!”", "“….”", "Sorg Kühne turned back to Seol Jihu without a word.", "“Just open it.”", "Chohong couldn’t bear it anymore and muttered in frustration.", "“Look at the number of High Rankers here. Recapturing her wouldn’t be a problem.”", "“…I will trust you.”", "In the end, Sorg Kühne put the key in and twisted it. Clunk! The sound of the lock opening rang out. As the steel door slowly opened, Hoshino Urara’s full body came into view.", "“…Would it kill you to wear something?”", "Oh Rahee commented as she spun her longsword around, but Hoshino Urara didn’t budge. Only the corner of her lips curled up slightly.", "Then suddenly, she spread out her arms like a stage magician standing before her audience.", "“KITAAAAAAA!”", "She shot out of the cell immediately afterward, but was captured by the Valhalla members that were standing by. She could not handle Marcel Ghionea, Kazuki, and Oh Rahee simultaneously.", "“Uaang.”", "Thrown to the ground, Hoshino Urara whimpered.", "“So mean~ Recapturing me as soon as I get out~”", "“Stop acting up.”", "Chohong looked down with her idiosyncratic chilling gaze while pointing the Thorn of Steel down.", "Hoshino Urara lifted her chin and gave a coy look.", "“Kowai ne~”", "“Mhm, keep blabbering. Let’s see if you can say that with a few teeth knocked out.”", "“Oop, sorry.”", "She immediately lowered her head.", "“I’ll stay put, so let me go~ I won’t run away, I promise~”", "She squirmed on the ground and pleaded.", "Once Seol Jihu gave the signal, the hands and feet pressing her down eased up and moved.", "“Thank you, thank you. Oicha!”", "Hoshino Urara jumped up, then stretched while twisting her body. It looked like she really was a high-level Archer as her body bent flexibly.", "“Auu, auuu! Is it because I’m outside the cell? The air hits different.”", "“…Damn it. Consider yourself lucky.”", "Sorg Kühne growled, seemingly annoyed seeing a criminal stretching so leisurely.", "“If it weren’t for the urgent situation we are in! If it weren’t for Representative Seol! You would have had to spend the rest of your life rotting away in prison!”", "“NANI!?”", "“You better cooperate with Valhalla to the best of your ability. You should obviously watch what you do. If I hear that you committed another crime, I will personally pull your head out!”", "Hoshino Urara stopped twisting her pelvis at the combative threat. She gave Sorg Kühne a sideways glance, then smirked.", "“Goodness. You’re going to pull what out? Do you even have the strength?”", "“What?”", "Hoshino Urara smiled and tapped on her head.", "Sorg Kühne reflexively rubbed his head and could feel his smooth skin.", "Hoshino Urara snickered.", "“Nothing to pull, eh?”", "Sorg Kühne blinked dazedly. A moment later, he flew into a rage.", "“You little—!”", "“Administrator! Don’t let it get to you!”", "While Kim Hannah calmed down the incensed Sorg Kühne, Seol Jihu hurriedly brought Hoshino Urara out of the prison.", "“Hmm—”", "She shut her eyes tight, seemingly blinded by the first sunlight she had seen in a long time.", "“Ahh~ The smell of freedom~ Oishiiiiiyo.”", "She stuck out her tongue and licked the air as if to taste it. After looking around with a pair of hazy pupils, she found a maid that was walking by and grinned.", "“Kawaii ne~”", "The maid shrunk back.", "“Atashi nihonjin desune~”", "“P-Pardon?”", "“Do you know Nico Nico Ni ne~?”", "“W-Why are you doing this!?”", "The frightened maid ran away in a hurry.", "“Onee-san? Ganbarimashou~!”", "Hoshino Urara cracked up and clapped loudly.", "“…Is she mentally ill?”", "The quietly-watching Kazuki muttered.", "It was just as he said. Staying still must give her a burning itch as Hoshino Urara didn’t rest for a single moment.", "Seol Jihu could feel his energy draining just by being next to her.", "“Mm~ Was I too excited? I’m starting to get hungry.”", "After running wild for some time, Hoshino Urara turned back with twinkling eyes.", "“Anybody wanna feed me??”", "She walked over in short and quick steps, grabbing Seol Jihu’s arm and raising it high. Then, she shouted.", "“Haaaaaaitto!”", "“….”", "Seol Jihu shook his hand off calmly.", "“…Are you okay?”", "Oh Rahee gave him a rare, pitying look.", "“Why do you ask?”", "“Well… your face is kind of saying, ‘Get me out of here.’”", "Seol Jihu sighed and shook his head.", "“…Let’s go.”", "Seol Jihu began to walk while dragging Hoshino Urara, who was complaining about her empty stomach.", "“Itaaaaai!”", "*", "The first impression Seol Jihu got from Hoshino Urara was ‘noisy’. Alternatively, it would be ‘hectic’ or ‘unfocused’.", "She babbled on and on even while she was eating, dancing with her shoulders nonstop. It was to the point that Seol Jihu wanted to crack open her mouth and check for a motor.", "“Burrrrp—!”", "But she must still be human as she quieted down a bit after eating her fill.", "“Ah~ How nice. Leaving the prison, eating delicious food. Is this happiness? I should change my way of living.”", "Seol Jihu stared at the yapping Hoshino Urara helplessly.", "Did she feel his gaze? She smiled back at him with her eyes.", "“Aiing~ What are you staring? Don’t worry. I keep my promises.”", "“You better.”", "“Of course. Now that we’re on this topic, let’s shimai. You know, take care of the complicated stuff. You’re trying to go there, right, Oppa?”", "Seol Jihu nodded quietly. Hoshino Urara clapped her hands.", "“Yoshi! It works out then. Let’s go together.”", "“Together?”", "“Yep. You see, going back to that place was what I wanted to do the most if I ever got out of the prison. Not knowing what happened to me was driving me nuts.”", "“What happened to you?”", "Seol Jihu asked for a more detailed explanation.", "Hoshino Urara leaned forward in an exaggerated motion and frowned.", "“Hmm… Oppa, look at my face for a bit.”", "“?”", "“From the front, you see my eyes, nose, and lips, right?”", "“Yes.”", "“And you see my ear from the side.”", "“Obviously.”", "“But what would you feel if you saw my eyes, nose, and lips like you were looking at me from the front?”", "When Seol Jihu furrowed his brows, Kazuki, who was listening in from the side, raised his eyebrows.", "“That doesn’t make sense.”", "“Right, it doesn’t make sense.”", "Hoshino Urara widened her eyes and retorted.", "“That was the feeling I got when I found that place, ya know? The scenery didn’t change no matter which angle I was looking from. Bajebus! I still can’t believe it!”", "“So you entered that place?”", "“Of course! I went in, wondering what this place could be. And, mm… how should I say this…”", "Hoshino Urara groaned as if she was having a hard time coming up with words.", "Seeing this, Kazuki asked.", "“Did your senses become half-faint?”", "“Ah! Right! That was the feeling!”", "Hoshino Urara rejoiced.", "“I was walking while not feeling like I was walking. I was breathing while not feeling like I was breathing. But how do you know that feeling, Oppa?”", "Kazuki didn’t answer.", "“No way… An Astral World… I only heard about it from Master Ian…”", "“Ooooooh! That’s right. Anal world or whatever! That Magician guy said the same thing I think!”", "Hoshino Urara stared at Kazuki, who fell into a world of his own, and shrugged.", "“Anyway, my mind went bonk while I was lost and wandering around that place. When I snapped out, I was in Eva.”", "[So you were possessed.]", "Flone, who was eavesdropping from inside the pendant, murmured.", "“Oh yeah.”", "At that moment, Hoshino Urara put down the spoon she was holding.", "“I just remembered. What I told you just now didn’t fill your stomach, right? Come closer.”", "She beckoned him while leaning forward.", "“I heard this from that Magician. He said there was a way to break through that place. This is real quality info!”", "“…What’s the method?”", "“He said you gotta find a Priest. Well, that’s probably not enough given just how many Priests there are. Thankfully, I know the Priest’s face.”", "Seol Jihu laughed blandly.", "“What, why are you laughing? I’m telling the truth, ya know? I still remember it clearly. I snapped out and there was this Priest girl in front of me.”", "Seol Jihu turned his gaze. Oana Halep and her older brother were coincidentally eating on the other side of the cafeteria.", "“That girl was a white-haired witch. Her face was like a blank slate but also had a bit of sensuality. You know what I mean? Ah, hey, pay attention! Where ya looking at? Focus— Hmm?”", "Hoshino Urara turned her head following Seol Jihu’s gaze. In the next moment, her eyes widened.", "“Eh? Yeah, that Priest looked just like her. Lanky, seductive eyes and—”", "“That’s the right person.”", "“Ah!?”", "Hoshino Urara shot up in surprise.", "“Wow! Yeah! You’re the girl from back then, right!?”", "“Yes, I am.”", "Oana Halep smiled bashfully and waved her hand.", "“Hello~”", "“Yo! Hello!”", "Hoshino Urara retorted cheerfully, then plopped back down.", "“Jeez, ya should’ve told me earlier. How embarrassing.”", "“I never got the chance.”", "“Anyway, wow, I see you’re all prepped up. Okay, that’s good. I’m down to go now if you want. How about it?”", "Hoshino Urara clenched her fists while bobbing up and down excitedly.", "Seol Jihu was more than happy to hear this but shook his head.", "“We plan to go as soon as possible, but not now.”", "“Why~?”", "“We still have to prepare some things. Don’t you need to recover as well, Miss Hoshino Urara?”", "Hearing this, Hoshino Urara’s eyes gazed at the empty air. She must be checking her Status Window.", "“…You’re right. My physical level is a mess. Like this, I wouldn’t call myself a Level 5, much less a Level 6.”", "“Rest up for now. We’ll be going sooner or later, so focus on your recovery until then.”", "Hoshino Urara whistled.", "“Iya~ Look at the way you talk. Oppa, you’ve got some good manners. I’m so~ lucky. Meeting a man who’s so thoughtful and considerate.”", "Hoshino Urara sent a hazy gaze with slightly loose pupils.", "“What should I do? I’m starting to like Oppa more and more.”", "She put her hands over her cheeks and screamed, “Kyaa!”", "“How about it? Wanna get it on tonight with me?”", "Seol Jihu got up, ignoring her completely. It didn’t look like she had any notion of running away. Since Chohong was going to keep a close eye on her, he had no reason to play along any further.", "“Go rest. You should try to get back in shape before we set out.”", "“Haaii!”", "Hoshino Urara shot up and saluted.", "Seol Jihu left the cafeteria while massaging his temples.", "‘What a tiring day…’", "But now, he finally had a safety net to counter the Parasite Queen’s scheme.", "‘What’s left now is…’", "And it was around this time that one of the titans of Paradise visited Valhalla.", "To meet its representative.", "This visitor was an Earthling he did not expect in the slightest.", "The romanized Japanese in this chapter was all like that in the RAW (i.e. the author wrote the Japanese pronunciation in Korean). Most of them were things Koreans would know (and coincidentally, most Japanese-media reading/watching English speakers). The only weird thing is the fact that he went with “Oppa” instead of “Onii-san” when he used “Onee-san” once anyways.", ""]}