{"cid": "463", "title": "Chapter 463. Golden Current Undulates in the Empire (1)", "content": ["“You got them all honed perfectly.”", "That was Jang Maldong’s assessment of the members of Valhalla after they returned from training.", "And he was right. Surrounded by enigmatic yet sharp energy, all of them looked completely different from when they first left.", "The change was only natural, considering the number of times they died, the endless verbal abuse they endured, and the tears they shed while climbing the slope.", "Seol Jihu held a strategy meeting as soon as they returned.", "During their absence, the Federation sent the entire dwarf race to help restore humanity, while making preparations for the war, including the ‘migration’ of the World Tree.", "It was decided that they would gather in the Hiral Mountain Range.", "The travel distance would be shortest for humanity if they crossed the Arden Mountain Range and joined forces within the Parasites territory. They still decided to congregate before crossing the border in case the Parasites tried to destroy the two forces individually.", "Apart from that, several different topics were discussed during the meeting, but there was only one thing Seol Jihu really needed to pay attention to.", "The Parasite Queen.", "The outcome of the battle between Seol Jihu and the Parasite Queen would greatly impact the outcome of the war.", "The Federation and humanity promised to create an environment where Seol Jihu could concentrate on his mission.", "Their assistance, if successful, would be a great help to Seol Jihu.", "After the agenda was set, Seol Jihu contacted the royal families and representative organizations of all the cities and asked them to send troops to Eva.", "He stressed that those who refuse the draft call would have no place left for them in Paradise after the war.", "Seol Jihu thought the procedure would not go as smoothly as he wished.", "Surprisingly, however, people from cities all across Paradise willingly responded to his request.", "Sure, the representative organizations were bound by Oaths, so they had no choice, but it surprised him that other Earthlings who did not belong to these organizations were also willing to comply.", "Out of curiosity, Seol Jihu looked into the matter and found out that the news of his victory over Sung Shihyun and his killing of Abhorrent Charity had spread throughout Haramark.", "Kim Hannah told him that this incident again reflected Earthlings’ tendency to prioritize their interests.", "They were only participating in the war because the situation did not seem as hopeless as it used to be. If they could come back alive, they would not only be recognized as heroes but would also be able to avoid being labeled cowards.", "At first, this made Seol Jihu a little bitter, but he soon changed his mind. This was, in fact, solid evidence that he had changed humanity.", "Humanity quickly responded to Valhalla's request for help, as it was something they were expecting.", "Haramark was the first to arrive.", "Jan Sactus led the troops to Eva on Teresa’s behalf, and the Earthlings from Sicilia arrived next.", "Agnes benefited from the changes led by Seol Jihu and was appointed the Apostle of Superbia. Another good news was that she was also promoted to Level 8 ‘Arachne’, in recognition of her services during the Imperial Oath Expedition and the war that followed.", "Next came Philip Muller of Odor and Yun Seora of Scheherazade, each leading their armies.", "Grazia and Caligo followed….", "Soon the entire humanity gathered in Eva under Valhalla’s command.", "The night before the storm….", "[Your Status Window]", "[1. General Information]Summoned Date: 2017. 03. 16Marking Grade: GoldSex/Age: Male/27Height/Weight: 180.5cm/75.8kgCurrent Condition: HealthyClass: Lv 9. Divine SpearNationality: Korea (Area 1)Affiliation: ValhallaAlias: The Adversary, Valhalla’s Representative, Savior of the Federation, Huuuge, Apostle of Gula, Haramark’s War Hero, Snowy, Training Masochist", "[2. Traits]1. Temperament—Self-command (Suppresses emotions, greed, and impulses with the rational will)—Superhuman (Unbelievably exceptional in enduring pain and hardship when compared to an average human being)—Competitiveness (A desire to win)", "2. Aptitude—Effort (Endeavors with both body and mind to achieve a goal)—Clear Mirror, Still Water (Possesses a calm, clean mind resembling a shining mirror and still water.)—Heart and Soul as One (Unfaltering and unwavering when concentrating on one thing)—Average (Normal in every way; possesses no particular talent)", "[3. Physical Level]Strength: EXEndurance: EXAgility: EXStamina: EXMana: Divine BeginningLuck: High (Intermediate)Remaining Ability Points: 4", "[4. Abilities]", "1. Authorities (3)—Servant (Grade Unknown): 1. Flonecia Lusignan La Rothschear (100%)—Godslaying (Grade Unknown)—Gluttony (Grade Unknown)", "2. Innate Ability (1)—Future-Gauging Nine Eyes (Grade Unknown)", "3. Class Abilities (12)—Awakening Skill: Berserk (EX)—Basic Spear Techniques: Thrust (EX), Strike (EX), Cut (EX)—Nemesis: Misfortune-delivering Curse Spear (Pinnacle)—Nemesis: Punishing Vengeance Spear (Pinnacle)—Aerial Movement (EX)—Mana Spear - Multiple (EX)—Secret Art: Sword Qi Wave (EX) - Explosion (EX)—Secret Art: Reinforced Sword Qi (Pinnacle) - Explosion (Pinnacle)—Secret Art: Mutilation (EX)—Trinity Harmony (Grade Unknown): One With the Spear (Grade Unknown), Flying Spear (Grade Unknown), Formless Spear (Grade Unknown), Mind Spear (Grade Unknown), Limitlessness (Grade Unknown), Thousand Stream Convergence (Grade Unknown)—Ethereal Shift (EX)—Righteous Heart (EX)", "4. Miscellaneous Abilities (7)—Reinforced Circuit (EX)—Grand Cosmic Shift (EX)—Hell Severing (EX)—Intuition (EX)—Thousand Thunder (Pinnacle)—Supernova Explosion (EX)", "[5. Level of Cognition]Executor (The Star of Gluttony, the one who leads Paradise) / Nervous / Golden Rule (To treat others as they have treated you)", "A smile spread across Seol Jihu’s face as he examined his status window.", "His weight had returned to normal.", "It was all thanks to Seo Yuhui’s care. Concerned that Seol Jihu had lost too much weight, she made sure he ate well and slept well during their time in the Path of the Soul.", "Two other changes besides his weight stood out more than others.", "The first was that the Authorities associated with the Spear of Purity moved to Class Abilities.", "This suggested that Seol Jihu had mastered these skills completely, though he had yet to learn the Seventh Ultimate Art. Spear God required a whole new level of mastery, unreachable even with Trinity Harmony.", "Black Seol Jihu said it couldn’t be helped, that Seol Jihu did well enough just to achieve Thousand Stream Convergence, which united the infinite flow of Limitlessness into one.", "The second was that he raised Thousand Thunder to Pinnacle.", "Black Seol Jihu was originally opposed to this, but since then, Seol Jihu’s Endurance and Stamina had risen to EX.", "Seol Jihu could have raised Thousand Thunder to EX if he wanted to, but deliberately stopped at Pinnacle to be completely safe.", "He was thoroughly happy with this change, as even Pinnacle significantly increased the destructive power of Hell Severing and Supernova Explosion.", "‘But what the hell is Huuge…?’", "He recently noticed that the female members of Valhalla giggled whenever he passed them. Few times he caught them glancing at his private area.", "As Seol Jihu tilted his head, his gaze suddenly shifted to the mirror. He recalled what Black Seol Jihu had said.", "‘What should I do….’", "After much thought, Seol Jihu stood in front of the mirror.", "He knew it was better not to look.", "But even if he were to lie in bed right now, he wouldn’t be able to sleep, as evidenced by the second slot of his Level of Cognition.", "Seol Jihu calmed his breathing and looked into his eyes in the mirror.", "Then he activated the Future-Gauging Nine Eyes.", "As his body began to emit golden light….", "FLASH!", "A vision began to unfold.", "*", "A fire blazed across the battlefield.", "On this day, the red star, an invader from outer space, finally regained its light.", "A black fire burned in the sky and swallowed all the stars across the universe, and Earth and one other planet were tainted with blood.", "A scene from hell unfolded in the center of the crimson light spreading like watercolor on canvas.", "Blood was everywhere. Bodies, their bones shattered and their flesh torn, formed a bottomless mire.", "‘This place is….’", "As Seol Jihu observed the surroundings, he instinctively realized where he was.", "He was looking at the past, not the future. He was standing on the battlefield of the last war of his previous life.", "Amidst the commotion, only one spot remained so silent that it stood out from the rest.", "There, a man and a woman stood glaring at each other, the space between them filled with tension.", "[How do you… feel?]", "The woman was the first to break the stifling silence, although she could hardly be called a woman.", "Only her face was that of a human. The rest of her body seemed to have been transformed into a completely different species.", "[I said, how do you feel? Answer me.]", "The creature, believed to have been a woman at some point during her lifetime, asked again. She sounded rather amused.", "[The woman you cherish so much, and the world that you love so much… both have come to this. I’d love to hear your thoughts on this matter. Care to speak?]", "‘Wait a second. That parasite is….’", "“Yun Seohui?”", "At the same time as Seol Jihu unwittingly muttered to himself….", "Puhak!", "Blood spattered.", "With a look of disbelief, Yun Seohui looked down at her chest.", "A spear had pierced through her lower left breast.", "The man, now standing behind her, had skewered her on his spear with a completely expressionless face.", "‘Black Seol Jihu.’", "Seol Jihu’s eyes tensed.", "The moment Yun Seohui felt the cold metal pierce her heart, her eyes shot wide open, then slowly began to close.", "Even while falling, Yun Seohui’s lips drew a curve, triumphantly grinning at her victory over Seol Jihu.", "It was then.", "[Seol Jihuuuu!]", "As Yun Seohui collapsed to the ground, a shadow roared and charged at the man from behind. It moved at lightning speed.", "Black Seol Jihu flinched and dropped his spear.", "But that was all that happened. The man spun with his fist already clenched, and it landed precisely on the enemy behind him.", "The shadow fell to the ground.", "[…Right. You were here, too.]", "Black Seol Jihu muttered quietly.", "[Kang Seok.]", "Seol Jihu doubted his ears for a second.", "He didn’t recognize Kang Seok right away because he had turned into a parasite.", "[I-It’s all your fault…!]", "Kang Seok tried to shout something even as blood spurted from his wound, but Black Seol Jihu wouldn’t listen.", "[Same here. If it weren’t for you, the Spirit Realm Expedition would’ve been successful.]", "His blood-soaked fist smashed down without any hesitation.", "Bam!", "The parasite’s head, wriggling like a worm on the ground, burst in an instant.", "[Back then.]", "But the man did not stop.", "Once.", "[At the Neutral Zone.]", "Twice.", "[I should’ve….]", "Three times.", "[Killed you….]", "Four times….", "[No matter what…!]", "He punched and punched, shouting at the top of his lungs.", "The one-sided beating ended only after Kang Seok’s skull was crushed, and his brain was oozing out.", "Black Seol Jihu raised his head and glanced around as if searching for the next prey.", "He picked up his spear from the ground and set out, his feet kicking against the ground stained with pieces of the brain and flesh.", "He ran into the thick fog, into the swirling ashes, his eyes gleaming like the devil….", "*", "The sudden and unexpected appearance fazed Seol Jihu.", "When he came to his senses, the vision had already progressed pretty far.", "He knew exactly what would happen next.", "Seo Yuhui would come and revive him from his death.", "But he was wrong.", "Somebody came before Seo Yuhui.", "[Then why didn’t you just grant his wish?]", "Seol Jihu’s jaw slowly dropped.", "[…O Venerable Gula.]", "[Please grant this Earthling’s wish.]", "“Ah.”", "[The Royal Oath… you haven’t forgotten about it, have you?]", "“Ah, ah….”", "When Seol Jihu saw Teresa raise her necklace, he shut his eyes.", "Now he finally knew. It had taken him too long.", "The vision ended there.", "Feeling perturbed, Seol Jihu stepped out of his room and headed for the garden.", "He sat alone and fell into contemplation.", "He went over the things he had just seen in the vision. He thought about Yun Seohui’s triumphant smirk, about the things that Kang Seok never got to say, and….", "‘Maybe I shouldn’t have seen it in the first place.’", "He couldn’t figure out why Black Seol Jihu had suggested that he take a look at it.", "Seol Jihu sat still for a long time….", "“Yap!”", "Until somebody tapped on his shoulder from behind.", "“What are you doing here alone?”", "He quickly looked up in surprise and saw Teresa sit down next to him.", "“Princess?”", "“I couldn’t sleep, so I thought I’d go for a stroll. Then I saw you.”", "Teresa poked Seol Jihu’s elbow.", "“You too?”", "“Ah…. I just had some things to think about.”", "“That’s surpri—”", "Teresa stopped in the middle of her sentence.", "“I mean… of course, since you’re human, too.”", "She rested her head on Seol Jihu’s shoulder and brought her face close to his.", "“Maybe the two of us insomniacs should keep each other company. Luckily for you, I know just the way to help you relax and sleep well.”", "“What is it?”", "“You know what I’m talking about.”", "“I want you to say it.”", "“Sex.”", "Seol Jihu smiled, and Teresa giggled.", "“That’s right! What are you going to do when the war is over?”", "It was an unexpected question. He’d never thought about it before.", "After he defeated the Parasite Queen and won the war….", "“Is there anything you want to do? Or want to be?”", "Something he wanted to do or wanted to be….", "‘…Hmm?’", "All of a sudden, Seol Jihu began to blink rapidly.", "Still, nothing came to mind, but his head felt clear again, free of all worry and anxiety. It was a strange feeling.", "“I’m going to become a queen, you see.”", "He realized all his worries were for nothing.", "“Not just the Queen of Haramark….”", "Seol Jihu looked up at the night sky as he listened to Teresa’s chatter.", "‘Until now….’", "He always looked up, even when he was walking on a bumpy path.", "Now, a future as bright as the stars in the night sky was right before his eyes.", "But he felt… uncertain.", "He just needed to take one more step but wasn’t sure if he could win against the Parasite Queen.", "In fact, the chances of him losing were far greater than that of winning, and….", "“…”", "…It pained him just to think about what would happen if he lost.", "He had sacrificed so much to get this far. He couldn’t let everything go to waste because of a single loss.", "Only Black Seol Jihu seemed to have noticed Seol Jihu’s worries, which he tried to hide from others.", "“…I won’t do that. That was all in the past. Now I have to look ahead in the future.”", "Suddenly, Teresa’s voice flowed into his ears.", "‘Ah.’", "Was this why Black Seol Jihu wanted him to look at the vision?", "[Don’t worry too much.]", "Seol Jihu finally understood.", "The past was just that. The past.", "Even something as trivial as the flapping of a butterfly’s wings could eventually set off a storm, and the changes Seol Jihu had made until now had gone well beyond that in terms of scale.", "So, of course, the future would have changed.", "‘That’s right.’", "Whatever the outcome, it would be better than it was in the past.", "So don’t obsess over the past you’ve never experienced and move forward—as you always have.", "That must have been what Black Seol Jihu wanted to tell him.", "…He was right. Seol Jihu had nothing to be afraid of.", "“You’re not going back to Earth just because the war is over, are you?”", "Just as he finally managed to calm down, a pleasant voice rang out.", "“No, you can’t go. I won’t allow it.”", "Teresa announced.", "“If you really have to go, at least leave behind a child. Then I’ll be able to carry on raising our child.”", "Seol Jihu gazed at Teresa, pouting with her arms crossed over her chest.", "He still remembered the first time they met.", "Even now, he couldn’t help but wonder what made him do the things he did.", "He followed Teresa to the battlefield when he was only Level 1, and volunteered to be a bait to save her.", "‘I always wondered why I felt so compelled to be near her….’", "Who knew something like that had happened?", "Seol Jihu gave a small smile.", "“W-Why are you laughing?”", "“Princess, you….”", "“Ah, I know what you’re gonna say. You—”", "“You must like me very much.”", "A look of shock spread across Teresa’s face.", "This time again, she thought he would say….", "“…Pardon?”", "…But she became the one to say it.", "“I don’t know.”", "Seol Jihu continued.", "“I don’t know what I’m going to do or what I’m going to become. I’ll think about it when the war is actually over.”", "“I… Uh….”", "“And that’s also when I’ll be able to tell you how I feel about you, Princess.”", "Teresa’s eyes widened.", "He didn’t evade the subject?", "“Because….”", "Suddenly, a cool breeze blew by and ruffled both their hair.", "Here in the moonlit garden….", "“Tonight….”", "Brushing his hair off his forehead, Seol Jihu….", "“I can’t think of anything other than tomorrow’s battle.”", "He stretched out his arm and smoothed Teresa’s hair with his hand.", "“…Princess?”", "Suddenly, his gaze shifted to Teresa’s face.", "Teresa was staring into Seol Jihu’s eyes with a dreamy look on her face.", "Her lips parted slowly.", "“So cool….”", "She muttered in a small voice that Seol Jihu did not hear.", "The blush on her cheeks was pink under the bright moonlight.", "“Why can’t you just…. No, nevermind.”", "He could be mistaken, but Seol Jihu thought he saw hearts in her eyes.", "“You’re right. It doesn’t have to be now.”", "Even her breathing was getting heavier.", "“I brought this just in case….”", "Though Teresa’s face remained completely mesmerized, her hands moved with agility.", "She took something small and square out of her pocket.", "“Alright, mister. I’ll let you off the hook for today.”", "What was she talking about? And why was she suddenly speaking like that?", "Seol Jihu only realized something was wrong when Teresa showed him what was in her hand.", "“But this is okay, right?”", "“What do you mean?”", "“Don’t worry. I didn’t puncture it or anything.”", "Rip!", "Without hesitation, she tore the wrapper, and a round, translucent, rubber-like object popped out of it.", "‘…Huh?’", "Seol Jihu’s eyes widened in an instant.", "*", "Chirp, chirp!", "Morning dawned with the sound of chirping birds.", "As soon as Seol Jihu got up, he began preparing for the departure.", "He felt great. Last night he was able to relax and sleep well thanks to Teresa.", "This morning, the streets of Eva formed a magnificent sight.", "Troops from all cities, except Nur, which had been completely destroyed, were gathered, and tents were lined up not just inside but outside the city walls as well.", "“Let’s go.”", "After all preparations were made, Seol Jihu led the members of Valhalla outside.", "That day, humanity began to march toward the Hiral Mountain Range.", "Their goal: total destruction of the Parasites.", "The battle to mark the end of the long war had finally begun."]}