{"cid": "438", "title": "Chapter 438. With One Spear and Two Legs (3)", "content": ["Seol Jihu felt like he was dreaming and was in a dream world, much like the one created by Roselle.", "Everything he saw and felt was vague and distant. Surrounded by uncertainty, only he could move freely.", "Perhaps this was what a lucid dream was. Everything he wished for came true, as is often the case in dreams. He could perform any technique that he set his mind to, and his body moved flawlessly according to his will. The combination of the three factors — mind, technique, and body — opened his eyes to a world of infinite possibilities.", "He finally understood what it meant to secure his own domain. It was still far from complete, but he felt like he would never lose as long as he stayed here.", "If he could stay in this state longer, escape would no longer be just a dream. His bleak heart began to fill with courage and hope.", "Just as he found the first light of hope after a long night of floundering in the sea of despair….", "Seol Jihu stopped.", "“…Huh?”", "He suddenly felt as if he had woken up. Seol Jihu wiped his cheek with the back of his hand with a puzzled look. A stream of cold liquid was trickling down it.", "‘…Rain?’", "Chwaaaa—", "The sound of falling rain began to echo in his ears.", "‘No….’", "The sound grew louder each time he thought he didn’t want to wake up.", "‘No….’", "But the overwhelming presence in front of him was forcing him to open his eyes. As much as he didn’t want to see, he had no choice. The presence was the reason he stopped in the first place.", "It was then.", "Clap, clap, clap, clap….", "Suddenly, he heard slow applause.", "[Amazing….]", "A dignified voice resounded.", "[You’ve managed to come this far despite the many obstacles that stood in your way.]", "Standing in the pouring rain, Seol Jihu slowly raised his head. He opened his eyes and registered the world around him. In the face of reality, Seol Jihu….", "“…”", "…closed his mouth.", "The first thing he saw was the Parasite army, the size of which seemed to easily surpass the combined numbers of all the enemies he had encountered so far.", "Among them, he saw the three Army Commanders and their armies that he had previously fought. He also saw the two people he never wished to meet again: Sung Shihyun, sitting on the ground in a white uniform, and Twisted Kindness, standing with her arms crossed in front of her.", "And then there was the god, leaning against the air as if there was an invisible throne beneath her, gazing down at him with arrogant eyes, exuding a powerful presence — the Parasite Queen.", "[Seol Jihu.]", "The Parasite Queen’s chin lifted slightly. Her gaze traveled vertically from Seol Jihu’s head to toe, slowly as if savoring his entire being.", "[We finally meet!]", "[Seol Jihu, ah, Seol Jihu…. You’ve interrupted my grand plan far too many times.]", "She repeated his name several times as if tasting it.", "[If it weren’t for you, this world would already be in my hands.]", "[It is you who ruined everything.]", "The resentful voice continued.", "[When I think of all you’ve done to me, a violent urge erupts within me—an urge to tear you apart into a million pieces….]", "[…However, I cannot deny you’re different from all the other insects.]", "The Parasite Queen’s voice suddenly softened.", "[Ever since my birth on the icy planet, until I conquered the galaxy….]", "[I have never suffered a defeat, except for the one time I made a wrong choice that plunged me to the depths of the abyss.]", "[In terms of significance, I’m sure you are ranked far below me in this universe.]", "[This is the first time my plans have been compromised by such a lowly being.]", "[I cannot help but think… killing you is a waste of your potential.]", "The Parasite Queen paused.", "[I’ll be straightforward.]", "After a moment of silence, she raised her voice.", "[Join me.]", "[The position you want, the power you seek…. No, listing them all would be a waste of time.]", "[As long as it doesn’t interfere with my plans, I will grant you everything you wish for.]", "The Parasite Queen was asking Seol Jihu to switch sides.", "[I’m giving you a chance.]", "She emphasized again.", "Her offer was far from surprising, as Seol Jihu had already received the same proposal once before.", "The same was true of the Parasites. No one objected. Apart from the fact that they could not disobey the queen’s orders, they had already accepted Seol Jihu as their equal during their earlier clashes. Of course, they all knew that Seol Jihu was unlikely to accept their offer. Regardless, they had to cover all bases.", "Surprisingly, Seol Jihu did not refuse immediately. He lowered his head, opened his lips, and then closed them again. His shoulders moved slightly as he inhaled and exhaled, and this made him appear to be in deep thought.", "“…Ha.”", "Sung Shihyun, who was closely watching Seol Jihu, snorted.", "“Your Majesty?”", "He chuckled with disdain.", "“That bastard, he’s only pretending to think to catch his breath.”", "The Parasite Queen’s eyes narrowed. Her eyes caught a glimpse of Seol Jihu’s smile as rain washed away the blood dripping from the corner of his mouth.", "For Seol Jihu, the Queen’s offer was not even worth a second of thought. She said she would grant him any wish as long as it did not interfere with her plans. But how could they work together when what they sought fundamentally contradicted each other?", "He understood that the Parasite Queen knew better than to expect the impossible, and she was just being thorough.", "[How foolish.]", "The voice echoing throughout the field became as cold as ice.", "[…Fine. If that’s your choice, then I’ll give you the future you’ve chosen for yourself.]", "That was the last straw for the Parasite Queen.", "[Fight like a dog and die like a dog.]", "[I wonder if you can stay calm even as you suffer a miserable death.]", "Somewhat offended by his choice, the queen taunted, but Seol Jihu remained silent. As Sung Shihyun said, catching his breath was far more crucial for him right now.", "He never had any choice from the start. He had already decided to fight when he stopped running. Now, there was only one possible outcome between the two possibilities: lose and die or win and escape.", "And frankly, he was curious how long he could hold out against them all. ‘Will I be able to survive?’ Seol Jihu thought before letting out a chuckle.", "[Why are you standing still?]", "At the same time, as the Parasite Queen’s voice rang out, Sung Shihyun stood up. He raised his arms and stretched, tilting his head side to side. Twisted Kindness unfolded her arms and spread her wings.", "And Seol Jihu, faced with an important battle, raised his eyes to the sky and sighed.", "The rain had already stopped.", "[Let’s not waste any more time.]", "The Parasite Queen waved her arm as if warding off a troublesome bug.", "[Commence!]", "Shwing!", "With an eerie scraping sound, a white blade was pulled from Sung Shihyun’s sheath, and a pair of swords were drawn from around Twisted Kindness’ waist.", "The two strongest Parasites, the First and Seventh Army Commanders, took a step in Seol Jihu’s direction, their gaze fixed on the enemy.", "“I give you credit for making it this far. But—”", "Sung Shihyun spoke, spinning his sword in his hand.", "“Just to be clear, you’re not putting us in the same category as the Idiot Trio, are you?”", "By ‘Idiot Trio’, he was referring to the Second, Fifth, and the Sixth Army Commanders. Exploding Patience and Vulgar Chastity seemed displeased with the name but couldn’t say anything, for it was a fact that they failed in killing one human even after releasing their divinities.", "“Don’t think we’re the same~ I bet you’ll regret it.”", "With a chuckle, Sung Shihyun slowly began to approach Seol Jihu.", "There was still no answer from Seol Jihu. His entire focus was on his breathing. He stood utterly motionless, only his grip tightening around the Spear of Purity stuck in the ground.", "“Come on, at least say something. Or is it that you are too tired to—”", "Sung Shihyun suddenly stopped in place. So did Twisted Kindness.", "“…”", "Sensing that something was wrong, Sung Shihyun glanced at Seol Jihu.", "Pzzt!", "Suddenly gold sparks erupted from the tip of the snow-white spear pointing toward the sky. Immediately an aura began to form around Seol Jihu. This aura was invisible but extremely powerful and destructive.", "An oppressive silence hung over the field. Not even the sound of breathing was heard. No one said a thing, but everyone felt the terrifying mana had already filled the air around them.", "Wooong!", "The aura’s ripples passed Sung Shihyun six times in the blink of an eye.", "“…Hoh.”", "Sung Shihyun tightened his grip around the hilt of his sword as the soil began to rise in lumps from the ground. Tension mounted when he raised his mana, mixed with divinity.", "The battle had already begun.", "Twisted Kindness must have thought the same, and she quickly soared into the sky chanting a spell.", "Amidst a strange silence, a single man faced off against a team of a man and a woman.", "One, two, three, and then, four seconds passed by. The tension-filled silence ensued, when suddenly….", "BOOM!", "A massive explosion shook everything in the vicinity.", "Behind Seol Jihu, a sphere with an infinite number of rings around it rose from the ground. As the rings rotated faster and faster, the sphere grew bigger, and the light it emitted also became intenser.", "The sphere, now as bright as the sun, began to shake violently. Its blinding light caused Sung Shihyun to cover his eyes partially with his robe’s long sleeve.", "Cracks began to form on the surface of the sphere, shaking like an egg about to hatch. Sung Shihyun’s eyes shot wide open when he sensed the condensed energy spouting from between the cracks.", "Seol Jihu’s Unique Spatial Ability — Supernova Explosion.", "At last, the rings revolving around the sphere were launched outward in all directions like bullets fired from a machine gun, and the energy beneath the sphere’s surface began to overflow like a bursting river dam.", "As this happened, Sung Shihyun too, released his divinity and raised his longsword. The longsword began to emit bright light as it pierced the air.", "Sung Shihyun’s Unique Spatial Ability — Flowering Rain.", "A strand of white sword qi gushed out of the blade of the sword. The sword qi split into two strands and then into four strands as it shot forward. Then, in the blink of an eye, it further divided into 16 strands, which, after a few seconds, became 256 strands.", "In the end, the strands of sword qi became close to 10,000 in number, and each rushed toward the enemy—the wave of electricity barreling toward them, searing the rain-soaked earth—as if competing against each other.", "KUAAAAAAA!", "The air seemed to scream. Much like the sea’s surface when hit by a storm, it wavered near the point of contact between the two overwhelming forces.", "The strands of sword qi left a long trail behind them as they crashed into the wave of lightning desperate to devour everything. There was something beautiful about the way these two forces clashed, pushing back and forth against each other.", "“Ha!”", "Sung Shihyun burst into laughter when he felt his longsword, which was connected to every single strand of sword qi, tremble.", "The same was true of Twisted Kindness. She was busy avoiding the rings of lightning, which carried enough destructive power to cut even space itself. As her body twisted and turned in the air like she was dancing, a satisfying smile crossed her face.", "“This is what I call a warm-up!”", "It was then. Amidst the lightning flashes, Twisted Kindness saw a golden flame engulf Seol Jihu’s whole body.", "Seol Jihu’s Unique Spatial Ability — Thousand Thunder.", "After swallowing Seol Jihu whole, the flame shot up into the sky and not toward the spear.", "Rumble!", "The crackling sound of lightning resounded. Twisted Kindness hurriedly raised her head and saw a golden light flash across the dark sky.", "Immediately the layers of dark clouds scattered with a swirl, causing electricity to rise around them. As if responding to Seol Jihu’s energy, lightning flashed and thunder crashed everywhere in the sky.", "‘That’s…!’", "Twisted Kindness shivered. She was looking at thunderclouds, without a doubt.", "“Come! Six Domains of the Desire Realm!”", "Twisted Kindness quickly threw the twin swords into the air and recited a spell….", "Seol Jihu’s Unique Spatial Ability — Hell Severing.", "…At the same time as thousands of lightning bolts poured down at her from the sky.", "Rumble!", "“HAAAAAAAAA!”", "Twisted Kindness roared as she witnessed the thunderbolts of lightning raining down from the sky toward her in zigzags.", "Hundreds of red magic circles rose into the air surrounding her, and each magic circle, with a flash, shot out a ray of crimson light toward the sky, toward the lightning.", "Tzzzzzzt!", "Lightning flashed everywhere. Every time the golden lightning and the blood-colored lightning crashed against each other, it resulted in a horrific rattle of thunder.", "The air on which the magic circles rested shook violently as if about to be ripped apart.", "[Hmm….]", "The Parasite Queen watched this tug-of-war from afar, resting her chin in the palm of her hand.", "Even as she watched the fierce battle, which literally shook the sky and the earth, the queen’s expression remained cool. It was not the first time for her, who used to be the ruler of an entire galaxy, to witness a fight of this magnitude.", "As time went by, the two forces slowly began to disappear as if canceling each other out. As the flashing lights faded….", "[What are you doing?]", "…The Parasite Queen’s apathetic voice rang out.", "[Don’t tell me that you two, as demigods, can’t even defeat a human on the verge of collapse.]", "“…It’s more intense than I thought.”", "After the explosion subsided, Sung Shihyun expelled the breath he had held in and clicked his tongue.", "“But there’s no way I’ll lose.”", "He tightened his grip again and straightened his posture.", "Then he turned to Seol Jihu, who had one hand firmly around his spear, his eyes turning crimson. Sung Shihyun smirked, his own eyes glowing red.", "Level 7 Star Seeker, Awakening Skill — Berserk.", "Level 7 Pinnacle-Rank Mana Swordsman, Awakening Skill — Berserk.", "Crimson hostility blazed in the eyes of the two men as their mouths opened simultaneously.", "And just like that….", "HUAAAAAAA!", "The last of the four most brutal battles Seol Jihu fought during his time in Paradise….", "KIAAAAAAAA!", "…began."]}