{"cid": "168", "title": "Chapter 168. Skirmish (3)", "content": ["A fierce battle raged on in front of the fortress.", "Haramark’s heavy infantry unit consisting only of seasoned veterans that survived the frontlines for many years was skillfully resisting the enemy’s charge.", "The front row drove their shields into the ground while the second row placed their shields on top, creating an impregnable iron wall.", "However, the ones trying to breach the line weren’t easy to deal with either.", "Parasites spurred on by the enraged Medusas rammed into the spears and desperately tried to climb over the shield wall.", "As an undead wolf used the pile of corpses to fling its body over the wall, Jan Sanctus stabbed out with a spear and hurled it away before shouting.", "“Resist! Resist with all you've got! Remember that the moment there’s a gap between the shields, we’re all dead!”", "As he was roaring encouragements, he felt an unusual commotion behind him and turned around.", "The Earthlings were running towards them.", "\"The Earthling bastards are coming! Resist just a little more!\"", "\"Fuck! They sure took their sweet time!\"", "A veteran soldier that was desperately holding on to his shield shouted out. A few of the soldiers around him with scrunched up faces let out grim smiles.", "They couldn’t burst into laughter since they were in a life or death situation, but they were seasoned enough to be able to joke around in the face of death.", "\"Don’t open your mouths! Save your energy!\"", "Jan Sanctus, who rebuked them quickly, turned his head to confirm the distance.", "His intense eyes widened.", "A certain group that left all the other groups behind caught his eye.", "\"Move out of the way!\"", "A woman that was running towards them with her shield held upright, fluttering her curly red hair behind her, shouted.", "Jan Sanctus shouted in response.", "\"Rhat! Zimmer! Get ready!”", "The two soldiers glanced behind them.", "And when she drew close enough…", "\"Now!”", "The two soldiers heavily pushed out and instantly turned their bodies 90 degrees.", "\"Euyaaaa!\"", "Phi Sora held out her shield in front of her as she charged in through the gap like a raging tank.", "Booom!", "An explosion blasted out, causing people’s ears to ring. Due to the sudden impact, the Parasites in front were flung back and their ranks collapsed.", "There was even one that spattered sparks as it was blasted into the sky.", "However, Phi Sora who had stopped after her charge was surprisingly unharmed and her stance was stable.", "The only peculiar point was that her skin and armor were letting off white smoke.", "\"Ah.\"", "Phi Sora lifted her head and pumped out her chest, showing her white teeth.", "\"My body finally feels warmed up.\"", "She kicked up a monster that was fearfully trying to raise its body before smashing it back into the ground with her heels.", "She struck away a Parasite that launched itself at her from the side with her shield and swung her red sword that was swathed in flames.", "Several people rushed over and joined her the next moment.", "Jan Sanctus’ gaze was focused on a young man that was stabbing out with a bluish spear.", "The speartip that was shining gold was rapidly piercing through the enemies stunned by Phi Sora’s charge.", "The increasingly faster spear strokes gave an illusion of melting down the enemy ranks.", "Jan Sanctus nodded seeing the strike team following Seol Jihu demolish the Parasites at a terrifying pace.", "The group escorting this team would have a high chance of living.", "It was a common banter exchanged by the soldiers before entering the battlefield. Their survival rates depended on which group of Earthlings they cooperated with.", "It was a pretty realistic story to simply brush it off as a joke.", "Some Earthlings treated the soldiers like meat shields or consumable pawns. There were even cases where they fled, leaving the soldiers that desperately made a path for them to escape.", "Judging with that in mind, the young man’s actions could be seen as extremely commendable from a Paradisian’s point of view, but…", "'Hmm?'", "Seeing Seol Jihu get rid of all the enemies in the vicinity and recklessly glance in front of him, a glint flashed in Jan Sanctus’ eyes.", "He grabbed Seol Jihu by his shoulders, as he was trying to force his way through the wall of shoulders made by his subordinates. Jan Sanctus felt a strong resistance in his hand but managed to forcefully drag Seol Jihu backwards.", "Seol Jihu fiercely glanced back. Jan Sanctus solemnly raised his arm and pointed at the sky.", "Seol Jihu frowned and tilted his head up.", "The blade boomerangs fired from the fortress flew past diagonally and swept away the enemies rushing towards them.", "Arrows rained down, drawing parabolic arcs and piercing the enemies that were relatively near the fortress.", "\"I’m grateful for your enthusiasm.\"", "A low-pitched voice reverberated in Seol Jihu’s ears while he was blankly staring upwards.", "\"But it’s not a good choice to wear yourself out from the start. Not only is it going to make things harder for you, but you’re going to be a burden for us and your allies.”", "Seol Jihu slowly blinked. A man’s face suddenly came into his gaze. It was the general who had come to get him when Teresa invited him to the palace.", "In other words, his thoughts were so preoccupied that he hadn’t even recognized the man.", "\"You’re going to have to continuously fight even if you don’t want to later on. Swing your spear fiercely but maintain a clear mind while moving.”", "It was a cold splash of water. His flushed face slowly regained some of its color.", "They didn’t talk for long as they were in the midst of a battle.", "Seeing him regain his calm, Jan Sanctus commanded in a thunderous voice.", "\"All soldiers, ready again and chaaarge!\"", "The soldiers who had been kneeling on one knee stood up all at once. They uniformly marched forwards, stepping on the still-squirming corpses with their steel-clad boots.", "And through this, their mission of securing a space for the Earthlings to come out was complete. Now, they had to deal with the Medusas that were commanding the enemy units.", "The soldiers’ role here was to open up a path to the Medusas.", "Due to the fact that the ten Medusas were spread out throughout the battlefield, the once straight defense line began to fan out.", "But whenever the strike groups cleared out the Parasites in the front, the ones waiting in the back no longer had obstructions and immediately swarmed in.", "Even after sweeping away the enemies and firing countless arrows at them, the Parasites boasted a mind-boggling number of troops that didn’t seem to wane.", "The soldiers that charged forward shouted battle cries as they extended their spears. Unsettling crashing noises rang out.", "The majority of the Parasites were pierced through by the spears or blocked by the shields, but a considerable amount still managed to break through the wall.", "A ghoul-like creature that was definitely a human before it died came running while dangling its arms.", "Seol Jihu’s spear cut through the air and precisely stabbed its forehead. And in that position, he flicked his spear upwards, causing a black stream of blood to shoot out from between its eyebrows.", "Golden electricity simultaneously sparked out.", "Even before ice spread out from the wound, the ghoul’s head was burnt black.", "\"Keeeeeurr!\"", "Next, an unknown race of midgets came running in a row holding hammers.", "Seol Jihu tightened his grip on his spear with both hands and stabbed out with his spear while running forwards.", "Puk. A sensation of jabbing a rotten fruit was transmitted to his hands.", "Seol Jihu pushed forward the spear that had stabbed through the enemy’s chest. The spearhead that pierced through the first one went through the chests of the ones after it.", "The midgets spasmed as if they were struck by lightning before their bodies went limp.", "Upon taking out his spear, the holes in their chests spilled out dark red juices.", "He felt a gust of wind hit his neck at that moment. A half-human half-beast with half of its body rotting away had kicked the ground and jumped into the air.", "It was as if it was going to strike him just like that.", "The fierce momentum of the claws that descended made Seol Jihu gulp nervously.", "'Maintain a clear mind.'", "As he dodged, twisting his body backward, a dirty claw swiped past his eyes. A few strands of what looked like his front bangs tickled his eyeballs.", "‘And swing my spear fiercely.'", "Seol Jihu’s eyes widened. He thrust at its head the moment the enemy landed, but the monster skillfully caught the spearhead with its teeth.", "Then, it immediately grabbed the spear and strongly bit down as if it wanted to bite the spear apart.", "However, Seol Jihu didn’t panic and lifted up the entire spear. He then smashed down the spear, causing the half-human half-beast to be helplessly thrown down.", "Seol Jihu raised his leg and stepped on the enemy’s chest before thrusting down at its throat. The half-human half-beast madly struggled before its limbs lost their strength.", "Twisting out his spear, Seol Jihu paused to take a breather and took a deep breath. A revolting stench filled his mouth.", "When he was about to spit…", "\"!\"", "Seol Jihu intuitively swung his spear backward without turning around.", "A satisfying sensation of cutting through flesh was felt.", "Hurriedly turning around, he could see three wolves crashing down from the sky. The squirming beasts had their wounds burn up before their convulsions ceased.", "He had cut down over ten Parasites in an instant while mindlessly fighting.", "Seol Jihu shivered. He was met with a continuous series of surprises the longer he fought.", "The monsters infected by the Parasites were all from different races, but there was one thing they had in common — that they were all extremely hard to kill.", "As long as the Parasite that controlled the body wasn’t killed, the monster would fight even with only its head left intact.", "But every time he struck with his spear, a monster was killed.", "It was literally a one shot one kill.", "'This is it.'", "\"Help me!\"", "He suddenly heard an urgent scream.", "A human’s, no, it was a soldier’s cry.", "Boom! Boom! An unsettling noise was gradually approaching.", "Seol Jihu’s eyes narrowed as he glanced over to the soldier’s direction.", "A group of four monsters over two meters tall were furiously charging towards him.", "He didn’t need to imagine what would happen if the brutes crashed into the defense line.", "Seol Jihu stopped himself from immediately running over. He suddenly thought of something before making a stance and diagonally raising his right arm.", "A Mana Spear that emitted a golden light formed in his right fist.", "After a short running start, Seol Jihu lowered his upper body as he powerfully swung his arm.", "Chazak!", "A crash of thunder rang out. The monster that noticed the attack twisted its body.", "But it couldn’t entirely avoid it, causing electric arcs to crackle all over its left arm and paralyze it.", "\"Keeurrrr!\"", "The momentarily stunned giant ripped off its own arm without hesitation before viciously staring at Seol Jihu and letting out a roar.", "The four monsters were furious as they lowered their bodies as much as possible and tensed their legs. Then they shot out like springs at an incredibly fast speed.", "‘Let’s see you try avoiding it again.'", "As the monsters charged at him like enraged bulls, Seol Jihu simultaneously summoned four Mana Spears and launched them before immediately repeating his actions.", "And another time.", "Though it lacked firepower, the fact that he could shoot them out continuously was the skill’s perk.", "Furthermore, adding the anti-evil attribute in his mana, the monsters that were barraged by tens of Mana Spears halted their charge before staggering.", "Chohong, Oh Rahee, Phi Sora, and Hugo took advantage of the situation and rushed forward to slit their necks. The ground shook as the four powerful giants fell at the same time.", "'Not bad.'", "It was a skill fit to be called Lightning Barrage rather than Mana Spear.", "As Seol Jihu repeatedly opened and closed his fists, Chohong gave him a thumbs up while sending him a look of disbelief that plainly asked ‘Just what are you? What happened to you?’", "But Seol Jihu couldn’t explain as he himself didn’t know that the power of the Essence of Soma was strong to such an extent.", "Neither was it an appropriate time to do so.", "The soldier looked at Seol Jihu with terrified eyes before quickly turning his gaze to the battlefield. They had barely survived a single wave, but a new swarm of monsters filled the horizon and was rushing at them like a tsunami.", "The soldiers grit their teeth and ran to confront them, resuming the long battle.", "The fight pattern was fairly simple. When the enemy showed up, the soldiers would act as the buffer, buying enough time for the Earthlings to come and kill them.", "The soldiers that repeatedly defeated each wave using this pattern suddenly had a strange feeling.", "They were able to advance forward much more easily than they had thought. Thinking back, they hadn’t been held in place since the battle started and even when they were forced to stop, the situation was quickly resolved each time.", "If they weren’t mistaken, then the number of enemy troops that actually rushed at them was much less than the ones they could see.", "To say that it was because of the support fire from the fortress was insufficient. The survival rate of their fellow soldiers was unnaturally high despite advancing this far into enemy lines.", "Of course, they knew that the strike team behind them had a tremendous combat prowess but…", "'Huh?'", "A woman that smashed her iron mace into an enemy’s chest, and a woman that made heads fly with her fast sword. The sight of something in between these two women made a soldier squint his eyes in doubt.", "'Smoke?'", "If he hadn’t seen wrong, then there was a cloud of black smoke flying around.", "At a very fast speed at that.", "It was weaving through the enemy ranks, plucking out heads and tearing their bodies apart, reducing their numbers with a terrifying pace.", "The soldier that was dumbly staring at the unexplainable phenomenon suddenly came to an understanding.", "'It must be magic!'", "Speaking of which, he had heard that the Haramark Royal Family had employed a High-Rank Magician for an enormous sum.", "Realizing that the Magician able to turn the tides of war was supporting his area, the soldier grew brave.", "The Earthlings his team was paired up with were already fighting beyond his expectations so his motivation was bolstered, causing him to urge his comrades on, and lead the way with all he had.", "But good things never lasted long.", "If fortune came, then so did disaster.", "The soldier who was constantly watching his surroundings suddenly made a bewildered expression."]}