{"cid": "113", "title": "Chapter 113. Harem of Hell", "content": ["It wasn’t such a good idea to ride a carriage through a desert. The soft sand could easily break the wheels, and the running speed also had to slow down significantly.", "Because of the hot sand, the Horuses pulling the carriage would also become tired easily. Of course, it wasn’t as if they would suddenly collapse, especially with an ample supply of water and hay, but considering that the team was traveling in the Salt Desert that was known for its hilly terrain, traveling by carriage was definitely inefficient.", "As such, once the team arrived at the entrance of the desert, they began to cross it on foot. As expected of a desert, the daytime temperature was scorching hot, as if the air itself was boiling. Furthermore, every time one took a breath, a salty smell stung the nose, inducing one to feel parched.", "Seol Jihu walked in this terrible environment, but he didn’t look like he was having a hard time. It wasn’t that his face didn’t show it, but that he really found it quite simple.", "This was mainly due to his Stamina stat having risen to Intermediate, but it was also because he had endured much greater mental pain.", "Compared to the time he had no water or food for eight days while having to constantly escape without a wink of sleep, walking in this desert was like taking a stroll in heaven. After all, he had food, water, and a clear destination.", "This was also why he was fine carrying the tired Maria on his back.", "However, even though Seol Jihu had no problem with the environment, his complexion was still dark for one small reason. And that was the large group of people following them at a distance.", "Chohong told him to ignore them, saying, ‘Those hyenas would have attacked us already if they wanted to. Don’t worry.’ But Seol Jihu found it hard to just forget about them. The glances that sometimes pricked his neck and back were too chilling. They bothered him more because their hostility was so explicit rather than furtive.", "‘They got smaller again.’", "In just a day or two, the group that seemed like an army of millions at the start had now been cut down by half. The missing people might have given up and gone back, but Seol Jihu knew that this wasn’t the only reason.", "It wasn’t that he was afraid.", "Level 4 Barbarian Warrior - Richard Hugo.Level 5 Chief Priest - Nameless Priest.Level 4 Thief Striker - Sakamoto Jun.Level 5 Grand Pathfinder - Ayase Kazuki.Level 4 High Priest - Maria Yeriel.Level 5 Templar - Chung Chohong.", "Being worried about a potential battle would be unfounded with such a powerful team. However, as Seol Jihu was at the front of the group, he couldn’t help but worry that something would happen to his teammates while he wasn’t watching.", "“Hyung-nim.”", "Noticing that Seol Jihu was putting a great deal of attention behind him, Jun spoke.", "“You know, to Earthlings, the Banquet is like going to buy a biennial lottery.”", "Seol Jihu listened in, even though he found it weird that Jun was referring to them as ‘Earthlings’.", "“If we calculate simply in terms of sample size, then they have a 0.012% chance of winning this lottery.”", "“Is that high or low?”", "“It’s high. Extremely. That’s about a 1 in 8 million chance. In comparison, real lotteries are about 1 in 300 million.”", "“But you have to bet your life on this one.”", "“Not necessarily. From what I know, you can leave Stage 3 in the middle. And if you’re lucky and manage to clear it, it’s the same as winning a progressive Powerball jackpot that’s been carried over for multiple drawings.”", "It sounded like Jun was quite knowledgeable about how foreign lotteries worked. He glanced back before spinning his short katana and sniggered, “What’s important is that Level 4s, Level 3s, and even Level 2s have been winners. Though, that’s only in the beginning.”", "“….”", "“Most importantly, depending on the individual, the ‘Harmonious Wish’ can be a reward that’s equivalent to the ‘wish’ that can be granted by the Gods. There might be people dreaming about turning their life around like me, or there might be others with other dreams. Regardless, wouldn’t you be willing to bet your life on such a chance?”", "Seol Jihu sighed.", "“But still, if we had just filled up all spots from beginning….”", "Seol Jihu was about to finish by saying, ‘They might not have followed us.’ However, he swallowed his words.", "Would those people really not have followed the group if they had come as a team of ten? And if they did follow them, how should the group interpret that?", "“Don’t make that conclusion so hastily, Hyung-nim. There aren’t many things in this world you can be sure about.”", "Jun laughed, but Seol Jihu couldn’t. Jun was implying that Kazuki had left three spots on purpose, essentially telling the followers, ‘We’ll leave some breadcrumbs, so don’t bother us.’", "“Ah, but don’t misunderstand either. The reason Kazuki Hyung-nim only gathered the seven of us is also because he cares a lot about the team color.”", "“Team color?”", "“Yep. Having more people isn’t always a good thing, especially when it concerns working together in a team. For example, what’s on your back.”", "Jun poked the short, robed figure piggybacked on Seol Jihu. As Maria was normally extremely weak to heat waves, she was in a groggy state from the sweltering heat.", "“Look at little Maria-chan. She was allowed in because we weren’t in a position to be picky. Otherwise, with Kazuki Hyung-nim’s personality, he would have seriously considered rejecting her.”", "“But Miss Maria is—”", "“Ah, I know. She’s an excellent Priest. The problem is her personality. To be precise, it’s her interpersonal relationship and sociability.”", "Seol Jihu was at a loss for words. He couldn’t say anything in response because Jun made a good point.", "“I’m sure Kazuki Hyung-nim is nervous. I sure am. Having two of the Six Crazies in one team? My. God.”", "However, as if she’d had enough of it, an angry “Un!” came from Seol Jihu’s back and the robed figure wriggled powerfully. ‘Shut the fuck up,’ was what she seemed to be saying. Seol Jihu thought she had fallen asleep, but it seemed she at least had her ears open.", "“Hehe~ Wriggling Maria-chan is cute too~”", "While Jun giggled, Seol Jihu glanced to the side. This was because Jun mentioning the Six Crazies had reminded him of someone.", "He spoke quietly, “Then what about Chohong?”", "“Chung Chohong Noonim is different,” Jun gestured at Seol Jihu to come closer before speaking softly.", "“Not only is she a High Ranker, but she’s also famous as the Slaughter Maiden. I’m certain she is the biggest reason those hyenas aren’t coming anywhere near us.”", "“Really?”", "“Yep. It’s obvious what will happen if they do. She’ll blow their heads to smithereens. Speaking of which, that weapon of hers is really….”", "Chohong must have heard them as her neck stiffened. Her bent back also stood tall like a bamboo.", "“Hey, why are you talking so much in the middle of a march? Aren’t you thirsty?”", "She even handed Jun a water bottle. From the looks of it, she had been listening in from the start. She had to be happy because Jun praised her while talking down on Maria.", "“Oh! Thank you!” Jun took the water bottle without hesitation.", "“By the way, I agree with you. How can anyone be so weak as to collapse just because of the heat? It’s not like we’re out here on a picnic.”", "“Yes, yes, I agree a thousand percent.”", "“Look at her, piggybacked on Seol as if her life depended on it. Doesn’t she think about the person carrying her? If it were me, I would have gotten down immediately from shame.”", "“You’re right, Noonim.”", "“There’s even you and Hugo, so why is she insisting on Seol’s back?”", "“Noonim, are you jeal…. No, you’re right. You’re always right.”", "Seol Jihu felt the wriggling on his back getting rougher. With a wry laugh, he heaved her up before speaking, “Miss Maria? Stay still. You might fall down otherwise.”", "“Uun!”", "“I know, I know. Be a good girl. They’re just kidding. Everyone knows how skilled you are.”", "“Uuuuun!”", "As Seol Jihu worked to console the squirming Maria, Chohong’s criticism increased.", "In the end, Kazuki glanced back with a menacing look. With that, silence descended on the group once more.", "*", "Just like Kazuki had mentioned, it took the team exactly two days to get to the entrance from Haramark. Since all entrances appeared at midnight, six or so hours must have gone by since it opened.", "The entrance was located at one of the fertile regions of the arid desert - an oasis. As its name implied, water and vegetation could be found in this place.", "But for an oasis, it was rather small. Rather than a lake, it was more like a pond or even a puddle.", "Seol Jihu surveyed the area before tilting his head. Setting aside the size of the oasis, he couldn’t see anything that resembled an entrance.", "‘I read that the entrance comes in all colors and forms.’", "Seol Jihu stared at the oasis thinking, ‘Could it be?’ And just as he expected, Kazuki pointed at the pool of water and told the group to get ready to go in.", "“We’re going underwater?”", "When Seol Jihu asked, Kazuki nodded his head with a somewhat nervous expression, “Yes, we should hurry. There’s no reason to delay going inside.”", "In Kazuki’s mind, the fact that no one had attacked them so far meant that they had accepted his unspoken deal. Still, he wanted to go in before the situation took an abrupt turn.", "“Ah, I want to watch them fight. It’ll be exciting,” Hugo muttered wistfully, but Kazuki ignored him and turned to the robed Priest fanning herself with her hand.", "“Just in case… please.”", "The fanning stopped, and the moment the Priest took out a crucifix….", "WOONG!", "A short vibration rang out and a white spherical film spread out from the center of the oasis. What was even more unbelievable was that the protective film expanded, becoming big enough to cover the entire oasis in less than a second.", "Even Maria stopped huffing and opened her eyes like a rabbit.", "“Holy fuck….”", "This was the first time Seol Jihu heard Maria curse as a sign of astonishment. He couldn’t help but admire High Rankers once again.", "However, he wasn’t given much time to stand around in awe. Kazuki walked in first and urged the rest of the team inside. This was because the hyenas following them became busy the moment the protective film was created.", "“Seol! Hurry!”", "“Okay.”", "Splash, splash. Seol Jihu blinked his eyes even as he walked into the water at Chohong’s urging. What was he supposed to do?", "“I’ll go ahead!”", "“Let’s meet again at the unknown place!” At that moment, Jun and Hugo shouted before jumping in.", "SPLASH! Water sprayed up as the two instantly vanished.", "Seol Jihu’s jaw dropped open. The water wasn’t that deep, but they had disappeared without a trace.", "“Those sons of bitches!”", "Having been hit on the cheek by the water, Chohong bent her waist forward, and then Kazuki also dove in. The two of them soon disappeared. Seol Jihu couldn’t find Maria anywhere either.", "“Ah!”", "When he felt something touching his shoulders, he flinched and turned around. The nameless Priest had her hands on his shoulders.", "“Aren’t you going in?” Seol Jihu asked.", "The Priest didn’t say anything. She simply pressed down on his shoulders gently.", "‘Does she want to go in with me?’", "He might be mistaken, but it looked like she was afraid to leave him alone. He felt strange. The Priest was treating him like a child by a river.", "‘I’m fine by myself though….’", "He grumbled inwardly, but for some reason, he kind of enjoyed it. Just like that, the two of them sunk underwater.", "As more and more water began to fill his vision, he saw people popping out from various places, people distancing themselves from each other, people charging toward the oasis without caring for defense, and people aiming attacks at others.", "Seol Jihu closed his eyes.", "‘….’", "He focused on the flowing water, and a sense of deja vu overcame him. Was it at the Huge Stone Rocky Mountain? It was the same feeling he’d gotten when he was floating in the lake, contemplating about Flash Step.", "‘Right.’", "I was feeling the flow of the water….", "‘…Butt?’", "Suddenly remembering Agnes’s butt, Seol Jihu shook his head. At that moment, a sudden sinking feeling engulfed him.", "Ploosh!", "“Kwack—”", "Immediately afterwards, he felt his butt fall on something soft.", "“Puha!”", "Seol Jihu opened his eyes, realizing that he was no longer underwater. Although he was still soaked, he at least wasn’t at the oasis.", "Looking around, he noticed that he was in a panic room similar to the one he had escaped to with Teresa back at the laboratory.", "“Sa, save me….”", "Suddenly, a moan rang out, and Seol Jihu looked down in a fluster. Maria was crushed flat under his butt, hitting the floor with her palm. Startled, Seol Jihu quickly shot up.", "“Maria?”", "“Fucking hell—”", "Cough, cough. The foul-mouthed girl scowled like a demon from Hell. But when she saw the youth sitting on top of her, she flinched and then pouted her cherry-like lips.", "“…Oppa~ You should’ve been more careful. I thought you’d break my back.”", "Seol Jihu was expecting her to spit out another bucket full of curses, so he breathed a sigh of relief when he heard what she actually said.", "“Are you okay?”", "“Do I look okay? Hurry and help me up.”", "She was just as blunt as always, but she wasn’t going berserk. Seol Jihu thanked the gods that the effect of the silver coins hadn’t disappeared.", "However, if there was one thing the youth was mistaken about, it was that money wasn’t the only reason for Maria’s relative calm. Although it was only a little, Maria was feeling indebted to Seol Jihu for carrying her through the desert.", "“Anyways, where are we?” Seol Jihu asked as he grabbed Maria’s hand and pulled her up. The room seemed to be around 65 square meters.", "“I don’t know,” Maria replied with an apathetic face. She had her head tilted to the side and was currently busy squeezing out water from her wet hair.", "“You two are from the same team?”", "At that moment, a high soprano tone voice rang out. Maria and Seol Jihu quickly turned around, and their eyes immediately widened in shock. They saw two women sitting with their knees together in the corner of the room.", "The one who had spoken up was the woman with aquiline eyes, a bob cut hair, and a beauty mark under her left eye.", "The one sitting next to her and staring at them blankly was a feeble girl who looked like she was sick. Her long, silky hair stood out because it was silver.", "The important thing was that Seol Jihu wasn’t familiar with either of them.", "‘What….’", "Quickly scanning the room, Seol Jihu realized that the other five members of the team were missing.", "‘No way.’", "Jang Maldong had initially planned to train only Seol Jihu’s proficiency with Mana Spear because Stage 1 and 2 were supposed to be team missions. ‘People entering from the same entrance will be moved to the same place’ - This rule had been broken for the first time in the fifth Banquet.", "“Hmm, from the looks of it, not all of your teammates are here.”", "The bob cut woman murmured as if she read Seol Jihu and Maria’s expressions.", "“What’s going on?”", "“I don’t know. I didn’t see my teammates either when I opened my eyes. It looks like it’s the same for this kid.” The bob cut woman shrugged her shoulders as she smiled with her eyes.", "Seol Jihu bit his lower lip and tried to take out the communication crystal. It was then—", "“That won’t work.”", "He paused as the woman made it sound like she already tried it.", "“Ah… we’re fucked, aren’t we….”", "Maria’s survival instincts had been triggered, and she pitifully looked up at the ceiling. Then, she quickly stuck to Seol Jihu’s side.", "“Oppa~ You won’t abandon me, right? Right~?”", "“Why would I abandon you, Miss Maria?”", "Maria had said this half-jokingly, but when Seol Jihu replied more seriously than she thought, she was the one who was taken aback.", "It was then. Suddenly, someone fell down from the air…. Thud!", "“Kwack—!”", "And Maria was crushed once again.", "“Ow, ow, ow….”", "Seol Jihu blankly stared at the woman who had appeared out of nowhere and was rubbing her buttocks with a frown, as well as Maria lying down in a 大 position, convulsing like a wriggling caterpillar."]}