{"cid": "417", "title": "Chapter 417. The Future That Could Not Be Avoided (1)", "content": ["Yun Seohui did not pick up the call. No, she couldn’t. It was because she was on Earth, and not in Paradise when Seol Jihu called her.", "When she heard the news and returned to Paradise, the communication crystal was still flashing with light.", "Yun Seohui looked at the pure light with a slight surprise before looking down at the shining orb. It had taken her twenty minutes to enter Paradise after receiving a phone call saying that Representative Seol was looking for her.", "In other words, one hour had gone by in Paradise’s time.", "“Have they been calling this whole time?”", "“Yes, I told them I would let them know when the Director comes back, but they’ve continued to call every five minutes….”", "“Hmm….”", "Yun Seohui placed her hand on the orb but did not pick up the call right away. She narrowed her eyes at the orb, thinking of playing hard to get.", "The current relationship between Valhalla and Sinyoung was at its worst. Valhalla’s representative had a family member targeted on Earth, and Sinyoung was the prime suspect behind the incident.", "Of course, there was no way to prove that they were behind it, but it was true that they committed the grave error of letting Jung Minjong escape.", "Hence, there should only be one reason for Valhalla’s representative to be calling her at this point.", "The fact that he has been calling her nonstop like an obsessed ex-boyfriend… it just didn’t add up. Moreover, the Seol Jihu she knew was a man of action rather than words.", "As Yun Seohui was wrapping up her thoughts, the call ended. Yun Seohui still had her hand placed on the orb. Then, when the orb lit up before five minutes went by, her eyes curved in a peculiar fashion.", "Next, Yun Seohui’s breathing suddenly became rough. She cleared her throat and waited for the call to end yet again. When the light flickered off from the orb, she counted to one hundred and then infused her mana into it.", "“I’m sorry!”", "Paat! Yun Seohui apologized in a hurry as soon as a light burst out.", "“I wasn’t in Paradise and only heard a moment ago… I came running right away….”", "She gasped for breath like someone who just did a 100-meter sprint.", "She had many excuses to give. She planned to mention the incident that happened on Earth to justify her lateness, all the while stealthily showing how remorseful she was.", "Currently, the only thing in her mind was the relationship between her and Seol Jihu.", "That was, until she heard what the other person said.", "“On Earth… huh?”", "Yun Seohui’s tone went up toward the end.", "“…Lady Roe Scheherazade?”", "Her fake-crying voice subsided as a low voice continued to ring out from the orb.", "“Yes, yes. It’s hard to believe… but we’ll make a move right away. Don’t worry too much.”", "Yun Seohui replied amiably and nodded her head. She then turned to the young man as soon as the call ended.", "“Did something happen in Nur?”", "“Yes. It hasn’t been confirmed yet, but… all contact has been cut off from Nur a few days ago. Not only the Nur Royal Family but also every single organization in it is not picking up any calls.”", "Yun Seohui furrowed her fair brows at the young man’s reply.", "“A few days ago? How many days has it been exactly? Valhalla’s representative said he received the news four days after he set off from Eva.”", "“I am not sure. We only heard news of it today. The Japan Business Federation apparently asked a team that was nearby to investigate, but it seems they lost contact with them as well.”", "That meant something might have happened more than three days ago.", "It was certainly strange, but it should have been fine to take action after investigating it more thoroughly.", "Yun Seohui remembered the request that Seol Jihu just made.", "To secure Roe Scheherazade and her attendant and protect the city.", "Or to only secure Roe Scheherazade and her attendant and leave the city.", "And if that wasn’t possible either, to kill Roe Scheherazade and leave the city.", "She did not hear wrong. Seol Jihu had asked her to kill Roe Scheherazade. Furthermore, he said to secure the Royal Oath if possible.", "Yun Seohui tilted her head before shaking it side to side. Roe Scheherazade being a traitor wasn’t so hard to believe, but killing her was simply too daring.", "Regardless, Yun Seohui saw this as an opportunity.", "Seol Jihu was in such a rush that he had called someone he hated and made an earnest request.", "For Yun Seohui, who was walking on a tightrope, this request should become a sturdy rope for her to cling onto.", "“Tell Lady Roe Scheherazade to come here.”", "She sounded like someone who was summoning her subordinate.", "Even in reality, Roe Scheherazade had become Sinyoung’s puppet during the time of Yun Seojin, and the status quo did not change after Yun Seohui took power.", "She knew about the situation Scheherazade’s queen was in but had simply ignored it.", "“Tell her to come right now. We need to get hold of her first. If other organizations butt in, you’re welcome to use the authority of the representative organization.”", "“Understood.”", "The young man rushed out of the office.", "Then about thirty minutes later, he ran back inside in a hurry.", "“D-Director!”", "Yun Seohui was in the middle of her second call with Seol Jihu, busily drawing a map on a piece of paper.", "“Hold on.”", "She asked to be excused, turned to the young man, and asked loudly.", "“Did she disappear?”", "“We secured the attendant, but Lady Roe Scheherazade is nowhere to be seen….”", "The young man nodded his head in a daze.", "“…We have the attendant.”", "Yun Seohui repeated the message at the crystal.", "“Lady Roe Scheherazade has… yes, she disappeared. It’s just like you said…. So she is hiding in this place?”", "Yun Seohui put her pen down.", "“Got it. I’ll form an expedition team and check it out personally.”", "With that, she hung up the call, tilted her head, and looked up at the ceiling.", "By now, Yun Seohui was feeling a bit uncomfortable.", "She thought this would be an insignificant matter.", "But it really seemed as if….", "Tapping anxiously on her desk, Yun Seohui looked back at the young man, who was standing in the room awkwardly.", "“How long does it take to get to Nur from Scheherazade?”", "“Pardon? Ah, about ten days by carriage….”", "“What if you rush there in a fully drawn carriage?”", "“Uh…. If the Horuses don’t exhaust themselves out, I’m sure the time can be cut in half.”", "“In that case…”", "Yun Seohui thought for a moment before asking.", "“What if you travel by plane?”", "“By plane?”", "The young man retorted in a fluster. He couldn’t understand why she was asking about a plane when it didn’t exist in Paradise.", "However, Yun Seohui’s expression was turning more and more serious. It was because she thought of a worst-case scenario.", "As proven many times in the past, the Parasites could march at a speed transcending one’s wildest imaginations.", "Besides having the physical body modified through the virtue of parasitism, there were entities within the Parasites that could use magic. Moreover, Parasites did not get tired, especially the Army Commanders who had absorbed divinities.", "‘Could this be an extremely dangerous situation?’", "Just as Yun Seohui thought so and got up…", "Krrrrrrrr!", "A sudden tremor shook the entire building.", "The tremor sprang up from deep within the earth.", "The sudden trembling caused Yun Seohui and the young man to lose their balance and fall. Chairs shook back and forth and tables slid to the side like there was a huge earthquake.", "Soon, screams erupted.", "After arriving without a warning, the earthquake lasted close to five minutes.", "“Just now….”", "Yun Seohui’s eyes shone sharply under the protection of a barrier she’d cast.", "The young man, who was stuck in the corner of the room, only gaped his mouth.", "Yun Seohui shot up and ran outside.", "Total chaos unfolded before her. It wasn’t as if buildings crumbled down or the earth cracked up, but people were in great confusion from the sudden tremor.", "Did an earthquake really happen in Scheherazade?", "Yun Seohui shook her head.", "That couldn’t be the case as she felt four changes immediately after the earthquake.", "The first was that the city changed into a strange space filled with odd vibrations.", "The second was that the mana flowing through her mana circuit was seeping out.", "The third was that this mana was seeping into the earth, joining a huge flow of energy and heading in one direction.", "And the fourth…", "“….”", "When she subconsciously followed the direction of the flowing mana, she saw the Scheherazade Royal Palace in the distance.", "Unless she was seeing things, the location of the palace seemed to have changed since the last time she checked.", "Yun Seohui subconsciously infused her mana into the communication crystal. However, the crystal was not reacting.", "The mana that she infused into it leaked out and disappeared.", "It was like it was being pulled by a magnetic force.", "That wasn’t all.", "“W-What the hell is going on!?”", "Someone cried out from the temple.", "“What happened?”", "“The portal disappeared!”", "“What?”", "“The warp gate isn’t working!”", "Yun Seohui’s eyes narrowed.", "A mysterious earthquake, mana flowing in one direction, and the warp gate malfunctioning….", "As she was thinking, a gust of wind carrying powerful energy swept by and struck Yun Seohui’s cheeks.", "She wasn’t the only one. Other people seemed to have felt this energy as well.", "The murmuring instantly subsided.", "“….”", "A heavy silence descended.", "Despite no one saying a word, they were all thinking the same thing.", "The cause of this incident was getting closer. Something that was large enough to devour this city in one gulp.", "It was then.", "“Pa…!”", "Someone pointed at the sky and screamed.", "Yun Seohui looked up.", "The sky beyond the lofty castle wall was turning black.", "Before she could take a second look, the filthy black tide dyed the sky in its color and flooded Scheherazade.", "Chweeeeeek!", "Hundreds of bat-winged shadows cut through the air at speeds rivaling planes, no, jets.", "*", "Same time.", "Roe Scheherazade was standing alone in the deepest area of the royal palace.", "In the direction she was looking was a stone chamber where a huge magic circle was drawn on the ceiling and the floor with a large pillar of light standing tall.", "The light grew intense as more mana flowed into the stone chamber, and her eyes twinkled with more and more light.", "Roe Scheherazade had just activated the first level of Gorad Boga’s mechanism.", "Consequently, the whole of Gorad Boga turned into a huge magic circle, which began to scrape up mana inside the city.", "This included the mana of both humans and structures.", "In a way, the first level was only a preparation for the activation of the second level.", "Roe Scheherazade stared at the stele that was floating inside the pillar and then suddenly lifted her chin up.", "The rumbling of the earth, the explosives booms, and the unintelligible screams… the faint amalgamation of these sounds mixed together to make her ears happy.", "Roe Scheherazade smiled beamingly.", "“Can you hear it?”", "She spread out her arms as if to show off her own work of art.", "“Dear.”", "Showing a smile that was brighter than any other…", "“It is a requiem for you.”", "She whispered silently in the empty space.", "“Do you know what that child said? ‘What use is there in getting revenge now? Doing so will only leave you with emptiness…’”", "She then sniggered softly.", "“…But, what is this?”", "Her eyes lost focus like a woman who lost herself from the ecstasy of orgasm.", "“I only just began my revenge, I only just got a taste, but never mind feeling empty, it’s so, so sweet! It’s so sweet that I….”", "Roe Scheherazade gently closed her eyes without finishing her sentence.", "“Ah, this feeling of liberation….”", "After her husband died of a mysterious cause, Gorad Boga had been her only place of peace.", "Every time she suffered indescribable humiliation, she would come here to cry and seek her husband, apologizing until she fainted from exhaustion.", "However, today would be the last day this place was used for such a purpose.", "Because as of today, both Sinyoung and this city would disappear.", "Furthermore, it would be the start of humanity’s downfall.", "“Haaaa….”", "Roe Scheherazade moaned blissfully as she heard the ringing above the ceiling.", "She then unbuttoned the front part of her dress as if she couldn’t help herself.", "Sssk. Her dress slipped down, and her naked body was revealed in full.", "Next, Roe Scheherazade raised one arm and one leg high.", "Using the Earthlings’ screams as accompaniment, she began to spin as if she was performing a ballet.", "Inside an empty stone chamber, a naked woman danced by herself, rolling a tongue around her lips like someone savoring the taste of sweet chocolate.", "*", "It took six days to get to Scheherazade from Eva. If one rushed, it would take four days.", "As Seol Jihu noticed the abnormality on the fourth night, there was only one day’s worth of distance to cover.", "He already did everything he could.", "He ordered Kim Hannah to notify every city beside Nur and got every organization inside Scheherazade on the move.", "The result was a loss of communication.", "After hearing from Yun Seohui that Roe Scheherazade disappeared, he told her the path to get to Gorad Boga.", "He failed to get in touch with her since.", "He could send faint signals with the communication crystal, but the other side was not picking up.", "Even sending the signal should not be possible if the Parasites were jamming the communication.", "Seol Jihu grew impatient as this was a first for him as well.", "In the end, he got off the carriage midway and rushed to Scheherazade with only Flone and Little Chick.", "The Horus had grown tired from running all night, and even if it ran at full speed, it was still slower than Flone’s flying speed.", "Though he couldn’t call this an ideal situation, the urgency of the matter left him with no other choice.", "Thankfully, they were closing in on their destination with Flone giving her all in flying.", "While cutting through the sky at a frightening speed…", "[Over there…!]", "Flone’s voice suddenly rang out.", "Seol Jihu, who had constantly been trying to use the communication crystal, looked up.", "The city began to enter his sight.", "And when Scheherazade got big enough so that he couldn’t capture it with a single look…", "“!”", "Seol Jihu’s brows twitched violently after confirming the state the city was in."]}