{"cid": "129", "title": "Chapter 129. The True Intent of the Banquet", "content": ["Seol Jihu still had his eyes widened. Soon, the fierce light in his eyes subsided, and he fell into a daze. ", "‘I won?’ ", "He checked once again. Perhaps because he had squeezed out every ounce of his strength to swing his spear, the Orc Champion’s head had flown far away and its body was lying facedown on the plaza. ", "‘I really won?’", "He couldn’t believe it no matter how many times he confirmed it. Seol Jihu was blankly staring into the air when he found a message window floating there. ", "[Class Ability, ‘Flash Step (Lowest)’, has been created.] ", "‘…I see. I learned Flash Step….’ ", "Seol Jihu let out a sigh of relief and looked ahead again. The Orc Champion had fallen. He had personally cut off its neck. ", "Seol Jihu had to put in great effort to keep his eyes from closing. The moment he lost his focus, he felt like tears would pour down. ", "‘Did I cry this easily?’ ", "He realized he had been crying often ever since he entered Paradise. He knew this, yet he still wanted to cry.", "He didn’t think he would win. He thought he would die. Truly.", "At that moment, a loud shout struck his ears. The sniffling Seol Jihu jolted in surprise and looked around. The plaza was echoing with the roars of humans. The Orcs had lost their fighting spirit and were starting to get pushed back. ", "After seeing all this with a dazed look, Seol Jihu snapped out and put strength into his numb legs. ", "The war wasn’t over yet. ", "*", "Seol Jihu climbed up to the grass field supported by Kazuki. He had squeezed out every ounce of his strength to fight the Orc Champion, and because he continued to fight afterward in a groggy state, he was now thoroughly exhausted. ", "But the result spoke for itself. All 110 participants had made it out alive. Of course, most of them were injured in some way, but the result was still fantastic. ", "There were two reasons for this success. The first reason was Kazuki’s quick assassination of the Orc Shaman, and the second, more important reason was Seol Jihu defeating the Orc Champion early on. ", "To be precise, they had used the Orcs’ military system against them. When a commander-class Orc fell, the Orcs’ morale plummeted and over half of the Orc Warriors became noticeably weaker. ", "Noticing this change, Kazuki immediately drove the momentum and supported the struggling Chohong. And once they defeated the remaining Orc Champion, the rest was easy. ", "At first, he thought they were unlucky that the enemies moved in an organized structure. But he got to learn that this could be a good thing as well. ", "Once the fight ended, the Priests ran around busily. The ones with lighter injuries drank healing potions, and those with severe injuries had a Priest heal them. ", "The atmosphere wasn’t bad. At the very least, it was a huge improvement from when each side was on high alert and glaring at each other murderously. ", "‘Not yet.’ ", "However, Seol Jihu didn’t relax yet. He couldn’t even say, ‘It’s too early to relax.’ In the first place, the Banquet wasn’t a place for relaxation. He would have to wait until the damned Banquet ended and he went back to Paradise before he could sleep peacefully. ", "With a worried gaze, Seol Jihu faced the Plaza of the Dissonant Wish. He couldn’t see the six people who had gone ahead. ", "It hadn’t taken Seol Jihu’s group hours to finish conquering the Plaza of Sacrifice, but he was expecting Oh Rahee’s group to have come out already.", "“Don’t appear nervous.” ", "Seeing Seol Jihu wandering around the pit, Kazuki whispered. ", "“Just sit in front of it and pretend to wait in leisure.” ", "It wasn’t ‘wait’ but ‘pretend to wait’. Seol Jihu tilted his head at this distinction, but since it sounded like an advice, he silently sat down. ", "Soon, the anxiously waiting Seol Jihu heard the sound of a door opening. He put down the healing potion he was drinking and got up. He would have run forward if he could, but remembering Kazuki’s words, he only stared at the same spot.", "People began to walk out of the Plaza of the Dissonant Wish. ", "‘One, two, three, four….’ ", "Six. Exactly six people walked forward while carrying both big and small, cloth-wrapped items. Seol Jihu breathed a sigh of relief, but then realized a strange air flowing between them.", "Oh Rahee looked unhappy about something, while Hugo had his mouth shut from exhaustion. The two people chosen from the minority faction also had their spirits crushed.", "Even without anyone saying a word, he could tell something happened. ", "Seol Jihu let out a bitter smile. He was happy that everyone made it out alive, but that was how Stage 2’s atmosphere normally was. ", "Even the group that entered the Plaza of Sacrifice was showing signs of returning to this atmosphere. It was foolish to expect them to join hands and laugh just because they successfully cleared the Plaza of Sacrifice once.", "“Hugo.” ", "“Uh, uh…. Why do you look so tired? Are you alright?” ", "“I’m fine. Rather than that, what took you guys so long?” ", "“Oh, you see…” Hugo glanced at Oh Rahee and breathed out a sigh. “It was really far.” ", "“Far?” ", "“Yeah. The pathway to the room where you could claim the reward was longer than we expected. And once we got there, there were several rooms to choose from….”", "Hugo shook his head.", "“Damn it. Just finding your room takes time, but not only did all six of us have to move together, we also had to observe each other… ugh!”", "He shuddered as if just thinking about it frightened him. ", "Then, Chohong sneaked in, “Stop overreacting. What are you complaining about after a nice, free meal?” ", "“C’mon, the entire time, I couldn’t even talk unless I was allowed to, people could have run away at a moment’s notice, and a scary demon with a sword was standing behind me. Do you know how hard it was to try not to pay attention? I thought I was gonna die of having all my energy sucked out!” ", "It sounded like Oh Rahee intimidated them more than she needed to. Seol Jihu could imagine how sinister the atmosphere must have been. ", "“Whatever. So, what’d you get?” ", "“Fuck.”", "“What?” ", "“Don’t ask. I’m gonna cry.” ", "Hugo waved his hand. Chohong giggled. ", "“What, did you get screwed over?” ", "“Just look at this thing. This place has got to be playing a trick on me….” ", "Hugo unwrapped the cloth while complaining. After checking the content, Seol Jihu began to observe the surrounding space. ", "He had finally come this far. He forcefully united the 110 people, performed better than expected on the first conquering of the Plaza of Sacrifice, and had all six people return alive from the Plaza of the Dissonant Wish.", "He was 80% of the way there. It would be great if the rest worked out on its own, but Seol Jihu thought there was a low chance of that happening. ", "He realized this just by remembering how Stage 1 progressed. He had persuaded everyone to work together, but after a while, Oh Rahee had suggested that they abandon the Level 3s. ", "Similarly, although things were progressing well now, there was no guarantee that everything would end well. Whether big or small, someone was bound to complain somehow, and Seol Jihu expected at least one more incident to come up. ", "So what could he do to prevent this? ", "Seol Jihu found the answer in making the Banquet a banquet. When he caught sight of Oh Rahee walking through the field, his eyes flickered. ", "“Miss Oh Rahee.” ", "She didn’t stop. Perhaps she was too far away to hear him. ", "“Miss Oh Rahee!” ", "He raised his voice, yet she was still unperturbed. He wasn’t sure whether she couldn’t hear him or if she was ignoring him, but judging by the way she had her arms folded and was walking haughtily, he guessed it was the latter. ", "Seol Jihu cleared his throat and raised his arm. Then, he shouted at the top of his lungs. ", "“OH RAAAAAAAHEEEEE!” ", "Oh Rahee stopped. She creaked her head to the side frighteningly, and Seol Jihu immediately added, “MISS!” ", "In the next moment, Seol Jihu faced Oh Rahee with a winter storm blowing behind her. ", "“What did you say?” ", "This was the first time he was seeing her so emotional, so he quickly opened his mouth. ", "“Ah…. That’s your name, right, Miss Oh Rahee?” ", "“My last name… well, I guess you could have heard from Kazuki or someone else. Anyways, you called my name?” ", "“Yes. I called you multiple times, but you didn’t turn around, so….”", "“….”", "Oh Rahee’s eyes narrowed. She tilted her head. After a moment of hesitation, she let out a short sigh.", "“Anyways, I heard you defeated the Orc Champion.”", "“Huh? Ah, yes.” ", "Seol Jihu scratched his head. ", "‘It spread already?’ ", "“I didn’t do it alone. It was only possible because of my team’s support.” ", "“Doesn’t that go without saying? Who would believe you defeated an Orc Champion alone? Even I am not confident in doing that.” ", "Her tone wasn’t condescending or sneering in any way. That was just how she talked. Her tone was actually more close to being surprised. ", "“How mysterious….”", "She murmured to herself while sending strange glances at Seol Jihu. ", "“Anyways, what’s up?”", "Seol Jihu was about to ask, ‘What did you get?’ But when he saw what she was holding in her hand, he changed his question.", "“You wanted a weapon?” He asked as Oh Rahee was holding something long and big wrapped in a cloth.", "“…Yeah.” Oh Rahee nodded faintly. When she untied the cloth knot, a big, long two-handed axe revealed itself.", "The flower symbol engraved on the axe head harmonized well with the delicate white light flowing down to the butt, giving the weapon a beautiful, sacred look.", "“An axe?” ", "“Hilarious, isn’t it?” Oh Rahee looked more than a little disappointed. ", "In Paradise, finding a high-quality weapon or armor was difficult. A part of the reason was the fall of the Empire, but the bigger reason was a severe lack of material caused by the long, drawn-out war. ", "This was the reason the price of equipment jumped by digits every time one leveled up. Furthermore, it was almost impossible to find a weapon suitable for a High Ranker. ", "Oh Rahee would have been ecstatic if she had received a longsword on the same level as this axe; but this couldn’t be helped. After all, Stage 2’s reward was supposed to grant the participants’ wish in a ‘dissonant’ form. ", "“If you’re done, can I leave?” ", "“No.”", "“W-What?” ", "“Hold on.” Seol Jihu dragged Hugo over. Seol Jihu noticed that he became dead silent the moment Oh Rahee arrived. ", "Seol Jihu smiled brightly and purposely increased the tone of his voice.", "“Do you guys want to switch?” ", "“?”", "“Huh?”", "Oh Rahee looked like she was asking, ‘What are you talking about all of a sudden?’ But when she saw the blood-red longsword in Hugo’s hand, she blinked dazedly and went “Ah.”", "Hugo’s eyes also widened when he saw the axe in Oh Rahee’s hand.", "“Can… can I see it?” Oh Rahee asked first.", "“M-Me too.” Hugo nodded. ", "The duo then began to examine the weapon they exchanged. ", "“You guys didn’t confirm what you got inside?” ", "“I told you. We didn’t say a word to each other.” ", "When Seol Jihu asked, Hugo retorted with an unusual level of concentration. ", "“We didn’t have time to either….” Hugo murmured in a daze.", "‘Makes sense,’ Seol Jihu thought. Considering how wary they were of each other, asking ‘Can I see what you got?’ was probably out of the question. ", "In any case, judging by Hugo’s entranced face, it seemed that he liked the axe. ", "It was the same for Oh Rahee. She carefully scrutinized the blood-red rapier emitting an ominous, demonic sword-like aura. From the way the corner of her mouth was curled up, one could tell how satisfied she was. ", "The two weapons didn’t seem to differ too much in functionality. And even if it was, a trade was fair as long as both sides agreed to it.", "“Your first impression was terrible… but I’ve been loving everything you do.” ", "“Excuse me?”", "“No, nothing.” Oh Rahee shook her head. Glancing at Hugo, she asked, “Oi, you.”", "“Huh?” ", "“How about it?” ", "Hugo raised both of his thumbs up as if he didn’t even need to think about the answer. ", "“Call!” ", "“Good.”", "The trade had been completed. ", "Oh Rahee spun the rapier in her hand before caressing the blade with her hand and smiling. Hugo ran around while swinging the axe, like a child who had received his Christmas present. ", "Seeing this, the four people who entered the Plaza of the Dissonant Wish with them didn’t sit still. In case someone had an item worth trading for, they began to unwrap their cloth. ", "Then, other people began to gather round. When they saw the rewards the six people received, they couldn’t help but marvel at them. ", "The most sought after reward among Earthlings.", "The Banquet that magnificently satisfied their interest. ", "Soon….", "“Um.” One person swallowed his saliva and asked, “When are we selecting the next group of participants?” ", "Hearing this, Seol Jihu grinned with satisfaction.", "*", "The conquering of the Plaza of Sacrifice hastened. ", "The second attempt ended without anyone dying, mainly due to Oh Rahee playing an active role. She killed more enemies than anyone else, and just as one might expect, it wasn’t for an altruistic reason. ", "It turned out that the rapier got stronger and could even restore its user’s stamina by drinking blood. When Seol Jihu found out, he was convinced the rapier was a demonic sword of some sort. ", "In any case, the participants were able to conquer the Plaza of Sacrifice four times that day, and six times the next day. They had progressed more than halfway in just two days.", "And on the sixth night…", "“Amazing.” ", "Kazuki muttered in awe after once again conquering the Plaza of Sacrifice for the sixth time in a single day.", "“I never even imagined something like this on the first day.”", "It was late at night, but dozens of people were gathered together on the grass field. ", "People who were simply watching, people who stopped uninterested traders trying to persuade them, people wondering if they should accept the trade, people haggling…. ", "The entire field was rowdy. The way people were gathered around a large campfire, Kazuki felt like he was looking at a festival. ", "“You know, I never even considered trading.” ", "It wasn’t that he couldn’t. He didn’t. ", "When Kazuki chuckled, Seol Jihu also laughed.", "“It’s nothing amazing, really.” ", "“What’s surprising is that you considered this possibility in that situation.” ", "Kazuki wasn’t wrong about this. While everyone else was obsessed with sacrificing others to escape, Seol Jihu alone had the idea of turning the Dissonant Wish into the Harmonious Wish. ", "“Well… I just wondered why this place was given the name Banquet when it first opened.” Seol Jihu continued, “Banquets are supposed to be fun.”", "Originally, a banquet was a feast where many gathered to celebrate or congratulate. Seol Jihu had interpreted this in a Paradisian fashion. ", "“I thought about why Dissonant Wishes were given out… and I thought it was for people to interact with each other and grow closer….”", "Seol Jihu blurred the end of his speech before squatting down with a sigh. Kazuki tilted his head. ", "“Why the sigh?” ", "“Because it’s difficult.” ", "“Even though things went according to your plan?” ", "“That’s true, but….” Seol Jihu smacked his lips. “To be honest, I got lucky.” ", "“Lucky?” ", "“Yes. I could force the situation thanks to several conditions being met. If our allied team wasn’t the strongest force here….” ", "In truth, Seol Jihu’s initial plan was to persuade others by telling them about trading. But after seeing how things were working out, he had used a more forceful approach. He had only taken out the trade card afterwards. Otherwise, nothing he said would have held weight.", "Kazuki shrugged his shoulders. ", "“If you were the eloquent orator type or the cunning strategist type, things might have gone as you expected. The same can be said if you possessed charisma that can mesmerize people at first glance.” ", "“If there really are people like that — I’m jealous.” ", "“But I don’t think you were wrong. You don’t need to blame yourself.” ", "“I think so too.” ", "With that, the conversation between the two was cut off. It was Seol Jihu who broke the silence.", "“Anyways, what did you get?”", "“Me? You know…. What about you?” Kazuki asked back while glossing over the answer. ", "Seol Jihu answered clearly, “Competence.”", "Kazuki’s eyes widened, and he burst into laughter. ", "“Haha. You’re a real piece of work. What kind of wish….” ", "Suddenly, he tilted his head as if something was strange and muttered seriously.", "“Wait, your reward should have been ‘dissonant’… but it doesn’t seem like it was.”", "“Right?”", "“Can you show it to me?” ", "Seol Jihu shook his head. ", "“I don’t have it.”", "“You don’t?”", "“I traded it.” ", "Seol Jihu had given up on Competence? Kazuki found this hard to believe. ", "“I don’t know what efficacy it had… but I doubt it was bad. What did you trade it with?” ", "Seol Jihu grinned.", "“That’s a secret.” ", "Kazuki looked as if he had taken a good blow. ", "“You didn’t tell me either.”", "“….”", "Kazuki raised both his hands, then walked away with a grin. Seeing Kazuki walk toward the people absorbed in trading, Seol Jihu got up and turned back.", "He headed to the campsite. Entering the tent, he saw Maria, who had fallen asleep after finishing up with healing the injured, and Hugo, who was sitting with a frown. ", "Seeing Hugo grumbling while holding the battle-axe he traded with Oh Rahee, Seol Jihu clicked his tongue.", "‘That weapon sure is amazing.’", "Seol Jihu knew the reason for Hugo’s disgruntled face. Although the weapon was flawless in other aspects…. ", "Pzzzt!", "“Aaaak.” ", "It resisted every time Hugo tried to infuse his mana. ", "According to Kazuki, rarely, there were intelligent weapons that chose their users. In other words, the battle-axe was rejecting Hugo’s disposition and refusing to accept Hugo as its master.", "“Ehew….”", "Seeing Hugo sigh as if it was the end of the world, Seol Jihu patted his back.", "“Is it still like that?”", "Hugo nodded dejectedly. He had been talking to the axe for the past four days, treating it as though it was a divine object, but it seemed that wasn’t enough to change the weapon’s mind. ", "After grunting hard, Hugo exploded in anger.", "“Fuck! I must be mad, doing all this bullshit.” ", "“Why don’t you just trade it away? You never know if someone has a better axe. Plus, there are people who haven’t entered yet.” ", "Seol Jihu had a point, but Hugo shook his head firmly. ", "“No, I’m going to use this. I will!” ", "Seol Jihu thought Hugo had given up, but he turned out to be burning with eagerness instead.", "“I mean, isn’t it just a hunk of metal at the end of the day?” ", "“W-Well….”", "“This little bitch wants to choose its master? Since it was born as a weapon, it should be thanking me for wanting to use it!”", "Woong! The battle-axe shone fiercely. It seemed to be angry. ", "“Huh? This bitch…. Hey, you dumbass axe. Do you hate me that much?”", "Woong!", "“Oh? Wow…. You know, I’m a gentleman when I’m with my partner, but I won’t be one with you. Since you can’t understand with words, I’ll just break you in.” ", "Seol Jihu was watching with interest before he started doubting his eyes.", "Hugo suddenly slammed the axe down and plopped down on it with his dirty butt. He sat cross-legged on it and spoke with a displeased face. ", "“This is the last chance. I plan on using you no matter what. You still wanna play hard to get?” ", "Woong! Woong!", "“Ooookay. Fine. You better not regret it.” ", "Hugo grit his teeth before suddenly shooting his eyes open. He then let out a short “Haat!” ", "Psh! A bomb detonated. No, that’s what Seol Jihu thought before he saw Hugo’s butt jump up. ", "Even Maria woke up in a stupor. ", "“Wha… what!? What happened!?” ", "With a drowsy face, she turned left and right before sniffing the air. When a foul odor entered her nose, she scowled. ", "“AH, FUCK!” ", "She screamed before blocking her nose and running out of the tent. Seol Jihu could hear her screaming “YOU SON OF A BITCH!” while barfing. ", "“Haha, she’s overreacting. It smells fine to me.” ", "Hugo laughed contently while rubbing his butt on the battle-axe. ", "“How is it? Hm? It’s shit-fart aged for four days!” ", "Woooooooooong! ", "Seeing the battle-axe vibrating in horror, Seol Jihu apologized inwardly and quietly entered his sleeping bag. ", "‘Tomorrow.’", "Stage 2 would end. And perhaps this tiring Banquet would come to a close as well. ", "Seol Jihu looked up at the ceiling, then shoved his hand into his pocket. After looking at the item he took out, he grinned. ", "‘Who would have thought something like this existed?’ ", "The Competence he got had incredible efficacy. Naturally, he had agonized over the decision. But after deliberating for a long time, Seol Jihu chose to trade. He believed this item had much greater value in terms of usefulness. ", "‘I hope she’ll be happy.’ ", "Reminding himself to visit the Forest of Denial after returning to Paradise, Seol Jihu closed his eyes, while using the battle-axe’s screams of despair as a lullaby.", "The night passed, and the next morning dawned.", "The participants cleared the four remaining attempts instantly. Once they succeeded in clearing the Plaza of Sacrifice 20 times, the Plaza of the Dissonant Wish opened up permanently. ", "Stage 2 had finally come to a close."]}