{"cid": "314", "title": "Chapter 314. The Eve (3)", "content": ["Though it was a compliment, Eun Yuri furrowed her brows. Whether it was interesting or not wasn’t the problem.", "What mattered was whether it was doable or not.", "“This is urgent, Teacher.”", "“Hmm. If you’re asking a yes or no question…”", "Roselle rubbed her slim chin with the tip of her hand.", "Eun Yuri focused on Roselle’s mouth, suppressing her pounding heart.", "Roselle La Grazia was a truly incredible teacher and an extraordinary sorcerer. If they could borrow her strength for the upcoming war, it would be equivalent to obtaining a thousand troops and horses.", "Soon, as Eun Yuri was sweating internally from anxiety, Roselle’s lips opened in a smile.", "“…Yes.”", "Eun Yuri’s complexion brightened.", "“‘It should be possible,’ is my answer if we’re only looking at the result.”", "Roselle continued in a monotonous voice.", "“But to obtain the fruit called result, we will need to go through an unavoidable process. That is, to bear fruit, we will need to overcome four difficulties.”", "“Four? That many?”", "“Yes. Two of the four can be done with our strengths, but the other two must be left to heaven’s will.”", "After saying this, Roselle looked sharply at Eun Yuri.", "“So, do you still want to give it a try?”", "“Yes, I do.”", "Eun Yuri replied without a shred of hesitation.", "Roselle closed her mouth and gave a renewed look.", "“Oh my, you have such beautiful eyes. Burning with passion, it’s almost like I am looking at my younger self.”", "She giggled while nodding.", "“Alright. My precious disciple wants to help her dear husband, who is going to war. This teacher will roll up her sleeves and help out.”", "“No, that’s not it at all.”", "Eun Yuri firmly denied the accusation.", "“It’s just that… he looked so overwhelmed. Like he would fall if no one held him up…”", "“Yes, yes, I understand. I’d love to hear more about the stories of this young love, but since time is short, let’s cut to the chase.”", "Roselle raised four fingers.", "“First are the problems we can’t solve. One of them is obviously the revival of the World Tree. If this matter cannot be achieved, even I can’t do anything about it.”", "The entire plan was based on the revival of the World Tree. As this point was rather obvious, Eun Yuri nodded in agreement right away.", "“The second problem is getting the permission of the revived World Tree.”", "“Permission?”", "“Yes. Once the World Tree revives, it will regain total control over the pathway connecting to its avatar in the Middle World. So we will need to explain our circumstances and ask for its permission to borrow the pathway.”", "Simply put, they needed the permission of the World Tree to use the pathway.", "“These two are the problems we have no control over. Now, shall we talk about the problems that we can try to solve?”", "Eun Yuri fixed her posture.", "“As I said before, Miss Eun Yuri’s idea is interesting. But even if we somehow succeed, it is unknown whether I can utilize my full strength in the Middle World.”", "“Why is that?”", "“Because the Astral World is a space where two worlds are overlapped. By being in that world, half of me would be in one world and the other half would be in the other world. So even if I use my full strength in the Dream World, I suspect only half of the power will reach the Middle World.”", "“But Teacher—”", "“I know. What Miss Eun Yuri is saying is not simply about the Astral World. It is true that the outcome is unclear if we can use the World Tree’s pathway. That is what makes the outcome unknown.”", "Roselle cleared her throat after explaining her reasoning.", "“Not knowing the outcome— that means we cannot be certain. Do not bet on uncertainty. Have you heard that saying?”", "“….”", "“So won’t we need to change this uncertainty to certainty?”", "“Is that something we can do?”", "“My, you’re truly full of questions today. Do I not always say you should think for yourself first before asking questions?”", "Eun Yuri bit her lower lip at her teacher’s scolding.", "Roselle rested her chin on the back of her clenched fist and said.", "“Remember. When you’re facing a difficult problem—”", "“‘Think simply,’ is what you said.”", "“Exactly. When trying to solve a problem, always go for simplicity. Now, what should be done for me to utilize my full strength in the Middle World?”", "“We need to take half of the Astral World that is resting in the Dream World and bring it to the Middle World.”", "“But that is impossible given the nature of the Astral World, so you will need to come up with a different method~”", "Roselle glanced at Eun Yuri stealthily.", "“Now let’s think, what schools of magic were there again…?”", "She threw her a hint. After mulling over it, Eun Yuri exclaimed quietly.", "“Soul manifestation!”[1]", "“Exactly.”", "Roselle smiled.", "“Though I am just a will, Roselle La Grazia most certainly exists in this world and is akin to a god who created the Dream World. If Miss Eun Yuri can learn soul manifestation magic to a high enough level, fully summoning me would not be a dream.”", "She raised her hands before continuing.", "“Of course, it might be a waste of your effort— but this teacher thinks that the core value of a Magician is to prepare what they can, rather than leaving something to luck. What do you think?”", "Eun Yuri’s eyes lit up.", "“Yes!”", "Hearing Eun Yuri’s energetic reply, Roselle smiled in satisfaction.", "“Good. Then let’s put your study of the Path of Mana on hold. From today onward, I will teach you about soul manifestation. Let me give you a fair warning. It isn’t an easy discipline so you best brace yourself!”", "Roselle turned away after giving a stern warning. Looking at a white-blonde-haired girl, who was watching them blankly, she spoke.", "“Charlotte?”", "“H-Hmm?”", "“Since things have come to this, you will be on self-study until further notice. This is an urgent matter, so I seek your understanding.”", "“O-Okay, I’m fine. Don’t worry.”", "Charlotte Aria did her best to reply nonchalantly, but she couldn’t hide the disappointed expression on her face. Although she was dense, she could still understand that Roselle meant, ‘Teaching her one on one will be more efficient, so don’t bother us.’", "“Thank you. Then for the fourth and last problem…”", "Roselle paused just before turning back to Eun Yuri. She gazed attentively at the sullen Charlotte Aria.", "“…Hold on.”", "After asking Eun Yuri for her understanding, Roselle walked forward softly. She then gently spoke to the girl dejectedly looking down.", "“Why are you so crestfallen?”", "“Hmm? No, I…”", "Charlotte Aria murmured in a halting voice.", "“You…?”", "“It’s just… both Teacher and Yuri are amazing…”", "“Because we’re amazing? Is that really it?”", "“….”", "“Really?”", "When Roselle asked again—", "“…I—”", "She carefully replied.", "“I want to help too… but I didn’t understand anything Teacher and Yuri talked about… and I can’t think of a good idea like Yuri…”", "“Aha.”", "Roselle grinned.", "“Hmm, he must be very happy. Having two beautiful and adorable ladies loving and caring for him.”", "“N-No! That’s not it!”", "Charlotte Aria waved her hands dismissively in a fluster.", "Roselle asked, giggling at the reaction that wasn’t far off from Eun Yuri’s.", "“Charlotte, aren’t you in a position to help him? You are the queen of a kingdom, after all.”", "“I-I am, but… how should I say this…”", "Charlotte Aria’s voice got quieter by the second.", "“I’m useless, I don’t know things well… I even entrusted government affairs to the royal administrator…”", "She must be embarrassed as she couldn’t meet Roselle’s eyes.", "“Hnng.”", "With a nasal hum, Roselle studied the queen with a renewed gaze.", "‘My, my.’", "Roselle exclaimed internally after reading her thoughts.", "Strictly speaking, it was hard to say Charlotte Aria was more excellent than Eun Yuri. It wasn’t simply a matter of talent. What Roselle emphasized the most in her teachings was the attitude in researching one’s discipline.", "Charlotte Aria was vastly inferior to Eun Yuri in this regard. Although she was good at imitating what she was shown, she lacked the pioneering spirit to achieve something by herself.", "It wasn’t that she lacked the desire to improve herself, but every time she tried something new, she got scared and dreaded it.", "Even though Eun Yuri started learning later, given the nature of the two students, it was only natural for the motivated Eun Yuri to pull ahead of Charlotte Aria.", "But that didn’t mean these were poor terms. It wouldn’t be strange for a senior disciple to be jealous of a junior disciple after being surpassed by them. But rather than being jealous, Charlotte Aria was full of admiration for Eun Yuri.", "Roselle had no plans to say anything about this. It wasn’t a bad thing for her two disciples to be on good terms, and Charlotte Aria was an uncompetitive person by nature.", "Right, that was how she usually was.", "So she should have been like that this time as well, but from Charlotte Aria’s inner thoughts, Roselle could feel an electrifying emotion that wasn’t there before.", "She was certain. The Queen of Eva was fiercely burning with a competitive spirit against Eun Yuri.", "‘What happened…?’", "It didn’t take long for Roselle to find out why.", "‘Seol Jihu.’", "It was because all of Charlotte Aria’s thoughts were pointing in one direction.", "‘Maybe…’", "Roselle’s eyes lit up.", "“Charlotte.”", "“…Hmm?”", "She stepped closer, pressed on Charlotte Aria’s plump, baby fat-filled cheeks, and raised her face.", "Roselle spoke quietly with eyes that were full of unknown expectations.", "“Listen carefully to what I am about to say.”", "Charlotte Aria widened her eyes and nodded dazedly.", "*", "The eight-Horus-drawn carriage carrying Seol Jihu and Agnes arrived in Eva.", "Agnes expressed her surprise after seeing the imposing building in the middle of the city.", "“Looks like you spent some money.”", "“You’d be even more surprised when you find out how many gold coins went into building this place.”", "Seol Jihu grumbled as he cut through the garden filled with the refreshing smell of flowers.", "“Kim Hannah was in charge of the design. It turns out she even invited an Alchemist.”", "“Miss Foxy did…? Why an Alchemist?”", "“I’m not exactly sure, but apparently his help was needed to build the hot springs. Really, I felt like a husband seeing his wife going wild with his credit cards.”", "Of course, this wasn’t a fair statement considering how many gold coins Kim Hannah made for him, but Seol Jihu just couldn’t understand it.", "“Hot springs? Ah, Eva is a volcanic region…”", "Agnes’ eyes twinkled as she nodded her head.", "“You’ve caught my interest. Hot springs that needed a Magician’s help to be built…”", "“Both hot springs are downstairs, one for men, one for women. You’re free to go whenever. I’m sure you’ll love it.”", "Seol Jihu spoke plainly as he opened the door.", "“Speaking of which, you must be tired from the carriage ride. I’ll take you there, so why don’t you jump in the steamy hot spring with me?”", "“Cut the bullshit.”", "Seol Jihu smacked his lips, having been flat out rejected.", "“Haha. Okay, there are plenty of guest rooms, so you can grab whichever one you like. Also…?”", "Seol Jihu paused when he saw the first-floor lobby.", "He couldn’t be blamed. There was a bob-cut woman sprawled on the ground with her arms and legs spread out.", "Seol Jihu didn’t know any Valhalla members who would do something lacking so much in common sense. Even Chohong and Hugo wouldn’t do something like this.", "“…Miss Hoshino Urara?”", "As soon as he called out her name, Hoshino Urara’s upper body shot up. She looked at Seol Jihu and opened her mouth wide enough to show her uvula.", "“OOOOOOH!”", "She then changed her sitting position to a crouch and galloped toward him like a crazy horse. However, her bee-stung pony impression was short-lived.", "“KITAAAAAA—CK!?”", "When she saw the maid standing behind Seol Jihu, she screamed in terror. Flailing her arms and legs in the air, she rolled backward.", "After somehow tumbling around, she fixed her posture and showed a dazed face.", "“….”", "“….”", "An indescribably uncomfortable silence hung between the two women.", "The first to act was Hoshino Urara. Her lips trembled before she respectfully got on her knees. She even cupped her hands above her knees.", "Her expression was also calm and tidy. Five seconds was all it took for the crazy woman to transform into a lady of a distinguished family.", "“Have you come back?”", "Hearing that the sharp voice had turned into a calm, silvery voice, Seol Jihu doubted his eyes and ears.", "Hoshino Urara turned… docile?", "“It’s been a while. Thank you for coming. Though this may be a lowly place, please think of it as your home and make yourself comfortable.”", "She bowed politely until her forehead was almost touching the ground.", "Seol Jihu, who was rubbing his eyes in disbelief, slowly turned back. Then, he was surprised once again.", "It was because Agnes was walking forward with a face that clearly said, ‘God, I hate this.’", "“M-Miss Agnes?”", "“You said there was a hot spring downstairs?”", "“Um, you should grab a room first.”", "“No need to guide me. I’ll be fine on my own. Then excuse me.”", "She walked quickly and disappeared.", "Seol Jihu’s jaw dropped.", "THE Agnes was avoiding someone?", "Hoshino Urara waited until Agnes disappeared from sight before shooting up.", "“Oppppaa!”", "Screaming like a duck, she grabbed the flinching Seol Jihu’s hands and made a fuss.", "“You crazy!? Hmm? Why is that person here? Why did you bring her here!!?”", "“F-For of the expedition. It wasn’t easy to invite her, you know.”", "“Jeebus—! I’m gonna go crazy! Do you know who that is!? You want to die, Oppa!? You must, right!?”", "“Why? She’s a great person.”", "“Great my asssss!”", "Hoshino Urara jumped like she was really going crazy.", "“Fuck me, end me, absolutely obliterate me! How can you be so blind?”", "Pointing in the direction Agnes disappeared to, Hoshino Urara shook her hand and muttered with her face up close.", "“You must not know, Oppa, so I’ll tell ya about it. You ever hear about the Haramark Civil War?”", "“Yes, somewhat.”", "“Yeah, I was there.”", "“Okay. And?”", "“And, you say? Brother, I was there watching! That person captured the enemy organization members, eh! Cut open a dude’s stomach, eh! Yoinked the intestines like a noodle! Then she—”", "Hoshino Urara suddenly cleared her throat, then raised her middle finger and swept past her face. She seemed to be imitating Agnes pushing up her glasses.", "She continued with a grin, “Eat! Here! Chew on it properly and swallow it! It’s your subordinate’s organ! Looks delicious, doesn’t it? It must! Ki— Kikikiki!”", "Hoshino Urara cackled as she revealed her teeth and shook her head crazily.", "“That was what she did!”", "Then, she abruptly turned serious.", "“I’m telling ya! This is all true! I swear on it on me mum!”", "“….”", "“That ain’t all. She served corpses on a silver platter at a dinner meant for negotiation, held a corpse exhibition just to show the enemy organizations… Anyway, that is one crazy woman. You won’t find a crazier woman anywhere else!”", "Seol Jihu looked taken aback. He wanted to say something, but it didn’t look like she was lying from the terrified expression she had.", "But it was also hard to imagine Agnes, who was the byword of seriousness and solemnity, laughing maniacally, like ‘Ki— Kikikiki!’", "‘She’s a good person to me.’", "Seol Jihu shook his head.", "He looked at Hoshino Urara, who was clattering her teeth nervously, and asked.", "“Anyway, why were you laying in the lobby?”", "“Ah, my body recovered, but I couldn’t find Oppa. I was wondering when you were gonna come back. I was getting bored.”", "“You didn’t know if I’d show up today though…”", "“Well… I figured you’d come back within a few days. I must have been lying like that for three, four days already. Ah, except for the times I was eating.”", "Seol Jihu didn’t put it past Hoshino Urara to have really done so.", "“Jeez.”", "Seol Jihu didn’t know what to say when he suddenly went “Ah”.", "“Have you seen Yuhui Noona?”", "“Yuhui Noona? Ah~ That Unni with the huuuu~ge titties?”", "Hoshino Urara said as she put her hands on her chest and drew a big circle. Then, she shook her head.", "“Nope, didn’t see her.”", "“I see.”", "Seol Jihu became worried. It took him almost ten days to make his trip to Haramark from Eva and be back, but Seo Yuhui hadn’t come back yet. It was hard to believe she ran away either.", "‘Are things not going well…?’", "He became uncomfortable, thinking that he burdened her with a difficult request.", "‘I’m sure she’ll be back soon.’", "But Seol Jihu decided to trust in Seo Yuhui and wait.", "*", "Clouds of war began to hang in the air.", "Although it was unknown whether the Federation purposely leaked the information, there were baseless rumors of the Parasites raising a large-scale army soon.", "The movements of humanity became messy. With the Eva Royal Family actively reassembling their army, the rumors were treated as an established truth.", "As the organization closest to the war than any other, Valhalla’s air became heavier as well.", "The members seemed to have known intuitively, with Seo Yuhui being gone for so long and Seol Jihu suddenly bringing Agnes.", "Their intuition turned to conviction when Philip Muller revisited Valhalla after taking care of his matters.", "And thus, they had prepared everything they could before going on the expedition. There was now only one thing left to do — waiting for one, no, two people.", "It wasn’t until noon that day that the long-awaited Seo Yuhui finally came back.", "Seol Jihu, who was anxiously waiting like a puppy, ran down to the first floor as soon as he heard of Seo Yuhui’s return.", "“Noona?”", "“Jihu!”", "“What took you so long!?”", "Seeing Seo Yuhui standing at the entrance, Seol Jihu flew like a butterfly and pounced like a bee. Burying his face in her alluring shoulders, he began to sniff her like a dog missing his master’s scent.", "“I was worried!”", "“What! Sorry, sorry! It took longer than I expected— Ahahaha! It tickles!”", "Enjoying Seo Yuhui’s scent for a moment and rubbing his scratchy cheek on her soft skin—", "“It tickles! Jeez!”", "Seol Jihu flinched, seeing someone standing behind the shrinking Seo Yuhui, holding a jade-colored spear.", "“….”", "A woman wearing a white traditional robe was staring at him coldly with eyes as tranquil as a frozen lake.", "1. This word was previously mistranslated as ‘necromancy’ in chapter 231. Sorry about that! (kind of similar though, eh?) "]}