{"cid": "393", "title": "Chapter 393. Intention (1)", "content": ["The situation quickly came to an end.", "Valhalla first subdued the enemy and then climbed up the cliff to exterminate the Evil Phantoms trapped inside the cage of light.", "When he finished killing every last one of the Evil Phantoms, screeching in pain from the Requiem of Stars, Seol Jihu raised his spear above his head so that people below could see.", "This was the cut sign.", "Eun Yuri flopped to the ground as soon as she saw the signal.", "Controlling dozens of communication crystals and simultaneously using magic was certainly not an easy task.", "“Good job.”", "Seol Jihu gave Eun Yuri a pat on the shoulder in appreciation.", "Panting for breath, she barely managed to nod, her eyes a little puffy from fatigue. Then she threw a glance to the side.", "There, Seo Yuhui was kneeling on the ground, her hands roaming every inch of her own body.", "“Noona…?”", "Seol Jihu flinched when he saw her up close.", "Something was not right.", "Seo Yuhui was collecting rain with her hands and cleansing her body with it.", "“Dirty…. Dirty….”", "She rubbed the nape of her neck, where the burly man had grabbed her. She rubbed all the other parts of her body where the man’s gaze might have landed.", "All the while, she kept uttering the word ‘dirty’.", "She rubbed with such a force that her skin began to redden and swell.", "Her usual gentle self was gone and a look of revulsion spread across her face like she’d just seen a thousand maggots crawl across her skin.", "Seol Jihu could tell she was far from okay. He asked carefully.", "“Are you okay?”", "Seo Yuhui paused instantly.", "The revulsion clouding her eyes quickly receded and her face now beamed with hope, as if she had just witnessed the Messiah.", "“J-Jihu.”", "“Yes? What is it?”", "“My neck….”", "“Your neck?”", "“Touch my neck. Hurry.”", "It was an unexpected request, but Seol Jihu quickly reached out.", "His fingers brushed her long, delicate neck.", "“Huuuu—”", "Seo Yuhui grasped Seol Jihu’s hands, closed her eyes, and let out a long, restorative breath.", "“Haaaa—”", "There was something erotic about the way her heated breath touched his hands and her body trembled, soaked from head to toe with rain. Seol Jihu slowly pulled his hands away from her.", "Seo Yuhui opened her eyes halfway.", "“Noona, you should get to the tent.”", "“I can’t…. My legs won’t move….”", "It kind of sounded like she was pouting.", "“I’ll help you. Let’s go.”", "Seol Jihu picked Seo Yuhui up from the ground and pulled her to his chest.", "Drenched in rain, he walked across the battlefield toward their campsite.", "“…I’m sorry.”", "Suddenly, a faint voice broke the awkward silence between the two.", "“I thought I’d be okay….”", "Seol Jihu lowered his gaze slowly.", "He knew Moirai’s Souvenir had healed both her holy power and her body.", "But the woman in his arms looked more tired than he had ever seen her.", "“Don’t apologize.”", "Seol Jihu tried to sound cheerful.", "“It’s not a big deal.”", "“Not a big deal…?”", "“Ah, the thing is, I know.”", "Seol Jihu continued in a casual tone.", "“I first heard about it from Sung Shihyun, and the bishop also said something similar….”", "Seo Yuhui remained silent and only furrowed her brow slightly.", "“Actually, I’ve experienced something similar. I’m not a germaphobe, but I do have a compulsion of sorts.”", "“…No.”", "“Pardon?”", "“I’m not a germaphobe.”", "Seo Yuhui’s voice suddenly became articulate.", "“I….”", "After a moment of silence, Seo Yuhui continued.", "“I’m the apostle of Luxuria….”", "Conscious of the eyes watching them, her voice once again dwindled to a whisper.", "“In a way, an executor is like the incarnation of the god they serve….”", "Seol Jihu nodded in silence. He’d heard. The higher their level, the more likely they were to be influenced by the gods they served.", "There were differences between individuals, of course, but Earthlings usually came under this influence when they first became High Rankers. The pressure intensified when they became Unique Rankers, but it was still bearable.", "But things were a little different for executors.", "Because executors received their powers directly from their gods, they were influenced more greatly than others.", "Not only their emotions but also their thoughts and actions were affected by their gods.", "Once his thoughts reached this far, Seol Jihu abruptly came to a halt.", "“And I’m a Priest….”", "The whisper continued.", "“Priests are closer to their gods than any other Classes… so they’re the most affected among all Executors….”", "The goddess that Seo Yuhui served was Luxuria, the goddess of lust.", "“…Noona.”", "Seol Jihu asked in disbelief.", "“Don’t tell me you’re….”", "“…”", "Once again Seo Yuhui gave a long sigh and nodded.", "“Wait…. How bad is it…?”", "“Let’s just say… that I didn’t know it was going to be this bad…?”", "Seo Yuhui spoke slowly and with deliberation.", "“It’s not just men…. Women are dangerous, too…. Regardless of age or sex, I…. And it’s not only touching….”", "“…”", "“Gaze, smell, any kind of stimulation…. The lingering sensation of a touch or even pain….”", "Seo Yuhui’s voice began to waver and she clamped her lips.", "Seol Jihu unwittingly closed his eyes.", "[Don’t you know her nickname? It’s Steel Wall.]", "[Weren’t you disgusted whenever you touched a man?]", "[Lady Seo Yuhui avoids uncleanliness so much that it nears mysophobia. She detested even the slightest touch from foreign things.]", "[For someone who avoided making contact with others like a plague to be hugging a man….]", "The voices from the past raced through his head.", "Everyone had it wrong.", "They knew nothing about the truth.", "Seo Yuhui wasn’t mysophobic.", "She had no choice but to put up a steel wall.", "Just as Cinzia suffered from lethargy, Seo Yuhui, who served Goddess Luxuria, was suffering from lust.", "The same was true of what had just happened. She wasn’t calling the burly man dirty.", "It was an expression of self-hatred stemming from feeling excited and almost climaxing at the touch of a man who exposed and abused her, even if it was just acting.", "“You’ve been… withholding it?”", "“Yeah….”", "Seo Yuhui admitted with a blush.", "“I’m a healthy woman… so, of course, I think about it… but I don’t want to sleep with just anyone and let my desires get the best of me….”", "“…”", "“But the more I endure my desires, the stronger they become…. And the goddess’ influence is getting stronger, too….”", "Lust was a primitive emotion that could be relieved to some extent by satisfying desires.", "But Seo Yuhui refused to become an animal, driven only by its urges.", "She curled up in Seol Jihu’s arms, hiding her face in embarrassment.", "The campsite was filling up and getting noisy.", "Seol Jihu adjusted his grip on Seo Yuhui’s arms and resumed walking.", "“You should get some rest. Change your clothes, too. I’ll be on the watch.”", "“…Thanks.”", "Seo Yuhui gave a frail smile.", "After he dropped her off in the tent, Seol Jihu stepped outside and settled down near the entrance.", "He couldn’t help but notice the sound of her clothes falling.", "No one came by except Eun Yuri, who made a brief stop to pick up ropes to tie up the captives.", "Everyone was focused on post-battle activities.", "Or, more precisely speaking….", "“Woah. Looks like we hit a jackpot. Look at this equipment!”", "“A gold mine! It’s a gold mine!”", "They were identifying the dead and those who had fainted. All the while they were busy collecting weapons and equipment from them.", "What they were doing was nothing short of looting, but Seol Jihu did not stop them.", "He wouldn’t have cared anyway, but Seo Yuhui was occupying his mind, especially at this moment.", "Now that he knew her secret, everything seemed to fall in place. Why hadn’t he noticed until now?", "It didn’t take long for Seol Jihu to figure out the answer to that question. Subsequently, another question formed in his mind.", "Ever since their first meeting, to him specifically, Seo Yuhui had been….", "Unable to overcome his curiosity, Seol Jihu turned and poked his face into the tent.", "“Noona….”", "But Seo Yuhui had already changed into clean clothes and was lying in her sleeping bag.", "Seol Jihu stared at Seo Yuhui’s sleeping face for a while before pulling his head out of the tent.", "He turned his eyes forward again, putting his question aside for the time being.", "*", "The next morning, the rain that poured all night stopped like somebody turned off a faucet.", "Under the bright sunshine, the members of Valhalla finished their breakfast.", "All of them looked happy and content as they took down their tents and loaded their belongings into the carriages that Kazuki had brought along.", "Sure, they had won, but that wasn’t the only reason.", "The quality of the weapons and equipment they had looted from the enemy was shockingly high.", "But then again, that was to be expected. This equipment was fit to be used by Level 6s. Not even a hundred of them existed in all of Paradise.", "The other loots were also of good quality, all at least Level 4. The extra rewards from this mission were substantial.", "Valhalla took the five humans that led the attack as captives.", "Seol Jihu had hoped to capture them alive no matter what and he got what he wanted.", "It was clear that whatever was in store for them from now on would be far from pleasant.", "The five couldn’t look more pitiful.", "They were stripped of all clothing and had ropes tied to their waists.", "They also wore thick collars around their necks, which were connected to long chains tied to a nearby tree.", "In short, they were being treated like dogs rather than humans.", "“Hey. Here’s your breakfast.”", "Chohong threw a pot in front of the captives.", "“You’ll all have to run like crazy behind the carriage for the next few days. Don’t you think you should save up some energy?”", "Chohong snickered as she looked down at the mixture that had spilled from the pot.", "It was a mixture of leftovers from their breakfast, basically an inedible garbage.", "“Aren’t you being too nice? These scumbags not only tried to kill us, but also betrayed humanity and joined hands with the Parasites. But you’re still giving them food?”", "“Kindness is one of my many fine qualities. What are you guys waiting for? Go on, eat it!”", "Audrey Basler smirked and Chohong hastened the captives.", "“Ah, is it because you’re all tied up? Well then, you should lick it like the dogs you are.”", "It was then a look of defiance crossed the face of the young man, who had been quiet until now. Chohong’s words seemed to have hurt his pride.", "“Look at this guy!”", "Chohong gave a light chuckle, and then suddenly, all traces of joy disappeared from her face.", "She grabbed the young man’s hair, and….", "“I guess this doesn’t suit his highness and his expensive tastes, does it?”", "Koong!", "“Uup!”", "She slammed his face into the food waste.", "“Open your mouth! Eat it!”", "She moved her hand left and right, rubbing the young man’s face on the ground, then yanked his hair back and forced him to look her in the eye.", "“Bitches aren’t supposed to complain about their food. So what’s with that look?”", "Pieces of garbage spattered on his face and the young man groaned.", "“All of you, eat. I’ll give you 10 seconds. Those who don’t eat in 10 seconds, I’ll make you wish you had.”", "The remaining four flinched at Chohong’s stare.", "“You don’t like the food? Do you need a dipping sauce or something?”", "Spit!", "Chohong spat into the mixture.", "“Will that even be enough? You need some salt if you really want to get the taste right.”", "Audrey Basler smirked and shook her hair above the pot. Flakes of white dandruff fell into the mixture.", "Eun Yuri, who was wrapping a leather strap around a tree branch to make a whip, cringed at the sight. She seemed disgusted.", "But this was only the beginning.", "“What are you talking about? Fragrance is what matters the most!”", "Hugo shouted and crouched down above the pot.", "Fffffft! Everyone’s face stiffened at the farting noise.", "The noise, which started out light and casual, suddenly became heavy and dull.", "“Fuck.”", "Hugo shot to his feet.", "He waddled across the field and disappeared in a hurry.", "“…Disgusting bastard.”", "Oh Rahee covered her mouth with one hand and retched.", "Finally, when Hoshino Urara pissed into the pot, Kazuki could no longer witness this abomination and fled the scene.", "“Um….”", "Chohong hesitated. She didn’t want to go anywhere near the food covered with feces and urine.", "“Stop it!”", "The woman finally broke down.", "“What?”", "“Stop! This… This is too cruel! At least let us—”", "It was then.", "“What’s going on?”", "Asked Seol Jihu as he walked toward them from the tent.", "“We have to leave soon… so why are you all gathered here?”", "“Huh? Um, uh….”", "Chohong hesitated.", "“We gave them breakfast… but they aren’t eating….”", "“Breakfast?”", "Seol Jihu glanced across the clearing and quickly realized the situation.", "The utterly disgusting state of the food and the bits of debris across the young man’s face were both dead giveaways.", "He slowly turned his gaze and Chohong averted her eyes. Audrey Basler smiled nervously.", "“I was just trying to be nice… but they won’t eat. I guess they’re not hungry.”", "“…What should we do?”", "Seol Jihu let out a sigh.", "“If they’re not hungry….”", "Then he raised his foot.", "“We should make them.”", "Puk! He kicked with all his might.", "The woman collapsed to the ground with a shriek. Everyone opened their eyes wide.", "Seol Jihu discovered a palm-sized tattoo of a snake on the woman’s neck and his lips formed a mocking sneer.", "And he didn’t stop with just one kick.", "Puk, puk, puk, puk! He also kicked the four others in turn.", "The burly man took an especially hard beating. The hands that had strangled Seo Yuhui were kicked, stomped on, and beaten.", "The beating was so severe that even Audrey Basler retreated with a cringe. It reminded her of what had happened to her in the past at the banquet.", "“Hey, hey, stop!”", "Finally, Chohong intervened.", "“You’re going to kill them. Weren’t you the one who wanted them alive?”", "“We can heal them afterwards.”", "Seol Jihu remarked coldly as he pushed Chohong to the side.", "Then he aimed as if he was kicking a soccer ball and gave the woman another kick.", "“That’s right! Kill us!”", "The woman screamed, blood gushing from her nose and her mouth.", "“Kill us! We won’t give in to you!”", "“…Give in?”", "Seol Jihu lowered his foot.", "With a scoff, he slowly crouched beside the woman and looked into her eyes.", "“There must be a misunderstanding here, Level 6 Ghost Striker, Miss Kishi Yukino.”", "The woman, Kishi Yukino flinched, even though it shouldn’t be surprising that the enemy knew her name. All five of them were quite famous in Paradise, after all.", "What really shocked her and her comrades was what came after.", "Seol Jihu began to recite their summoned date, sex, age, nationality, and even affiliation.", "Because they had no way of knowing his innate ability, they were led to believe that he had thoroughly researched them beforehand.", "“Don’t flatter yourselves. We don’t want to ask you any questions or squeeze information out of you. We’ve already captured the bishop, so why would we?”", "“H-How….”", "“Let me repeat this one more time just to be clear. You have nothing to offer us. We’re only keeping you alive to use as sacrifices. Keep your mouth shut and your head down if you want to die peacefully when everything’s over.”", "Seol Jihu threw another punch at Kishi Yukino, who had been rendered speechless.", "He shook the blood off from his hand and foot before speaking.", "“We’re leaving soon. Bring them all and tie them to the back of the carriages.”", "His cold voice made Chohong click her tongue.", "“The roads are in bad shape. It’ll take at least 10 days….”", "“It doesn’t matter. They’ll run if they want to live. Mister Kazuki brought two carriages, so divide them into two groups.”", "“Okay!”", "Eun Yuri replied merrily. She untied the ropes from the tree and raised the homemade, black, leather whip in her hand.", "“Let’s go, everyone~”", "The five dogs squirmed with discomfort.", "Eun Yuri flicked her arm and the whip slashed the young man, leaving a red line on his naked butt.", "“Let’s go~”", "“This bitch…!”", "The burly man also vented his anger and Eun Yuri whipped him as well.", "He clenched his teeth, his face buried in the damp soil and his butt aching from the lash.", "But these kinds of reactions seemed to excite Eun Yuri even more.", "Her cheeks were flushed and her eyes sparkled. The slight curl at one corner of her mouth was another proof.", "“Let’s go~”", "Swish! The whip once again struck the young man’s back and he clenched his teeth.", "In the end, the five were forced to walk on their hands and knees like vermin.", "*", "Around the same time.", "When morning came, all the human territories in Paradise bustled with noise.", "Everyone who watched the shocking movie from the night before was talking about it.", "“Father! Father!”", "The same was true of Haramark.", "Teresa looked for King Prihi as soon as she opened her eyes.", "“Did you see it? Did you?”", "“I did. I could hardly sleep afterward.”", "Prihi replied from his office, calmly tilting his teacup.", "“How can you be so calm? I couldn’t sleep a wink last night!”", "“Something has been bothering me.”", "“?”", "“Earlier, I spoke with the Executor of Avarice through the communication crystal. He said he was the director and that Valhalla’s representative was the producer….”", "Prihi set his cup down and tapped the desk with his finger.", "“I just don’t understand the purpose of their production.”", "“Purpose?”", "“They didn’t have to broadcast it live everywhere, but they did. This makes me think they have a hidden motive….”", "Prihi thought for a while before going on.", "“I believe they were trying to gain justification for something.”", "“Justification?”", "“Yes. And if I’m right, we’ll soon see the sequel.”", "Prihi muttered to himself and stood up from the desk.", "Teresa looked puzzled.", "“We should head to Eva.”", "Prihi spoke.", "“This plan of theirs is too over the top for the simple purpose of securing evidence. They must have a bigger picture in mind, and we might be able to help them paint it. We should head to Eva, and….”", "Prihi, who turned to face Teresa, paused in the middle of his sentence.", "His daughter was already dressed in her armor and even carrying a bag on her back. She seemed ready to depart at any moment.", "“…When?”", "“Uhuhuhu.”", "Teresa twisted and turned her body coyly.", "“I packed early in the morning. I told you I couldn’t sleep. Also, I wanted to see him badly….”", "Prihi shook his head.", "“…I’ll get ready right away.”"]}