{"cid": "84", "title": "Chapter 84. By a Whisker", "content": ["—Seriously?", "Kazuki sounded really happy.", "—Where…. No, hang on. What about signs of infection?", "Teresa Hussey's condition couldn't be described as good even as lip service. One of her eyes was blackened; dried blood was evident on her nose; her lips were busted open unsightly; her swollen, reddened cheek….", "Several spots of her body were also reddened and bruised, and the stink from all sorts of filth wafted around heavily. Her current appearance attested to the indescribable hardship she had gone through. But Seol Jihu couldn't spot any tell-tale signs of infection from forced breeding.", "He displayed her condition through the communication crystal and opened his mouth.", "“I found her in the experimentation area. She seems to be tortured, but I don't think she's been infected.”", "—Tortured? …Ah!", "Kazuki sounded as if he had just about figured out the process of how she was discovered. Now that he had seen her through the crystal, his suspicions would be satisfied too.", "—Hmm. I was on my way back, but if you want, I can come and help you.", "“No, hang on. It's difficult to describe exactly where I am. So, go back first.”", "—Got it. I'll trust you.", "The communication ended there. Seol Jihu quickly checked her wrists and ankles. If she had been tied down with special restraints, things might have become troublesome, but thankfully, she was bound with thick ropes, instead. As he pulled out a dagger, his eyes met the Princess's. She looked as if she had seen a mirage just now.", "“…Is this a dream?” ", "Her voice was really hoarse.", "“Or a hallucination?” ", "He simply grinned back at her. She must have found his response rather mean-spirited because large teardrops formed on those two jewel-like eyes next. She sniffled her reddish nose and continued on with a desperately pleading voice.", "“Please, say it ain't so. Please.” ", "“This is neither a dream nor a hallucination.”", "Seol Jihu replied concisely back to her.", "“I came to rescue you, Princess.” ", "“But, how?”", "“I know you have lots of questions, but please, hold them in for now. We don't have much time left.” ", "He quickly knelt down on one knee.", "“…Ah.”", "Teresa Hussey suddenly became flustered for some reason.", "“What should I do, what should I do?! Sob, I can’t get married now.” ", "“?”", "“I couldn't help it, that perverted bastard didn't want me to use the bathroom….” ", "She explained her situation in a voice that got progressively smaller.", "'…Perverted bastard?'", "“….It's fine.” ", "Seol Jihu quietly replied to her.", "“I'm just thankful that… you managed to stay alive until now. Truly.” ", "He was being genuine here. Because he was concentrating on cutting the bind on her ankles, he failed to see what her facial expression was like when she heard his words.", "“….Can, can I cry now?” ", "“Nope, you can't.”", "“What about a hot-blooded kiss, then?”", "“Obviously no, wouldn't you say?” ", "While sharing a carefree banter, he brought the dagger closer to the rope binding her ankle, but then….", "Dururuk!!", "He heard a sound from the other side of a wall. Gulp! He swallowed his breath. His hands stopped moving. His heart palpitated and the muscles in his entire body seemed to contract.", "Now that he took another look, this building was shaped like a rectangular container from the outside, but the torture chamber was much closer to a square box. Only then did he finally spot a doorway to the far corner. He quickly remembered that this whole place being marked 'Do Not Approach'. But he forgot all about it because of Teresa Hussey.", "What should he do now? Too bad, even before he had the chance to come up with a plan, he heard the sound of the door being yanked open. He instantly lowered his body and hid behind the large X-shaped frame. Meanwhile, Teresa Hussey quickly lowered her head and began opening her mouth.", "“Someone, anyone, help me. Save me. I want to go home. Ahhh….” ", "She began muttering all to herself. Splash, splosh…. Sounds of wet footsteps could be heard before a huge shadow was cast around the wooden frame.", "“Here I was, wondering why I suddenly heard voices. You were yapping to yourself?” ", "Prrrr. An ear-grating voice akin to a bubbling quagmire came from the shadow's owner.", "Teresa Hussey's quick-witted thinking helped him to overcome the immediate danger. Of course, Seol Jihu continued to remain vigilant. If this thing could move even under the rudium's control, then it had to be a really high-ranking creature. He didn't want to believe, but it was really here.", "Cold sweat trickled down his backside. Luckily, the thing must've been staying inside this building and didn't know what was going on outside. But, if it found out what was going on from the get-go, then….", "“Hmm?” ", "The unknown creature suddenly began frowning.", "“How did this bastard get here?” ", "Right at that moment, Seol Jihu thought his heart would explode, but…", "“Didn't I forbid it from coming here?”", "….But, he quickly realized that the high-ranking Parasite wasn't talking about him, but the mutated Orc he spotted during his search and made it enter the building first.", "Although it was a good fortune among a sea of misfortunes, it was too early to feel relieved. He hurriedly grasped the rudium and undid all of the mental control other than the friend-foe-recognition.", "The mutated Orc turned around to leave. Even the hatchery, once deathly-quiet, was filled back up with sounds of renewed activity. The unknown Parasite creature tilted its head as the mutated Orcs began moving around again, but then….", "“I, I'm thirsty….” ", "…Then, it reverted its attention back to Teresa Hussey after hearing her pained moan.", "“Water, water….” ", "“Hoh.”", "Splash, splosh…", "The creature approached the frame again. Saliva quickly pooled in Seol Jihu's mouth. He felt tension surge through his entire body and didn't even move an inch from the spot. He even stopped breathing altogether.", "“Kekeke. Looks like you're seeing hallucinations now. Is this your limit, then?”", "“Water. Gimme water….”", "“To think, she'd break down already. That's too bad. Where's your initial spirit disappeared to now?” ", "“Euhk.” ", "“Well, I guess that's because you're from an inferior species. Still, you did resist more than expected.” ", "The ridiculing words forced Teresa Hussey to chew on her lips.", "“So, you want to drink water?”", "She quietly nodded her head.", "“And you want to eat something, too?”", "“….Yes.”", "“Then, speak.”", "She formed a conflicted expression.", "“It's not difficult. All you have to do is to tell me.”", "The unknown Parasite opened its arms wide.", "“Our Queen is magnanimous and merciful.”", "“….”", "“Even if you're from one of the inferior species, she will not abandon you as long as you have one redeeming quality, however insignificant. So, speak up. Speak everything about the oath made with the seven gods. That is the only way for you to prove your worth.”", "Teresa Hussey looked to be in a deep dilemma before her head faltered even more.", "“I, I need more time to think.” ", "“What a frustrating little fool. How much more time do you require? Maybe, you still haven't understood what I'm saying?” ", "“We humans are different from your kind. I have people who believe in me – my family, my friends, my subordinates. If I do as you say, then I become a bitch that betrayed their trust.”", "“Tsk, tsk. That is why you're inferior. All those emotions are useless when compared to the brand new world our glorious Queen will bestow unto this world.”", "“God damn it! I get it. I hear you, so gimme time to think about it for myself!”", "Seol Jihu finally grasped what the Princess was trying to do here. She was trying to send this high-ranking Parasite away, thus giving themselves a window of opportunity to escape.", "“Fufufu. Aren't you a funny one? You think I don't know what you're trying to do?” ", "“What was that??”", "“Was it four days ago? Didn't you waste dozens of minutes by repeatedly telling me you'd think about it and then, began demanding from me this and that? You think I'll be fooled twice?” ", "'She already used this tactic before….' ", "Seol Jihu despaired inwardly. But then, Teresa Hussey began shouting out.", "“Damn it! Even if it's for a short while, it'll be fine! With you around, I can't get my thoughts straight!” ", "The unknown Parasite snorted derisively, but it didn't say no. Even without looking, one could tell the creature felt conflicted. It wouldn't be so bad to give her time to rationalize her thoughts now, would it? However, the being didn't back away peacefully.", "“For a short while, is it? I guess it doesn't really matter, but if you are trying to deceive me again, then you better prepare yourself.”", "“I'm really trying to think about it.” ", "“Fine. I shall hope that you're being serious. If not….” ", "Pow!", "“Euh-huuk!!” ", "The creature's fist roughly slammed into her midriff. Teresa Hussey's eyes shot open wide. Drool leaked out of her gagging mouth. The unknown Parasite cackled on.", "“….We are going to enjoy yet another fun time together.”", "Cough, cough!!", "The creature ignored the coughing human and left through the exit.", "“Urgh, that hurts.”", "Teresa Hussey complained bitterly. Meanwhile, Seol Jihu quickly moved his hands. He felt sorry for her reddened midriff, but there simply wasn't enough time to ask how she was doing right now. That high-ranking Parasite's entrance had eaten up way too much time already. If it weren't for her quick thinking, he might even have overshot his time limit, too.", "The ropes were thick, but they didn't pose much of problems when he used his mana.", "“Can you walk?”", "“Yes…. Uh, eh?” ", "Finally freed, she unsteadily faltered as her feet touched the ground. Her arms flailed about and she nearly fell, but Seol Jihu caught her in time. He lifted her up in an embrace by her slender shoulders and below her knees. Wasn't this the famed princess carry?", "“Oh, my~?” ", "She blinked her eyes after inadvertently ending up in his arms. Seol Jihu cautiously scanned the outside, worried that the unknown Parasite was nearby.", "“I hope that thing won't show up soon.”", "“No, it's going to, pretty soon. Remember, I tried to fool it once before, and besides, the bastard's got one hell of a short fuse.”", "Teresa Hussey spoke in a wry tone.", "“From the get-go, they look at things differently from us. And that thing is like a freaking insane loon.”", "Perhaps she had suffered a lot at the creature's hands because she gnashed her teeth like crazy herself before she went “Oops” and recovered her wits. She pointed at the door within the torture chamber.", "“Go there. There should be another exit from here.”", "It was only a matter of time before they got discovered. Even then, that didn't mean they had to use the door he used to enter, now did it? A blitzkrieg it was, then.", "'As long as we can make out of the prison block….!' ", "Seol Jihu quickly organized his thoughts and fixed his hold on the princess. She softly wrapped her arms around his neck and whispered to his ear.", "“Let's go, my prince.”", "And then, Seol Jihu began running like an arrow.", "*", "Just as she predicted, the high-ranking Parasite returned quickly. In terms of actual time, it was around two minutes. From the moment it spotted the mutated Orc entering the forbidden building, this creature had been sensing that something wasn't quite right, so it took a look around but couldn't find anything was amiss.", "'Did I see it wrong?' ", "The chain of thought that roughly went along that line shattered into pieces the moment it returned to the torture chamber. Well, the Haramark Princess who should have been bound to the frame was nowhere to be seen, after all. The only thing remaining was the sliced-off ropes.", "It freaked out and dashed outside, but it was impossible to find the princess in one breath. There were just too many things walking around, disrupting its vision. Of course, this high-ranking creature was no dummy.", "“Every single one of you, stop moving!” ", "A mental wave containing powerful controlling will spread out everywhere, causing everything inside this place to stop moving at once. The unknown Parasite being quickly scanned the area, but couldn't spot any movements. Either she was in hiding or had escaped from the hatchery already.", "“That damn rat-like bitch!”", "The high-ranking creature glared at the ceiling and roared out.", "Meanwhile, Seol Jihu was in the middle of hurriedly running up the stairs. Around the same time as that roar, the communication crystal dangling in his ear began glowing as well.", "“Mister Kazuki?” ", "A short bout of silence later, the communication resumed.", "—I told you to arrive before the last minute mark, didn't I?", "He sounded a bit furious.", "“I ran into a high-ranking Parasite.” ", "—What?!", "“For the time being, I managed to evade detection, but I don't know when….”", "Pant, pant…", "Seol Jihu pounded on the steps until he arrived on the first floor – and that's when he stopped talking altogether. As soon as he got here, he realized that the mutated Orcs busy moving around until then suddenly began staring at him. He used the rudium, but it didn't work. Thoughts of “Oh, shit” entered his brain.", "—Run!!", "Kazuki assessed the current situation through the communication crystal and shouted out loudly.", "Kuuuuueeeeh!!", "Mutated Orcs began rushing at him almost at the same time. Seol Jihu listened to his instinct and climbed on a wooden desk before leaping up from it. The Orcs rushing at him stopped and dazedly looked at his acrobatic jump. He flew above them, and at the exact moment he landed on the floor…", "PANG!!", "….Without a shred of hesitation, he activated the Festina Earring and ran.", "The surroundings rapidly blurred past him. The light became hazy once more, and he spotted the path he took to get here. He couldn't tell whether the passageway had narrowed suddenly or that it was his own vision narrowing down. He didn't care and kept his eyes fixed to his front and ran like his butt was on fire.", "In no time at all, he reached the middle of the laboratory, but then….", "DUDUDUDU…!!", "He heard unknown sounds of humongous scale coming from the left side. Even during his hurried escape, goosebumps broke out on his skin.", "That direction was where he found Hugo. And that's where the stairs leading up to the surface was located, too. If he didn't hear it wrong, then it meant that even the elite Parasites guarding the surface had all come down here.", "Rather than getting further away from him, the chasing footsteps grew only louder and louder, tenaciously clinging to his rear. PANG!! Seol Jihu activated the second layer of 'Boost'.", "Just a little bit, and he'd be able to escape from the research area. Too bad, the reality wasn't so kind. The mutated Orcs he saw when entering this part of the underground laboratory were roaming around near the lone exit. Their numbers weren't high, but what with their large frames, it would be very difficult to go right through them. It was then.", "“Keep running!” ", "His ice spear was suddenly pointing to his front. Teresa Hussey had picked up his weapon and began wielding it before he had the chance to notice her actions.", "They couldn't fight here. Not only they would not win, but they would also get captured by the chasing pack, instead. Which meant that they had no other option but to break through from the front.", "“Keuk!”", "Seol Jihu gritted his teeth. He lowered his posture and pounced forward even harder.", "Kuehk? Kuuheehk!", "The mutated Orcs discovered the humans belatedly, their eyes gleaming dangerously now. All sorts of colorful weapons descended on the young human male dashing in like an ice pick.", "He caught the sight of an axe being bounced away by the ice spear.", "He felt a part of his armor breaking.", "He even sensed something brushing past him which immediately lead to this burning ache coming from his back and his side. And then…", "BOOM!!", "Out of the blue, he felt something hard blocking his path slam into his body. And soon, that pressure from the front disappeared and his view opened up wide. He had finally broken past the exit door and escaped out of the research area. ", "He almost rolled on the ground from the remaining impact force after he broke past the door, but he somehow managed to not fall. With Teresa Hussey in his arms, it was far harder to maintain his balance.", "'Even still…' ", "Now that he could see the sky bridge, he was almost at an eighth of the way to his destination. Past the bridge, the passageway beyond it, plus to the room with the hideout, was all in a straight line. Better still, there was no obstacle blocking his way.", "He thought like that and activated the third level of stacking – it was also right then he felt this itching sensation on his neck.", "Bzz….", "Sounds of beating wings pounded on his eardrums. Not only that, the garbled shouting coming from the crystal, the thudding footsteps, all these indecipherable cacophonies of noises assaulted his hearing. He hadn't even managed to cross the sky bridge yet, but it felt like some things were drawing nearer at a frightening pace.", "—Jump!", "Kazuki's shouting hit Seol Jihu's ear.", "“I’m running!” ", "—No, that's not it! Trust me and jump as hard as you can! Hurry!” ", "“Behind you!” ", "At the same time, Teresa Hussey shouted at him.", "There was nothing to lose now. Seol Jihu stopped thinking and kicked the sky bridge hard to jump. It happened in that exact moment.", "Kwang!", "An explosion suddenly rang out. The shock waves from that explosion swooped down on the youth as he was on the downward arc of his jump. He held Teresa Hussey tightly as his own body drew a parabola, before they crashed and rolled on the floor. Only after they slammed into the edge of the bridge's end did they come to a painful stop.", "“Cough!!”", "Tang, tang, Tang, tang!!", "Seol Jihu coughed, but when he heard the repeated noises of things slamming into a wall, he quickly looked up in a panic. Several flying creatures were stuck in a whitish barrier with cracks running through them.", "“What the hell…..?!” ", "His jaw dropped to the floor. Not in a bad way, mind, but in a good way.", "The middle of the sky bridge had been cut off. Should he say that a big gaping hole suddenly opened up in the middle? The leading pack of the tenaciously-chasing Parasites fell to the black abyss below while the rest quickly took steps back.", "Immediately afterwards, rather pleasing sounds of air being split could be heard, which in turn led to the flying creatures attacking the protective barrier to fall from the air one by one. Swish-! Swish-!! They were the sounds of arrows whistling by.", "Only then did Seol Jihu realize what was going on. He also understood why Kazuki told him to jump.", "'The trap!'", "—Wake up and start running!", "He immediately pushed himself up. Thanks to Mary Rhine's timely barrier, neither he nor the Princess was injured.", "—We'll provide cover fire, so don't stop and run!", "Seol Jihu took a quick glance at the enemies, now looking like dogs chasing a chicken, before picking the Princess up in one go. He then broke past the protective barrier and ran.", "“How many seconds left?”", "—11!", "Although tight, it was doable. Enemies couldn't catch him, and the rest of the road was as straight as an autobahn. A situation several times considerably simpler than back in the Arden valley lay in wait for him.", "Sssshwwing-!!", "The sounds brushing past his ears were indeed quite joyful to hear. He couldn't hear anything else, though. No, he simply concentrated all of his being in running.", "The passage was considerably long at almost 200 meters, but with triple stacking of the Boost, he only needed six seconds to cross it.", "“Haa, haa!”", "When he entered the disused room, five seconds remained.", "He saw Kazuki and Mary Rhine lower their bow and the crucifix respectively. Yasser Rahdi was jumping up and down on his spot with a flushed face, gesturing wildly.", "Four seconds.", "The bookshelf turned 90 degrees was right in front of his nose now. Seol Jihu didn't slow down and simply changed his direction a little bit. Chohong had extended both of her arms out, ready to catch him.", "Three seconds.", "A fleeting smile of relief entered everyone's face. Even Seol Jihu formed a slight grin as if to reply.", "In that moment…", "BLAM-!!", "An abrupt gunshot rang out, and Chohong witnessed it with her own two eyes. She saw the young man carrying Teresa Hussey twist and falter before he was sent crashing to the floor.", "'….What was that?!' ", "Seol Jihu also formed a dumbfounded expression. They were almost there. They had almost succeeded.", "It felt as if his foot was stuck in something. His vision blurred. Everything seemed to go white, then the ceiling filled up his view before everything suddenly crashed into the floor in a mad descent.", "'What the hell happened?' ", "Abruptly, he remembered.", "—Please, do not forget. Be mindful of the unseen sniper.", "Agnes's warning entered his head. His spinning head kissed the floor, his poor forehead the first to bear the brunt of the contact.", "“Ah….” ", "It felt like something somewhere in his body felt 'empty'. The pain rushed at him a single breath later.", "“Argh, ah…” ", "Blood spewed out of his mouth. He curled up like a worm, but still, tried to reach out with his trembling hand.", "As his hand aimlessly wandered in the air, he thought he could hear Chohong cry out like a wild animal. He painfully raised his head up to see.", "She wasn't there.", "There was no one on the altar.", "“….”", "Seol Jihu's dazedly stared at the empty void.", "….At the transfer magic circle where no one stood, with the light already switched off."]}