{"cid": "131", "title": "Chapter 131. Dances With Wolves (2)", "content": ["The room was almost 100~130 square meters in size and was shaped like a roundabout connecting ten roads. Other than that, the only unique thing to note was the rectangular table covered with delicacies at the center of the room, and perhaps that the overhead lighting was very dim.", "The ceiling was covered by a thick darkness that made it invisible to everyone below.", "Click! A click rang out. Subconsciously turning around, Seol Jihu saw the door he entered through merging into the wall.", "Just like that, all ten doors disappeared. In other words, the room had transformed into an enclosed space the moment everyone stepped in.", "As Seol Jihu thought there was a way to escape Stage 3, this change had caught him off guard.", "“So it became a panic room….”", "While everyone was holding their breath and waiting, a relaxed voice broke the silence. When Seol Jihu saw the owner of this voice, his brows furrowed.", "The person sweeping his hair up was none other than the man with the slicked-back hair.", "‘He’s….’", "How could Seol Jihu not know him? He was the bastard who pretended to appease both sides during the first conference, then sacrificed the people from the minority side to escape.", "In a way, he was the first person who lit the fuse for the bomb that was Stage 2.", "“Let’s not just stand around…. Why not take a seat?” Slick Hair spoke as he stared at the table. “They prepared a real banquet for us. Where would our manners be if we didn’t taste these dishes?”", "Did he not remember what he did? Or did he not care?", "Slick Hair glanced left and right before boldly grabbing a seat. Then, two other men sat down next to him. They seemed to be the Slick Hair’s teammates.", "‘So those bastards also had a hand in that incident.’ Seol Jihu muttered inwardly, then checked who else entered Stage 3.", "He surprisingly knew most of them: Oh Rahee who had her usual, apathetic face; Audrey Basler who had bags under her eyes; the intimidating giant who was the white-headband girl’s older brother; and the Priest Kazuki invited….", "‘She’s here too….’", "He also recognized the other two. Although he had never talked to them personally, he remembered them as they participated in conquering the Plaza of Sacrifice 20 times.", "Soon, all ten people gathered around the table. The plentiful delicacies on the table would have made the usual Seol Jihu blind, but he wore a complicated expression instead.", "He was so deep in thought that he didn’t even realize that the robed Priest sat next to him.", "He thought Stage 3 would have clues regarding the secret of the Banquet. The word he saw in the cabin room, Stage 3’s rules, and the ten people that entered Stage 3…. Thinking about how these were related, he began to piece the puzzle together.", "At that moment, Slick Hair opened his mouth.", "“First, we know for sure that this ship is Stage 3.”", "Holding the bottle of wine and swirling it here and there, he uncorked it with a grin. When he tilted the bottle, rose-colored liquid trickled out.", "“Cheers!”", "Bringing the half-filled wine glass up to his mouth, he slowly tilted it backward, as if to celebrate everyone making it to Stage 3.", "“You guys were pretty late.”", "After taking a sip, Slick Hair muttered out.", "“I thought you would arrive much sooner…. I thought I was going to die of boredom waiting in that cabin room.”", "“Must be nice.”", "Oh Rahee smirked while slicing a cut of steak.", "“Thanks to you, everyone has their guard up….”", "Stabbing into the meat with her fork, she gracefully brought it up to her mouth.", "“It was quite troublesome to make it out of there.”", "“Oops, really?”", "As though he was happy that he finally had someone to talk to, Slick Hair snickered.", "“Well, now I’m starting to feel sorry. How did Stage 2 turn out?”", "“I don’t know.” Oh Rahee swallowed the meat in her mouth and continued, “I’m sure they’re doing fine on their own. It’s none of my business anymore, is it?”", "“You mean…. Everyone here is in the same position?”", "Oh Rahee didn’t say anything. She simply picked up a white napkin and lightly tapped her mouth.", "She made it sound like she sacrificed people to pass Stage 2. In other words, she was lying.", "Seol Jihu saw Slick Hair rolling his eyes in secret and controlled his facial expression. He didn’t know why Oh Rahee was trying to get him to misunderstand, but she must have her reasons. He couldn’t give the man a chance to figure out the truth.", "After giving the table one sweeping glance, Slick Hair lowered his head and cackled, “Puhuhuhu.”", "“I was wondering why the air was so~ frigid. Well, don’t resent me too much. Things are normally more difficult for latecomers. You know what they say, the early bird gets the worm.”", "Seeing how he was muttering useless nonsense, he must not feel an ounce of guilt at sacrificing six people. The way he was strutting his chest out, he even looked proud of it.", "“Anyways, where are the other three?”", "While eagerly slicing her steak, Oh Rahee asked casually.", "“Oh~ Those guys?”", "The corner of Slick Hair’s mouth curled up.", "“Well….”", "After looking back and forth at his comrades, he grinned.", "“Who knows?”", "Seeing how the three of them were quietly snickering, it was easy to guess what must have happened.", "“Well, what happened to them isn’t important. What I want to say right now is this.”", "Slick Hair swiftly collected his composure and spoke.", "“Stage 2 is Stage 2, and Stage 3 is Stage 3. I’m saying we should differentiate them. Plus— you guys aren’t all that different from us. The only difference is who came in first. No?”", "He asked while glancing at Oh Rahee, and she shrugged her shoulders.", "“Anyways, now that things turned out this way, let’s all work together. You all got the rules, right?”", "Slick Hair assumed an air of gravity, as if he was bringing up the main subject.", "“Survive from this room….”", "He dragged out the end of his speech as he stealthily rolled his eyes.", "“We are all cooperating, right?”", "Tak. Immediately, a small tap rang out. It was the sound of her knife hitting her plate.", "Oh Rahee spoke as she tapped her knife on the plate.", "“Aren’t you forgetting to mention something?”", "Slick Hair’s eyes widened. Oh Rahee still hadn’t let go of her knife.", "“Don’t pretend like you don’t know. Didn’t you see the word written on the cabin room wall before you left?”", "“…You know, I feel like I’m the only one talking, like I’m taking a loss.”", "“You were the first one to use the method to escape Stage 2. Since you are trying to get ahead in Stage 3 as well, you should put up with this much.”", "“Fine, I’ll reveal it first. The word written on my door was….”", "He licked his lips slightly with his tongue.", "“…Wolf. It said Wolf.”", "Oh Rahee dropped her head slightly.", "“And you? No, why don’t we all take turns saying it?”", "Slick Hair made a suggestion, but Oh Rahee didn’t say a word. She only moved her hands idly with a deeply thinking face. The tapping of her knife slowed down as well.", "‘A wolf?’", "Seol Jihu activated the Nine Eyes, not knowing what was what. And when he turned to Slick Hair to check his color…", "Paat!", "‘!’", "His vision contorted abruptly.", "The space rippled like a softly crumpled paper, then materialized a screen that spread out in front of him.", "‘What…?’", "Seol Jihu’s widened eyes saw a vivid scene. Slick Hair and five others were moving stealthily through the night.", "—Hurry!", "After capturing six people from the minority faction and throwing them into the Plaza of Sacrifice….", "—Good, now….", "They entered the Plaza of the Dissonant Wish, then murdered three of their comrades who returned with their rewards. The scene showed their snickering faces as they looted the dead before disappearing.", "Seol Jihu was startled by the sudden vision, but he wasn’t unfamiliar with it. After all, it felt just like the dream he saw months ago.", "But why did this phenomenon suddenly occur now…?", "Tak. The sound of Oh Rahee’s knife scattered his thoughts.", "“Ah–”", "Oh Rahee slowly tilted her head up.", "“I get it now.”", "Seeing a smile spreading across her emotionless face, Seol Jihu intuitively realized that her reconnaissance had ended.", "Slick Hair must have smelled something fishy, as he glanced at his two comrades.", "“I was wondering why that Baek bitch said that…. How funny. This Stage 3.”", "Her smile grew ominous.", "‘Baek bitch?’", "Speaking of which, during the third Banquet’s Stage 3, there was a woman who had killed everyone except one escapee. Her last name was also Baek.", "And when Seol Jihu remembered the name ‘Baek Haeju’, he went ‘Ah’.", "“It seems a bit different from that time, though.”", "Then, when Oh Rahee lightly grasped her knife–", "Flash!Peuk!", "Light flashed.", "Before Seol Jihu could blink even once, he saw the knife stabbing into Slick Hair’s throat. Everyone except Seol Jihu shot up from their seats and put in some distance.", "It had truly happened in the blink of an eye.", "Seol Jihu couldn’t follow Oh Rahee’s quickdraw, even though he knew it was her specialty.", "In fact, not even the two men sitting next to Slick Hair reacted in time. Oh Rahee’s speed was truly terrifying.", "“You…!”", "One of Slick Hair’s comrades growled a beat later, but he had no other choice than pause in the next moment.", "After letting go of the knife, Oh Rahee had taken out her rapier and brought it up to his neck. The smell of blood flowing out from the blade was dangerous enough to make the growling man’s muscles contract.", "“Stay still, will you? Unless you want to die before him.”", "Oh Rahee showed her true colors. When Slick Hair croaked as he glared with his widened eyes, Oh Rahee smirked.", "“What a joke.”", "“You… you….”", "“That’s enough bullshitting from you.”", "Sneering openly, Oh Rahee suddenly put on a furtive smile.", "“By the way— have you heard of the Mafia Game… no, should I say Lupus in Tabula? Well, this seems like a mix anyway, so whatever.”[1]", "Tap, tap. She nudged the man’s chin with her rapier.", "“What’s important is that this Stage 3 is incredibly similar to the games I just mentioned…. In other words, it’s Paradise’s own rendition.”", "Slick Hair was still glaring at her. His eyes were widened to the point of splitting, but he couldn’t say a word because of the knife in his throat.", "“Ah, you’re wondering why I stabbed you?”", "Having read his thoughts, Oh Rahee showed her unique, unpleasant smile.", "“If you have a brain, use it. You say you’re a Wolf, and what? The rule is to survive? You want everyone to cooperate?”", "“Keuk…!”", "“Fucking retard. Can you make it any more obvious?”", "Oh Rahee snickered.", "“You mean Sheep. A Townsman, if you will.”", "“Kkeuk….”", "“No? Then are you the Rat? Then it shouldn’t be ‘surviving’, but ‘surviving alone.’ That’s the victory condition for the Rat.”", "Slick Hair’s dimming eyes trembled.", "“Well… it doesn’t matter either way. For the record, I’m the Hyena.”", "Oh Rahee seemed to be enjoying the situation.", "“I was confused what that meant at first… but I understood when I saw the victory condition.”", "“Keureuk!”", "“I think it’s the same as the Petty Thief role. In the normal Mafia Game, I only have to make contact with the Mafia, but judging by Stage 3’s rules, it looks like I have to kill you to join the Mafia — the Wolves.”", "“Keurueeek!”", "Slick Hair endured tenaciously, but blood finally spurted out of his mouth. The knife in his throat drooped down.", "After confirming his death, Oh Rahee turned her head as if she was done.", "“Are you guys going to stay still?”", "She was talking to the ones who had jumped back and were watching silently.", "“I don’t know what roles you got, but shouldn’t you make contact with the real Wolf? Before the game ends, that is.”", "“Make contact?”", "The burly man asked.", "“I’m asking you to appeal to him. Show that you’re not his enemy, that you are on his team.”", "“…I don’t get what you’re saying at all, but—”", "The burly man raised his chained scythe.", "“You’re saying those two did bad things and I should kill them.”", "“Simple, right?”", "When Oh Rahee snickered, the two men who were suppressed by her madly shook their hands.", "“W-Wait!”", "Chwaaak! Before they could even finish, a scythe flew forward and stabbed into one man’s face. At the same time, an arrow hit the other man’s head.", "Their bodies collapsed helplessly. They were dead. In an instant, the group of ten had fallen to seven.", "Oh Rahee faced Audrey Basler with a hint of surprise on her face.", "“Kik. So you became a loyal dog after only a few days of training?”", "“….”", "“What were you?”", "“The same thing as you.”", "Audrey Basler retorted unpleasantly, then said.", "“Let me ask you once thing.”", "“?”", "“With your skills, wouldn’t it be easy to turn the table entirely…?”", "When Basler slurred the end of her speech suggestively, Oh Rahee tilted her chin and hummed.", "“Hmm, that would be thrilling as well, but….”", "She glanced at Seol Jihu, who was sitting alone at the table.", "“No. This Stage 3’s answer is already set. You just have to decide.”", "“The answer is already set? I just have to decide?”", "“Yep. This game’s ending is already decided.”", "Looking at the Priest who was standing behind the chair the young man was sitting on, Oh Rahee shook her head.", "“The person who has the combined job of the Doctor and the Guard is on the same team as the Wolf. How are we supposed to win against that?”", "After saying this….", "“Anyways—”", "Oh Rahee’s gaze scanned the remaining members before stopping at the male and female duo.", "“Seeing how the game didn’t end with these three dying….”", "When they met Oh Rahee’s gaze, they quickly waved their hands.", "“N-No! You’re mistaken!”", "“We participated in conquering the Plaza of Sacrifice from beginning to end!”", "Seeing the two protest frantically, Oh Rahee fiddled with the ends of her hair with a pitying look.", "“Save it. Just tell me the words you saw.”", "Hearing this, the duo became speechless. They could only roll their eyes side to side, their lips moving slightly. Almost as if they felt guilty about something.", "“I was going to say this before, but….”", "Audrey Basler, who was watching silently until now, opened her mouth.", "“You guys reek of blood.”", "The man winced, and the woman raised her head in shock.", "“W-What?”", "“You two reek of blood. Who did you kill?”", "“What are you talking about!?”", "The woman shouted with a wronged face.", "“Honestly, I’ve been thinking it was strange. The door also appeared for you guys as soon as you entered Stage 3, right?”", "“That’s right… but what’s strange about that?”", "Audrey Basler snorted.", "“So it was you two. The last ones to enter.”", "The duo still looked confused.", "“B-But it was the same for–”", "“Ah, that was a lie.”", "“Huh?”", "“I waited for quite a while.”", "Hearing this, both Oh Rahee and the burly man nodded.", "“Think about it. The Plaza of the Dissonant Wish opened up permanently. The fact that you stayed without leaving right away meant that you had a reason to stay in Stage 2, no?”", "Finally realizing that they had been led on, the duo’s faces turned white.", "“…D-Do you have evidence?”", "“Evidence? My ability and what you said just now are evidence.”", "“That’s only a suspicion! I’m asking if you have hard evidence!”", "Refusing to accept what was quite obvious by this point, the woman shouted in her agitated state.", "Audrey Basler snorted.", "“Then do you want us to search your bodies? What I’m saying will be true if you two have three or more Dissonant Wishes, right?”", "The woman’s scowling face quickly turned dark.", "“T-That’s!”", "She tried to shout something, but her expression contorted and all she could do was keep her mouth slightly open.", "It was then…", "Koong!", "The table suddenly shook, and the five people, who had been participating in the conversation until now, simultaneously turned their gazes.", "They could see an icy spear placed on the table, emanating a chilling air….", "“….”", "And a young man with his head dropped, slowly putting his hands on the table.", "Seol Jihu, who had been sitting quietly until now, was gradually getting up.", "1. Courtesy of Seraphim. So, for those that are curious and don't understand: Lupus in Tabula (lupus meaning wolf/werewolf) and Mafia are both group games.", "In Lupus in Tabula, you have a group of players, werewolves, whose goal is to \"kill off\" everyone that is not a member of their group. Then, you have the normal people, \"villagers\" who can lynch and \"kill\" one suspect per round (also called day). The game is played in day and night cycles. During the night, the werewolves choose one player to kill off. During the day, the villagers try to guess who the wolf is. Game is over when the number of wolves = number of villagers (wolves and co. win), or when the villagers kill all the wolves (villagers and co win). There are special roles, but I will only explain the ones mentioned. Hamster: They cannot be killed by wolves, but can be killed by villagers. Technically a were-hamster. Their win condition is to have everyone else die. Guard: They can choose to protect one person per round from being lynched by the villagers. To explain that: If they want, they can protect the same person over and over. So, if they choose to protect the wolf, the wolf cannot be killed.", "Mafia: Much the same, but slightly different roles. I'll only explain the ones that appear in this so far.Mafia: Equivalent of the wolves in this game.Innocents: The villagersDoctor: They can protect someone from being killed by the mafia. Can choose themselves.The hyena: Technically, called the \"lycan\" hint hint. They can be innocents (villagers) during the day, but help the mafia at night. They are counted as mafia if they get lynched.", "So, to explain Rahee's comment about the game being decided from the get-go, the priest is the doctor and the guard. They are innocent, so they can't be lynched by the villagers. She is also on MC's (the wolf/mafia's) side, and therefore he won't choose to \"kill\" her. She is therefore invincible.", "Now, since she is invincible, she doesn't have to use her ability on herself. She can use it on MC. So, Rahee knows who the wolf is, but can't kill him because of the guard abilities. Therefore, according to the rules of the game, it is a matter of time until MC is able to \"kill\" everyone else. Therefore, she deduces that the best option is to join the MC's team, and kill all the innocents/villagers/others."]}