{"cid": "410", "title": "Chapter 410. Omen (1)", "content": ["[Through a series of events, you have obtained a written oath from the leading organizations of Paradise.]", "[You have also identified and removed some of the traitors in Paradise.]", "[In addition, you helped the royal family gain the authority to manage the settings of Earthlings.]", "[I acknowledge that you have used the above three methods to forcefully change the Earthlings to some extent.]", "Gula’s voice paused for a moment.", "[…However.]", "The voice continued with a sigh.", "[Those who have changed are only a fraction of the total.]", "[Humanity still bears a grave problem.]", "[Because it has a problem, it isn’t perfect. Because it isn’t perfect, the change isn’t complete.]", "[Therefore, you have yet to pass the trial to become my apostle.]", "Her words were like a death sentence to him.", "Seol Jihu shut his eyes.", "He had hoped his premonition would prove false.", "But Gula’s declaration just now only proved him right.", "What drove him even more crazy was that he had no idea what went wrong.", "‘So… What more do I need to do?’", "[…]", "‘How close am I to the problem?’", "[…]", "There was no response from Gula. But Seol Jihu didn’t mind, because he had never expected one from the start.", "Because of the principle of causality, the Seven Sins were unable to interfere freely in this world where the Parasite Queen had become the Chief Deity.", "If Gula suggested a way to solve the existing problem, the Parasites would gain something in return for it.", "Just like how the Parasites’ invasion of Paradise caused Earthlings to be summoned and the Fallen Angels to emerge.", "‘Such an annoying law,’ Seol Jihu thought to himself.", "[You were close in terms of physical distance.]", "This was the best she could tell him.", "Physical distance.", "Seol Jihu let out a chuckle.", "So it could have been one of the thousands of people he had passed on the street.", "[I’m sorry.]", "Seol Jihu shook his head.", "He knew Gula wasn’t doing this on purpose.", "He could only blame the former Chief Deity for getting devoured by the invaders.", "‘…I understand.’", "Seol Jihu bowed and then left with Little Chick.", "*", "“Hey, Bouncy.”", "Seol Jihu spoke to Little Chick as he walked out of Gula’s Temple.", "“When do you think you’ll be able to unlock the Spear of Purity to its fourth stage?”", "Little Chick, who was standing on Seol Jihu’s shoulder picking at his down, glanced sideways.", "“I don’t know….”", "It crossed its wings and tilted its head.", "“First tell me why you suddenly brought this up. I thought you haven’t been paying much attention to it lately.”", "“I think I might need it soon.”", "“Need it….”", "Little Chick tilted its head and smacked its beak.", "“I’m not sure.”", "“?”", "“As you know, I’m a Spirit born under the protection of Castitas, one of the Seven Virtues. As a pursuer of everything good and orderly… Judging from your recent moves, I can’t help but hesitate.”", "“…”", "“In regards to the current situation, do you consider yourself good and lawful?”", "“No. Not at all.”", "Seol Jihu immediately shook his head.", "Him, good and lawful? That was enough to make a cat laugh.", "“I’m glad if that’s what you really think. Anyway, in my opinion, you’re hardly neutral. If I had to be completely honest, I’d say you lean towards chaotic evil.”", "Little Chick continued.", "“To control evil by evil. Considering the situation in Paradise, which is dominated by the Seven Sins, I guess that could be a valid method. So I’m going to wait before I make up my mind.”", "“Until when?”", "“Until I see for myself the consequences of your actions and the changes they bring.”", "It was rare for him to present such accurate standards.", "Seol Jihu was surprised.", "In the past, whenever Seol Jihu brought up this topic, Little Chick used to get angry, saying he was expecting more than he deserved. So why the sudden change?", "“I see your standards have become quite generous. Wasn’t ability also an important factor in the evaluation?”", "“Well, that’s….”", "One of Little Chick’s eyes slowly widened.", "“In terms of ability, you could probably breeze through two stages right now.”", "“Really?”", "“You’ve suffered enough on the Path of the Soul and cultivated yourself with a discipline that befits the fourth and fifth stage. So I’m not worried about your skills.”", "Little Chick snorted.", "“The truth is, when I saw you for the first time after you passed the trial, I debated with myself over whether or not to unlock the fourth stage. I’m sure you won’t let the Spear of Purity shake you now.”", "In short, his ability was sufficient, but his character left much to be debated.", "Seol Jihu nodded. Somehow he felt better knowing that.", "That’s right. He couldn’t just sit idly by and watch everything he’d built up so far go to waste.", "The goal was clear. All he had to do now was try his best to achieve that goal.", "He swore to himself to break all the traps the enemy had laid out, as he had done so far.", "Slap!", "Seol Jihu slapped himself to snap out of it.", "“Alright. Let’s go.”", "Full of determination, he began to descend the stairs.", "*", "After the meeting with Sinyoung, everything happened in a flash.", "When the best organization finally succumbed, others rushed to cooperate with Valhalla.", "Odor and Haramark were the first cities to accept Valhalla’s terms and open their borders to the Federation.", "Their quick response prompted representative organizations in other cities to take action as well.", "Caligo’s PAX and Grazia’s Wu Lei, the Star of Wrath, visited Eva to talk to Valhalla, although the latter wasn’t directly related to the attack incident.", "The royal families of each city had no reason to resist the change.", "One of the conditions requested by the Federation was the authority to supervise the settings of Earthlings, which, if accepted, would give the royal families enormous power.", "So all the royal families, except Scheherazade’s, used the Royal Oath and began preparing to welcome the immigrants.", "Everything was going smoothly.", "Except for one thing.", "Sinyoung had been faithfully implementing the terms of the contract, delivering signed oaths and withdrawing its branches from other cities, but made a small mistake regarding Jung Minjong’s extradition.", "Sinyoung first removed Jung Minjong from his post and then summoned him to Paradise, but he refused to comply.", "So they tried to transfer him by force when the police suddenly rushed in and took him away.", "It turned out that he had asked one of his acquaintances to report him missing.", "Usually, it took time for the investigation to begin after the initial report, but the way the police intervened almost immediately made Seol Jihu think it was a premeditated scheme on part of Jung Minjong.", "Yun Seohui informed Seol Jihu that Sinyoung was contacting the police and asked for his understanding.", "Other than that, everything was under easy sail.", "‘It’s lively.’", "Seol Jihu stood on the rooftop of Valhalla’s building and looked down at the city.", "He saw a few Earthlings provide beer and towels to the Dwarves busy repairing the castle wall. In the middle of the main road, there was a Cave Fairy’s shop bustling with Earthling customers looking at displayed items or bargaining prices with the shop owner.", "Wherever his gaze landed, the Federation and humanity had mingled together.", "Eva was flourishing more than ever.", "Seol Jihu smiled as he watched the little fuzzballs out on the street wagging their tails at passersby awarding them with treats.", "*", "The next day, Seol Jihu opened his eyes at the crack of dawn.", "Today was the day he had decided he would return to Earth.", "He hadn’t been home for a long time because of everything that was going on in Paradise.", "His mother and brother must be worried sick.", "His plan was to contact them and meet with them as soon as he returned, then stay on Earth for a day or two to for a change of pace.", "Seol Jihu walked down the stairs to the first floor and stopped.", "Kim Hannah stood by the entrance, looking at him.", "She seemed to have been waiting for him.", "“What’s going on? It’s still early.”", "“You said you were going to Earth today.”", "“Yeah, that’s what I said a few days ago.”", "“There’s something I want to warn you about before you leave. Also, I have a question for you….”", "Seol Jihu blinked in mild confusion.", "The Kim Hannah he knew wouldn’t try to ambush him with a sudden question. She would have just asked him straight up.", "So it seemed that she had stayed up all night wondering whether to ask him this question or not.", "“What is it?”", "“What’s your relationship with Yun Seohui?”", "That came out of nowhere.", "Seol Jihu frowned.", "“Relationship? What do you mean?”", "“Have you ever met or contacted her without my knowledge since you met at the cafe?”", "This confused him even more.", "“No, not even once. I only met with Miss Yun Seora.”", "Seol Jihu shook his head.", "He felt slightly offended because her question seemed to accuse him of secretly dating Yun Seohui.", "“Why do you ask?”", "“You see, I just don’t understand why she acted as she did….”", "“You mean the attack?”", "“No, the meeting.”", "Kim Hannah began with a sigh.", "“Do you remember what Yun Seohui said at the meeting? Her address, I mean.”", "“Address?”", "“You’re the Representative of Valhalla and Yun Seohui is the Representative of Sinyoung. And that meeting wasn’t a personal meeting, it was an official meeting between the two representatives, attended by the members of each organization.”", "She was right.", "“But Yun Seohui, she…. How should I say this? It’s like she spoke to you, not to all of Valhalla, as herself and not as Sinyoung’s Representative.”", "“But she apologized to everyone at the end….”", "“That was after everything was over. Think about it carefully.”", "Seol Jihu searched through his memories.", "[We—I don’t hate Valhalla.]", "[If I really thought badly of you….]", "[I admired you, Representative of Valhalla, for all the incredible achievements you made for the sake of Paradise. I wanted to become your friend and help you in any way I could.]", "[I apologize for the distress and the hurt the recent series of incidents have caused you, Representative of Valhalla.]", "[And I promise in the name of God Invidia to faithfully fulfill the conditions set by Valhalla until your misunderstanding is resolved.]", "It did sound a little strange now that he thought about it.", "She had emphasized herself when she should have spoken for Sinyoung, and Seol Jihu when she should have mentioned Valhalla as a whole.", "It might be nothing, but he couldn’t help but suspect it was on purpose because Yun Seohui was the one who made these remarks.", "“There’s no way she could have made such a mistake. I just think it’s weird….”", "Kim Hannah clicked her tongue and then nodded her head.", "“Anyway, thanks for answering my question. Be careful on Earth. We’ve done everything we can, but who knows?”", "Seol Jihu nodded quietly.", "“…See you later.”", "With that, he left the building.", "Once he arrived at the temple, Seol Jihu stood in front of the warp gate.", "He hesitated for a moment before taking out the tiny piece of paper he had received from a priest.", "He clenched the paper in his fist so that he could tear it right away when needed.", "After a moment of silence, Seol Jihu took a deep breath and buried himself slowly into the portal.", "*", "FLASH! Light exploded.", "As soon as the scenery changed, Seol Jihu ducked his head in a hurry.", "Tightening the grip of his hand holding the paper, he rolled across the floor and looked around busily.", "But nothing happened, and no one was nearby.", "“…”", "Seol Jihu got up from the floor with a cough.", "‘That was new.’", "He felt a little humiliated, but he only had one life.", "Only after he kicked open the closet door and peeped into the bathroom with his back against the wall was he finally able to relax.", "“Let’s see…. What the…? Why do I have so many unread texts?”", "Seol Jihu was shocked when he turned on his cell phone.", "There were at least a dozen missed calls and text messages.", "The most recent calls were from his mother and brother.", "In total, there were 12 records left.", "‘Uk. I guess I’ve been gone for too long.’", "He wouldn’t be surprised if they reported him missing.", "Nervously, Seol Jihu clicked on the call button.", "He heard the dial tone, but his mother didn’t pick up.", "The same thing happened with his brother.", "He tried calling them again, but the calls went straight to the automated message announcing that they were unavailable.", "‘They’re probably working right now….’", "Seol Jihu decided to wait a little longer and looked around the room.", "He didn't know what to do, so he turned on the TV and browsed the texts.", "—There was a shooting in downtown Seoul last night. A police officer and a civilian were injured in the process of arresting the suspect. This is reporter Park Johyun.", "‘A shooting? In Korea?’", "Curious, Seol Jihu was about to raise his head but stopped.", "As he had expected, most of the text messages came from Yun Seora.", "[Oppa~ This is Seora. How are you?]", "[You said we should meet up. When can we meet?]", "[Can you give me a call if you get this message?]", "[I heard the news. Unni is resigning…. Thank you. I’ll do my best to help you from now on.]", "[By the way, what are you going to do to Seohui Unni?]", "Seol Jihu gave a light chuckle as he read the text messages one by one.", "“I don’t know~ What should I do?”", "He muttered to himself and tapped on the arrow icon.", "They had promised to hang out a long time ago, but their meeting had yet to take place.", "‘Should I reply?’", "He thought for a moment but decided to read the rest of the messages first. There could be one from his mother or his brother, after all.", "As Seol Jihu slowly browsed through the text messages, his thumb suddenly stopped.", "There were quite a lot of texts from a number he had never seen before in his life, almost as many as Yun Seora’s texts.", "‘Who is this?’", "Led by curiosity, he tapped on one of them.", "[Jihu Oppa. This is Seora.]", "Seol Jihu’s face immediately stiffened.", "[Ignore all the calls and texts from my old number. Even if that number pretends to be me, you shouldn’t trust it.]", "[This number belongs to someone I know and trust. From now on, I’ll only contact you with this number.]", "[Oppa. If you get this text, return to that place immediately. Don’t call this number or my old number, just to be safe.]", "[I know it’s confusing, but please do as I say. I was going to explain it beforehand, but I couldn’t get in touch with you. I’ll tell you everything later.]", "[Don’t worry about Earth. I’ll think of something. Hurry up and leave, Oppa….]", "After Seol Jihu read the last message, he immediately scrolled up through the texts.", "He reread the texts from Yun Seora’s original number.", "Seol Jihu’s face began to tremble as he compared the messages from the two numbers.", "‘What the hell…?’", "He suddenly felt goosebumps all over his body.", "Who was he supposed to trust?", "It was then.", "Buzz! Buzz!", "His cell phone began to vibrate violently."]}