{"cid": "132", "title": "Chapter 132. The Whole Story", "content": ["When the duo met the young man’s bleak eyes under the shades of his hair, they froze stiff.", "Kiiiik–!", "A screeching sound of metal rang out. Seol Jihu let his spear drag on the ground as he walked one step at a time.", "The duo’s faces turned pale. They started stepping backwards as if they had seen a grim reaper, but their backs soon struck the wall.", "They turned around in fright, but they couldn’t see a place to escape to.", "“W-Why….”", "Their eyes had moistened up with tears as they asked why he was staring at them like that. However, not only did Seol Jihu’s complexion not change….", "“You sons of bitches….”", "But his growling voice trembled with rage. His glaring eyes were bloodshot, and his veins were bulging out of his forearms.", "That was how enraged Seol Jihu was.", "Because he had seen it.", "Because when he saw them through his Nine Eyes, another vision had spread out before his eyes.", "He saw the duo murdering Lara Wolff in the grass field, stealing her Dissonant Wish, and escaping.", "Of course, he couldn’t believe the sudden vision unquestioningly, but Audrey Basler had testified and had even led them into confessing. After all, if they really were innocent, they wouldn’t have refused the body search.", "In other words, they must have done something once the Alliance team left. After all, it wasn’t as if there weren’t any people remaining on the grass field until then.", "Seol Jihu had done his best to turn the Banquet into a real banquet, yet not only did these two ruin everything, but they also killed Lara Wolff, who was begging for her life.", "This was the biggest reason Seol Jihu was angry.", "“Why did you kill her?”", "A slightly hoarse voice rang out.", "“H-Huh?”", "The trembling woman asked in a stutter.", "“Lara Wolff… the bob cut Archer.”", "“Bob cut Archer… a woman?”", "Seol Jihu took in a deep breath.", "“Why did you kill them?”", "“We didn’t!”", "“It’s a misunderstanding!”", "The man also shouted desperately. Regardless, when the young man raised his spear, the man and the woman jumped in surprise.", "“Please! We really didn’t kill her!”", "“Bob cut Archer? We never even saw her!”", "Seol Jihu’s arm paused, and seeing him hesitate, the man calmly tried to deny it.", "“I think you’re seriously mistaken about something….”", "But when he saw Seol Jihu swing his spear again, he hurriedly shouted.", "“Wait, wait! The person we killed wasn’t a woman, but a manpp..!!”", "The woman quickly blocked the man’s mouth. However, it was too late.", "“?”", "Seol Jihu furrowed his brows.", "“Not a woman, but a man?”", "Realizing his slip of the tongue, the man’s expression devolved into despair.", "‘But the one I saw in my vision was Lara Wolff….’", "“You idiot!”", "The woman shouted in anger before pursing her lips and “Ptui!” unexpectedly spitting out a small thorn.", "Although she was extremely close to Seol Jihu, she failed to achieve what she wanted. It was because of the small, white disks floating around Seol Jihu.", "‘So they did kill someone.’", "Glaring at them fixedly, Seol Jihu swung his arm without hesitation.", "Chwak!", "The woman’s frail neck was easily sliced off, and her head flew up into the air.", "The headless body shook before collapsing helplessly. The man screamed and plopped down on his butt.", "After seeing the woman’s convulsing body, he looked up with teary eyes.", "“Spa….”", "“….”", "“Spare me….”", "Seol Jihu looked down with cold eyes and calmly asked.", "“Why did you kill him?”", "“Spare….”", "“WHY DID YOU KILL HIM!?”", "“U, UAAAAAAH!”", "When Seol Jihu shouted, a scream erupted. The man ran forward with his dagger in hand, but Seol Jihu’s spear instantly stabbed his chest and skewered him onto the wall.", "His body wriggled like chopped-off octopus legs, then sagged down.", "“….”", "That was his first murder.", "He didn’t feel like he killed game characters.", "The sensation of slicing soft flesh, the sensation of cutting hard bones, the beating heart and organs… he felt everything clearly.", "But that was it. His eyes didn’t shake, and neither did his hands. He calmly pulled out his spear and gathered his roughened breath.", "There were now five people remaining.", "Half had died, but the room was silent. Not a single change could be spotted. It meant that the game had yet to end.", "After looking up at the ceiling for a moment, Seol Jihu slowly turned back. Oh Rahee was watching him silently, but her throat drew a small up-and-down movement.", "‘Is this… really him…?’", "She couldn’t help but think this. Because, while carefully scanning the remaining members, Seol Jihu’s eyes were gleaming with a crimson light akin to the pupils of a beast.", "Just like when ‘Future Vision’ activated.", "A chilling gaze reached her.", "‘How scary.’", "Oh Rahee was convinced that she made the right choice.", "Turning her blade on Slick Hair and his comrades had been the correct answer. If Seol Jihu aimed for her too, although she had no intention of being killed so easily… she had a strong, unfounded hunch that she would lose if she fought now.", "Oh Rahee returned her rapier to her scabbard and raised both of her hands.", "“It’s not me.”", "She muttered quietly.", "“I’m on your team. You know that, right?”", "She smiled with her eyes. After staring at her for a moment, Seol Jihu moved his gaze.", "“Why look at me?”", "A blunt voice shot out.", "“I shut up and remained silent just like you wanted. I even entered the Plaza of the Dissonant Wish before you. You should know that I am innocent better than anyone else.”", "Audrey Basler murmured with narrowed eyes.", "Seol Jihu moved his gaze to the next person. When his eyes landed on the burly man, his brows wriggled.", "Paat!", "Vision. It was another vision.", "The scene didn’t take place in Stage 2, but in Stage 1. The burly man ran wildly inside a room and murdered seven people mercilessly. He seemed to be enjoying cutting their flesh into pieces very much, almost as if he felt ecstasy from murder.", "Seeing Seol Jihu’s expression, Oh Rahee crossed her arms.", "“You. What’s your class?”", "Chareureuk! Rather than an answer, the sound of chains rang out. The burly man must have smelled something fishy as he raised his scythe.", "“Why are you trying to kill me?”", "Hearing him ask as if he couldn’t understand, Seol Jihu opened his mouth.", "“In Stage 1….”", "He remembered how the burly man walked up the staircase alone, plastered in blood.", "“Why did you climb up alone?”", "It wasn’t until considerable time passed that the burly man standing alert answered.", "“I had a reason to kill them.”", "“A reason to kill them?”", "“That’s it.”", "“So you killed all seven of them?”", "The burly man’s expression changed for the first time.", "“What do you mean? I only killed six of them.”", "‘What?’", "Seol Jihu’s eyes narrowed.", "“Six of them joined hands and tried to scheme against me first. I only responded to their threat.”", "“But when you climbed up to the mountaintop….”", "“If you’re talking about the staircase part of Stage 1, I climbed it from the second floor. The one who came out with me died in the middle to a monster attack. He died because he lacked skill. What am I supposed to do about that?”", "What was going on? If he was telling the truth, it meant the vision was wrong again.", "It didn’t look like he was lying.", "Seol Jihu pressed his forehead.", "[Wait, wait! The person we killed wasn’t a woman, but a manpp..!!]", "He was reminded of the words the man shouted before he became a cold corpse.", "[Hurry up and take him!]", "He was reminded of how the burly man saved him twice during the fight against the Orc Champion.", "[Oppa got hurt trying to save me….]", "And he was reminded of the sobbing white headband girl.", "Seol Jihu slowly closed his eyes.", "“Are you going to kill me?”", "As the atmosphere began to turn for the worse, Seol Jihu tightened his grasp on his spear. Then….", "“…Damn it.”", "He muttered shortly before opening the hand that was clutching tight enough to make his fingernails dig into the skin.", "Tang!", "The Ice Spear made a small ringing noise.", "“I will stop here.”", "Seol Jihu tilted his head up and spoke into the empty darkness.", "“I’ll stop here, god dammit! I’m ending it here!”", "Seol Jihu raised his voice and looked around with a complicated expression. Soon, his eyes widened.", "The four people who were standing upright all fell over one by one.", "Oh Rahee and Audrey Basler fell, the burly man dropped his scythe and collapsed, and even the Priest Kazuki invited lost her consciousness.", "Then–", "[What a lame ending!]", "A somewhat angry voice resounded in his ears.", "Seol Jihu, who was looking around hastily, froze stiff.", "[You were doing so well, yet you give up with just one decision left to make?]", "A groan escaped his mouth due to the overwhelming pressure pressing down on his body. It wasn’t an unfamiliar sensation. To be precise, he had felt it once before - back in the Neutral Zone’s Chamber of Awakening.", "[Come on, we gave you so much support so you could do well. So why did you make that decision at the end?]", "This thunderous, dominating voice had to be Ira, the God of Wrath.", "‘The Seven Gods!’", "The Seven Gods of Paradise had appeared in this place.", "Right, looking back, there were more than one or two suspicious points.", "Everyone else was separated from their team during Stage 1, but only Seol Jihu entered with Maria; almost as if she was the minimal safety measure.", "It was the same in Stage 2. Seol Jihu was thinking that it was suspicious that the robed Priest focused on protecting just him.", "The result of the exchange felt like an outside force had interfered, and Seol Jihu periodically thought that the Banquet was similar to the Neutral Zone.", "Until now, he was only suspicious.", "But with the appearance of the Seven Gods, he felt as if he got backstabbed.", "[Backstabbed?]", "An ‘envious’ voice…", "[Come on~ You’re really going to be like that?]", "And a ‘prideful’ voice rang out.", "[During Stage 1, we gave you the special treatment of having a comrade accompany you, and just to be safe, we even allowed the Daughter of Luxuria to guard you. We will be disappointed if you really think that way.]", "Seol Jihu clenched his teeth. Even opening his mouth became difficult, and he could only glare at the air with mixed feelings.", "[What was that? Why do we host the Banquet and make people kill each other?]", "Ira snorted, seemingly having read his mind.", "[Are you asking because you really don’t know the answer? You. What do you think is the reason we summoned Earthlings to this world?]", "Seol Jihu’s expression stiffened.", "The reason was simple — to save this world which was on the crossroads of ruin.", "And Earthlings received rewards in exchange.", "[It was fine at first, but it became more and more ridiculous as time went by.]", "[Focusing on dealing with the Parasites would have been difficult enough, but they were blinded by the profits in front of them, fighting and killing each other.]", "[They even rose in revolt because they didn’t like what they were summoned to do, attacking and enslaving Paradisians.]", "[Evil…. Evil….]", "Several voices rang out at once.", "[It’s the same with the Banquet.]", "Ira growled.", "[At first, its purpose was to help Earthlings who couldn’t become High Rankers, and also to give the courageous, talented ones a chance to grow.]", "‘But!’", "[Ridiculous! Was the trial we gave impossibly difficult? Do you really think so even though you cleared Stage 2 with 110 people?]", "Having read Seol Jihu’s thoughts, Ira seized the initiative. Seol Jihu became speechless and stopped thinking.", "[Well, I admit that the conditions of the Stage were shitty. Because we made them that way on purpose.]", "Ira snickered.", "[We had no other choice. Don’t tell me you actually thought we would stay put and let the Earthlings’ behavior continue?]", "Seol Jihu bit his lips.", "1. First BanquetStage 3 Survivors: 8 / Escapees: 2 / Deaths: 0Special Note: One of the survivors, Phil Kanoo (Cameroon), announces receiving ‘+4 Rampaging Fierce Longsword’ as Stage 3 reward.", "2. Second BanquetStage 3 Survivors: 5 / Escapees: 4 / Deaths: 1Special Note: One of the survivors, Damv Nyam (Jamaica), advances to Level 5 immediately after the Banquet.", "3. Third BanquetStage 3 Survivors: 1 / Escapees: 1 / Deaths: 8Special Note: The sole survivor, Baek Haeju (Korea), kills everyone other than the sole escapee. She declared, “Stage 3 wasn’t a cooperative mission, but a battle royale.”", "4. Fourth BanquetStage 3 Survivors: 0 / Escapees: 0 / Deaths: 10Special Note: During Stage 2, a catastrophe occurs, in which participants kill each other unconditionally. Nothing about Stage 3 has been confirmed, but seeing that no one made it back….", "He couldn’t understand why the number of deaths had suddenly increased starting from the third Banquet. Now, he understood.", "Similar to how the Earthlings changed, the Banquet had lost its initial purpose and changed. To sift and filter humans who went against the will of Paradise in Stage 1 and 2, and…", "[Humans who incite disorder are not needed in Paradise.]", "Just like Ira said, to execute them in Stage 3.", "The word Seol Jihu saw on the wall was ‘Wolf’.", "The victory condition he was given was ‘determine the life and death of every participant other than the Priest.’", "In other words, Seol Jihu had been chosen as ‘the executioner’ of the fifth Banquet.", "[If you understand, kill him.]", "Ira’s voice pierced his ears as if this had to be done.", "[Didn’t you see? He could have resolved the matter with words, but he killed them all just because he was dissatisfied.]", "The burly man was lying on the ground, helpless.", "As things were, killing him would be easy.", "[You just have to kill him.]", "Whisper, whisper.", "[It’s not like we are telling you to kill just anyone. And once you kill him, this tiring Banquet will end.]", "Hearing a whisper laced with ‘avarice’, Seol Jihu frowned.", "[You don’t want to?]", "Just as Ira was breaking out in irritation and rage….", "[Isn’t it okay?]", "A strange ringing cut her off.", "Just hearing this sensuous voice evoked a reaction from his genitals.", "[I am interested in this child. I would like to hear him out.]", "[No need! Don’t you know what he is thinking?]", "[I have read it. This child has a neutral attitude of wanting to lead both righteous and evil people. That is what makes him so special.]", "[Ha!]", "A groan burst out. Luxuria continued without caring one bit.", "[There were many humans who had horrible personalities but were too good to kill off. We are not in a position to be picky now, are we?]", "[Even so, what this kid has done doesn’t reflect it!]", "A hand touched Seol Jihu’s head. His head automatically turned around…", "[If he really thought that way…]", "And his gaze fell on the corpses of the man and woman duo lying in front of the wall.", "[He shouldn’t have killed those two either, no?]", "Seol Jihu closed his eyes. This was something he had thought about several times during the Banquet.", "And he had already come up with the answer.", "Just like Prihi said, everyone had ‘a limit to their vessel’. When those two had ruined the Banquet that Seol Jihu worked hard to correct, they crossed the line.", "That was why he killed them.", "But the burly man was different. Rather than trying to ruin the Banquet, he participated in it earnestly.", "Plus, it wasn’t as if he was verbally rude. If he had at the very least done this, Seol Jihu would have had a reason to do something. But the burly man hadn’t done anything to him.", "An outsider might call Seol Jihu out for having no backbone, but that was really how he felt.", "[If that is the reason, then what about those two? Although we brought them here because of what they did in the end, it isn’t like they did anything to harm you directly.]", "‘….’", "[Why don’t you just admit it? It is that girl you are mindful of. Because she helped you, you are hesitant.]", "No, that was wrong.", "Slick Hair committed an act that was clearly wrong.", "Although he didn’t personally see what the nameless male-female duo did, it was revealed thanks to Audrey Basler.", "But he couldn’t be sure about the burly man. Because he didn’t have proof that what he saw in his vision was true, he didn’t want to kill him blindly.", "[Why do you think that?]", "Seol Jihu thought that the future of Paradise would flow as he had seen in his dream. He thought so when Kim Hannah came to find him just like he had experienced in his dream.", "But his thoughts changed during his stay in Paradise.", "Seol Jihu wasn’t a Red Mark and he certainly did toil like a slave. The future had changed.", "He suddenly had this thought.", "What if the vision the Seven Gods showed him didn’t include this change? To be a bit more precise, what if the vision only indicated that it had occurred in the past? What if it was simply a part of ‘Future Vision’?", "[Hoh….]", "In that case, the man confessing that he ‘killed a man and not Lara Wolff’ made sense. The same went for the incongruity between what the burly man said and what his vision showed.", "Because he being here must have changed the future somehow.", "[Oh yeah?]", "Seol Jihu flinched. This was because Ira’s voice suddenly sounded closer.", "[So you figured it out. You must be quite proud of yourself….]", "Fufufufu. A low laughter flowed out.", "[Those two…. Right, they didn’t kill Lara Wolff.]", "[But at the end of the day, they still killed someone. Do you still think the future changed?]", "Another voice rang out.", "[All humans are born with their own Star of Fate.]", "Star of Fate? With a cough, Seol Jihu shook his head.", "[The movement of this star rea~lly doesn’t change easily. No matter how much it is disturbed, it continues to advance toward its predetermined fate.]", "[In exchange for Lara Wolff surviving, someone else died. That is the result of a Star of Fate that has broken away from its course trying to return to its original path. This is the reason that the future can’t be changed so easily.]", "These final words lingered in Seol Jihu’s head.", "[We are not killing Earthlings because we hate them or because we are bored. It is because killing them is much more certain than a half-baked attempt at a change.]", "Seol Jihu’s head automatically turned again.", "[He is no different.]", "His gaze landed on the burly man still collapsed on the floor.", "[Just like there are Stars born with the fate of becoming an Executor, there are stars that stand in their opposition.]", "Seol Jihu swallowed hard.", "[Do you still not get it? Then I will tell you. That human is a demon born with the spirit of the Heaven-Slaughtering Star.]", "[It is a vicious fate. He will kill thousands in the future at the very least. Imagine your comrades being included in that number.]", "Seol Jihu’s sweat-carrying, half-closed eyes opened.", "[So? We told you this much. Isn’t that enough justification?]", "Seol Jihu stared at the burly man as he panted. Then, he shook his head.", "[No?]", "Seol Jihu didn’t think he was wrong, at least in the present. The burly man had only responded to others’ aggression and did not kill all seven of them.", "He had not crossed the line.", "No matter how small it might be, a change was a change.", "[What…. He is the Heaven-Slaughtering Star!]", "What Ira was saying might be correct, but that was still a future that hadn’t come yet.", "[Hah?]", "The Golden Rule said so. That every effect followed a cause.", "The same words could be applied when talking about the future. At the current moment, Seol Jihu couldn’t rashly decide whether that burly man was the so-called Heaven-Slaughtering Star.", "If it was true that Seol Jihu himself killed thousands of people when he lived in Paradise as a Red Mark slave, then there was surely a reason for that as well.", "In that case, he simply had to alter the cause that would result in the Heaven-Slaughtering Star.", "Whether that be erasing it or changing it, as long as the cause changed, the effect would certainly change as well.", "When Seol Jihu’s thoughts reached this point….", "[Hohohoho, huhuhuhu!]", "[Ahahaha!]", "[Hehehe!]", "[Puhahahahehehe!]", "[Kik… kik….]", "The gods suddenly burst into laughter. There were two gods who didn’t laugh.", "Under the flurry of laughter that resounded his eardrums, Seol Jihu couldn’t help but wonder.", "‘Why are they laughing?’", "He thought he could do it. That he could achieve it.", "[Huu, huu. It is like they say! Courage and bravado are only a paper’s width apart!]", "As if she found what he said absurdly funny, Ira’s voice was much rougher than before.", "[Hoh…. He really thinks he can do it.]", "[Wow. How much of an idealistic world is this child hoping for? It really makes my heart beat~]", "[It is nothing to be surprised about. He has no idea what he even said.]", "[Fufu, he reminds me of the Martial God who saw and regretted being unable to reach one of the branches of the World Tree’s future.]", "[Something… that even he couldn’t achieve…. This boy wants to… achieve that…?]", "At that moment–", "[I believe it is possible.]", "Luxuria’s voice spread out soothingly.", "Suffering from all sorts of emotions, Seol Jihu fell to his knees at last. He could feel his body becoming more and more fatigued due to the prolonged meeting with the gods.", "[The Banquet had fallen into depravity, yet this child managed to return it to a true banquet. Also, he has already succeeded in changing one person’s color.]", "Seol Jihu could feel a gentle hand stroking his head. It seemed to be sympathizing with him.", "[So I think we can give him a chance. It isn’t as if we don’t have time.]", "[Chance, you say!?]", "[Stop.]", "A languid voice stopped the ire of a certain god.", "Gula had stepped in.", "[Let us stop here. We have manifested in this place for too long. We are not in our temples, our territories. Any more and this child will not be able to handle it.]", "[You mean to let the Heaven-Slaughtering Star go!?]", "[There is no other choice. We are the one who gave this child the right to end Stage 3. He made his decision from his own will. The Banquet should have ended at that point.]", "Silence descended in the room.", "If anything, it was true that Seol Jihu was exhausted to the limit. Just being in the Chamber of Awakening for a moment had drained him of his energy. But here, he had been facing them far longer than last time.", "If he stayed any longer, his life would be at risk.", "[No, not yet.]", "Ira refused.", "[I will not tolerate you playing with my child as you please.]", "Gula’s voice also carried a hint of wrath.", "[Fine. We can go back. But since the Banquet ended, should we not give him what he deserves?]", "[?]", "[I’m talking about the ‘Harmonious Wish’.]", "This time, Gula fell silent.", "[Let us see. This kid’s wish….]", "Seol Jihu raised his head as his consciousness began to fade away. Although he still couldn’t see anything, he felt seven pairs of eyes gazing down on him fixedly.", "[Reconciliation with his family…. Difficult. Harmonization of the mind, technique, and body…. We gave him a Competence but he traded it away. Then….]", "[We shall bestow him another Competence.]", "Gula quickly interjected. However—", "[No, how could we? We must bestow a reward befitting of Stage 3’s name. Don’t you agree?]", "Ira refused immediately before speaking quietly.", "[Nine Eyes. We shall go with that.]", "[Preposterous.]", "Gula cut in as if she expected Ira to say this.", "[This child is not ready yet. We should wait until he is at least a High Ranker.]", "[That is your greed. You are being overprotective.]", "Ira snorted.", "[Do not refuse this. If you think we should respect his decision, shouldn’t we respect his wish too? They both stem from his will, after all.]", "Gula grit her teeth at the brazen ringing.", "[I am not saying we should open all three directions. The right. We shall grant him this one direction.]", "[Similar to the left direction, the right direction of the Nine Eyes has to be opened simultaneously.]", "[I know. But I will bear the consequences.]", "[….]", "[Do you have anything else to say?]", "With Ira going this far, Gula had nothing to say.", "Ira seemed to want to open the right side no matter what.", "[But why? Is there a reason you are going this far?]", "[Of course!]", "Just before he lost his consciousness, Seol Jihu noticed that something came up to his face.", "[I am curious! I am dying to find out!]", "He could feel a giant hand-like thing cover his face.", "[He came up with the adorable notion of applying the Golden Commandment to the future.]", "[Will he be able to withstand the weight of the words he said…?]", "Soon, a powerful energy brushed past his eyes.", "[You. Never forget.]", "Thus…", "[The decision you made today…!]", "The moment Ira’s voice echoed out…", "[Innate Ability, ‘Nine Eyes’, is evolving.]", "His vision turned white."]}