{"cid": "353", "title": "Chapter 353. Settlement of Accounts", "content": ["It was then.", "Seol Jihu, who was pestering Gula for a report on the current state of his contribution points, felt someone gently pulling on his body.", "A statue of a beautiful goddess approached him.", "“Uup.”", "The gentle pulling stopped at the same time that his body fell onto the statue.", "He then felt a warm pair of hands gently embrace him.", "Seol Jihu, who ended up in the statue’s embrace before he noticed, looked up in a daze.", "[You’re too excited.]", "Though he might be mistaken, he felt like the statue was looking down at him and smiling.", "Now that he thought about it, this was his first time seeing Gula up close.", "It was a bit difficult to read her expression from a statue, but the neat hair that stretched all the way to the ground came off as exceedingly beautiful.", "[I understand you’re happy, but you should calm down a bit.]", "Seol Jihu let out a low, quiet moan as a soft hand stroked his back.", "‘Ah… I’m sorry. I was too excited.’", "[Good boy.]", "‘Okay, I’ll calm down, so can you do something about this…’", "Seol Jihu twisted and turned, feeling somewhat embarrassed, and Gula let go of him with a chuckle.", "Seol Jihu took a couple of steps back with a flushed face. He then lowered his head and closed his eyes.", "Gula’s relaxed voice rang out as if she just finished preparing everything.", "[Let’s see. This is going to take some time with everything you’ve accomplished… Alright, we can start with your contribution points.]", "Seol Jihu’s ears perked up.", "[First, let’s go over your achievements.]", "Gula cleared her throat.", "[Forcing the Parasites’ Fourth Army Commander into defecting, being a direct cause of his perishing, and successfully retrieving the divinity of Temperance.]", "[Forcing the Parasites’ Seventh Army Commander into releasing her divinity and defeating her.]", "[And finally, planning the revival of the World Tree and saving the Spirit Realm that was in an unprecedented threat of extinction. These achievements are more than enough to prove that you are qualified to advance to the next step.]", "A faint smile emerged on Seol Jihu’s face.", "It was just like Oh Rahee said.", "Everything they did, whether small or big, was counted as a contribution, and the promotion exam had been more or less waived.", "[Furthermore, requesting the Spirit Kings to forget the resentment that has continued for thousands of years, helping the Cave Fairies regain the power of Spirits, and thereby freeing the Spirit Lords of Light and Darkness should also be counted as achievements.]", "Gula cleared up what he had been secretly wondering.", "Seol Jihu yelled in delight, but this wasn’t the end.", "[Overturning the tide of war at Tigol Fortress by saving the Spirit Realm.]", "[Forcing Unsightly Humility, Abhorrent Charity, Exploding Patience, and Vulgar Chastity — the Second, Third, Fifth, and Sixth Army Commanders — into releasing their divinities and directly being responsible for their retreat.]", "[Making the Parasite Queen descend to the battlefield, inducing the destruction of the Nests and the Parasites’ forces, and damaging a portion of the Goddess of Parasitism’s divinity.]", "[And thereby defeating the Parasites and saving Tigol Fortress from destruction. All of these things mean that you have proven yourself to be qualified to advance to the next step.]", "Seol Jihu clenched his fists. It sounded like he could skip the promotion exam twice.", "[Furthermore.]", "Gula continued.", "[Forcing the First Army Commander to reveal himself in Tigol Fortress… shall also be counted as a contribution.]", "Seol Jihu could feel a slight hesitation from Gula’s voice when she mentioned the First Army Commander.", "This naturally referred to Sung Shihyun. As far as Seol Jihu was aware, Sung Shihyun was the past Executor of Gula, the Star of Gluttony.", "Seol Jihu thought about something, then emptied his mind. Someone who used to be her apostle had betrayed her. Seol Jihu couldn’t imagine what she was feeling at the moment.", "[Fufu.]", "However, having read Seol Jihu’s mind, Gula chuckled quietly and stroked his head.", "[It’s very interesting. The two of you are very similar in the way you act, so why is that child so hateful while you are so cute?]", "‘Come again?’", "[No, it’s nothing. Anyway, using a Divine Wish ate up a lot of your contribution points, but if we add the contribution points you amassed this time with what was left over from before…]", "Seol Jihu strained his ears with a beating heart.", "[You will be able to advance to Level 6 and then Level 7 at once.]", "Level 7.", "The realm of Unique Rankers, of which there were not even ten in the whole of Paradise.", "With the level that he had always dreamed of right in front of his eyes, Seol Jihu cheered inwardly.", "However, a man’s greed knew no bounds. Seol Jihu began to thirst the realm of Level 8.", "‘Gula-nim, what about Level 8…?’", "[Purely in terms of contribution points, you have already passed what is needed to become a Level 8.]", "Seol Jihu’s eyes widened.", "[But on top of needing to take a promotion exam, your experience is far too lacking to advance to Level 8. That is my opinion.]", "Seol Jihu smacked his lips after hearing that he had enough contribution points but lacked experience points.", "However, he accepted the reasoning.", "It was just like Gula said.", "Seol Jihu clearly felt his lack of experience in this war.", "‘And it wasn’t just once or twice that I felt it.’", "In fact, he was surprised that he was even standing here in one piece. And so, he decided to be content with the fact that he could jump two levels higher.", "[Now that we’ve gone over your level, we can move on to the next topic. The Yggdrasil Essence and the divinity of Temperance.]", "Seol Jihu immediately took out the red fruit and the shining orb.", "[The World Tree is a tree that lies between the realm of immortality and mortality. It can live much longer than a Dragon, but its lifespan is not infinite. When its true body runs out of lifeforce, it immediately plants a new seed and blooms anew, continuing its existence through a cycle of rebirth.]", "Gula first brought up the fruit of the World Tree.", "[Do you know what the World Tree does first when it comes into being?]", "‘No, not at all.’", "[It’s simple. It prepares nutrients for the World Tree that will be born next.]", "‘Nutrients?’", "[Yes. Normally, it takes a very long time for the World Tree to grow to adulthood without external help. With a human’s lifespan, they will not be able to see the World Tree evolve to adulthood even if they live for thirty generations. It is far too inefficient.]", "Gula continued.", "[So, the World Tree separates a portion of its energy when it fully evolves and stores it for the next World Tree. If you haven’t guessed already, the fruit you are holding in your hand is exactly that.]", "Seol Jihu widened his eyes as he fiddled with the fruit.", "‘Wait, that means…’", "[You don’t have to worry about the World Tree that will be born next.]", "Gula said softly.", "[Didn’t you give it several sedges? Five, to be exact. They should have given the World Tree enough reserve energy. Consider that fruit a gift for your hard work.]", "‘I sure hope so.’", "[You can visit the Spirit realm later when you have time. The same fruit as the one in your hand will be hanging on the World Tree.]", "Seol Jihu nodded.", "He’d been wanting to go there again with how beautiful the Spirit Realm was with the World Tree alive. There probably wouldn’t be a better location for a honeymoon.", "[As you might expect, you can use the Yggdrasil Essence simply by consuming it.]", "Seol Jihu, who was indulging in a momentary flight of imagination, turned his attention to Gula.", "‘What effect does it have?’", "[There’s no way to know.]", "Gula answered firmly.", "[It is guaranteed to give a beneficial effect, but the exact effect depends on the user. Their physical attributes might increase, their mana might increase, they might awaken a new attribute or go through an evolution, or they might gain a new talent or increase their innate potential.]", "‘So… it’s pretty much random, but in a good way.’", "[Exactly.]", "Seol Jihu gulped. He wondered if his rash disposition would change, or if his ‘average’ talent would evolve.", "[But, there is something you need to keep in mind before consuming it. The Yggdrasil Essence is a type of medicine. You know that you can’t consume it thoughtlessly, right?]", "‘Yes.’", "[You cannot get greedy and eat the whole fruit by yourself. Cut it into dozens of pieces, you have one, and let your friends eat one piece each as well. Any more than that can endanger the consumer’s life.]", "[You punk. How can any human endure the natural energy condensed for thousands of years?]", "Recalling what Jang Maldong said in the past, Seol Jihu nodded his head.", "He was glad to hear this as he planned to share the fruit with everyone anyway.", "‘Thank you for letting me know. I’ll make sure to do that.’", "[Good. Then let’s talk about Temperance’s divinity…]", "Gula’s flowing voice came to a sudden stop as she trailed off.", "After a short moment of silence, she continued.", "[To be honest, it is a bit troublesome.]", "‘Why?’", "[Obviously, it’s a great thing that the number of Army Commanders is reduced to six. The problem is how to deal with Temperance’s divinity.]", "‘Uh… I’m not sure how this works, but can’t you use this to resurrect Temperance? Then we would have eight gods on our side.’", "[That would be great if we’re only looking at the results. The problem is that we would have to bear a great cost to complete that process.]", "Gula said with lamentation.", "[What you have in your hand is only the divinity of Temperance, not the goddess herself. Temperance’s true body was exterminated by the Parasite Queen.]", "‘….’", "[It’s not impossible to resurrect her. It is technically possible now that we have her divinity in our possession. But to resurrect Temperance, a god, we would need a tremendous amount of holy power. That is something we Seven Gods cannot afford to bear.]", "That made sense. The Seven Gods were currently using a lot of their power to maintain the connection between Paradise and Earth, and also to bring more Earthlings to Paradise.", "On top of that, the Seven Gods also gave the Earthlings supernatural powers, created the Tutorial and the Neutral Zone, and were bearing the cost of Earthlings bringing in small items from Earth.", "There was simply no way they had enough energy in reserve to resurrect a god.", "Seol Jihu asked after thinking silently for a moment.", "‘What kind of benefit will we gain if Temperance resurrects?’", "[We will have one more god on our side as you said, so we would have more leeway to do things. For example, we can give a select number of Paradisians the same power as Earthlings, bring more Earthlings to Paradise, or create additional isolated domains like the Banquet and the Neutral Zone. There might even be a new class which Temperance oversees.]", "So resurrecting Temperance would definitely have its merits.", "But as Gula said, the problem was how to get there. Since the Seven Gods didn’t have any energy to spare, the Earthlings would have to take charge of resurrecting Temperance, and Seol Jihu did not think that was possible.", "The cost of doing this was unfathomable, and Earthlings might be hesitant to help if there wasn’t a direct benefit they would gain from it.", "‘Then are there other ways we can utilize it? For example, bestowing divinity to an Earthling like the Parasite Queen did with the Army Commanders.’", "[Absolutely not.]", "Gula spoke firmly.", "[That is not something the human body can withstand. The Parasite Queen is able to do so because she remodeled the Army Commanders’ body into parasites. Even with that, most of the Army Commanders usually keep their divinities sealed.]", "Seol Jihu bit his lips.", "He agreed with Gula on one hand but thought about Sung Shihyun on the other.", "Twisted Kindness was a Dragon before becoming a parasite, so it was at least somewhat understandable. Seol Jihu couldn’t help but wonder just how incredible Sung Shihyun’s innate potential must have been to fully absorb Diligence’s divinity.", "Though, the Parasite Queen remodeling Sung Shihyun’s body must have had some part in it.", "‘What if the receiver isn't human? Flone, for example.’", "[They will perish.]", "‘What about Little Chick?’", "[I wonder. I do think it will be difficult.]", "‘Little Chick can’t do it either?’", "[The Arcus Spirit will have a higher chance of succeeding compared to a human. But that child was born from the power of Chastity. Although it feeds on evil energy and holy power, absorbing Temperance’s divinity is incomparable to absorbing holy power that we refined for it.]", "She was saying that it wasn’t easy to simultaneously carry the power of two gods.", "[Although the Arcus Spirit is a special existence, if you ask me whether it can absorb Temperance’s divinity, I would be skeptical. We don’t know if that’s what it wants either.]", "Seol Jihu clicked his tongue as he listened quietly.", "This didn’t work, that didn’t work. It was a huge headache.", "What was a precious treasure to the Parasites’ side seemed like a nuisance to humanity’s side.", "‘It’s complicated, huh.’", "[It is. Worst case, you can offer it to us. We will surely reward you with the appropriate amount of contribution points.]", "‘I don’t think this is something I can decide right now. Is it okay for me to discuss with my companions and tell you later?’", "[Of course. We also decided to let you choose what to do with Temperance’s divinity. You can take your time and tell us when you’re sure.]", "‘Thank you.’", "Having heard so much new information, Seol Jihu needed some time to organize his thoughts. And rather than deciding on his own, he figured it would be better to discuss it with everyone and decide afterward.", "‘Divinity aside, I will have to discuss my level with Master Jang.’", "[That’s not a bad choice. So, did I answer all of your questions?]", "Seol Jihu furrowed his brows just as he was about to answer ‘yes’.", "Now that he thought about it, there was something important he had to ask.", "‘Gula-nim, there’s actually something I need to ask no matter what.’", "[Go ahead. As long as it does not violate the law of causality, I will answer whatever I can.]", "Gula spoke, pleased at Seol Jihu’s polite request.", "‘If I level up… what will my Level 6 and Level 7 class names be?’", "Then, Gula suddenly fell silent.", "Though Seol Jihu might be mistaken, he felt like he saw the statue flinch.", "‘So?’", "[Erm, hmm?]", "‘You haven’t decided yet? I doubt that’s the case, but just tell me this. Does it have the word ‘mana’ in it?’", "[Uh…]", "‘…Gula-nim?’", "[….]", "Gula didn’t say anything like she suddenly became mute.", "However, Seol Jihu waited tenaciously. He was okay with a vague answer for anything else, but he wanted a clear answer for this.", "How much time went by?", "‘Gula-nim… Don’t tell me…’", "When Seol Jihu asked again, worried about the long silence…", "[Today’s weather is quite excellent.]", "Gula suddenly spewed a load of nonsense.", "‘Huh? What does the weather have to do with anything?’", "[A festival is held every day on the streets. It’s great that you’re thinking of your future path, but shouldn’t you have a bit of fun as well?]", "‘Wait, hold on, why are you bringing up the festival?’", "[You’re the main character. You should hurry on out. Otherwise, the festival won’t be as interesting. Anyway, come see me after you give some thought to the things we talked about today.]", "Seol Jihu wanted to protest, but his voice refused to come out.", "That wasn’t all. His body moved against his will and slid backward.", "‘W-What…!?’", "Seol Jihu flailed his arms, but it was meaningless. He was helplessly pushed outside the temple.", "‘T-This damned goddess…!’", "The outraged Seol Jihu tried to storm back in.", "“…What the…?”", "However, the entrance was blocked.", "He could see that it was wide open, but he couldn’t move forward like there was an invisible wall standing in his way.", "“Gula-nim! Gula-nim!”", "Seol Jihu slammed on the invisible wall and raised his voice, but Gula did not reply.", "The wall didn’t disappear either.", "In a fit of anger, he threw several Mana Spears at the wall, but they simply disintegrated upon making contact.", "Seol Jihu immediately regretted leaving the Spear of Purity home.", "Flone, who was watching from the side, rolled on the ground, laughing.", "“What are you laughing about?”", "[What are you getting mad at me for?]", "“Because you’re laughing! Wait, Flone, try going inside.”", "[I have no problem going in.]", "Flone went in and out from the entrance.", "With this, Seol Jihu became sure.", "Gula had chased him out because she was troubled by his question.", "Not only that, but she also banned him from re-entering!", "“Keuk!”", "Seol Jihu gritted his teeth.", "“Flone, don’t just stand there. Go in and say something! Go destroy the statue!”", "[Are you trying to incite a divine punishment?]", "“Argh, damn it.”", "Seol Jihu knocked on the invisible wall again.", "“Gula-nim! Are you really doing this!? You sure you won’t regret it?”", "[?]", "Since the words already escaped his mouth, Seol Jihu decided to go with it.", "“Who’s to say I won’t defect to the Parasites?”", "[What was that!?]", "A strong voice burst out from the temple.", "The corner of Seol Jihu’s mouth curled up as he finally got a reaction out of her.", "“Think well! I have Temperance’s divinity in my hands!”", "[You punk.]", "“The Parasites happen to be missing an Army Commander. Wouldn’t it be a shame if they went back to having seven Army Commanders? Huh?”", "[You… you…!]", "“Iya~ First, Sung Shihyun. And now, me. Two Unique Ranker Earthlings serving Gula defecting to the Parasites, I wonder what the other gods will think about that!”", "[Brat… I’ve been too lenient with you…!]", "With Gula being at a loss for words, Seol Jihu raised his voice up a notch and threatened her.", "“Try putting even the ‘ma’ of mana in my class name, and you will see a new Fourth Army Commander replacing Raging Temperance. Something like ‘Pranking Seol Jihu’. Got that?”", "It was then.", "[You… I spoiled you so much that you know no limit…!]", "A furious voice rang out before…", "Pzzt!", "A white bolt of lightning struck down from the sky.", "At the same time, Seol Jihu’s scream pierced the sky.", "The heavens had sent him a divine punishment."]}