{"cid": "442", "title": "Chapter 442. The Star Sets in the Valley (1)", "content": ["A bird with colorful feathers was cutting through the grey sky. The phoenix craning its neck left and right in search of something was none other than Little Chick.", "Little Chick and Flone kept their promise to Seol Jihu. Even when they saw the withdrawing Parasite troops, they avoided making contact with them as promised and did not go back.", "It wasn’t as if they didn’t run into them. But Little Chick led the way, risking its life to scout for danger, and Flone flew safely while carrying the unconscious Seo Yuhui.", "Other than at times Seo Yuhui woke up and had to be forced down, they flew day and night without stopping to rest. Perhaps because they could both fly, they were able to return to Haramark faster than anyone else.", "They threw Seo Yuhui in the royal palace as soon as they arrived. Once they heard from Prihi that the Federation and humanity’s combined forces should have crossed the border already, they immediately set off to rescue Seol Jihu, who should be fighting against the entirety of the Parasite army alone.", "They couldn’t help but think that it was already too late… but they had no choice but to go back.", "After all, they believed in him.", "Seol Jihu wouldn’t die. He had weathered numerous life-threatening storms before.", "He was a man who, when on the verge of collapsing, stood up each time.", "So, they believed he would do the same this time as well.", "Even if he fell for a moment, he would undoubtedly stand back up and come back alive for everyone to see.", "Just like always.", "‘Please…. Please….!’", "The phoenix could not hide its anxiousness even as it flew at a terrifying speed. It had separated from Flone long ago.", "There just wasn’t enough information. Finding Seol Jihu in this vast territory was like finding a needle in a haystack.", "There was no way to tell if he had escaped, or was still surrounded, or if he was being pursued.", "Not only that, Little Chick couldn’t maintain its phoenix form permanently, which also slowed down the search. And so, Little Chick sent Flone ahead to the predicted location of the battle and was scouring a different area based on his prediction of Seol Jihu’s path of escape.", "‘I came this far, and he’s not here…. Does that mean he escaped toward the Federation…?’", "Little Chick shook off his anxious thoughts and continued to fly. Then suddenly, his wide-range sensing ability detected a source of evil energy.", "It did not feel like a demonic being, but Little Chick changed its course just to be safe. The closer it got to the source, the more it felt sure of the evil energy’s identity.", "The faint fragrance changed into a demonic being’s strong stench of blood.", "“Ah…!”", "At that moment, Little Chick screamed. Just when it thought things couldn’t possibly get any worse, it had run out of energy.", "“Damn it!”", "It tried its best to maintain its phoenix form, but it was falling from the sky rapidly.", "In the end, a light flashed from the sky. The phoenix disappeared and a small, bright-yellow bird fell to the ground.", "Crash. Only after hitting the ground and rolling on the dirt several times did Little Chick barely grab hold of its body.", "“Kaahaak!”", "Limping up, Little Chick spat out a mouthful of blood. A crimson stain was smeared around its beak. Because Little Chick repeatedly transformed into its phoenix form during its flight back, too much burden had been placed on its body.", "Despite this, Little Chick did not stop. After spitting out blood, it quickly moved to the evil energy’s location and saw the blood-stained ground.", "‘This is…!’", "Blood that was not dry yet was forming a long trail on the dirt. The path extended for a long distance, seemingly endless in the way it disappeared into the horizon.", "Little Chick looked around the area before abruptly running in one direction. Its tiny legs moved urgently.", "Little Chick was half in doubt, but he hastened his steps, feeling his insides burning the more he followed the trail of blood.", "Then, at last, Little Chick stopped running at the end of the trail.", "“Ah!”", "Inside the barren valley, Little Chick saw a man advancing forward while continually creating a bloody trail with each step.", "It really was Seol Jihu.", "A look of delight flashed across Little Chick’s face when it saw Seol Jihu’s white spear.", "“Hey!”", "Little Chick skipped forward.", "“Heeeey!”", "Running in short and quick steps, it closed the distance in an instant.", "“Part…!”", "But just as it was about to shout, ‘Partner!’, its beak dropped open. It became lost for words, its face dazed.", "The man lacked a right arm and was taking laborious steps using the spear in his left hand like a cane. The way he leaned on his spear, he looked feeble and out of strength.", "It was impressive enough that he was standing, much less walking. The state of his body… could hardly be called a human being’s. The word ‘terrible’ did not begin to describe it.", "From the dried up blood around his eyes to the blood dripping down from the end of his nose, from the blood plastered across his face to the foul stench of blood mixed with sweat and pus… blood, blood, blood, blood… there was so much blood that his severed arm looked like the least serious injury.", "It was only now that Little Chick understood how the trail of blood was formed. If not for the Spear of Purity, it would not have even recognized Seol Jihu.", "Little Chick’s eyes trembled. It could guess the scene of madness Seol Jihu must have paved through to get here.", "Tak!", "Seol Jihu dragged his feet on the ground, using his spear as a crutch, and slowly walked past Little Chick. His face, which could be seen from his drooping head, was completely dazed.", "“Partner….”", "It was only then that Little Chick muttered a word. It was also at this time that Seol Jihu regained his senses.", "‘…Huh?’", "Loosely opening his eyes, Seol Jihu saw the ground. He blinked, wondering just what happened.", "He remembered up until the point he got surrounded by the Army Commanders while trying to kill Sung Shihyun….", "At that moment, as Seol Jihu was staring blankly at the ground, his eyebrows twitched. He saw a familiar figure in his blurred vision. A small, bright-yellow thing was flapping its wings and looking up at him.", "“…!”", "Now that he took a closer look, it seemed to be chirping something as well.", "“Snap out of it…! Hey…!”", "When he concentrated his nerves on listening, a frantic voice faintly rang out in his ears.", "Seol Jihu stared at Little Chick for a long time before his eyes widened slightly.", "“You….”", "When he opened his eyes, Little Chick’s eyes grew larger.", "“Didn’t I… tell you… not to… come back…?”", "Seol Jihu’s submerged voice came out intermittently.", "“I kept my promise, you bastard!”", "Little Chick yelled.", "“I brought that woman to Haramark safe and sound! I kept my promise, so what I do afterward is my choice!”", "“…You did?”", "I see. So Yuhui’s safe. That’s fine then. Seol Jihu internally breathed a sigh of relief.", "“Thanks….”", "“Save it! Anyway, what happened to you? Did you really break through that death trap?”", "“Me…?”", "Seol Jihu blinked slowly.", "It wasn’t that he lost his memories. If anything, he remembered too much, too vividly. Just as his consciousness was about to flicker off, a message popped up that said Future Vision activated, and…", "“Cough, cough…!”", "Seol Jihu coughed while he was trying to recall what happened. Even though it was only a light cough, a cold mixture of blood spurted out of his mouth.", "“Ukk….”", "Seol Jihu tried to force himself to swallow it, but the blood still dripped down his mouth.", "“No, nevermind!”", "Little Chick shook his head in fright.", "“You can just tell me about it later! Let’s hurry back for now!”", "Seol Jihu smiled.", "“…Damn it! Can you even walk? Or wait! Let me regain some energy, and then we can…”", "Little Chick muttered, perhaps feeling sorry after seeing Seol Jihu’s smile.", "“Ah, you have a communication crystal! Make a call now…!”", "Seol Jihu shook his head. He indeed had a communication crystal. Unfortunately, he did not have even an inkling of mana left with which he could activate it.", "For some reason, he couldn’t gather the mana inside his body.", "…No, in truth, he had an idea why.", "“….”", "After a moment of silence, Seol Jihu continued walking. Using the Spear of Purity as a crutch, he placed his weight against it and dragged his feet.", "Now that he came to his senses, he realized just how tough and arduous this process was. It wasn’t that the pain was excruciating, but his entire body stung as if it was scraped.", "And this was even after Black Seol Jihu cut off his sense of pain.", "‘Ah… come to think of it….’", "A question rose in Seol Jihu’s mind as he organized his thoughts. Up until now, he was not able to remember what happened when Future Vision was active.", "But it was different this time. He could faintly recall what happened after his Innate Ability activated and Black Seol Jihu took over his body.", "Black Seol Jihu battled the Army Commanders in his place and almost killed Sung Shihyun; he was thrown into the pit by the Parasite Queen’s intervention, then coaxed the enemy and escaped, and…", "[Good job….]", "[You did well…. Really….]", "He said those words to him.", "‘What happened…?’", "While thinking, Seol Jihu suddenly felt his consciousness sink. His eyes slowly closed as well.", "“Ah! Hey, hey!”", "A high-pitched scream struck his ears. His narrowed eyes widened slightly.", "Little Chick was screaming with a pressing look on its face. If not for his loud screaming, Seol Jihu most certainly would have lost his consciousness then.", "“Are you okay?”", "“Yeah, sorry….”", "Seol Jihu dropped his head. Leaning his forehead against the spear shaft, he panted slowly. At this point, he wasn’t even sure he was breathing properly.", "“I don’t know… I… suddenly blanked out…”", "“Snap out of it! We’re almost home…!”", "“We are…?”", "“Y… Yeah! We just have to cross this valley! Let’s get going!”", "Again, he started walking. Seol Jihu stopped thinking about the details and focused on moving his feet.", "Right, who cared? He had achieved what he desired. He protected the stele, his comrades were safe, and Seo Yuhui returned alive as well.", "Although, he fought and fought until his body was a frightening wreck to achieve this…", "‘It’s not bad….’", "He was more than satisfied with the outcome.", "But if there was one thing he wanted, one thing he could wish for…", "‘I want to… see everyone….’", "It was to see his comrades.", "He wanted to reunite with everyone, embrace them, and share the joy of returning alive.", "And to do that, he had to get out of this valley.", "He did. But….", "Seol Jihu stared blankly at Little Chick, who was leading the way and constantly encouraging him. After a brief second, his gaze dropped to the ground.", "He tried to raise his head, but it kept falling down. Along with it, his bangs rolled down and blocked his vision.", "‘I want to rest….’", "It wasn’t like a feeling of exhaustion or wanting to lie down. He wanted to walk, but his body had escaped his control and was stopping on its own. He felt like he would fall into an eternal sleep if he closed his eyes.", "Soon, the light in his eyes dimmed. Little Chick’s figure blurred like he went underwater.", "Suddenly, he felt something hard on his foot. At the same time, Seol Jihu’s swaying steps stopped.", "‘Shoot!’", "Little Chick gritted its teeth.", "There was a hill.", "The slope wasn’t steep, but the way up was too long. It would have scoffed it off at any other time, but the current Seol Jihu was having trouble even taking a single step.", "It couldn’t blame him. It was already a miracle that he was alive and moving. He must be steering his body with only his will to return, not even knowing where they were going….", "A cold wind blew.", "“Ah….”", "Seol Jihu shuddered, the cold air seemingly penetrating his organs. Eventually, he could no longer bear it and fell on his knees.", "His body had been scorching hot during the battle, but now it was too cold. He could feel it losing temperature by the second.", "“Little Chick….”", "A groaning voice flowed out.", "“Are you… there…?”", "What do I do? Little Chick looked around their surroundings before gasping in shock. Seol Jihu’s body was on the verge of collapse.", "“W-What’s wrong!?”", "Little Chick ran up to him in a hurry and shouted.", "“To be… honest… I haven’t… been able to… see… for a while….”", "Cough, cough. Seol Jihu coughed again and panted with difficulty.", "“Little Chick….”", "After a short silence, Seol Jihu finally spat out the thing that he kept gulping back into his throat. His face relaxed slightly.", "“What…”", "After collecting his breath for a while, he asked out of the blue.", "“What will happen to me…?”", "“W-What?”", "“Will I… really forget…?”", "“….”", "“Everything that happened in Paradise… everything related to it… everything…?”", "His voice trembled out. As he continued his sentence one phrase at a time, a look of pain distorted Little Chick’s face.", "“I can’t forget….”", "A lamentation mixed with a sigh escaped his mouth.", "“I can’t… go back… to how I was…”", "“What are you talking about all of a sudden?”", "Little Chick raised its voice, unable to bear listening any longer.", "“Get back up if you have the energy to keep yapping!”", "“….”", "“Come on, get up! Are you going to quit after you came this far? This is it! You just have to cross this hill! You’re almost there!”", "“….”", "“Hey! Hey! Snap out of it! Didn’t you say you didn’t want to forget!? You said you can’t forget! Then you can’t die! You need to return alive!”", "Little Chick shouted at the top of its lungs.", "It twisted its body in the middle of urging him. A faint light shone from its body, but the light scattered in the next instant as it coughed out of a mouthful of blood.", "It had suffered an injury while trying to transform forcefully.", "“Argh, this damned body! This damned, damned body! You should have helped me evolve to adulthood earlier!”", "Being a phoenix didn’t mean it didn’t feel pain. Immediately after Little Chick frowned and raised its voice in anger, it abruptly widened its eyes and raised its head.", "Seol Jihu, who had fallen to his knees, slowly got up.", "“Okay….”", "After picking himself back up, he smiled bitterly.", "“I’m going…”", "“…Ya bastard!”", "Little Chick was on the verge of bursting into tears.", "“I knew you could stand! Making me worry for nothing! Do you really want to pull a prank at a time like this?”", "“Does it look like a prank…”", "“Anyway, let’s go! I’m not kidding! You just have to climb this hill! The reinforcements are coming, so we should be able to meet up with them!”", "Little Chick pulled on Seol Jihu’s pants with its beak before deciding it wasn’t working and climbed the hill first. It jumped up and down in the middle and desperately shouted at him to hurry up.", "Seol Jihu squeezed out every ounce of energy in his body and looked up. He put strength in his eyes. His vision came into focus, and he finally saw the hill for himself.", "For some reason, the hill in front of him overlapped with the image of the mountain he climbed in the Path of the Soul. The thought to climb it enveloped his head naturally.", "“Hurry up!”", "Little Chick shouted.", "“Okay, okay….”", "Seol Jihu nodded.", "“I have to live…. Since I can’t forget….”", "He saw the ground again.", "Right.", "‘Let’s go….’", "Seol Jihu slowly lifted his foot. Although he couldn’t raise his head, he suddenly felt a lot lighter.", "Let’s go, let’s go, let’s go.", "Even if I die here….", "Just a step more….", "Even if I can’t… open my eyes again…", "Let’s take just one more… step…", "And go….", "“Just a little more! I think I can see them!”", "Little Chick climbed the hill.", "“I can hear something too! I think they’re almost here! Come listen!”", "It hopped up…", "“Aren’t you coming? Want me to go ahead? Hmm?”", "…and shouted nonstop.", "“Chet! Fine! I’ll make a special exception just for you! If you can climb this hill, I’ll liberate the Spear of Purity’s sixth and seventh stage!”", "Little Chick shouted whatever came to his mind.", "“Of course, you’ll have to help me evolve to adulthood before that!”", "It felt like it had to.", "“To do that, you have to go back alive…!”", "It was then.", "Tang!", "A metallic clang suddenly rang out.", "“!”", "Little Chick did a double-take and looked back in a hurry. It immediately became stunned.", "The first thing that caught its eye was the Spear of Purity rolling down the hill.", "“Ah….”", "Little Chick’s beak dropped open when it saw Seol Jihu. The left hand that was holding onto the Spear of Purity sagged down helplessly.", "Behind his half-closed, half-opened eyes were dim pupils that lost their light, and his swaying body leaned to one side.", "His hair fluttered ceaselessly, and…", "‘Hmm?’", "Seol Jihu opened his eyes after a few blinks. He’d lost consciousness again for a moment, and the scenery changed.", "Petals were fluttering in a beautiful garden.", "‘This is….’", "Just as he recognized the place, the scenery quickly changed.", "He saw the hill again.", "‘Did I see wrong…?’", "Seol Jihu tilted his head before suddenly widening his eyes.", "‘Anyway, when did this path get… huh?’", "When he raised his eyes and looked up, he couldn’t hide his shock.", "‘Huuuuh?’", "Above the hill, he saw the scenery he wanted to see more than anything else.", "There weren’t just one or two people there. More than a dozen people were looking down at him.", "‘Everyone…!’", "Baek Haeju, no, Yoo Seonhwa was looking at him with her hands clasped together.", "Kazuki was crossing his arms with a calm face.", "Maria was shaking her broken artifact and shouting something angrily.", "Teresa was smiling elegantly and winking.", "Philip Muller, who was sitting down reading his book, raised his body and closed the book.", "Eun Yuri waved her hand with an expressionless face, and Marcel Ghionea raised his crossbow with an awkward smile.", "Agnes pushed her glasses up and eyed at him to hurry up, and Oh Rahee grinned while fiddling with the ends of her hair.", "Yi Seol-Ah was holding hands with Hoshino Urara and jumping up and down in joy, and Hugo was excitedly waving his hand as well. To say welcome home.", "Audrey Basler was shaking her head while looking at the trio. Meanwhile, Wu Lei and White Tiger were roaring with laughter.", "Chohong and Phi Sora looked a little annoyed. The two snorted and then simultaneously stretched their hands out. The way they were beckoning at him, they seemed to be telling him to hurry up.", "As Seol Jihu watched in a daze, the corner of his mouth curled up.", "‘They’re all alive…!’", "Everyone had survived and was waiting for him to come back.", "Little Chick had not lied.", "Because at the center of the group was Seo Yuhui. She glared at Seol Jihu with reddened eyes before closing them. She then opened her eyes and revealed a bright smile.", "Inside the illuminating mirage, Seol Jihu clenched his fists.", "He became impatient and ran forward in a heat of passion, looking only at the summit.", "That was why he failed to see that his body was gradually turning faint, and that Roselle, who was quietly watching him from behind, closed her eyes with a look of pity.", "Not knowing anything, Seol Jihu laughed.", "He shouted with a beaming smile.", "“I…!”", "Then….", "Koong.", "Seol Jihu’s body fell flat on the hill.", "Then, it no longer moved.", "His foot, which he raised with great difficulty, did not complete its step.", "Little Chick stood blankly for a second. After doubting its eyes, it rushed back down.", "“O… Oi!”", "It stuttered.", "“Oi…!”", "There was no reply.", "“…Partner!”", "Seol Jihu did not move in the slightest.", "A shimmering ripple stirred in its pupils. Its beak convulsed as well.", "“Hey, you…!”", "In that instant, Little Chick shut its beak in the middle of shouting something. It clenched hard as if to break its teeth.", "“Keuk…!”", "Its face contorted to an indescribable degree, and it dropped its head.", "Soon, a faint light began to rise from Little Chick’s body.", "…In truth, Little Chick already knew.", "It knew what would happen long before it discovered Seol Jihu’s body.", "Though the Arcus Spirit was an immortal phoenix, its life was not eternal. It would meet its end, along with the death of its lifelong partner, and return to its egg form to await a new master.", "Little Chick knew what state its body was in during the search. It just didn’t want to believe it.", "Because… because….", "“Get up….”", "Little Chick curled up and shook intensely.", "“Get up… ya bastard…!”", "Tears streamed down from its dropped head.", "“You always got back up…! Always…! Without a doubt…!”", "Seol Jihu still did not answer.", "A smile hung on his mouth as if he was having a happy dream.", "‘I’m….’", "Only…", "‘Home….’", "A hoarse, groggy voice faintly flowed out."]}