{"cid": "279", "title": "Chapter 279. Winter’s Struggle (4)", "content": ["Seol Jihu headed to Luxuria’s temple. Perhaps because it was late, the temple was quiet inside.", "Luxuria welcomed Seol Jihu with open arms, asking why he hadn’t come over in a long time.", "Seol Jihu did not decline. Only after being spoiled by Luxuria for a bit did he reveal the reason for his visit.", "Luxuria, who read Seol Jihu’s thoughts, spoke in awe.", "[You’re really going to use that many contribution points?]", "‘Yes, will it work?’", "[Let me see. Hold on.]", "Luxuria asked for time to calculate. Soon, a seductive voice rang out in his head.", "[It’ll work. Yep, you’ll be cutting it pretty close, but it’s possible.]", "A positive answer came back. Seol Jihu’s complexion brightened.", "‘Really? It will work?’", "Seol Jihu asked again.", "[You have no idea how many contribution points you have, do you?]", "Luxuria said playfully. Seol Jihu laughed awkwardly.", "‘I don’t. The people around me put me on a pedestal, calling me a hero or a legend, but I don’t really feel any special…’", "[Think about it this way. You exterminated Undying Diligence. That is something that no one has managed to do in all of Paradise since the Parasite Queen’s invasion.]", "Luxuria spoke kindly.", "[What’s important is that you were the first one to have achieved this. For the same task, the contribution points you get can change depending on the situation and background.]", "‘Ah.’", "[Contribution points are the quantified representation of an individual’s influence on society.]", "Remembering Seo Yuhui’s words, Seol Jihu quickly understood the significance of being the first person to achieve something. Simply put, one would gain additional rewards by being the first.", "Exterminating Undying Diligence was already an incredible contribution, but contribution points were not calculated simply based on that.", "By annihilating the First Army Commander who was thought to be invincible, Seol Jihu had given the rest of the world hope and courage that they could defeat the Parasites.", "As the outcome of this war impacted all regions of Paradise, the number of contribution points he must have gained could not be estimated at all.", "[That’s not all. The achievements you’ve made so far have all had a great influence on the primary flow of events. Didn’t you make another outstanding achievement recently?]", "She must be talking about the Eva incident.", "Furthermore, since Seol Jihu rarely used his contribution points except for leveling up, it only made sense that he had a terrifying amount amassed.", "[I am willing to bet my name on it. Currently, no one else holds more contribution points than you. Not only Executors but also my daughter cannot compare to you.]", "In truth, Seo Yuhui making a wish for Seol Jihu and advancing to Level 8 had to be considered, but Luxuria did not mention them. After all, what she said was the truth at the current moment.", "Seol Jihu clenched his fists.", "Was it possible or not possible?", "That was the most important question. Of course, the fact that he had to use an exorbitant amount of contribution points did not change, but that was not a problem. Because—", "[Oh?]", "At this moment, Luxuria exclaimed.", "[Huhu. Hohohoho!]", "Hearing her laughter, Seol Jihu went, ‘Ah’.", "[That is a very interesting idea. Perhaps only you could have thought of it.]", "As she didn’t say it wouldn’t work, Seol Jihu asked carefully.", "‘Is this possible too?’", "[Yes, of course.]", "Luxuria replied refreshingly. Unlike a certain someone who liked riddles, she gave clear answers.", "[Think about it. Why do you think we separated the Invited into different grades?]", "‘I’m not sure…’", "Seol Jihu tilted his head as Luxuria placed her hand on top of his head and stroked his hair softly.", "[Don’t worry. What you are trying to do does not go against the restrictions we have set. So there is no reason for us to interfere or stop you.]", "Seol Jihu cheered inwardly. He had just received the okay-sign from a fully trustworthy existence. Now, he had nothing to fear.", "‘Thank you.’", "He bowed politely and turned around at once.", "[C-Child!]", "He ran out of the temple, leaving behind Luxuria who was disappointedly asking him to stay a bit longer and play.", "Perhaps because it was winter, the night’s air was cold. His body shuddered and white vapor came out of his mouth, but his head was clear as if cold water had been poured over it.", "Once he achieved a breakthrough in his thinking, the flooding river had swept away his troubles and conflicts.", "He felt like he managed to score while randomly making shots in front of the goal post.", "‘Jeez.’", "He burst into laughter in the middle of walking.", "‘If it weren’t for that vision…’", "Would he have known about the mysterious Eun Yuri?", "She probably did not know there was someone working so hard to bring her into an otherworldly place. But he didn’t plan to force her. The choice would be Eun Yuri’s to make.", "But for some reason, he was confident she would come to Paradise.", "‘Eun Yuri.’", "Seol Jihu tilted his chin up. Looking up at the night sky, his eyes twinkled like stars.", "‘I hope to see you soon.’", "*", "The next morning.", "“Did something good happen?”", "Kim Hannah asked after she came into the meeting room at Seol Jihu’s summon.", "“Yep. It’s about the March Neutral Zone.”", "Seol Jihu said with a beaming smile.", "“Let’s join the temple auction. No matter what, we need to take one of the Neutral Zones opening up this March.”", "Kim Hannah nodded. Given Seol Jihu’s contribution points, it wouldn’t be anything difficult.", "“What about Eun Yuri?”", "“Let’s recruit her.”", "Kim Hannah wasn’t all that surprised. She had expected this from the moment he asked about Eun Yuri, and she knew Seol Jihu had been looking into her recently.", "Although he would have to expend a wish, he must have made up his mind after much consideration.", "“Will you be bringing her as a Contracted? Or an Invited?”", "“Invited.”", "Seol Jihu said without hesitation.", "“We’re going to give her a gold grade invitation.”", "Kim Hannah’s expression froze. Not bronze, not silver, but gold?", "“Hold on.”", "Kim Hannah quickly raised her hand.", "“Are you saying this knowing how valuable a gold stamp is?”", "“I don’t know exactly.”", "“Representative, there is a reason most organizations use contracts rather than invitations to bring people in.”", "“Because it costs fewer contribution points, right?”", "“If you know that… Huu. Yes.”", "Kim Hannah swallowed her sigh.", "“The bonuses and privileges given to the higher Invited grades aren’t the only things you should consider. There is a huge difference between contracts and invitations. Inviting someone means that we will shoulder all costs needed to bring that person into Paradise.”", "Seol Jihu nodded silently.", "“The bronze stamp, which is the lowest grade invitation, is equivalent to five red stamps. A silver stamp is equal to seven bronze stamps, and a gold stamp requires the equivalent contribution points of eleven silver stamps.”", "Meaning, a gold stamp’s worth of contribution points could bring in 385 contractees.", "“As a side note, only a couple of silver stamps are needed to win the bid for managing the Neutral Zone.”", "“I know. You’re saying we only need a bronze stamp to judge Eun Yuri.”", "Seol Jihu sounded like he knew the significance and cost of the gold stamp but would go with it anyway. Kim Hannah shut her mouth.", "Right, there had to be a reason. A reason that he was insisting on the gold stamp when a red or bronze would suffice.", "Seol Jihu began to explain leisurely. Starting from the information he dug up to his conversation with Luxuria, and the ultimate goal he was aiming for.", "The more Kim Hannah heard him, the more her expression changed. Rather than surprised, she looked doubtful.", "“Representative Seol.”", "Kim Hannah spoke with her eyes narrowed to a slit.", "“It isn’t as if no one has thought of that since the opening of Paradise.”", "“Sure.”", "“But in the end, the majority failed. There are only a handful of people who succeeded. Although I admit that it is possible theoretically, it is not as easy as it sounds.”", "“That’s why we need the gold stamp.”", "Seol Jihu smiled.", "“And rather than someone who doesn’t know anything, it’s more effective to call someone who’s experienced the Tutorial and the Neutral Zone. It’ll increase our chances of success.”", "“….”", "“It isn’t that this opportunity is hard to come by. It just has to be created and grasped with your own hands, like using money to make money.”", "Kim Hannah smacked her lips. She understood what he was saying.", "Seol Jihu had set the entire Neutral Zone, not just Eun Yuri, as his goal.", "‘Indeed.’", "If it succeeded, it would really be using money to make money. They would be able to get their hands on rewards not even the Pagoda of Dreams expedition would be comparable to, all without the loss of contribution points.", "“It’s possible in theory, but…”", "Although she was hesitant, Kim Hannah decided to back down. To put it bluntly, she had no justification for stopping Seol Jihu from using his own contribution points.", "“By the looks of it, you also…”", "“Huh?”", "“No, nothing.”", "Seol Jihu chuckled, then changed the subject.", "“Anyway, I want to ask you to scout Eun Yuri.”", "“Bringing her won’t be hard.”", "Kim Hannah spoke clearly.", "“I told you before, right? That Sinyoung put Eun Yuri in their recruitment list.”", "“Yeah.”", "“Although they scraped the plan before it was carried out, I was the one who was tasked with scouting Eun Yuri back then. I remember the tactic we devised and I also brought the relevant information with me, so I can get in touch with her today if I want to.”", "“That’s great. When should we seal the deal?”", "“Acquiring a Neutral Zone and obtaining the gold stamp should come first.”", "Kim Hannah continued.", "“The notice should come out around January on Earth. I will get in touch with her as soon as the participating process finishes. She will be an Invited, after all. It shouldn’t hurt to give her a lot of time to prepare.”", "“Right, telling her only a few hours before is too harsh.”", "Seol Jihu mumbled calmly. Kim Hannah was taken aback by the sudden attack.", "“H-Hey, back then…”", "“Hey? Wasn’t this an official matter?”", "“Ah, m-my apologies.”", "Seol Jihu sniggered and waved his hand.", "“Haha, I’m kidding, I’m kidding. So you can get flustered.”", "Kim Hannah blurted out, “Keuk!”", "*", "Seol Jihu turned on the ignition once his goal became clear.", "The first order of business was collecting contribution points. To lock up one of the March Neutral Zones, he asked each of Valhalla’s members 30 percent of the contribution points in their possession.", "Of course, it wouldn’t matter even if they did not contribute, but they knew it would delay the order in which they could enter the Neutral Zone.", "There were no complaints since they weren’t forced, and no one hesitated to expend their contribution points. After all, they knew they would enjoy three months of benefits as long as they entered the Neutral Zone.", "Moreover, with Valhalla having a 100 percent chance of obtaining a Neutral Zone, they would be fools not to contribute.", "A few days afterward, a huge notice was hung on the plaza’s bulletin board. It was regarding the custody auction for the upcoming Neutral Zones.", "Four Neutral Zones would be opening up for March of 2018. Spread out over four days — the 22nd, 23rd, 24th, and 25th — it was the most number of Neutral Zone openings in the history of Paradise.", "Each Area could only admit up to 50 people, but because Area 1 was an independent region, it received a 50 percent boost, allowing 75 people to enter. Since there were four Neutral Zones in total, up to 300 people could enter from South Korea alone.", "Then how was the custody of the Neutral Zones determined?", "The auction was carried out in a mixture of two formats — the round auction and blind auction. In a round auction, the opportunity to bid would return after every fixed interval, and in a blind auction, the potential bidders would not know how many stamps the others bought.", "The process was rather simple. Since the Neutral Zone was activated using contribution points, custody would be taken in the order of the maximum number of contribution points spent by the organizations.", "Here, the method of measuring the amount of contribution points spent were stamps. Meaning, the more stamps an organization purchased at the auction, the greater the chance they would have to acquire custody over a Neutral Zone.", "Of course, this process had a restriction as well.", "Once an organization succeeded in acquiring a Neutral Zone, although they would still be able to participate in the next auction, they would not be able to take on the general manager role until four additional Neutral Zones were opened, counting from the next biannual opening.", "In other words, supposing four Neutral Zones would open in September as well, Valhalla would only be able to take custody of a Neutral Zone in March of next year.", "This restriction was put in place to prevent one organization from monopolizing the Neutral Zone multiple times in a row.", "Although Seol Jihu felt like there was also a backstory in how this restriction came to be, he purposely did not ask. He figured he’d rather not listen to it than suffer the frustration all over again.", "In any case, after reviewing the above basic information, Seol Jihu headed to Scheherazade and participated in the temple auction.", "Valhalla bid for the Neutral Zone opening on Thursday, March 22nd, 2018.", "The fun of an auction lied in the bidder’s fierce battle of wits. Although when and how to spend stamps were entirely up to the organizations, ‘the conversion of contribution points spent in purchasing stamps to bidding price,’ only applied in the specific auction that the stamps were bought.", "If the organizations purchased only the amount of stamps they needed, the chances of them acquiring custody of a Neutral Zone would decrease. Naturally, they would have to carefully gauge how many stamps the competing organizations would buy.", "This usually resulted in the Neutral Zone auctions to be carried out in a heavy, grave atmosphere. However, the temple’s air today was surprisingly light. With even laughter being heard, the atmosphere was relatively relaxed.", "Seol Jihu knew why.", "He wasn’t the only one. Anyone participating in the auction today knew, the grass and the trees outside knew, and even the heaven and earth knew.", "90 percent of the participants purchased red stamps. What this signified was clear.", "It wasn’t as if there was only one Neutral Zone. There were three more besides the one on the 22nd. An organization vying for custody over a Neutral Zone had no reason to compete with Valhalla, the favorite to win the bid who came out swinging.", "In fact, it was so clear that they were unbeatable that the organizations looking to secure a Neutral Zone left the first day’s auction entirely. This naturally resulted in only small organizations and groups that had no chance of winning remaining.", "“If there are no bidders left, the auction will come to a close now.”", "As there were no additional bids after the first round, the auction ended earlier than expected. And soon, a Priest wearing a white robe walked out.", "“I will announce the result.”", "While this was normally the most tense moment of the auction, most people looked bored. How could they not lose interest when they already knew who the winner would be?", "“The organization to be in charge of managing Thursday, March 22nd, 2018’s Neutral Zone is…”", "The Priest also announced the result without dragging it out unnecessarily.", "“Eva’s Valhalla.”", "Seol Jihu grinned as he watched with his chin resting on his hands.", "‘We bought a gold stamp.’", "It was truly an obvious result."]}