{"cid": "87", "title": "Chapter 87. Strange Bedfellows (2)", "content": ["As far as the location of the Delpinion Duchy was concerned, one could say it was right next door to the Haramark Kingdom. The laboratory itself was located in the far northeastern edge of the Duchy's territory, and it wasn't all that far from Haramark's own borders.", "It was a great stroke of luck that Seol Jihu got to escape alongside Teresa Hussey. She may not have been an Archer, but thankfully, she was rather well versed in the local topography, and there was no need to worry that they would head in the wrong direction.", "“We don't have a lot of time left.” ", "She proposed that they take the shortest route to the Arden Valley. It was located in the border region so it was close. More importantly, there was the Arden Fortress as well. Since there was a new structure under construction, it was stocked up with plenty of supplies, and due to the previous incident, powerful combat forces were stationed there as well. ", "Teresa recommended that they march there, saying that if they walked non-stop, they would reach their destination as early as on the fifth day, or at the latest, the sixth.", "*", "Their first day was trouble-free.", "Although it was only the periphery, Seol Jihu still got to see what the regions controlled by the Parasites looked like. The assessment he gave after walking the whole day? A 'dead world'.", "Not a single hint of vitality or life could be seen. The ash-colored soil touching the soles of his feet were beyond the state of crumbling and now was as hard as a rock. All the blades of grass he saw were yellow and dried up. On the rare occasions when he saw a tree, they were thin and desiccated as if they were an apple gnawed on by a rat.", "Teresa warned him not to carelessly touch anything, just in case. But she also added that the condition in the Delpinion Duchy was actually comparably better than elsewhere. She said the changes to the conditions of the Empire, now serving as the center of the Parasites, couldn't even be imagined and let a sigh escape from her lips.", "Seol Jihu decided to concentrate on walking, instead. He simply wanted to get the hell out of this place as soon as he could.", "*", "Around the time when the second day came to greet them.", "He added one more item to his assessment. The changes in the temperature during the day and night were extreme, to say the least.", "When the evening came, the temperature dropped like a rock. It was too damn cold. Whitish steam escaped whenever they opened their mouths.", "As the night deepened, the coldness grew heavier. It was so cold that, for the first time in his life, Seol Jihu experienced the phenomenon of failing to fall asleep because of the coldness.", "Back when he was in the military, he had to participate in winter wilderness training that took place in the middle of a frozen mountainside. But even that wasn't as cold as this. ", "Not only did the chilly air seep into his body, but it also seemed to be gnawing at his bones and digging up his bone marrows. He even had a hallucination of suffering frostbite and watching his toes fall off by themselves.", "During the dawn of that night, the two of them desperately huddled together without knowing who started it first. They had no choice. In front of the real need to survive, things like embarrassment or honor were readily thrown out the window. ", "Seol Jihu’s teeth clattered by themselves from the bitter cold, but he forced himself to close his eyes and rest.", "He was on the brink of going insane. The sole ray of comfort was the faint warmth transmitted through the skin pressing against his, and the soft sensations wrapped around his neck and back.", "*", "Third day.", "Teresa continued to encourage the young man by saying that they were almost there, that they only needed to push themselves just a bit more. Seol Jihu knew that she was going through an even harder time than he was, so he did his best not to show his struggles.", "Unfortunately, the feared event had come to pass around midday. For the first time during this journey, his Nine Eyes returned a yellow color in the distant horizon. Considering that they were still within the enemy territory, there was a good chance that the color would become even more severe.", "'What should we do now?'", "While he stood there deliberating, the yellow-colored region suddenly widened in scope. No, should he say that it was actually approaching closer? Soon, the yellow hue changed to orange, then morphed to crimson red almost in an instant. Seol Jihu freaked out and hurriedly grasped Teresa's hand.", "“Princess!” ", "“Y-Yes?”", "“We need to retreat, right now.” ", "“Retreat?!” ", "Teresa formed a puzzled face of someone asking, “What are you talking about?”", "He was pressed for time, so he simply dragged her along and hid behind a huge boulder. She remained puzzled, but her expression hardened soon enough after hearing the buzzing of beating wings. Seol Jihu pointed upwards.", "“….Oh, god….” ", "Teresa's eyes grew as large as a pair of large bells. Strange flying lifeforms covering up the sky like a swarm of locusts were rushing in their general direction. As if they were merely scouting the area, the swarm circled around once and rapidly flew west.", "They never thought this would be easy, but now that they saw what they were up against with their own two eyes, well, this was well beyond their expectations.", "“….I made a mistake.” ", "Teresa muttered in a daze.", "“I figured that, with the laboratory gone, there would be no patrols around the border region….” ", "It was the exact opposite. Their numbers had increased far more.", "“…Still, let's continue on.” ", "Seol Jihu grasped the rudium hanging around his neck. Only about the size of a fingernail was left, but still, it was there and he could use it.", "“From here on, let me take the lead.” ", "He also decided to leave Nine Eyes on all the time.", "Teresa sneaked a glance at him. Just how did he detect the approaching enemies? He wasn’t even an Archer.", "Her curiosity was roused up, but instead of asking, she simply nodded her head.", "*", "Fourth day.", "Their water finally ran out. They were already injured to begin with, and now that they were on a forced march as well, their bodies demanded to be rehydrated more often than usual.", "At first, they took small sips to wet their throats if the thirst grew too much. But that meant their water supply got reduced far too quickly, so they agreed to spit back into the canteen after sloshing it around within their mouths. And eventually, they stopped at wetting their lips and that was it.", "They tried so hard to conserve their water, but in the end, the bottle ran dry. Now they really had nothing left to eat or drink.", "“This sucks….” ", "Teresa smacked her lips unhappily for a little while before telling him that she'd be back in a few. She soon returned and handed the canteen over to him, which issued the trademark sound of liquid sloshing inside.", "“Here you go.”", "Seol Jihu was about to ask, ‘What kind of magic did you just cast?’ But then…", "“Seol, you should do your business in the canteen, too. Don't waste it.” ", "“Eh?” ", "“Piss. You know, piss.” ", "…He freaked out from her following words.", "“P-Pee?” ", "“…Stop looking at me like that.” ", "Teresa's cheeks reddened slightly, but her words remained firm and resolute.", "“If we want to continue living, for the time being, we have no choice but to drink this.”", "“Still… I don’t think it’s very good for your body….” ", "Seol Jihu formed an unwilling expression.", "“Of course it's no good. Having said that, the first piss is probably the most tolerable of the lot. It's not as bad as you think to drink.” ", "“…Sounds like you've got experience in this.”", "“Yes.” ", "Teresa admitted to it without any hesitation.", "“Was it back when I ran away from the Capital? I was wandering around the desert all alone, and I was really thirsty, so…. I pissed, I drank that, then I pissed again, drank that….. Well, that's how I survived, anyway.” ", "“….”", "“It's not something you can continue doing, though. At the end of repeating that cycle, I just couldn't drink it anymore.” ", "While inwardly being dumbfounded by her drive to survive, he formed a fed-up expression.", "“In any case, I won't force you to drink it. Even then, don't pee on the ground and waste it, okay? Let me drink it, instead.” ", "Since she came out like that, he had no choice.", "In the end, he had to relieve himself by taking aim at the small mouth of the canteen. Grasping its warm exterior left him with somewhat dirty and complicated emotions.", "'How much further do we need to go?' ", "The sun was up high in the sky, but the day was gloomier than he thought as if thick clouds had rushed in. Seol Jihu sighed as he stared at the darkened sky.", "*", "Fifth day.", "Their walking speed had plummeted to a crawl. It was because the appearances of the Parasites had become far more frequent now. Every time that happened, they had to hide or hurriedly go in another direction. In some cases, they even had to go back the way they came from.", "Unfortunately, they had to tread on this path if they were to reach Arden Valley. When they really had no choice, he used the remaining rudium.", "More and more things now required his attention and that naturally led to a decrease in their conversation. In fact, they were trying to conserve their energy by not speaking to each other. That's how exhausted they were.", "However, what made Seol Jihu despair the most was his 'Nine Eyes'.", "He forcefully carried on by telling himself that their destination wasn't far, but when he saw the riot of red color utterly dominating his view by the foot of the valley, he almost broke down mentally.", "'This…. Should we even attempt this?' ", "He was suddenly overcome with an inexplicable deja vu. Didn't he go through a similar sort of experience back in the Neutral Zone? Back when he took on the 'Impossible' mission. The moment he walked past the dense forest, the red color instantly morphed into black. From 'Immediate Retreat Recommended' straight to 'Escape Immediately'.", "Seol Jihu felt conflicted. He had rudium as well as his Nine Eyes. No matter how optimistically he tried to analyze the situation, though, there was only one inevitable conclusion waiting for them at the end. They enter the valley, they die.", "“I guess the Parasites haven't lowered their vigilance yet.” ", "When he stood around unable to say anything for dozens of minutes, Teresa roughly figured out what was on his mind and tried to console him.", "“We shouldn't have come here to begin with….”", "She softly muttered to herself, but Seol Jihu forced his head to barely move from side to side. Teresa's idea was logical. This was no one's fault. No, they knew there was a risk of things playing out this way.", "Their current problem had to do with the encirclement; rather than disappearing, it had become even heavier than before and that meant they couldn't advance even though the valley was right in front of them. All the bloody hardships they went through were for nothing.", "Seol Jihu finally managed to open his lips.", "“What… should we do?”", "Teresa couldn't immediately make her reply. Inwardly, she wanted to recommend that they go in and risk everything. No, she thought that he'd really do it if she said it out loud first. That was how undecided Seol Jihu looked to her.", "However, there was something she grew to be sure of on their way here. And that would be about this young man possessing some kind of unknown ability. Without it, there was no way they would have avoided running into Parasites to this extent. So, if he was stuck in such a deep pit of dilemma, that could only mean one thing….", "Teresa also felt reluctant, but that didn't mean they could simply waltz right in. It was just that her body was almost pushed to the edges of a cliff, and she simply couldn't make a logical decision. ", "What would she have done under normal circumstances? When she thought about it this way, an answer arrived immediately.", "“Let's go back.” ", "With some difficulty, Teresa spoke up her opinion.", "“We don't need to go through the valley necessarily. I'm sure there are openings somewhere else.” ", "Seol Jihu dazedly turned around to go the other way.", "*", "Sixth day.", "They had picked up pursuers. He couldn't be sure, but he still got this strong feeling that they did. His Nine Eyes would constantly warn him whenever he tried to take a short break. It was the same story during the march too. It was as if the pursuers had picked up on their trails and were chasing after them.", "Eventually, they were discovered by the flying lifeforms chasing after them like crazy. He hurriedly used the rudium and avoided falling into the absolute worst situation, but….", "“….”", "….It was gone. Leaving behind only a slender smoke, the final bit of rudium was gone. One of their most powerful protections was no more.", "Their march had become a lot harder as a result. They couldn't risk walking on wide-open plains and had to walk on rugged terrains with many places they could hide. Their sleep had become very short naps, and they had to take them alternatively. They knew they would die if they lowered their guards even for a second.", "All they could rely on was Seol Jihu’s Nine Eyes.", "*", "Seventh day.", "They stopped talking. Not a word was exchanged between the two of them. No one asked where they were going nor did they volunteer to offer that information. Seol Jihu used his Nine Eyes to watch the surroundings like a hawk, and Teresa Hussey simply followed him from behind in silence.", "Eventually, they reached their physical limit. No, perhaps it was far more correct to say that their limit had been reached a couple of days ago. The knowledge of the Arden Valley being so close by managed to suppress their limit, but the moment they changed their direction, everything exploded out like water gushing out of a broken dam.", "He no longer felt any connection to his left shoulder. It was the same story for his right-side waist. His wounds had festered and yellow-ish puss leaked out. They itched and burned as sunlight relentlessly pounded on him.", "He also came to realize that, although it was bitterly cold during the night, the daytime was incredibly hot in reverse. Under the uncaring glare of the sun, it felt as if their flesh was being cooked alive. Even worse, not a drop of sweat showed signs of coming out.", "“Cough, cough….” ", "Seol Jihu heaved and coughed dryly. His entire body felt heavy. Not only on his skin, but even his innards seemed to be filled with bubbling rusty liquids. It wasn't all that surprising for serious internal injuries to develop after spending so much time in the land with such a pronounced difference in temperature.", "That wasn't all. Perhaps because he had been using Nine Eyes for too long, he felt a dizzying sensation assault him. It felt like a knife was busy stabbing and scooping out his brain cells.", "However, the hardest thing to endure wasn't the pain. It wasn't even the persistent pursuit by the Parasites, either.", "No, it was the damn hunger and thirst. The thirst was painful enough to nearly kill him. He followed his instinct and let his tongue lick his lips, but all he could feel was rough, cracked skin. His throat was so parched that it felt like it was on fire.", "He wouldn't have given a damn even if his throat was torn into pieces as long as he could drink a can of ice-cold Coke at this moment.", "Seol Jihu hurriedly bit into his ice spear. The cold aura emitted strongly by the weapon helped to cool down his mouth, but that was just about it. No matter how hard he sucked, the spear didn't want to melt. He dejectedly lowered the spear.", "Teresa had been wordlessly watching him and pushed the canteen at him. He slowly shook his head. He already tried to drink three or four times before but ended up wasting his energy after retching his head off. Once, he succeeded in taking just one mouthful but had to spit it out in the end. There was nothing he could do when his stomach violently resisted against drinking that.", "'Water…. Water….' ", "The young man bit his spear again.", "*", "Eighth day.", "Seol Jihu walked, his gaze staring fixedly at the ground. He walked, staring only at Teresa's calves shining gold.", "Perhaps because he had not slept properly in days, drowsiness was relentlessly assaulting him. The inside of his head was numb. His body didn't feel like his. He consciously blocked out all sensations and continued to trudge forward without a plan.", "And so, as he continued to march in this state of no thoughts or feelings, Teresa's legs suddenly 'went' upwards in his view.", "'Uh?'", "For some reason, his body felt much more comfortable. The crumbling soil pressed against his cheek felt softer and cushier than any bed he'd been on.", "'….What's this…?' ", "Abruptly, he heard someone talk to him. He felt the sensation of his body being shaken around.", "“You gotta wake up!” ", "Wake up? That's weird. I haven't blacked out, you know.", "“I'll help you up.” ", "His line of sight automatically rose up. It felt like he was being dragged up by force. Only then did he realize that he had collapsed on the ground.", "And he also could see something quite huge in the distance. Seol Jihu continued to silently glare with his blurry, unfocused eyes.", "'What… is that…?' ", "“Seol, that's a mountain. A mountain.”", "'A mountain….? Mountain… Uh…? What is… a mountain…?' ", "“We've arrived at the foot of the mountain range!! If we cross that….!”", "'The mountain… crossing…. a mountain?'", "He dazedly looked on without any response, and Teresa Hussey observed him with worried eyes from the side. She couldn't see any hints of emotion beneath his half-closed eyelids.", "“Ah….” ", "About ten seconds later, Seol Jihu opened his lips.", "“A mountain…. mountain…. Right…. a mountain….” ", "He murmured over and over again, but then….", "'The … Did I… switch Nine Eyes off….?' ", "….A frown formed on his brows.", "'Why can't I see any color….?' ", "Seol Jihu tried to force his legs to take unsteady steps forward. Unfortunately, he collapsed again after barely making it past the foot of the mountain range.", "“Seol!!” ", "Teresa hurriedly approached him. His face clearly expressed his confusion regarding why he fell like that.", "“Hah… hah, hah….”", "“Are you alright? Should we take a short break?”", "“N-No….”", "Seol Jihu used the spear as a walking stick and staggered back up. Teresa tried to stop him.", "“This won't do. Let's take a break, even if it's only for a short while. If we continue on at this rate….” ", "“No, I can… still walk….” ", "Pahng! The sound of air exploding suddenly resounded out. He had activated the Festina Earring.", "“Look…. You see…” ", "He formed a soulless smile and shifted his legs. He seemed to be walking forward without many issues before falling back to the ground again.", "“Uh….?” ", "Seeing him flounder about and babble on incoherently like that, Teresa Hussey began chewing on her lower lip. His breathing was rough, his skin boiling hot. It was obvious that his body couldn't endure anymore.", "There had been small hints throughout the march. Actually, him being able to endure up until now could be seen as a legitimate miracle. Most average people would have crumbled in defeat in less than four days.", "Yet, Seol Jihu managed to last eight days, twice the average, with a grievously wounded body, being pursued day and night, and worse still, unable to eat or drink.", "As a human being, one would naturally have his limits. Even if he was blessed with a tough physique and mana built up through a harsh training regime, he wouldn't be able to hang on forever.", "Teresa dragged the unmoving young man and laid him down in between the several boulders jutting out from the ground.", "“Stay here for a little while, okay?” ", "“….”", "“I'll go and look for something to eat or drink. Even if it's tree sap.” ", "By the time he regained his wits, the Princess was nowhere to be seen. Only the canteen and the spear lying on the ground were keeping him company.", "He remained lying dead still like a corpse before forcing his upper torso to sit up. He dearly wished to stay down and black out, just like that. He thought that, if he was unconscious, at least he'd not suffer through this hunger and thirst for a little while. However….", "'I can't drag her down anymore.' ", "….Unless he was by himself, it'd prove to be a huge inconvenience for her to blackout when they were supposed to be moving together.", "'I gotta stand up….' ", "In order to do so, though, he needed energy. He needed to give his body nutrients so it could move again. Just one sip of water, and he thought he'd be able to get going again. It was at this moment that the canteen entered his eyes.", "“….”", "Seol Jihu gingerly reached out to it.", "'It's not dirty.' ", "Regardless of what, this 'liquid' was expelled from human bodies. His trembling hands popped the top off and tilted the canteen over his lips. Now-cooled liquid dribbled down. Gulp, gulp…. He forced himself to swallow twice, and almost immediately, his brows furrowed violently.", "“Wuup…. Wuuuook!!”", "Accompanied by a fit of heavy coughing, he began vomiting right away. He supported his weight with both of his hands and retched over and over again. He knew that he was being pathetic, but no matter what he did, he just couldn't get used to the acrid stink unique to human urine.", "“Keuh, heuh….”", "Once his gagging reflex came to an end, he began sobbing next. However, there were no tears.", "Honestly speaking, he wanted to break down and cry several times during his journey here. He didn't want to make her worry with a display of how badly he was suffering, so he held everything back. But now that he was left alone, the uncontrollable crying erupted out.", "'Compromise, my ass….'", "He'd been often thinking about this during the march. He thought that he shouldn't have come and that he threw his idiot self into this trouble. He should have listened to others when they tried to dissuade him. But when his thoughts reached there, he began hating himself. He felt like a pathetic loser.", "“Keuk…. Kkeuh….”", "His lips were sobbing, but neither tears nor snot came out. It seemed that there was not a drop of moisture left in his body.", "He gasped and gagged for a long while before gritting his teeth. Perhaps due to all that retching and sobbing, his once-hazy mind had regained its lost focus.", "'I gotta endure.' ", "His innards tumbled ceaselessly, but he still bit into the spear shaft. He planned to conserve as much strength as possible and leave right after Teresa Hussey returned.", "“….”", "However, she didn't want to come back no matter how long he waited.", "'Could she…' ", "Did he get left behind? His thoughts briefly reached there, but he immediately threw that notion away. Teresa wasn't someone like that… But, even if she did leave him behind, there was nothing he could say about that, really.", "'I gotta remain sharp.' ", "He decided to wait for a little while longer and activated his Nine Eyes.", "'Mm?'", "Only then did he finally realize that something was wrong. He couldn't see any color. The mountains were completely 'colorless'. ", "It was then.", "Rustle, rustle….", "Everything had been quiet until then, but he could now hear the sounds of dried leaves being stepped on. He tried to get up, thinking that it was Teresa but stopped abruptly. There was more than one footstep.", "He slowly scanned his surroundings and almost bit his tongue. The mountains were still colourless, but the yellow color was slowly approaching him from behind.", "'Parasites??' ", "Again. These things were pursuing him again. He just couldn't figure out how they were able to sniff out his traces, but nonetheless, what disgusting persistence this was.", "Eventually, the yellow color drew closer and closer until it began lazily encroaching past the jutting boulders. Seol Jihu grasped his ice spear tightly and crouched his body as much as he could.", "'Keep going…. Keep going like that….' ", "He fervently prayed in his heart, but then, the footsteps came to an end. He unconsciously held his breath. A choking silence suddenly descended.", "Sniff, sniff….", "There was the sound of something sniffing the air, and then…", "Woof, woof!!", "Out of the blue, he was greeted by the sounds of some things barking angrily.", "Tap, tap, tap, tap!", "And then, there was the unmistakable presence of several things quickly running towards his location. Instinctively realizing that things had gone very wrong, he raised his body up.", "If he were to be honest, he dearly wished that these things were just some wild wolves.", "'Hah.'", "Unfortunately, what revealed themselves were a group of Parasites. They consisted of six never-before-seen mummy-like humanoid things with mud continuously dripping off, as well as four wolves infested with maggots.", "'And the Princess isn't even here….'", "“….”", "Seol Jihu lifted his head up and stared at the sky, even though there were enemies in front of him. That was how great the despair he felt right now.", "'Just… die?' ", "For a moment there, he was really tempted by the idea. He somehow managed to force himself up, but he didn't think he'd win against these things. So, rather than wasting more energy and suffer more pain, why not cleanly stab himself in the neck and be done with it? Wouldn't that be better?", "[Even then, I'd like to do everything in my power to survive.]", "It was then, words uttered by someone entered his brain. No, it wasn't someone, but he himself said that.", "[Let's go back home alive.] ", "Once he remembered Teresa, the temptation dissipated.", "'Alive…?'", "The moment he lowered his gaze, his expression vacant and distant…", "'…That's right.' ", "…His dried, cracked lips were firmly squeezed shut.", "From the beginning, there ever were only two choices for him – either run away or fight. It didn't matter which one he chose, he simply didn't want to die without a struggle.", "Even if he did die here, taking one out with him would decrease the burden on Teresa’s escape later. When his thoughts reached there, his courage level shot up by several levels.", "Cough! He dryly coughed out. His eyes itched and ached. Just holding the spear made it feel like his arm would fall off at any second. His stamina had hit rock bottom a long time ago, so it was impossible to jump around and fight in a cool manner now.", "Despite all that….", "…Seol Jihu still made a move. He didn't even consciously think of doing this, yet his right hand grabbed his left and placed it on the spear shaft. Then, the right hand grasped the bottom of the weapon. The spear unsteadily wobbled about. Just like that, he lifted the tip of the spear and took aim at his front.", "'If it's just one time.' ", "Kiiiieeehh-!!", "With a loud screech, enemies powerfully pounced on him. And he too thrust forward very naturally, as well.", "Whoosh!", "He scrounged up every ounce of power he had and performed the 'Thrust', the one he trained for hundreds of thousands of times back in the Neutral Zone.", "Now freed from all thoughts and feelings, he stared in trance at the enemy rushing at him and threw out his final attack.", "In an instant, the claw-like arm reaching out and the extending spear sharply exchanged attacks."]}