{"cid": "316", "title": "Chapter 316. A Tiger Father Does Not Beget a Dog Son (1)", "content": ["There were sixteen expedition members in total— eighteen if Flone and Little Chick were included. The group borrowed three carriages to comfortably seat everyone.", "The carriages were waiting for them near the castle gate.", "After Seol Jihu directed Agnes, Kazuki, and Hoshino Urara to separate carriages, he himself headed for the first carriage.", "\"Representative.\"", "Just as he opened the door and was about to get aboard, Kazuki called out to Seol Jihu.", "\"Yes?\"", "\"There….\"", "Kazuki pointed towards a certain direction with his finger. Seol Jihu reflexively followed the finger before tilting his head.", "Kazuki’s finger pointed towards an alley covered in the morning fog, but Seol Jihu couldn’t see anything that was out of place.", "\"What about there?\"", "\"Hmm….\"", "Kazuki paused for a second before shaking his head.", "\"Nevermind. It was nothing.”", "\"Should we check it out?”", "\"I don’t think there’s a need to delay our departure to investigate it. I must have been mistaken.”", "\"That’s new. For Mister Kazuki to make mistakes.”", "\"Perhaps I’m a little nervous. Sorry.”", "Seol Jihu shrugged his shoulders before boarding the carriage.", "Kazuki gazed at the alley for a few more seconds before quietly getting in and closing the door behind him.", "A moment later, the carriages began to move at the sound of the coachmen’s whips.", "The three carriages passed through the gates and quickly disappeared beyond the white fog.", "And then.", "\"…\"", "When the last carriage was out of sight, a person appeared from the alley. It was a small girl wearing a hood over her blond hair that spilled over her shoulders.", "The girl walked out of the alley.", "She silently stood at the place where Seol Jihu and Kazuki had exchanged their conversation. The girl repeatedly opened and closed her lips as if in regret, but no words came out from her mouth.", "She repeated these meaningless actions before turning back, unable to say anything in the end. The place where the girl with drooping shoulders headed to was the royal palace.", "\"Did you see them off?\"", "The moment she entered through a hidden entrance in the garden that only she knew about, an old voice called out to the girl.", "The girl flinched before she found an old man stiffly standing next to the entrance.", "\"K-Kühne.\"", "\"So did you get to talk with Representative Seol?”", "The girl, Charlotte Aria, hung her head.", "Guessing her answer from just her hesitating behavior, Sorg Kühne clicked his tongue.", "\"It would have been good if you had at least said goodbye.”", "His tone wasn’t as nice as his words. He couldn’t help it.", "Of course, a queen had no obligations to see people off every time they left the city.", "However, it wasn’t a typical expedition this time, but an actual war masked as an expedition. They were headed to the Spirit Realm, risking their lives in order to save all of Paradise.", "Consequently, seeing the queen shut herself in her room made it hard for him to view her in a good light. Well, she did sneak a look…", "\"But…\"", "After a long silence, the hesitating Charlotte Aria finally spoke up.", "\"If I told them to come back safe… to return without fail… and if something wrong happens again…”", "\"Yes?\"", "\"If they don’t ever come back like brother Campbell and Evangeline Rose…”", "Sorg Kühne’s face became dazed. At the same time, he realized why Charlotte Aria had refused to grant them an audience all this time.", "The day Campbell Aria had left for the battlefield, Charlotte Aria had bid her brother farewell with tears.", "However, he didn’t return alive.", "The day Evangeline Rose told her she had to attend the Banquet, Charlotte Aria begged her not to go.", "However, Evangeline Rose had insisted that it was necessary for the future of Paradise, and she, too, couldn’t come back.", "Sorg Kühne recalled the last days of the few people whom the queen had opened her heart to, and he couldn’t help but smile bitterly.", "He could finally understand what the queen had been feeling.", "She must have felt uneasy, thinking, ‘What if they don’t return if I bid them farewell as I did for the previous two?’", "And thus, she ironically didn’t meet them in hopes for them to come back at all costs.", "Others might snort at her ridiculous actions, but at least Sorg Kühne understood her desperate heart.", "Charlotte Aria was young.", "She was still a lacking and inexperienced queen, unable to walk out from her guardian’s shadow. That was why it wasn’t so farfetched for her to believe in a baseless jinx in hope of their safe return.", "\"The morning air is cold. Please hurry inside.”", "Sorg Kühne bowed and was about to turn around when Charlotte Aria suddenly called him.", "\"Kühne.\"", "It was still a quiet voice as ever, but it sounded clearer this time.", "\"Seol Jihu… will return… right?”", "The public administrator paused before staring at the anxious Charlotte Aria.", "\"I… I am… worried.”", "\"…\"", "\"I’m not sure if I can just wait for him to come back… Maybe it’s because I haven’t done anything all this time, maybe because I didn’t help them in the slightest and just waited for them… that my second brother and Rose didn’t come back…”", "A glint flashed in Sorg Kühne’s eyes.", "\"May I ask why you suddenly had this thought?”", "Charlotte Aria shut her mouth. It looked like she had something she wanted to say but was holding it in.", "Sorg Kühne slowly approached the queen and knelt on one knee. He matched her eye level and softly clasped his hand around her constantly fidgeting hand.", "\"Your Majesty.\"", "He continued in a voice that said he knew everything and understood everything.", "\"Your Majesty wishes to help Representative Seol, don’t you?”", "Charlotte Aria carefully nodded her head.", "A smile surfaced on Sorg Kühne’s wrinkled face.", "\"That is enough.\"", "\"Enough?\"", "\"We have already talked with Representative Seol about many things in advance, and the preparations are already underway.”", "\"Oh…\"", "\"Your thoughts, your intentions, and your words alone are enough. Please entrust the rest to your servant.”", "\"…\"", "The usual Charlotte Aria would have said, ‘R-Really?’", "Since she didn’t have the ability to help, she would just leave it to her capable public administrator as if it couldn’t be helped.", "But for some reason, this time, Charlotte Aria didn’t back down so easily.", "[Listen carefully to what I am about to say, Charlotte.]", "Roselle’s advice, which she had heard back in the Dream World, brushed past her mind all of a sudden.", "Charlotte Aria tightly clenched both her fists and gritted her teeth.", "\"…No.\"", "She looked upset and angry at the same time.", "\"I… I also…!”", "\"Your Majesty?\"", "Sorg Kühne’s eyes widened.", "*", "The carriage was quiet during the entire ride. Saying, ‘Let’s do this’, had a completely different feeling than actually doing it.", "Once they left Eva, everyone maintained silence without meeting each other’s eyes. Each member seemed to have a lot on their mind.", "Seol Jihu looked around the carriage, feeling apologetic for dragging everyone into yet another difficult mission, before fixing his gaze on one person.", "It was Baek Haeju who was riding on the same carriage as him.", "She had her eyes gently shut like she was quietly thinking to herself. It was amazing how she remained completely still despite the rattling of the carriage as it drove over the winding roads.", "\"…\"", "It would have been normal for her to open her eyes after feeling his gaze, but Baek Haeju didn’t show even the slightest movement from her straight posture.", "'The Nine Eyes isn’t working on her either…’", "Perhaps it was because she received Divine Vestige, but he couldn’t see her Status Window or her color, the same way he couldn’t for the Executors.", "There weren’t just one or two things he was curious about, but Seol Jihu didn’t insist on asking her about them. It was partly because it could be rude, but it was more because she gave off an unapproachable air.", "Despite this, she did express her interest just once since she was still human.", "\"Thank you, Partner.”", "It was when Little Chick spoke to Seol Jihu.", "\"For what?\"", "\"You’re doing your best to help the Spirit Realm. As a Spirit myself, I should thank you.”", "\"You spoke like it didn’t matter before.”", "\"That was because I prioritized my mission. The Spirit Realm is where I was born and raised. How can I not be worried?”", "\"Oh.”", "\"That’s right. In any case, I will help you as much as I can this time around. Those little bastards. How dare they…”", "Seol Jihu chuckled, finding Little Chick adorable as it schemed while fluttering its tiny wings.", "\"What do you think you can do when you’ve just entered infancy?”", "\"Heh. You know nothing.”", "It would have normally burst out in a fit of rage, but Little Chick proudly jutted its chin up.", "\"You would be right if it was the Middle World, but it’s a different story if we’re in the Spirit Realm.”", "\"Ooh, really?\"", "\"Of course! Well, it’s only under the condition that the Spirit Kings are all safe, but…”", "Seol Jihu, who was watching the murmuring Little Chick in a new light, suddenly looked up.", "Baek Haeju, who had been silent the entire time, was staring at Little Chick with her eyes open.", "'Does she like animals?’", "Her slightly widened eyes suggested she was interested.", "Seol Jihu pondered for a bit before gently picking up Little Chick, who was putting on airs and boasting about itself.", "\"W-What? What are you up to now?”", "Seol Jihu presented the struggling and chirping Little Chick to Baek Haeju.", "\"This guy might look like a baby chick, but he’s actually a mythical beast.”", "\"I am the Arcus Spirit!”", "\"Do you want to try touching it? It’s alright.”", "Baek Haeju seemed to accept Seol Jihu’s offer. With glittering eyes, she carefully extended her hand.", "\"Pyak!\"", "But she ended up drawing her hand back in a hurry as the punk called Little Chick pecked at the approaching hand.", "\"Prrrrrrr….\"", "It even opened its beak wide to growl at her.", "\"W-What’s up with you?”", "\"Who said you get to decide who can touch me!?”", "Seol Jihu asked while startled, but Little Chick became angry in response.", "\"How dare you! Even the Spirit Kings don’t dare to touch this body of mine…!”", "Seol Jihu looked dumbfoundedly at the humiliated Little Chick.", "\"What, a little touching won’t hurt.”", "\"Says who?\"", "\"You stayed still when Yuhui Noona touched you.”", "\"That person is different!”", "Little Chick glared at the blinking Baek Haeju after venting its anger.", "\"I don’t like this person.”", "\"Hey, that’s not nice! She came all the way here to help us!”", "Seol Jihu scolded it, telling it to apologize to her, but Little Chick only kept snorting.", "\"Hmph! I don’t know what scheme she has, but I refuse to talk with a cult member.”", "Baek Haeju’s expression stiffened.", "\"What did you say, punk? A cult?”", "\"It’s a cult since the fundamental dogma is different. Come back after taking off your mask. Then I’ll allow you to touch me.”", "Little Chick swung its head away like it was done talking before squirming back into Seol Jihu’s pocket.", "'Cult? What’s that about?’", "In any case, Seol Jihu jabbed at his pocket since Little Chick made the situation worse, but it refused to yield.", "\"I-I’m terribly sorry. This punk has a bad attitude…”", "When he looked at Baek Haeju to apologize, he found her not looking at him. She had gone back to closing her eyes at some point, pretending as if nothing had happened.", "*", "After exactly seven days since they left Eva, the carriages arrived at their destination.", "It was a region closer to Haramark than it was to the Federation— a borderland if it could be called as such.", "When they marched for half a day with Hoshino Urara leading the way, they came to a place where the topography drew the middle line between a plain and a mountainous region.", "After crossing the hilly plains with its small hill-like slopes and winding valleys, they could see the sight of a low basin leading down from the peak in the far distance.", "As chaotic as Hoshino Urara was, she was still an Earthling who faithfully fulfilled her promises.", "\"Aaah~ What fresh air~”", "Prancing up to the peak, she shouted while pointing below her.", "\"It’s there!\"", "Seol Jihu, who hurriedly followed her up, couldn’t stop marveling at the sight below him.", "The basin was densely packed with bamboo that was as thick as a finger with a heavy fog hovering over it.", "But the important point wasn’t the landscape. While everything looked normal at first glance, Hoshino Urara, who was pacing around back and forth and carefully observing the scenery, suddenly commented with a rare, serious expression.", "\"Look over there. I told you I was right.”", "Seol Jihu gave a low exclamation.", "That wasn’t all.", "Everyone in the expedition team looked at the scene in front of them with a skeptical gaze. No matter what angle they looked at it, whether it was from the middle, from the left or from the right, the entire scene remained the same.", "Everything was still.", "It definitely looked like everything was on pause, but the basin seemed to follow their eyes and show them only the frontal view of the scenery as if it was alive.", "\"It’s definitely strange.”", "[Mhm.]", "Flone, who had been peering at the scene with only her head sticking out, remarked in an odd voice.", "[If it’s a lake or a spring, fine. But for there to be such a huge ocean at this height… It’s the first time I’ve seen anything like this.]", "Seol Jihu frowned.", "\"Wait.\"", "[Huh?]", "\"Flone, what did you say just now? An ocean?”", "[Yup. There’s an ocean in front of us. It looks really ominous with black water churning so grossly.]", "She looked too serious to be joking. But no matter how much Seol Jihu rubbed his eyes, he couldn’t see an ocean, not to mention a lake.", "\"What do you mean by an ocean? I can only see a forest of bamboo and fog.”", "[What are you talking about? Fog… Yes, I can see some fog, but where’s the bamboo forest?]", "Flone looked around.", "\"Don’t panic.\"", "Kazuki spoke up.", "\"You both are right. Only, the two of you are looking at different scenes. Think about your differences.”", "In other words, the scene in front of them appeared differently to the living and the dead.", "\"Then… should I think of that place as a fusion between an ocean and a forest?”", "\"…Well.\"", "Kazuki lowered his head.", "\"I’m not sure about that, but I’ve once heard something from Master Ian.”", "\"What did he say?”", "\"Even if two objects from different worlds are fused together, ordinary people will only be able to see the surface, and only a very small portion of the exterior, at that. That probably applies to us right now.”", "Kazuki continued his explanation.", "\"But he also said that if you could see both objects at the same time, you would be able to see how the two worlds were intertwined with each other.”", "Seol Jihu looked at Kazuki blankly as he raised a difficult topic again.", "\"Think of it simply. What do you think our insides would look like if you and I were fused together?”", "\"…I don’t want to imagine that.”", "\"Right? It definitely won’t be a pleasant sight.”", "After saying that, a trace of worry could be seen on Kazuki’s face.", "\"If the sense of incongruity we feel is this great, I wonder what that Priest is feeling …”", "Suddenly, a clamor was heard from the other side. Seol Jihu’s expression sank when he reflexively looked back.", "As the saying went, be careful what you wish for.", "Oana Halep was lying on the floor.", "\"Oana! Oana! Get a hold of yourself!\"", "\"Heuk—! Heeuk—!”", "Vlad Halep shook her body as he cried out to her, but her eyes rolled back. She looked like a person with epilepsy, as her eyes widened and her breathing became rapid gasps.", "Checking Oana’s condition, Seo Yuhui hurriedly shouted.", "\"Miss Maria! Cast Perfusion!”", "\"Huh? That’s a High Ranker spell… I’m still Level 4…”", "\"…Then how about Ventilation? You know that, right?”", "\"I do, but…\"", "Maria tilted her head but still obediently recited the spell.", "As a breeze mixed with white light entered her nostrils, Oana’s seizures gradually calmed down.", "\"It’s okay, Miss Oana. Everything is okay, so focus on this.”", "Seo Yuhui shined a small light at the end of her finger and held it above the center of Oana’s eyebrows. The young girl whose eyes had been wildly rolling around finally regained her consciousness.", "\"Can you hear my voice?”", "\"Huk— Huk—\"", "\"Breathe in, breathe out. Breathe in, breathe out. Slowly.”", "\"Heu, heua, ehu, huu—”", "Oana gulped.", "A moment later.", "The young girl blankly gazed at the people staring down at her before…", "\"Euuaaaang.\"", "…She burst into tears.", "\"It was scary… It was so scary…”", "\"It’s okay, it’s okay.\"", "\"I’m sorry, I’m sorry… I’ve never seen anything like that… It was just so bizarre and grotesque… and too agonizing to look at…”", "Seol Jihu clenched his teeth looking at Oana endlessly sobbing in Seo Yuhui’s arms.", "Oana Halep was someone who had lived her whole life seeing things that normal humans couldn’t see. Despite this, she couldn’t stand the sight of the scene in front of her and had gone into seizures.", "While he couldn’t be sure, he figured that she had seen something that transcended human imagination— something that was outside human reasoning.", "Seo Yuhui patiently waited for Oana to calm down before whispering to her.", "\"Can you perhaps tell us what you saw? You can draw it if it’s hard to explain in words. Don’t look over there, though.”", "Oana managed to nod her head.", "When Marcel Ghionea brought her a pen and paper, she struggled to sit up and started drawing.", "After 10 or so minutes, the pen fell from Oana’s hand.", "As Seo Jihu bent down to pick up the paper, the rest of the members huddled around him to look at the picture.", "Because she had a talent for drawing, Oana’s drawing was more detailed than they had expected.", "However, it would have been better if she hadn’t drawn so well. It was because everyone, without a single exception, frowned a moment later.", "Seol Jihu stared at the picture with narrowed eyes, looking at it as if it was the most absurd thing in the world.", "\"…What is this?\"", "Chohong, who had been looking at it too with her chin propped on Seol Jihu’s shoulders, stuttered.", "\"W-What is this? What is this fucked up drawing?”", "The title is a proverb in Korea (you may have heard something similar in Chinese novels). ", "Also, Happy Mother's Day!"]}