{"cid": "371", "title": "Chapter 371. Penance (2)", "content": ["“That’s it for today’s meeting.”", "Phi Sora, who was sitting cross-legged at the desk, loosened her arms.", "“I’m sure that by now everyone, including myself, knows that High Ranker skills aren’t easy to wield.”", "A total of four people were listening to Phi Sora. All of them were members of the first team placed under her command, discussing their future course of action in a private conference room.", "“I contacted Grandpa yesterday. He told me he’s planning to leave Haramark with Mister Yoo Yeolmu tonight, which means they’ll be here within six days at the latest. We’ll set out the day after they arrive, and they’ll accompany us on our trip.”", "To the spirit energy-filled volcanic zone beyond Mount Peléeom.", "Phi Sora first looked at Marcel Ghionea, who was nodding attentively and then turned her eyes to the girl with sunken eyes, yawning her head off.", "“As I said before, I’m out~”", "When their eyes met, Maria announced, smacking her lips.", "“Because I’m a priest. Do you mind?”", "“No, but will you be alright? I hear that place is where Lust Unni goes to pray.”", "“Holy power isn’t a problem for me. It’s the offerings. Damn it, all the useful spells require high-quality offerings….”", "“Don’t you have a lot of money? I know you’d rather bite your tongue off than spend it, but try to be a little flexible.”", "“I actually don’t have a lot. I invested in virtual currency and lost all my fortune.”", "Maria answered in a somber voice, and then suddenly frowned.", "“And recently it’s become harder to secure offerings. I went to the auction house in Scheherazade the other day but came back empty-handed. Apparently an anonymous Earthling wiped the house clean. I wonder who that piece of shit is….”", "Maria clenched her teeth, but what she just described wasn’t exactly a rare phenomenon in Paradise.", "As one’s level went up, the supply of items suitable for that level decreased, and the price of equipment always ended up skyrocketing. This was a common occurrence for any class.", "But competition was especially fierce among the priests.", "Although they were one of the rarest classes after the magicians, their use of holy spells was significantly influenced by how often they prayed or how many offerings they provided on a regular basis.", "Therefore, it was no surprise that a priest would try to stockpile as many offerings as they could, whenever they could.", "Anyway, Maria’s point was that she would like to skip training because her time would be better spent elsewhere.", "Her request made sense considering the nature of her class, so Phi Sora accepted it without much hesitation.", "“Okay. If you’re really having trouble, you should ask Team Leader Kim for help. If you’re uncomfortable asking her, I could ask her for you.”", "“No, that’s alright. I actually ran into her in Scheherazade, and she said she was really busy. She told me to wait.”", "“In Scheherazade?”", "Maria raised her eyebrows and blinked.", "‘What’s wrong with that?’ her face seemed to ask.", "Phi Sora’s eyeballs spun in a circle and her head shook from side to side.", "“Mm…. Anyway, I understand. You two can leave now. Miss Maria will act alone for the time being, and Mister Marcel Ghionea will prepare for the trip. As for you….”", "Phi Sora pointed her finger at the Yi siblings.", "“We need to talk.”", "The sound of a chair screeching against the floor rang out.", "Yi Seol-Ah, who had already stood up halfway following Marcel Ghionea and Maria, froze in place.", "She sat back down slowly, with a slightly anxious look on her face.", "“It’s nothing bad. Just that… What will you two do?”", "“U-Us?”", "Phi Sora closed her eyes slightly.", "‘Obviously I’m talking to you. No one else is here,’ was what she wanted to say, but she held it in.", "“Things are a bit strange because our team was formed right after you leveled up.”", "“…”", "“You’re welcome to join me on the trip… but haven’t you had enough training? With Grandpa.”", "“…”", "“Maybe it’s time for you to pick up some real experience. You’re both Level 3, after all.”", "She looked alternately at the two and smacked her lips.", "“What I’m trying to say is, maybe you two should work alone for a while.”", "“Do— Do you mean on an expedition?”", "“No, not on an expedition. How will you even form an expedition team? The rules have changed. Don’t you know that now only team leaders can arrange an expedition?”", "When she saw Yi Seol-Ah flinch, Phi Sora softened her voice again.", "“I’m saying that you should go out on an adventure. You can easily find someone to accompany you at the plaza or the pub.”", "Phi Sora’s lips twitched as she stared at the siblings, who were still silent.", "She wasn’t aware, but her nostrils were about to flare.", "She hated this. She hated these kinds of situations.", "Any time she gave her opinion, she expected it to be recognized.", "The other party didn’t necessarily have to agree with her. If they disagreed, fine, but speak your mind out loud, for God’s sake. Like Maria, for example.", "But these two, they were silent as the grave.", "Those who had no guts to speak up but complained later on, were the kind of people Phi Sora loathed the most.", "“Guys, say something. Are you just gonna do what others tell you to do until the day you die? You guys are official members of Valhalla, too. Don’t you have your own opinion? Hmm?”", "“…Okay, we’ll do as you say.”", "Yi Seol-Ah answered in a voice as small as a mosquito’s.", "Phi Sora still wasn’t 100% satisfied, but she decided to stop there.", "“Good. Grandpa also said that he has nothing more to teach you at this point and that you need real-life experience.”", "She let out a deep sigh.", "“Seol-Ah. Unlike your brother, you have some experience. Tell me if you need anything, and report to me before you leave. At least through the communication crystal.”", "Phi Sora came down from her desk and strode across the room towards the door.", "*", "The siblings began preparations that very day.", "They weren’t sure what to do because they’d never planned adventures together before.", "After spending hours in the plaza and the pub, they finally found a team willing to talk to them.", "They achieved this feat only by revealing that they were members of Valhalla. The problem was that the combination of Guard and Tracker wasn’t as popular as they’d hoped.", "The team that the siblings came into contact with consisted of one Level 4 Warrior and two Level 3 Archers, all of whom had been working with each other for a long time.", "Their leader, Sergei Romanchev from Area 2 Russia, looked troubled after talking to the siblings.", "“No experience at all?”", "“Just my brother. But he won’t disappoint you. I promise.”", "“How can he be level 3 if he has no experience? …Oh, right. You’re from Valhalla.”", "“Yes, yes. It was all thanks to the neutral zone.”", "“Fuck, I’m jealous. Anyway, if you’re in Valhalla, why are you out here looking for a team?”", "The question was spot on.", "Yi Seol-Ah didn’t know what to say.", "When Sergei Romanchev saw her speechless, his face began to harden in response.", "The man was large and tough-looking, and Yi Seol-Ah could almost feel herself dwindle under his stare.", "“Look. I don’t think we can work with—”", "“Romanchev!”", "Just as Sergei Romanchev was about to say something, a voice called him from behind.", "A skinny black man with dreads was gesturing for him to come over.", "Next to him was a white woman carrying a bow and looking at the siblings with disapproving eyes.", "“…Give me a second.”", "The large man turned around, delaying his answer that was most definitely a no.", "He talked to his teammates for a while and then returned to the siblings with a bright face.", "“Listen. We have a suggestion.”", "“Pardon?”", "“You said you belong to Valhalla, right? Can you bring one more member? Not kids like you, but an actual adult. A Level 4 is fine, but a High Ranker is better.”", "“I-I don’t know if that’ll work… I don’t think it will.”", "Yi Seol-Ah’s face turned sour.", "The expression ‘not kids like you’ made her realize what he was really after.", "“Can you at least ask? Hmm? Please?”", "But if she refused, he probably wouldn’t let her and her brother join his team.", "Backed into a corner, Yi Seol-Ah nodded reluctantly.", "“I guess I could ask….”", "“Great. Can you give us your answer today, or by tomorrow at the latest? We’re pretty busy ourselves.”", "“I’ll go ask now.”", "Yi Seol-Ah got up from her seat and turned around towards the door.", "“Huh? Hey, hey! Wait!”", "Just as she was about to leave with Yi Sungjin, she stopped and looked back.", "Sergei Romanchev was looking at her with a dumbfounded expression.", "“Where are you going?”", "“Pardon? But you said to go ask….”", "“Sure, but what’s with the hurry? What exactly are you gonna tell them? We can’t give you every detail, but don’t you have questions to ask us before taking off?”", "He meant to say that she should ask them at least the basic information about the trip, such as destination and travel distance.", "“You… Have you ever really been on an expedition?”", "The female archer asked in doubt.", "“…Ah, I forgot.”", "Yi Seol-Ah’s face reddened with embarrassment.", "She felt as if she was standing naked in front of them.", "*", "“Should I have been more persistent…?”", "Back at Valhalla, Yi Seol-Ah let out a deep sigh.", "They’d returned to the shelter, but were unsure about who to ask for help.", "“Don’t worry too much about it. Let’s just try our best, and if they still don’t accept us, we can offer to accompany them as porters.”", "“To be a porter at our level is a bit….”", "Yi Seol-Ah pouted.", "“Haaaa. He said he’d take us on an expedition….”", "Although she didn’t specify a name, Yi Sungjin looked around the room to see if anyone was eavesdropping on them.", "But Seol Jihu hadn’t left them out on purpose. The opportunity just never presented itself.", "Arden Valley War, Pagoda of Dreams Expedition, Eva Alliance Extermination, Spirit Realm Expedition, and Tigol Fortress War….", "Ever since Yi Seol-Ah joined, Vahalla had done things way above her level. And with each success, the members who participated became substantially stronger.", "The gap between her and the rest continued to widen, further isolating her from all opportunities.", "“What should we do….”", "The sound of a clap caught Yi Sungjin’s attention as he was looking left and right across the room.", "Yi Seol-Ah’s face, which had been gloomy up until a moment ago, was now bright as if she had some kind of a revelation.", "“We should ask Hugo Oppa!”", "“Hugo Hyung? Will that be alright?”", "“Of course it’ll be alright. Hugo Oppa is always so nice to me. And you’re close to him, too.”", "“Yeah… but we’re on different teams. Shouldn’t we consult Team Leader first?”", "“She’d just scold us some more. I mean, she already has all of her plans laid out.”", "Yi Seol-Ah shook her head.", "There was a part of her that refused to owe Phi Sora anything.", "Also, she was still not sure why Phi Sora recruited them for her team, and that bothered her.", "Because of her experience in White Rose, Yi Seol-Ah couldn’t help but suspect that their team leader was somehow trying to take advantage of them.", "“Let’s go. I’m sure Hugo Oppa will listen to what we have to say.”", "Yi Seol-Ah grabbed Yi Sungjin’s wrist and led him up the stairs.", "Hugo was busy sitting on his halberd in the room assigned to Team 2.", "“What the…? Why are those two here?”", "Yi Seol-Ah flinched when Audrey Basler and Oh Rahee looked at her.", "“Oh? What’s our cutie doing here? I see you’ve brought my brother-in-law, too.”", "But thanks to Hugo’s playful words, she found the courage to speak up.", "“Oppa. Can we talk for a moment…?”", "“Talk?”", "“Yes, I have a favor to ask.”", "“A favor? Okay, tell me.”", "Hugo nodded without hesitation.", "Quickly, Yi Seol-Ah glanced about the room.", "Audrey Basler seemed to have lost interest in her, and Oh Rahee was wiping the blood on her longsword with an indifferent expression.", "Yi Seol-Ah lowered her voice and explained what had happened.", "But the room was so quiet that her voice couldn’t be missed.", "Hugo appeared slightly baffled.", "“Bring one more member…? These guys are a joke. They just want a free ride through the adventure.”", "“Can’t you come?”", "“I don’t know. If I wasn’t so busy, I would just think of this as volunteer work and go…. How long will this take?”", "“About four days.”", "“Four days, four days. We’re leaving next week… so that’s a little tight.”", "Hugo smacked his lips and scratched the side of his head.", "“I don’t know. I would’ve helped you before, but the situation’s changed. Anyway, I’ll ask Kazuki. But I don’t think he’ll allow it.”", "“Allow?”", "“Yeah. ‘Cause we already have an expedition scheduled for next week.”", "Yi Seol-Ah’s eyes widened.", "“Can Sungjin and I come along?”", "“Huh? Uh… No. This is only for our team.”", "Yi Seol-Ah was puzzled by the unexpected response.", "“I’m sorry, but try to understand. If I let you guys join in as I please, then— I don’t worry about Kazuki, but Seol will get mad. This is something that our representative strongly pushed for. I can’t do anything to undermine Seol’s authority.”", "“I really will try my best….”", "“Kek.” She heard a snicker.", "Audrey Basler was laughing, shaking her head left and right.", "The same went for Oh Rahee. She glanced at the siblings and snorted.", "“That’s funny. Aren’t you guys on Team 1? Why do you want to come with us on our expedition?”", "“…”", "“Do you think we’re going out there to level up? No, we’re going to hone our teamwork skills. What’s their team leader doing, letting them wander around like that?”", "“Hey. That’s enough.”", "Hugo intervened in an annoyed voice.", "Oh Rahee put her sword down and turned her head towards him.", "“What’s the matter? It’s not like I lied.”", "“They’re just kids. Don’t berate them in front of everyone.”", "“Kids? They’re Earthlings here in Paradise, just like us.”", "“You know, I’ve always wondered about them. They’ve been here since Carpe Diem, so why are they still like that?”", "Audrey Basler chimed in.", "Hugo threw a quick glance at the siblings and frowned.", "“I said enough…!”", "Knock, knock.", "As he was about to raise his voice, he heard a knock on the door.", "“It’s Kim Hannah. May I come in?”", "A pleasant voice rang out from behind the door, and Hugo had no choice but to close his mouth and swallow his words.", "The door opened with a click.", "“I wanted to talk to you about Mister Yoo Yeolmu….”", "Kim Hannah, carrying a clipboard at her side, stopped in her tracks. Her eyes quickly scanned the room.", "Audrey Basler and Oh Rahee were smirking.", "Hugo seemed annoyed with them.", "Yi Seol-Ah looked downcast, and Yi Sungjin stood calmly.", "Being the quick-witted vixen that she was, Kim Hannah easily figured out something was wrong.", "“…What’s going on?”", "“Ah, nothing.”", "Replied Audrey Basler as she clenched her hands and stretched, moving her arms up towards the sky.", "“It’s just that—”", "“Hey.”", "“Mister Hugo, please be quiet. Just that— What?”", "Hugo tried to stop her, but Kim Hannah was quicker.", "Her left eyebrow went up slightly as she listened to Audrey Basler’s explanation.", "“…Miss Yi Seol-Ah? Mister Yi Sungjin?”", "“Ye-Yes?”", "“May I talk to you for a minute?”", "“W-Why? About what?”", "Kim Hannah smiled silently at Yi Seol-Ah.", "But the next moment she suddenly straightened her posture and her smile disappeared without a trace.", "“As the acting representative of Valhalla, I would like to request a meeting with Yi Seol-Ah and Yi Sungjin, the official members of Valhalla.”", "“…”", "“But not here. Come to my office.”", "Kim Hannah spun around.", "Yi Seol-Ah glanced back at Hugo, who sighed as he placed his hand on his forehead.", "“You guys are fucked~ Too bad you got caught by the fox.”", "With a smirk, Audrey Basler waved her hand at them.", "Eventually, Yi Seol-Ah began to walk like a cow being forcibly taken to a slaughterhouse.", "*", "“You can’t say ‘yes’ to everything.”", "Kim Hannah said, cleaning under her fingernails with a nail file.", "This was the first thing she said after Yi Seol-Ah and Yi Sungjin sat down in front of her.", "“Because when you do, people look down on you. Look, these people were all fascinated at first when you mentioned Valhalla, but when you revealed your weakness to them they immediately tried to take advantage of you. How could they possibly think they could recruit a High Ranker on a four-day adventure?”", "“That’s not it….”", "Yi Seol-Ah spoke carefully.", "“They just couldn’t trust us… that’s why.”", "“Ah, really?”", "Kim Hannah smirked.", "“Then maybe you should’ve volunteered to accompany them as porters.”", "“I don’t think they’re recruiting porters….”", "“You don’t think? An archer must always be 100% sure. Are they not recruiting? Or is that just a theory in your head?”", "Yi Seol-Ah shut her mouth.", "“Well, in any case… If that doesn’t work out, you’d be better off looking for a different team.”", "Huu. Kim Hannah blew at her fingers and put down the nail file. She then turned her eyes to the siblings.", "“Or you could’ve lied if you really wanted to go on that particular adventure. Passing the buck to someone else because you have no balls to assert yourself. That’s a bad habit.”", "“That’s not what it was.”", "“I’m not done speaking.”", "Yi Seol-Ah tried to protest, but Kim Hannah stopped her.", "“Do you remember? The first day I came to Valhalla— I mean, Carpe Diem, I asked you two to see me alone.”", "[Lastly… Miss Yi Seol-Ah, Mister Yi Sungjin.]", "[You two and I need to talk.]", "Yi Seol-Ah’s face darkened as she recalled the past.", "“That was before Carpe Diem became an official organization, and I warned you that you two won’t be the key players in the new team. But you didn’t even read the contract. You said you could do it.”", "“…Yes.”", "Yi Seol-Ah answered barely above a whisper.", "“That contract included a section on low-level growth…. Well, I had high hopes for you then. Because I knew that the now-disbanded White Rose picked you as their next ace member. More precisely, I believed in our representative’s insightful eyes. How could I have known you wouldn’t be able to fetch yourself an adventure even at Level 3?”", "Every word out of her mouth pierced Yi Seol-Ah like a sharp knife.", "“You were very good at promoting in the neutral zone. If I knew this would happen, I would’ve asked the representative to make a PR team.”", "Kim Hannah sneered. They both knew she was being sarcastic.", "“Since you don’t seem to want to talk, I’ll be straightforward. Hasn’t it been a while since you two transferred from White Rose? What have you done in the meantime? Besides training, of course.”", "“That’s…!”", "Yi Seol-Ah was about to shout something, but she stopped herself.", "Kim Hannah’s eyes were glaring strangely. They seemed ready to condemn whatever Yi Seol-Ah said.", "“That’s?”", "“I… um….”", "“I’m curious about what comes next. ‘The representative brought us here and then he forgot about us’… I hope it’s nothing like that.”", "Yi Seol-Ah’s throat moved as she swallowed hard.", "“I think there’s a misunderstanding. Our representative has a different way of thinking than ordinary Earthlings.”", "Kim Hannah clenched her hands and leaned forward slightly.", "“He went to Haramark, practically being chased out of Scheherazade, and came this far from ground-up. He started as a porter in an expedition to the Forest of Denial. And because he grew up like this, he thinks other Earthlings go through similar things.”", "“…”", "“Never mind the representative. I personally don’t understand you two. Think of Valhalla as a company. Of course, you have to do what your boss tells you to do, but the fact that you were hired as full-time employees means that the company has recognized your abilities. You’re expected to handle your problems on your own.”", "Kim Hannah continued.", "“Take Miss Eun Yuri, for example. She joined Valhalla much later than the two of you, but she hit it big at Level 1. No wonder she was selected as a member of the main team.”", "Yi Seol-Ah’s head lowered when she heard Eun Yuri’s name.", "She’d never thought of it that way before, and now she felt embarrassed, even inferior.", "“I understand.”", "It was then.", "Kim Hannah turned her gaze away from Yi Seol-Ah.", "Yi Sungjin was looking at her with calm eyes.", "“It looks like we made a mistake. I promise it won’t happen again.”", "Kim Hannah’s eyes brightened.", "“At least your brother gets it. Alright, you may leave now.”", "Yi Sungjin was the first to get up.", "Yi Seol-Ah swallowed a sigh of relief.", "She’d been saved by her brother….", "“…Miss Yi Seol-Ah?”", "…Was what she thought.", "Kim Hannah’s voice called Yi Seol-Ah just as she was about to go out the door.", "Yi Seol-Ah turned her gaze to Kim Hannah’s distant smile.", "“Miss Yi Seol-Ah, this isn’t White Rose.”", "“…”", "“And it isn’t your home either.”", "“…I know.”", "Tak.", "Yi Seol-Ah closed the door on her."]}