{"cid": "232", "title": "Chapter 232. Threads of Bonds Gathering Together (1)", "content": ["“She certainly lives up to her name. What an ambitious and courageous lady.”", "Jang Maldong guffawed after the meeting broke. He seemed pleased for the first time in quite some time. Anyone could see that he was satisfied with what happened.", "Seol Jihu smiled bitterly.", "“I’m actually worried that she’s being too strong from the first meeting.”", "“Don’t be stupid.”", "Jang Maldong snorted.", "“We’re not playing house. Anyone who doesn’t find what she said acceptable should leave immediately.”", "“….”", "“From what I’ve heard, she didn’t say a single wrong thing. Everyone became speechless because everything she said was agreeable. And that includes Chohong. Didn’t you see it yourself?”", "“But—”", "“But? What but?”", "Jang Maldong interrupted him flatly.", "“The freedom they’ve been enjoying until now was all because they worked under the banner of Carpe Diem, which stands for seize the day. Are you going to continue using the name Carpe Diem?”", "“…No.”", "“Right, you’re not. New wine has to be brewed in a new keg. In the first place, teams also have basic rules they need to uphold. Carpe Diem is the one that’s special.”", "Seeing as how Seol Jihu didn’t raise any objection or disagreement, Jang Maldong continued.", "“Jihu, being a member of an organization means living a communal life. It’s a community where members share common values and interests.”", "“Right.”", "“There are only ten of us now, but the number of members will naturally rise as the organization gets bigger. Perhaps the number will go beyond being in two digits to three digits.”", "Jang Maldong looked around the office, checking that no one else was around, before bringing his face closer to Seol Jihu.", "He lowered his voice and whispered.", "“As more people gather together, the chances of an incident breaking out inevitably increases. Conflicts might happen, like Seol-Ah and Sora.”", "Seol Jihu understood immediately once he brought up Yi Seol-Ah and Phi Sora as an example.", "“There’s a limit to an arbitrator stepping up and handling the issue. You have to let the parties involved resolve the situation on their own. Of course, you can’t give them too much freedom, or else the community will instantly become a mess. I’ve seen more than a few organizations that collapsed because of this.”", "“….”", "“That’s why you need rules and regulations. Applying principles and fundamental rules to everything to assure fairness. Miss Kim Hannah knows this too well.”", "Only then did Jang Maldong retract his face and sit back down on the couch.", "“I’m saying this just in case. Don’t tell her to take it easy.”", "“I can’t?”", "“At least, not for now. I can’t understand why someone of her caliber is here to help us out…”", "Jang Maldong smiled bitterly.", "“But her eyes were very clearly burning. I don’t know what happened, but her determination is real. She must be clenching her teeth on the inside.”", "“…Yes, I understand.”", "Seol Jihu barely managed to nod his head.", "Carpe Diem’s transformation into an organization. The once vague plan was starting to gain momentum.", "After bringing in Kim Hannah.", "They had to go through several complicated hoops to officially register as an organization, and Kim Hannah was Carpe Diem’s sole reliable expert in this field.", "As a result, she was busy working starting from the first day she arrived at Haramark.", "Seol Jihu followed Kim Hannah around, helping her out and learning the ropes. If there was one thing he learned, it was that Kim Hannah kept a regular schedule no matter how busy she was.", "Counting the time with an hourglass, Kim Hannah went to bed at 2 a.m. and woke up at 6 a.m without exception.", "She started the day by washing her face and doing some light exercise. Then after finishing breakfast, she went to work right away.", "Other than two shorts breaks for lunch and dinner, she spent all of her time working.", "Seol Jihu couldn’t help but feel bad as she was like a company employee working overtime every day.", "As a result of focusing on administrative work without wasting a single minute, Kim Hannah began to show results in just a few days.", "The first was happening now. Chohong, Marcel Ghionea, Phi Sora, and Hugo had each coughed up 55 gold coins and 120 gems.", "Seol Jihu blankly stared at the gold coins that were delivered to Kim Hannah. A total of 220 gold coins and 480 gems… it was truly an astonishing amount.", "“…I feel like my sense of money is getting weird.”", "“Why?”", "“In the past, never mind a gold coin, I thought even a few dozen silver coins was a lot…”", "Enticing Maria with a few dozen silver coins almost felt like a dream.", "“Well, I don’t blame you. I almost screamed when you opened your bag to show me.”", "Kim Hannah spoke with a chortle.", "“Ah, Jihu, you take out 20 percent from your share too.”", "“?”", "“Taking 20 percent from each founding member is enough to get started. You don’t have to burden yourself just because you’re the leader. It’s important to keep private and organization assets separate.”", "Just what kind of family was she raised in to be so smart?", "Seol Jihu was prepared to suffer a huge expenditure, so he was pleasantly surprised to hear this.", "He happily handed over 110 gold coins and 240 gems, which included Flone’s share.", "But he could even reclaim a part of this expenditure as Marcel Ghionea formally requested to pay for the Laurel of Triumph.", "After a little bit of price negotiation, they settled on 20 gold coins. Although its premium label as a Banquet reward would normally make it 30 gold coins, Seol Jihu gave him a huge discount since he was a team member.", "Even this little gesture had Marcel Ghionea feeling extremely touched.", "But because Seol Jihu considered the crossbow a gift and wasn’t intending on taking it back until Kim Hannah mentioned it, he saw the exchange as an unexpected extra income.", "What made him happier was that this counted toward his private asset and not the organizational fund.", "Phi Sora, on the other hand, put the matter aside temporarily. She was almost enticed by the huge discount, but it wasn’t an easy decision to buy a full set of armor plus a weapon.", "In Paradise, equipment suitable for higher-ranked Earthlings got more expensive exponentially.", "Since this equipment was also from the Banquet, the enormous price needed to purchase it all made Phi Sora hesitate.", "In the end, Phi Sora swallowed her tears and returned the equipment. Then, she agreed on a four-month rental period starting from the day Carpe Diem would officially be registered as an organization.", "It really felt like the organization’s system was coming together starting from the little things.", "*", "“All done.”", "Kim Hannah stretched after tapping a stack of paper against the desk to organize it.", "“I’ll look over it one last time and give it to you tomorrow. All you have to do is send it to the Royal Palace of Eva through a messenger. Write your name as the sender and the royal administrator as the receiver. I’ll give you the address.”", "Seol Jihu asked while flipping through the documents.", "“You said this is the first step?”", "“Yep. We’re basically asking the Eva Royal Palace for their opinion. Our team wants to settle down in your city and work, what do you think? Now, do you remember what I told you about the way they respond?”", "It was a sudden question, but Seol Jihu answered as he had learned.", "“The documents you sent are—”", "“Ah, you don’t have to go into detail. Just say the main point.”", "“This letter started with the Empire 500 years ago—”", "“Hey!”", "When Kim Hannah turned serious, Seol Jihu laughed and corrected himself.", "“Their response is generally one of the two: a formal we permit your stay or a pensive let’s meet and talk.”", "Kim Hannah clicked her tongue and sighed.", "“Trying to crack a joke whenever you can… anyway, the former is really a roundabout way of rejecting us. If it’s simply staying in Eva, anyone can do it, right? Unless you’re a high-profile criminal on the Red Notice.”", "“Right.”", "“The latter— it means Eva is interested. They’ll come to us. That’s when their screening begins.”", "“They’ll come to us? To Carpe Diem’s office?”", "“How else are they going to see with their own eyes? Whether the documents we sent are true or false. We’ll also discuss other things. They’ll ask why you’re leaving Haramark to come to Eva, so make sure you have an answer.”", "Kim Hannah said they would be 80 percent done after this stage before continuing her explanation.", "“If the talk goes well, Eva will bring up the matter about the land. You can leave things to me from that point on.”", "Only after all of the above processes ended would they be able to officially put their name on Paradise’s registry of organizations.", "In a way, the whole process was similar to getting a visa approved for travel. Checking their background and financial power, seeing whether they would be helpful to the development and safety of Eva…", "“These documents getting cleared comes first. For the record, over 80 percent of applicants receive permission for stay at this stage.”", "“That much?”", "“No matter how famous your team is, at the end of the day, it’s just a team. If a team is a feather, then an organization is a boulder.”", "Meaning, the weight each word carried was different.", "Seol Jihu shook his head.", "“To be honest, I’m still a little confused. I don’t know why they made the procedure so complicated.”", "“Well, it wasn’t like this in the past.”", "Kim Hannah glanced at Seol Jihu before letting out a dry cough.", "She swallowed the words, ‘When Paradise first opened, kingdoms welcomed the creation of new organizations.’", "Doing so would be spitting on the faces of Earthlings including herself.", "“It’s because the area of activity in Paradise expanded too rapidly… though, you probably have no clue what that means.”", "Kim Hannah learned in the past few days that although Seol Jihu was renowned and skilled, he was lacking when it came to the breadth of knowledge regarding Paradise.", "“To put it simply, you’ll be recognized as a Paradisian. You won’t be treated as an ordinary citizen, but a noble.”", "Strictly speaking, Earthlings were outsiders to Paradise. Because they were summoned by the Seven Gods, they were almost never mistreated. But while they were stronger in both number and quality, what they could and couldn’t do was strictly separated by law.", "“Being recognized as a Paradisian will grant you the protection of the law. What do you think will happen if you become nobility?”", "The answer was obvious— becoming a fish in water.", "Seol Jihu murmured the answer inwardly, but the truth was that nobility was an outdated concept and an empty title these days.", "Most of Paradise’s nobles had died from the long war or escaped. Practically none remained in the current Paradise.", "‘So things turned out like this because the royal families tried to replace these nobles with Earthlings?’", "Seol Jihu had the above thought, but he didn’t ask Kim Hannah to confirm his suspicion.", "It wasn’t as if Kim Hannah knew everything about Paradise. Plus, he figured asking her whenever he had a question was a bad habit to develop.", "Finding out by himself would make the answer stick to his mind longer.", "“Anyway, it’s not an easy task. But… it’s nothing for you to lose your sleep over.”", "Kim Hannah yawned and got up from her seat.", "“It’s not like I don’t have any worries, but this team has huge merit that will easily cover its tiny flaws.”", "“Huge merit?”", "“Yep. It’s almost like a cheat-key. And this team has two.”", "“And what are those?”", "Using the hand that was covering her yawning mouth, she pointed at Seol Jihu.", "“You.”", "Then, her index finger moved to the door.", "“And Master Jang.”", "*", "The next morning, Seol Jihu left the office around noon.", "It was to deliver the documents Kim Hannah gave him to the messenger.", "However, he paused his steps before he could get down the stairs.", "It was because a familiar woman was sitting on the edge of the staircase.", "“Chohong?”", "“Huh?”", "Chohong tilted her head back in surprise. But she soon fixed her expression and spat out her cigarette.", "“Oh, where are you going?”", "“To send a messenger.”", "“Messenger?”", "“Yep, I have to send documents to Eva Royal Palace.”", "Seol Jihu raised the envelope in his hand and shook it left and right.", "Chohong nodded her head quietly before standing up.", "Because she looked a bit sullen, Seol Jihu couldn’t help but ask.", "“What’s wrong? It’s not like you. Did something happen?”", "“No… nothing…”", "Chohong rubbed her poor feet repeatedly until she finally murmured with a crestfallen voice.", "“It’s just… I can’t believe Carpe Diem will become an organization.”", "“We haven’t even heard back from Eva yet.”", "“I know, but I never thought I would have anything to do with an organization in my lifetime.”", "Chohong smacked her lips.", "“How should I put this… I’m a little restless.”", "Seol Jihu trudged down the stairs and asked.", "“You’re not planning on leaving, are you?”", "Chohong laughed.", "“Ya bastard, why would I? I’ve been here the longest. You think I’ll miss this opportunity?”", "After shouting rather cheerfully, she spun back.", "“See ya later. I’m gonna go chug some liquor at the pub.”", "But before Chohong could take a single step, Seol Jihu’s hand grabbed her shoulder.", "Chohong flinched.", "“Where do you think you’re running away to?”", "The corner of Seol Jihu’s mouth curled up.", "“W-What? I said I’m going to the pub! L-Let go!”", "Chohong stuttered and twisted her body here and there. But Seol Jihu wasn’t the type of person to let her go so easily, especially when he finally had something to hang over her head.", "“Aigoo~ Boss Chung. Going to the pub sounds great, but you gotta settle the tab first, no?”", "“T-Tab? What tab?”", "Chohong’s head creaked back.", "Seol Jihu gave a sly smile.", "“Do you want to go with Oppa or Hubby?”", "Chohong’s eyes began to tremble. She seemed to be saying, ‘You still remember that?’", "“Or do you prefer Master instead?”", "Chohong jumped.", "“No, I—”", "“Yeah, you, what.”", "“Noooo, I mean—!”", "“Now, now, I’ll hear you out, so calm down.”", "“Nooooooo!”", "“Go on.”", "Chohong’s face reddened, and Seol Jihu giggled uncontrollably.", "Having mixed feelings about Carpe Diem becoming an organization had to be an excuse. She was probably brooding about the bet she carelessly made with Seol Jihu.", "She tried to sneak her way out of it by making up a shoddy excuse, but her acting was meaningless in front of the prankster.", "“You have nothing to say, right?”", "Chohong’s neck trembled.", "“You promised. Kim Hannah and Yuhui Noona. You said you’d call me whatever I would like, if I managed to recruit just one of them. You said you’d be ve~ry polite and well-mannered.”", "“D-Did I say that?”", "In the end, she chose to play dumb.", "Seol Jihu went, “Hoh~” seeing Chohong struggle to feign ignorance.", "“You want to play dumb?”", "“What do you mean?”", "“Kyaa, so a Priest’s vow doesn’t mean anything?”", "A “keuk!” rang out.", "“Wait, dude, okay, I remember saying that. But didn’t I say you had to recruit both?”", "“Nope.”", "“No, no, I definitely remember saying you had to recruit both.”", "“Ooh~ So you’re resorting to fabrication and demagoguery to win? Do you want to go to Invidia’s temple to confirm?”", "Chohong shut her mouth and frowned.", "She had vowed upon her power as a Priest with Invidia as her witness. There was nothing she could do if Seol Jihu wanted to pursue the matter to the end.", "‘Fucking hell… why did I say that?’", "She remembered Dylan advising her to think thrice before saying anything.", "Seeing Chohong about to burst into tears, Seol Jihu giggled.", "Having played with her enough to relieve his boredom, he chose to stop here for today. That way, he would be able to have fun another time.", "“Hm… maybe you did say both.”", "Once he tilted his head while rubbing his chin, Chohong’s complexion brightened instantly.", "“Y-Yeah! I know I said both!”", "“I don’t know… well, we’ll know for sure once we go to the temple to check. Wanna go?”", "“Ah, hey, we don’t need to go that far. Don’t be a sissy.”", "Chohong clung to him desperately, speaking in a rare nasally voice.", "Seol Jihu shrugged.", "“Okay, so you’re saying it was both?”", "“Yeah-ah!”", "“Alright, fine. You won’t say anything once I recruit Yuhui Noona too, right?”", "Chohong nodded her head madly.", "“Of course! I won’t say a peep. If I go back on my words, I’d really be a bitch. I’ll say it now! I’m a dog if I go back on my words! For real!”", "“Oho.”", "Seol Jihu just landed himself a legitimate way of treating Chohong like a dog.", "Like a puppy that had a violent personality, but was really a gentle sweetie.", "“I don’t know… I feel like you’ll make up another excuse…”", "“I won’t. Okay, let’s do this then. Let’s write a new contract. I’ll sign it this time.”", "She darted off somewhere, brought back a pen and a piece of paper, then began to write a contract.", "“I, Chohong… if Seol Jihu succeeds in recruiting both Kim Hannah and Seo Yuhui… will do what he wants… vow upon Goddess Invidia…”", "“Don’t forget the part of you being a dog.”", "“Yeah, yeah, I will.”", "She even signed with a thumbprint.", "“Okay, there. Take it. Take it, you dirty bastard.”", "Chohong held the contract out while grumbling with a relieved face.", "“You won’t bitch about it later?”", "Seol Jihu smirked and took the contract.", "“You hate it that much?”", "“I don’t know what you’re talking about. Anyway, the terms of this contract are final.”", "“Wow, where’d you throw out your conscience?”", "“Screw my conscience! Take it!”", "“Fine, fine.”", "Once Seol Jihu reluctantly put the contract away, Chohong yelled in delight.", "She would have had no way out if they went to the temple, but she had somehow managed to turn the situation around at the end.", "How could she not be happy?", "In truth, Chohong had done some calculations in pulling off this performance.", "Kim Hannah joining Carpe Diem was absurd, but she could chuck it up to gears perfectly falling into place since Seol Jihu was connected to Kim Hannah as an Invited and Inviter.", "But successfully recruiting the remaining person was truly, truly impossible.", "The probability was an absolute zero.", "Who was Seo Yuhui?", "Paradise’s myth and legend!", "An Earthling known as the Iron Wall, who refused to join any organization until now, coming to a meager Carpe Diem?", "A dog strolling by would grab its belly and roll around in laughter.", "Because Chohong knew this, she regained her leisure in an instant.", "“Haha, you cute son of a bitch. You wanted this Noona to call you Oppa that much? Well, dream on!”", "“Ehew, you sure are in your own dreamland.”", "Seeing Seol Jihu shaking his head, Chohong sniggered.", "*", "On the other hand, at the same time.", "The building on the opposite side of the bickering duo seemed quiet on the outside, but was rowdy on the inside.", "It was because its owner was busy preparing for a move.", "“Ah, we’re finally done.”", "Once the Priest plopped down, Seo Yuhui clasped her hands together and smiled.", "“Thanks. I’m sorry for asking you to help out again.”", "“No, um, I’m fine helping out, but…”", "The Priest stared at Seo Yuhui resentfully.", "“But aren’t you going too far, Unni? It hasn’t been that long since you moved to Haramark and you’re moving again? And to Eva this time?”", "“Sorry, I had no clue that my baby would move to Eva.”", "“Jeez.”", "The Priest breathed out a deep sigh before looking at the fully-packed sacks with an exhausted expression.", "“You’re really going all out with parenting. If he moves again, you’re going to follow him again and again and again?”", "“Yeah, but I won’t call you about a move from now on.”", "Now, what did that mean?", "When the Priest stared at her fixedly, Seo Yuhui tilted her head slightly and clasped her hands over her cheeks.", "“Well, erm, you see… that child…”", "Kyaa.", "Closing her eyes, she screamed quietly like a teenage girl who finally met her knight in shining armor.", "“He said he wanted to protect me~”", "Plop! A drop of saliva fell down from the dazed Priest’s gaping mouth."]}