{"cid": "382", "title": "Chapter 382. The Shade of the Giant Tree (1)", "content": ["Seol Jihu and Phi Sora moved ten steps away from each other and took out their respective weapons.", "They stood in a vacant lot behind the Valhalla building, where people rarely visited.", "They chose this place on purpose because they didn’t want to attract other members’ attention.", "Jang Maldong stood away from the two before suddenly dropping his gaze down to his feet.", "Next to him, a tiny yellow fuzzball was staring at Seol Jihu and Phi Sora.", "He seemed to have found his way here on his own.", "Jang Maldong opened his mouth to ask him how he found out about the duel, but in the end, he just turned his eyes back to the lot.", "There were two reasons. The first was that, with his tiny wings folded over his chest, the chick didn’t seem to want to be disturbed. The second was that Jang Maldong sensed Phi Sora’s movement.", "Phi Sora stared at Seol Jihu and slowly stretched out her right arm.", "The tip of her sword pointed at her opponent.", "Seol Jihu stood motionless.", "His spear hung horizontally in a relaxed grip as he faced Phi Sora’s fierce gaze with unwavering eyes.", "A moment later, as Phi Sora bent her knees, Seol Jihu’s body turned slightly to the right.", "The war of nerves continued unabated when suddenly….", "“Haa!”", "With a sharp cry, Phi Sora sprang through the air.", "She ran and then kicked the ground with all her might.", "As she soared into the air, Phi Sora raised her right arm above her head, then swung it forward with brute force towards Seol Jihu.", "Clang!", "Seol Jihu lifted his spear.", "He parried Phi Sora’s sword, but it quickly found its way back to his chin.", "The blade scraped across Seol Jihu’s face.", "Phi Sora was persistent.", "She changed the direction of her sword again and Seol Jihu hurriedly plunged his spear down.", "In response, Phi Sora gracefully pulled her sword back and thrust it forward once more.", "It was then.", "Tang! A sudden, intense pain jolted through her right hand.", "Seol Jihu had spun his spear in a semicircle and struck the back of her sword.", "The clash was so strong that she almost dropped her sword.", "Phi Sora managed to straighten her posture and tried again to stab her opponent.", "However….", "“Uuk!”", "By then, the blunt end of Seol Jihu’s spear had already hit her stomach.", "This threw Phi Sora off her balance, and she stumbled backward a few steps before falling to the ground.", "As she placed her hand on her stomach, the expression on her face was that of astonishment.", "‘What the…? His speed and strength are just….’", "They were incomparable to the past.", "If this was real combat, she’d be dead by now. Phi Sora glanced upwards.", "Seol Jihu was quietly looking down at her.", "Her eyes shot wide open.", "“That was—”", "But instead of finishing her sentence, she was forced to stand back up.", "This time, Seol Jihu dashed at Phi Sora.", "He lifted his spear above his head and swung it down at his opponent.", "As soon as she got up, Phi Sora moved her sword diagonally to block the spear approaching her left shin.", "This caused her upper body to twist unnaturally, and not missing his chance, Seol Jihu quickly thrust his spear into Phi Sora’s left side.", "Phi Sora clenched her teeth. Had the opponent’s attack come from the right or at least from the front, she could’ve deflected it by swinging her sword as hard as she could.", "But in this position, the position she was forced to maintain by her opponent, evading an attack was nearly impossible.", "Seol Jihu seemed intent on beating her up by keeping her off balance.", "When she raised her sword to block the attack, as she was given no other choice, Seol Jihu’s spear swished gracefully in front of her face.", "Phi Sora was forced to take a step back.", "She told herself she’d use this chance to collect herself, but she knew as soon as she stepped back that her opponent had gained the upper hand on her.", "To make matters worse, Seol Jihu began thrusting his spear left and right, as if not to give Phi Sora a chance to think.", "Phi Sora pulled herself back, swinging her body from side to side.", "Sssshk! Like a shooting star, the blade slashed the air in front of her face.", "Phi Sora turned her head in a hurry, but her eyes remained fixed on Seol Jihu and his spear.", "One chance. Just one chance would be enough.", "Right now, he was throwing her off with consecutive attacks, but his movements were likely to get bigger as he prepared the final blow.", "It would be her chance to strike.", "It was then that Seol Jihu spun around with his back to her.", "This was the big motion Phi Sora had been waiting for.", "She raised her longsword intuitively, but panicked.", "Seol Jihu’s reaction was astonishingly fast.", "Before Phi Sora could do anything, her opponent turned his body and thrust his spear at her like a lightning bolt.", "She managed to deflect it with her sword, but he swung his spear again almost immediately as if everything were part of a prearranged choreography. The swiftness of his attack shocked her.", "Phi Sora’s strength, endurance, and stamina were top class, but her agility still remained at Intermediate (Low).", "On the other hand, Seol Jihu’s agility was High (Low).", "Their agilities differed by three steps, so it was only natural that she struggled to keep up with him.", "Cha-cha-cha-chang! Loud, metallic clanging sounds rang out consecutively.", "It took all of Phi Sora’s effort just to block her opponent’s attacks.", "Suddenly she stopped.", "‘Damn it…!’", "She knew that at this rate it was only a matter of time before the spear broke through her defense.", "She had to find a way to turn the tide of battle amidst the clashing of the blades.", "Clang, clang!", "Her arms shook violently with each clash and she frowned.", "She pushed the spear away from her left shoulder and took a chance.", "She tilted her longsword and thrust it half a beat faster towards the right.", "Swish! Phi Sora felt the spear slide past the back of her sword and smiled crookedly.", "She had him attack her twice in the left direction and then launched a surprise attack in the opposite direction.", "The attack was the result of a careful analysis of Seol Jihu’s movement patterns.", "As the spear slipped past her sword, Phi Sora swung her arms wide and brandished the sword from top to bottom.", "The spear spun in midair before lodging into the ground.", "Seol Jihu’s eyes flinched a little and Phi Sora grinned.", "When she held the spear in place with one hand and plunged towards Seol Jihu, he quickly pulled the spear back and turned his body.", "“Ha!”", "Phi Sora almost burst into laughter.", "Turning and twisting the body was often an unnecessary movement during combat.", "She could always just let go of the spear, and she felt confident that she could reach Seol Jihu before he could reach her.", "Phi Sora moved closer, certain of her victory.", "However.", "“Kuheuk!”", "Suddenly she felt a sharp pain in her pelvis.", "Because she was moving very fast, her waist bent almost in half.", "The pain caused Phi Sora to stop in her tracks, and when her head drooped down she saw the blunt end of the spear buried deep in her pelvis.", "Seol Jihu had thrust his spear backward with his back towards her.", "More than half of Phi Sora’s predictions hadn’t come true.", "It was true that Seol Jihu turned around, but he stopped halfway.", "At the same time, he had held his spear backward and pushed it towards her.", "He only used the blunt end because they were sparring. If this had been real combat, he would not have hesitated to use the head.", "And if he had done so, she would have died even before she had a chance to move closer.", "She could have avoided this attack if she had been more careful.", "But this was the first gap in his defense she had discovered since their sparring began and she just couldn’t be patient enough. Ultimately, her impatience had become the cause of her defeat.", "‘No way.’", "Phi Sora’s lips trembled.", "The fact was that she had already been struck twice.", "It wasn’t that she couldn’t admit it, she just couldn’t help but doubt that her opponent was playing her.", "She felt completely helpless.", "A moment later Seol Jihu turned around and waved his spear fiercely.", "With a cry of rage, Phi Sora blocked the spear with her longsword, but she couldn’t manage to block his kicks.", "Puk! When the third kick landed on her stomach, Phi Sora finally dropped her sword and fell backward.", "Only then did Seol Jihu stop, relaxing his grip on his spear.", "A strange silence descended upon the vacant lot.", "But it didn’t last long.", "As Seol Jihu opened his mouth to speak to Phi Sora, who sat on the ground dazed, he suddenly backed away with a flinch.", "Less than a second later, a series of daggers struck where he had just stood.", "“Yo yo yo yo yo yo yo yo~!”", "He knew who she was just by her voice.", "Hoshino Urara jumped from the terrace of the dormitory floor and landed on her feet.", "“You’re finally here! You traitor!”", "With her back to the building, she pointed her finger at Seol Jihu.", "Seol Jihu tilted his head curiously.", "“Traitor?”", "“Did you forget about our contract!?”", "“?”", "“Fun is the only reason I’m here! From the day we signed the contract, as my employer, you’re obliged to provide me with entertainment!”", "“…”", "“How could you forget our promise for 240,000 years?”", "“Come on, it was just eight months.”", "“I’m trying to tell you every day was like a thousand years to me!”", "Hoshino Urara shouted, gritting her teeth.", "Seol Jihu glanced down at the daggers on the ground.", "Despite her crazy attitude, her attack was full of a clear intent to kill.", "It was then that Hoshino Urara reached inside her clothes and threw something at him.", "Four daggers flew directly towards Seol Jihu, all at the same time.", "“Ohohoho! Death is what a traitor deserves! I’ll have you pay for deceiving me…. Eh?”", "Papapapak! Hoshino Urara suddenly began blinking rapidly.", "The reason was that the four daggers had turned midair and returned to her.", "“…”", "Hoshino Urara’s eyes moved slowly.", "One dagger was above her head, the other two were under her armpits, and the last dagger was between her legs.", "She could still feel the daggers vibrating against the wall.", "At the same time, she felt an enormous aura in front of her.", "Slowly, Seol Jihu’s hair was rising upwards.", "Her interruption was unexpected, but he always welcomed a good sparring partner.", "Hoshino Urara was a Unique Ranker. There was no doubt she would be a suitable partner.", "Seol Jihu only was raising his mana because his opponent seemed to have done so.", "Hoshino Urara’s blinking grew more rapid.", "The same was true for Phi Sora.", "Her jaw slowly dropped as she looked up at Seol Jihu.", "His body seemed almost fused with mana and was now boiling as one big lump of energy.", "“…Heh. Good. This is what I expect from my employer!”", "Hoshino Urara muttered gallantly and grabbed a dagger with each of her hands.", "And then she bowed her head down.", "“I apologize!”", "She even knelt down before Seol Jihu.", "“I won’t do it again! Please forgive me!”", "She stabbed the ground with her daggers and threw herself on the ground, her forehead touching the dirt.", "Seol Jihu looked disappointed.", "He was just getting into the game.", "This person— she was as spontaneous as ever.", "“…Go.”", "“You’re really letting me go?”", "“This will be the last time. The next time you bother me, I’m really going to get mad.”", "“Thank you! I’ll be a good girl now!”", "Hoshino Urara crawled away in the kneeling position.", "Her cockroach-like movements amazed Seol Jihu. He watched her move away before turning his eyes back to Phi Sora.", "She was still on the ground.", "“Miss Phi Sora.”", "“…No.”", "Her voice was small and feeble.", "Phi Sora bit her lower lip.", "“I want to stop.”", "She was stabbed three times in the same spot.", "It was a crushing defeat with no room for any excuses.", "And after witnessing Seol Jihu’s mana a moment ago, she completely lost the will to fight.", "Phi Sora slowly got up, using her longsword as a cane.", "Seol Jihu noticed she was disheartened by the defeat and tried to approach her, but she stopped him.", "“It’s okay. Now, everything seems clear….”", "Phi Sora’s face darkened. She herself was unsure what she wanted to say.", "She gave a small sigh and her shoulders slumped.", "“…I’ll get going now.”", "Slowly, she left the vacant lot and went back inside the building.", "‘Was I too harsh…?’", "Seol Jihu licked his lips as he leaned his spear against his shoulder.", "But based on what he knew about Phi Sora, he decided that she would have been angrier with him if he had gone easy on her.", "It was best to do his best.", "Seol Jihu concluded and turned his eyes.", "He noticed that Little Chick was looking up at him sternly from a short distance away.", "He also saw Jang Maldong. The old man’s eyes were wavering slightly.", "“What… happened to you?”", "Jang Maldong barely managed to ask.", "He stood with a look of disbelief across his face.", "His reaction was understandable. Seol Jihu completely crushed Phi Sora.", "His technical skills as well as his physical capabilities greatly surpassed those of Phi Sora.", "Pressing Phi Sora, who controlled the sword as if it were part of her body, to move according to his will?", "Impossible. Unless—", "There was only one possible explanation. Seol Jihu had reached a greater realm than Phi Sora.", "One thing Jang Maldong had noticed about the way Seol Jihu moved was that not only was he controlling the spear as if it were part of his body, but his determination and his weapon seemed almost united.", "“Mm….”", "Jang Maldong looked at him wide-eyed for an explanation, and Seol Jihu slowly said.", "“It’s a slightly… no, a very long story. Is that alright?”", "*", "They moved to a different area and Seol Jihu explained to Jang Maldong about what had happened.", "Of course, he was careful to leave out certain things, about Nine Eyes and Black Seol Jihu’s true identity, for example.", "The explanation took a long time because Jang Maldong was eager to learn all the details.", "But it still would have taken a long time if he hadn’t. The story was worth seven years after all.", "“…Unbelievable.”", "Jang Maldong couldn’t hide his amazement.", "“It’s unbelievable, really.”", "He exclaimed and shook his head.", "He was proud of Seol Jihu for facing the trials head-on and awed by the mysterious helper that Gula had sent.", "On the other hand, he was pissed.", "Jang Maldong himself had always been distressed by the fact that Seol Jihu’s insight had been too average to rise to the level of a realm.", "And he agreed that hands-on learning was the key. There was only so much a person could learn by simply listening to a lecture.", "Even so, Seol Jihu had been pushed too far. Jang Maldong was shocked to learn that the training had caused Seol Jihu to fall into a state of senselessness.", "Seol Jihu could have collapsed mentally in the process and it was this fact that angered Jang Maldong.", "He was just glad that Seol Jihu’s efforts were well compensated in the form of Perfect Harmony.", "“You did well. It must have been hard.”", "“I want to tell you that I’m okay… but I can’t. I can’t deny that it was hard….”", "Seol Jihu murmured and smiled bitterly.", "“That’s understandable.”", "Jang Maldong gave a bitter smile as well.", "It was then that they heard a voice calling them.", "Chohong was yelling at them, ‘wrap it up and let’s begin the welcome party!’", "Quite some time had passed while they were talking and the evening sun was setting.", "“…Let’s go.”", "There was nothing more left to say.", "Jang Maldong slowly got up from his seat.", "“Haha. I can’t believe it. Seven years you say. Seven years….”", "He patted Seol Jihu on the shoulder and turned around.", "At the same time, he heaved a heavy sigh.", "He finally understood how Seol Jihu became a completely different person in just eight months.", "The change was the result of seven years of rigorous, restless training.", "‘The result is really impressive, beyond comparison. He’s just one step away from achieving Trinity Harmony…. Now I’m curious about that helper.’", "Jang Maldong nodded as he walked down the stairs. Then suddenly, he stopped and turned around.", "“Well, don’t you think you were too harsh on her? You’ve been training for seven years, but she’s only trained for a few months.”", "“But she used to be better than me. There was the possibility that her eight months were worth more than my seven years.”", "“So you didn’t let your guard down. I suppose you’re right. She left without complaint because she knew you’d taken her seriously. She’d be upset if you’d been easy on her.”", "“That’s why I tried my best…. Do you think that was the right choice?”", "Jang Maldong thought for a second and let out a sigh.", "“I don’t know. She looks tough, but underneath she’s very soft-hearted….”", "*", "That evening, Valhalla threw a party to celebrate Seol Jihu’s return.", "“Raise your glasses, everyone~!”", "It seemed Jang Maldong had worried for nothing.", "At the party, he found Phi Sora as lively as ever. She even took on the role of a party starter.", "“The first glass goes to our representative, in celebration of his safe return!”", "To the representative!", "Everyone shouted after Phi Sora.", "She emptied her first glass of wine and opened a new bottle.", "“And the second glass— goes to our representative, who, after months of rigorous training is now much stronger than before!”", "To the representative!", "“And the third glass— also goes to our representative, who just can’t seem to control his strength, showing off his new skills like he can’t forget the past!”", "“To the representatiiive!”", "Hoshino Urara’s voice especially stood out.", "Seol Jihu glared at Phi Sora, but she pretended not to notice and emptied her drink.", "Her reddened neck showed that she was drunk.", "Nevertheless, he had fun.", "Almost all members of Valhalla had gathered for the celebration, and the housebound ghosts delivered food and wine to them under Flone’s command.", "As the night advanced, everyone ate and drank merrily and the echoes of laughter filled the hall.", "The only problem was that the wine seemed endless.", "“Drink! Drink! Drink till you drop!”", "“…This is crazy. How much wine did they get?”", "Oh Rahee muttered in disdain as she watched Chohong pour two bottles worth of wine into her mouth.", "It wasn’t until after midnight that the party from hell quieted down.", "This was far from saying that the party was dead. It was only quiet compared to the beginning, and many people were still conscious.", "“Hmm? We’re out of drinks already?”", "“There’s more in the kitchen. I’ll go get them.”", "“Woah. I’ll leave it to you, team leader~”", "Chohong slurred loudly and waved the empty bottle in her hand. Phi Sora got up.", "‘I- I can’t anymore…’", "Seol Jihu also got up from his seat.", "‘Liver… I have to save my liver….’", "Shuffling across the room, he almost stepped on Marcel Ghionea, who had passed out on the floor, but managed to make it out in one piece.", "‘I thought I’d die.’", "Maybe he was hallucinating because he drank too much.", "He saw Maria collecting empty bottles of wine, muttering to herself, “These should fetch a lot.”", "Seol Jihu decided to take a walk to sober up.", "He saw a room with the light on at the end of the dark hallway. He peeked inside and found Eun Yuri.", "He remembered seeing her at the party earlier that evening.", "Eun Yuri seemed to have left early to study.", "Her pen was moving busily, jotting down complex formulas over the paper.", "The light illuminating her room was the product of light magic. She really seemed to have blossomed into a full-blown magician.", "[Eun Yuri is a hard worker. You can trust her more.]", "Seol Jihu remembered Black Seol Jihu’s words and nodded to himself. Then he tiptoed past her room.", "The next place Seol Jihu visited was the shrine at the corner of the building.", "The ghosts that had worked hard all evening were gathered there, eating and drinking with Flone’s permission.", "‘I forgot they were here.’", "He watched them for a while when suddenly he felt a finger poke him in the back.", "“…Flone?”", "Flone was floating behind him.", "She seemed uneasy and tense as she fidgeted.", "“What’s wrong?”", "“Well, I… went to the kitchen to get more food and wine for the ghosts, and…”", "Flone lowered her head without finishing her sentence.", "Seol Jihu hurried up the stairs.", "When he reached the tenth floor, he heard a muffled cry.", "The cry from the kitchen, where the lights were off, created a spooky atmosphere.", "Perhaps Flone had scolded one of the ghosts too harshly. Seol Jihu thought as he peered into the kitchen.", "However….", "“Hic… hic…”", "He immediately sobered up.", "The crimson hair strikingly contrasted against the dark room.", "“Heuk…! Keuk…”", "Phi Sora stood in the middle of the kitchen, alone.", "She was sobbing in front of a plate half-filled with food.", "She sniffled once before raising a glass full of wine to her mouth.", "Gulp. She drank, held back her tears with difficulty, and began moving the food to her plate again.", "Soon, however, her hands slowed down and her head drooped low.", "Carefully, she placed her hand over her stomach where she was hit three times earlier today.", "Tears dripped from her eyes onto the table whenever she held back her hiccups.", "Seol Jihu almost entered the kitchen but stopped himself.", "He thought she was okay, but she really wasn’t.", "She must have held back her tears throughout the party.", "Seol Jihu wanted to reach out, but he knew his consolation would be futile, that it would only hurt Phi Sora’s pride even more.", "As dense as he was, he wasn’t insensitive.", "Soon, Phi Sora wiped the tears from her face and began moving her hands again.", "Seol Jihu watched her silently for a while and left."]}