{"cid": "439", "title": "Chapter 439. With One Spear and Two Legs (4)", "content": ["As the howls resounded together, the two monsters simultaneously kicked off the ground and swung their spear and sword.", "A chilling, white sword light engaged with a bright, golden spear blade.", "Clang!", "A metallic ring resounded as the two weapons violently clashed in the middle. Immediately after the collision, the two were knocked back from the recoil.", "Sung Shihyun, who was pushed back by a few steps, kicked off the ground once again. Holding his white longsword horizontally, he stabbed forward like a lightning bolt.", "Seol Jihu also rushed in as soon as he regained his footing. He parried Sung Shihyun’s sword and thrust his spear while maintaining a distance from Sung Shihyun.", "Sung Shihyun immediately retracted his sword and countered the spear blade that was aiming for his heart. He turned his body and made the following spear shaft’s frightening strike brush past him.", "Twisting his waist to the left and turning it back again, he used the rotational force to send an attack. With the power of his divinity, of course.", "Clang!", "Another ear-splitting metallic sound burst out. Seol Jihu drew back with a crumpled face. His hands felt numb.", "“I attacked with the intent to make you drop your spear…. You must still have strength left over, huh?”", "Sung Shihyun chuckled. Despite his mocking comment, he was undoubtedly impressed.", "“Can’t you give me a break? I’m the First Army Commander. If I can’t take care of a guy who’s on the brink of death…”", "Sung Shihyun lowered his stance in the middle of his sentence.", "“How can I hold my head up!?”", "He rushed in, sweeping across the ground with his longsword. A fierce gale blew as the mud splattered in all directions, momentarily blocking Seol Jihu’s line of sight.", "Tong! An air-popping sound was heard. Realizing that Ethereal Shift was used, Seol Jihu quickly scanned his sides and took a few steps back.", "“!”", "He did a double-take in the middle and turned around. Sung Shihyun appeared behind him, and his longsword was descending on his shoulder.", "But just before it sliced his shoulder, Seol Jihu’s upper body shook like a ripple. The sword blade missed its target and glided past Seol Jihu’s forearm.", "“Huh?”", "Sung Shihyun’s eyes widened. He knew he cut properly, but Seol Jihu’s energy had instantly infiltrated his sword and changed its course.", "“What? How…?”", "Instead of replying, Seol Jihu sliced up with his spear. Sung Shihyun grunted while pulling his upper body back. The spear blade brushed past him from his crotch to his face.", "Seol Jihu expected Sung Shihyun to fall back after that, but he bent his waist as soon as he landed on the ground and brandished his longsword multiple times. He sliced and stabbed randomly like he was doing so mindlessly.", "Perhaps because he had a lot more stamina than Seol Jihu, he was relentless in his attacks. His movements and motions were exaggerated as if he was trying to catch Seol Jihu off-guard just once to end the battle as quickly as possible.", "‘Twisted Kindness….’", "The Seventh Army Commander, who had yet to join the battle, suddenly crossed Seol Jihu’s mind, but he did not have much time to dwell on the matter with Sung Shihyun being more reckless than he anticipated.", "Voong! Seol Jihu ducked to avoid the longsword drawing a large arc. However, the sword blade, which seemed like it would sweep past him, stopped above his head and then dropped down in a straight line.", "Seol Jihu’s feet rolled on the ground forcefully. The Spear of Purity unwittingly shot up and parried the sword away. It then turned its head down like an eagle eyeing its prey and stabbed toward Sung Shihyun’s forehead.", "Sung Shihyun snorted, retracted his arm, and turned his body in place. Twisting his wrist, which held the sword’s hilt, he turned his sword clockwise in a huge motion. He planned to parry Seol Jihu’s attack and put an end to this fight.", "At that instant, Seol Jihu’s eyes shot open. The spear blade, which was gunning straight for Sung Shihyun, abruptly impaled the ground. Then, holding the firmly fixed spear shaft with both hands, Seol Jihu put a spin on his body and sent a flying kick.", "“Euk!”", "Seol Jihu felt like he kicked a hard wooden log. Perhaps not expecting Seol Jihu to attack with his leg, Sung Shihyun’s posture collapsed as he grabbed his side.", "Seol Jihu did not miss the opportunity. He immediately chased after the retreating Sung Shihyun, pulled out his spear, and sent it flying.", "Sung Shihyun hurriedly raised his weapon and blocked the attack with the back of his sword, but it ended up ruining his posture even more.", "Seol Jihu did not give him a break. After retrieving his spear, he pulled his spear back and threw it at the staggering Sung Shihyun. No, he tried to throw it.", "“!”", "Intuition skill suddenly sounded alarm bells in his head. In less than a second, Seol Jihu gave up on his attack and quickly jumped back. He then raised his left arm and activated the Blessing of the Circum.", "Booooom!", "The sound of an explosion struck his ears, and Seol Jihu was pushed back by a large impact on his left arm.", "“Keuk!”", "When Seol Jihu raised his eyes, he saw a shattered tri-circular shield. A part of his arm was charred black as if the attack wasn’t blocked in full.", "Seol Jihu frowned, seeing Twisted Kindness floating down from the sky as Sung Shihyun straightened his posture.", "Twisted Kindness was standing tall with her arms out like a doll. Two magic circles were spinning around her while crackling with blood-colored electricity.", "“Iya, that artifact looks sweet. I’m going to have to call dibs on it.”", "Sung Shihyun grinned as he cracked his head, holding his chin in one hand and his head in the other. Only now did Seol Jihu realize why Sung Shihyun paid no heed toward defense and rushed in with such recklessness.", "Twisted Kindness was an all-rounder. Not only was she proficient in close-ranged combat, but she could also be an excellent long-ranged attacker if necessary.", "It seemed like Sung Shihyun was playing the role of a close-range fighter while Twisted Kindness was playing the role of a long-ranged fighter.", "“Now then, shall we start round 2?”", "Sung Shihyun raised his longsword after stretching his body. Then, he stretched out his hand like flowing water.", "His longsword somehow elongated before bending in an S-shape and rushing forward like a serpent. Seol Jihu also raised his spear to respond, but a blood-colored beam of light shot toward him at a frightening speed and brushed past his shoulder. His armor tore, and his skin became hot.", "A stinging pain flooded over him, but he had no time to pay attention to it. It was because Sung Shihyun’s longsword was swerving in. Seol Jihu tried to back off, dodge the attack, and counterattack, but…", "Chachak!", "Another red beam of light flew in and obstructed his attempted counterattack. A small crater appeared on the ground like a lightning bolt struck the earth, and black smoke rose up from the ground.", "By the looks of it, there weren’t that many lightning bolts, and they also seemed to have a delay between each firing. That said, each shot had enough power to kill him.", "Seol Jihu clenched his teeth. Being pushed back in the current situation meant that he was getting closer to death.", "‘Not yet!’", "Seol Jihu tightened his grip on the Spear of Purity. He swung his spear, drawing out every ounce of strength in his body.", "Chachachang!", "A fierce metallic ringing burst out again. Sparks flew up as a spear and a sword crossed each other. With only a single exchange, four or five sounds rang out. It was because the two of them also used Formless Sword and Formless Spear on top of their weapons.", "The howling of sharp winds, sounds of explosions, and the clashing of weapons mixed together splendidly to form an endless metallic melody.", "The word ‘intense’ was nowhere close to being enough to describe the battle.", "When Sung Shihyun’s longsword stabbed forward like a beam of light, Seol Jihu’s spear struck it aside like a storm, and Twisted Kindness’ lightning bolt bombarded the area.", "“Hoh, you’re holding up well. Let’s see how long you can keep up.”", "Sung Shihyun sent his longsword flying and snickered. Though he shouted in high spirits, he wasn’t so delighted internally.", "He was doing what he could to press Seol Jihu with Twisted Kindness’ support, yet Seol Jihu refused to bend down. To be blunt, Sung Shihyun was embarrassed to perform so poorly against a dying opponent.", "This was the first time after absorbing and gaining control of Diligence’s divinity that he was facing someone he couldn’t overwhelm. And the more he thought about it, the more jealous and envious he became.", "Just why is he the main character? What the hell is a Brightest Star anyway? And with all this talk about him being a powerful star, his class name must be way better than my shitty class name.", "Sung Shihyun got angrier as he thought this.", "“What’s keeping up going to do?”", "He swung his sword at Seol Jihu one more time and spoke mockingly.", "“What, you think the Federation or humanity will send reinforcements? Hm?”", "Sung Shihyun shouted again, but Seol Jihu did not reply. No, he couldn’t. He was having a hard time just maintaining his breathing.", "“Stop dreaming. We turned back half of the troops that were stationed around you, so any reinforcement must be in an endless battle of their own.”", "Kwang!", "Seol Jihu blocked the sword attack aimed at his chest, but he failed to block the lightning bolt that flew in from his blind spot.", "He felt like his arm would rip out. Seol Jihu swallowed the blood that was trying to spill out from his throat.", "For a split second, his vision turned blurry. Then, he barely grabbed ahold of his fleeting consciousness and raised his spear.", "“Enough is enough!”", "When Seol Jihu held on once again, Sung Shihyun attacked even more fiercely in a fit of anger.", "Pk! Pk!", "Seol Jihu twisted his spear, frantically parrying Sung Shihyun’s attacks. He was avoiding fatal injuries, but small injuries began to build up one by one.", "He no longer had enough energy to use the Spear of Purity’s fourth and fifth level, and now that he was using Grand Cosmic Shift to block Twisted Kindness’ attacks, he was being distracted, and his defense had become thinner as well. It was a vicious cycle.", "‘Damn it.’", "He was going all out, but the situation wasn’t getting any better.", "It wasn’t as if he didn’t have enough energy to hold himself up. But he had to do something before this final reserve energy ran out. Even if he had to bear more risk.", "For example, killing either Sung Shihyun or Twisted Kindness once and for all with a single attack.", "‘Who?’", "Seol Jihu’s eyes narrowed and scanned up and down. After making up his mind, he immediately started.", "First, he leaped back, widening the gap between them. However, Sung Shihyun chased after him like a vengeful ghost.", "Seol Jihu stomped on the ground and came to a stop. Rushing forward to greet Sung Shihyun, he pretended to stab with his spear.", "Sung Shihyun snorted and sped up. Just as he raised his sword up in the air…", "“Heut!”", "Seol Jihu let out a shout of concentration before suddenly changing his course and turning to Sung Shihyun’s back.", "Pang, pang, pang! He activated the Festina Earring three times. Startled by Seol Jihu’s sudden acceleration, Sung Shihyun immediately paused and swung his sword. Seol Jihu spun to the side as much as possible and took up a spear-throwing posture, but it seemed he failed to escape the range of Sung Shihyun’s attack as blood spurted out of his side.", "Seol Jihu continued to run past Sung Shihyun and performed a run-up while maintaining his acceleration. He then squeezed out every ounce of strength left in his body to throw the spear sitting on his shoulder at the floating Twisted Kindness.", "Chweeeek!", "The Spear of Purity shot out like a bullet and grazed its target. Twisted Kindness had moved to the side and dodged the attack.", "But then, the spear made a u-turn and aimed for her back. Of course, it failed to hit its target this time as well. It was because Twisted Kindness vanished from thin air and appeared far away. She had used Teleport.", "However, this was precisely what Seol Jihu was aiming for.", "Seol Jihu recalled the Spear of Purity when even Flying Spear did not achieve any success. He scraped up his mana, and… Toong! He activated Ethereal Shift as soon as Twisted Kindness reappeared.", "The whole process was smooth and instantaneous. The moment he moved, he grabbed the Spear of Purity that flew back into his hand and simultaneously swung down at Twisted Kindness from behind her back.", "‘Huh?’", "Seol Jihu’s eyebrows twitched. He certainly cut her in half just now, but he didn’t feel anything in his hands. It was like he sliced through the water.", "Even in reality, Twisted Kindness’ severed body was scattering into a mist. It wasn’t as if she counterattacked him either.", "‘What happened?’", "She was expressionless to have used Teleport in a hurry. There wasn’t a hint of surprise on her face. Then could it be that she used a special ability similar to Ego Te Defendere?", "Seol Jihu questioned what happened, but he had no time to mull it over. It was because his second target had bitten the bait.", "“You fucker.”", "Sung Shihyun charged toward him before he descended from the sky.", "“Pulling a trick in the middle of a fight… are you belittling me?”", "Sung Shihyun swung his arm, aiming for the moment that Seol Jihu fell to the ground. His longsword flew out with frightening power as if Sung Shihyun wanted to use this chance to put an end to this fight once and for all. The sword drew a faint path in the air and cut Seol Jihu at the waist in half.", "“It’s over!”", "The moment Sung Shihyun shouted this, his expression turned pale.", "Whoosh!", "The white longsword cut through the air. Unless he had seen wrong, Seol Jihu had disappeared for a second before reappearing. The Blessing of the World Tree had activated.", "Sung Shihyun did a double-take, but he was already showing his back to Seol Jihu. Because he attacked with the intent to finish the fight, he had made a huge movement, and his body had rotated more than necessary.", "In this life-or-death crisis, Sung Shihyun’s Unique Ability, Thought Acceleration, activated.", "Time slowed down. Their slowly moving gazes brushed past each other. In the process, the scene of Seol Jihu grasping his spear once again entered Sung Shihyun’s eye.", "Right. Seol Jihu had expected his first scheme to fail and set both the opponents as targets. Regardless of how Twisted Kindness would avoid his attack, he dug a double-layered trap, knowing that Sung Shihyun would take the opportunity to attack. After all, the same method had proven to be effective in dealing a blow at Scheherazade.", "As a result, his plan worked perfectly. Saving the Blessing of the World Tree until now had proven to be worth it.", "The price for a failed attack was an inevitable counterattack. Sung Shihyun grew restless, knowing what was about to happen.", "‘This is bad.’", "The situation was much more dangerous than before. He didn’t make any preparation in case Seol Jihu counterattacked. He didn’t have time to use Ethereal Shift either.", "He turned around in a hurry and tried to swing his sword. However, his face paled the moment he looked back.", "Seol Jihu’s spear was already flying toward him while emitting a terrifying light.", "‘It’s too late.’", "Sung Shihyun knew instinctively that the spear would reach him a beat faster. His body would be blown into pieces before his longsword could even touch Seol Jihu.", "‘Reach him!’", "Still, Sung Shihyun did not give up and brandished his sword at full force.", "‘Please!’", "He widened his eyes, seeing the golden spear blade that was right in front of him. It was then.", "Craaaack!", "The sound of flesh tearing and bones breaking rang out instantly. At the same time, the spear blade that had come within a hair’s breadth of him abruptly changed course and shook up and down.", "Puk!", "Next, Sung Shihyun felt a sharpness stabbing deep into his stomach.", "“Kuhuk!”", "Suddenly becoming a piece of meat on a skewer, Sung Shihyun’s body shook violently.", "“Fuck….”", "Sung Shihyun reflexively looked down at his stomach, his eyes blinking quickly. The weapon that had stabbed his stomach was none other than Twisted Kindness’ longsword.", "Only then did Sung Shihyun look up, his jaw dropping.", "The longsword poking out of him was piercing Seol Jihu’s waist. His tilted chin was trembling faintly.", "“…Krrrk!”", "A stream of blood flowed down from his shaking mouth. Seol Jihu turned his head down and saw the blade that had penetrated his stomach.", "“I applaud you for digging a trap.”", "A relaxed voice rang out behind him.", "“But did it never cross your mind that my very existence might have been a bait?”", "He felt a soft touch on his shoulder. Glancing backward with difficulty, he saw Twisted Kindness gently placing her chin on his shoulder.", "“That was an illusion, no, a clone.”", "Twisted Kindness smiled gently after meeting Seol Jihu’s gaze.", "“If you want to know when… I could prepare it, thanks to the First Army Commander drawing your attention at the beginning.”", "Seol Jihu’s lips twisted.", "‘So that’s why.’", "He had been wondering why she was just standing there like a puppet. It seemed she had set up a clone and remained in hiding for a perfect chance to ambush.", "He might have noticed it if he had been observing closely. But that was a tall order given the situation, the state of his body, and the amount of attention he had to put in dealing with Sung Shihyun.", "“Don’t be too harsh on yourself.”", "Twisted Kindness whispered.", "“It’s not like we don’t know what state you’re in. Given the status of the First Army Commander and me, we aren’t proud to have joined hands to win either.”", "“….”", "“But this is a war. The result is all that matters. If you want to be strict, didn’t you also attack me with your comrades in the Spirit Realm?”", "Twisted Kindness spoke as if she was making an excuse for herself. It seemed she wasn’t happy with subduing Seol Jihu this way.", "“Hah… Are you fucking kidding me? Couldn’t you have gone a little easier?”", "Sung Shihyun grumbled as he pulled his skewered body out of the sword. He looked extremely annoyed.", "This fight should have been over long ago, but not only did it drag on until now, but he also was almost killed at the end.", "He raised his sword. He didn’t feel like he would be content until he cut off an arm or two before killing Seol Jihu.", "Twisted Kindness seemed to want to finish the job as well. But, just as she grabbed the longsword with both hands and was about to twist it…", "“Euk?”", "Her hands flinched.", "Next, Twisted Kindness’ eyes opened wide."]}