{"cid": "234", "title": "Chapter 234. Follow Me, I’ll Carry You (1)", "content": ["“I heard that you recently returned from a very successful expedition.”", "“Yes, if you check this bag…”", "Checking whether the team had the funding to establish and maintain an organization.", "“Ten people in total… that’s a lot for a team, but far too small for an organization. Do you plan to recruit more members soon?”", "The royal administrator asked whether Carpe Diem had plans to reinforce areas they were lacking.", "Kim Hannah was usually the one answering.", "“It is true that ten people are comparatively few, but you have to take the standard of the team into account. Whether it be rising stars or renowned veterans, Carpe Diem seeks a small force of elites formed with qualified Earthlings.”", "“But ten is still too little.”", "“I disagree. It’s not as if we are the first organization of a small group of elites.”", "“You must be talking about Balhae. You should know that the organization no longer exists. Plus, they founded their organization with twenty people. Most importantly, Balhae was a subsidiary organization of Goguryeo, containing their most powerful elites.”", "“That is one such example, but didn’t Nur also have the White-Haired Witch?”", "“That is Nur. I am an administrator of Eva.”", "“Even in Eva—”", "As Kim Hannah began to return a fluid rebuttal, the royal administrator shook his hand.", "“Stop, let’s stop. I fully understand Carpe Diem’s high standards and what it seeks from its members. I just want to know whether you plan to recruit more members in the future.”", "“Of course, we do.”", "Kim Hannah replied calmly without losing a smile for a single moment.", "“Carpe Diem will join the Neutral Zone auction for next March as soon as it becomes an organization.”", "“Hmm… you must have confidence.”", "“Confidence? The Earthling who killed the Parasite’s First Army Commander is here. That is something no other Earthling has managed to do since the opening of Paradise. In fact, not even the Federation has done anything like it.”", "Kim Hannah added that the Neutral Zone was guaranteed to be theirs no matter the number of organizations bidding for the spot. Only then did Sorg Kühne nod his head.", "After a brief back and forth where neither side lost out, Sorg Kühne suddenly put down the documents in his hand.", "“…There is something I’ve been personally dying to find out.”", "He interlocked his fingers and stared at Seol Jihu fixedly.", "“Just like Miss Kim Hannah said, the Earthling, Seol Jihu, is Haramark’s war hero.”", "“….”", "“Haramark has been his base of operations since the beginning. I will be blunt. Making an organization in Haramark would have been much easier, so what is the reason you want to come to Eva?”", "The question Seol Jihu had been waiting for was finally here.", "Kim Hannah had told him that the royal administrator would most certainly ask him this question.", "After a brief moment, Kim Hannah answered first.", "“Is that question related to the documents we sent?”", "“Technically, no. I admit it. But to me and to Eva, this is a very important question.”", "His firm voice made it clear that he must hear the answer.", "Kim Hannah gave it some time before speaking quietly.", "“That’s a rather impertinent question… but I can guess what you’re worried about. I remember hearing Eva’s circumstances.”", "“Circumstances?”", "Sorg Kühne’s eyebrows twitched.", "“Yes, circumstances.”", "Kim Hannah spoke without batting an eye.", "“I fully understand your worry, but if you, Mister Sorg Kühne, really want the best for Eva, wouldn’t betting on Seol Jihu be a worthwhile investment? I’m sure you’ve heard the rumors.”", "Sorg Kühne closed his mouth for the first time and listened to Kim Hannah quietly.", "“I won’t repeat what you probably know already. If you consider Seol Jihu’s achievements, not just in the war, but also in Haramark…”", "Kim Hannah trailed off on purpose as letting him complete the sentence on his own seemed more effective.", "After a short silence, Sorg Kühne spoke in a grave tone.", "“…As an evaluator, I’m always told good things. They’ll make me dream of a rosy future every time. And reality has always been the opposite.”", "“I’m not asking you to believe me.”", "Kim Hannah shook her head.", "“I’m asking you to see Seol Jihu and the path he has walked thus far in Paradise. Because that is an undeniable truth.”", "Sorg Kühne dropped his head as if he had nothing to say in response.", "At that moment, Jang Maldong began to speak.", "“Kühne, do you know why I came out of retirement?”", "He pointed at Seol Jihu with his cane.", "“It’s because of this brat. Ian tempting me was a part of the reason, but this young man is the true reason I decided to return to Paradise.”", "Jang Maldong was clearly backing up Kim Hannah’s explanation.", "Hearing this well-timed support, Sorg Kühne nodded his head before turning to Seo Yuhui.", "He was asking whether she had any input on the matter and that it would be taken into consideration as well.", "Seo Yuhui cupped her hands together respectfully and smiled cheerfully.", "“Our Jihu… is really kind.”", "“…Excuse me?”", "Sorg Kühne blinked.", "Then, he let out a dry cough.", "“Kuhum, I understand what you mean. I’ve also heard enough about Mister Seol Jihu to make my ears bleed, and the Queen holds great interest in him as well.”", "The smile on Kim Hannah’s face became thicker.", "“I’m not trying to find faults. I’m asking purely out of personal curiosity. Will it be possible for me to talk with Carpe Diem’s leader alone?”", "It was a sudden request, but Kim Hannah got up from her seat immediately.", "“Of course, we’ll excuse ourselves, so please talk freely.”", "After patting Seol Jihu’s back a couple of times, she headed toward the door. Following Kim Hannah, the other members of Carpe Diem left until only Seol Jihu and Sorg Kühne were left in the room.", "Sorg Kühne began the conversation.", "“Why didn’t you say anything?”", "“Pardon?”", "“You are the leader of Carpe Diem. I wanted to talk to you, but you only had your proxy talking.”", "Seol Jihu laughed.", "“Hannah’s really enthusiastic about this.”", "“Enthusiastic, is it? Well, she was quite fierce.”", "Sorg Kühne smacked his lips.", "“She clouded the issue whenever I tried to dig into a matter with a believable logic. She even rebutted every point and shut me up. The way she already had her answers prepared and carefully baited me toward it, it was like I was being played by a vixen. It’s been long since I felt so exhausted from a conversation.”", "Sorg Kühne shook his head with a fed-up face.", "Seeing his tired eyes remaining on his teacup, Seol Jihu reached out and offered his hand.", "“Why don’t you take a breather? Have some tea.”", "“It’s fine. Miss Foxy not being here is already opening up my throat.”", "He heaved out a puff of air from his nose before shaking his head and tilting his chin.", "“Anyway, I have a question for you.”", "‘Again?’", "Seol Jihu tilted his head.", "“What is the reason you’re coming to Eva?”", "“Didn’t we just—”", "“That was Miss Foxy’s answer, not yours.”", "Sorg Kühne said flatly.", "“This may come off rude, but I’ve contacted the Haramark Royal Palace before coming here and asked them several questions.”", "“….”", "“If you are really the Earthling from the rumors, there is no way Haramark would let you go. At least, they would try their best to make you stay. But the fact that you’re still coming to Eva… maybe it means that there are problems that the public is not aware of. That was my thinking, anyway.”", "Seol Jihu laughed.", "“I doubt you were met with kind words then.”", "Sorg Kühne also chuckled.", "“Fufu, it was a mess, alright. Princess Teresa was especially noteworthy. You thieving cat, where do you think you’re coming without permission. If you dare to take him away, Eva will be erased from the map. Things like that.”", "“T-That’s a bit too harsh.”", "“It’s totally fine. Princess Teresa often bickers with Eva’s Queen. I’m fully aware that she meant it as a joke.”", "Right, Teresa probably didn’t mean it for real, and that was probably why Sorg Kühne was saying this jokingly.", "“Anyway, I know that the reason you’re coming to Eva is not because of some problem. And that’s only making me more curious.”", "“If I tell you it’s for the sake of Paradise… would that suffice?”", "“I hate answers that sound like riddles the most.”", "That was something Seol Jihu wholeheartedly agreed with.", "Seol Jihu scratched his head.", "Normally, this would be where he answered, ‘Because I don’t want to fight with Sicilia.’", "But it didn’t look like Sorg Kühne would welcome that answer.", "So, he decided to give another one.", "“I’ll tell you if you promise not to laugh.”", "“As long as I feel that you are sincere, the corners of my mouth will not go up.”", "Sorg Kühne leaned forward in a show of interest.", "“I haven’t told anyone yet, but…”", "Seol Jihu finally revealed one of the new goals he planned to achieve in Eva.", "“It’s because of the Federation.”", "“The Federation?”", "Sorg Kühne’s wrinkly eyes widened at the unexpected answer.", "“Yes. I’m sure you know a lot about the Federation, Mister Sorg Kühne. About the importance of the Federation to the current Paradise and its relationship to humanity.”", "“There’s no need to even mention it. The Federation and humanity are sharing the same fate. Though, their relationships leave much to be desired.”", "Seol Jihu was worried Sorg Kühne would say something like the Federation being a union of an alien race and foreign races, but it didn’t seem like he was such a stuck-up person.", "Judging by what he said about the Federation and humanity’s relationship, it seemed he knew all about the state of the current situation.", "Thinking that Sorg Kühne was someone he could talk to, Seol Jihu continued his words.", "“One of the reasons I’m trying to relocate to Eva is to improve humanity’s relationship with the Federation. Moving past our current ambiguous relationship to a definite alliance, I hope we will be able to exchange more direct interactions.”", "“Mm, but isn’t that something you could do in Haramark as well? Of course, Eva is closer to the Federation and has minor conflicts with them, but—”", "“That’s exactly why.”", "Seol Jihu said flatly.", "“The conflicts between the Federation and Eva aren’t minor at all. I’ve recently witnessed a problem myself.”", "Sorg Kühne’s complexion darkened as Seol Jihu had just poked at Eva’s deep-rooted evil.", "“Unless these conflicts are resolved, improving our relationship with the Federation will be a faraway dream.”", "“….”", "“Though, even after that, we will have to deal with piled-up problems like the Beastman Alliance…”", "Seol Jihu sighed.", "Sorg Kühne closed his mouth and shut his eyes.", "“The Federation. The Federation, he says…”", "He repeated the same words for a long time before finally breaking out into a smile.", "“This is the first time I’m hearing it.”", "“Pardon?”", "“We will make Eva a ton of money. We will protect Eva. These are the words I’m used to hearing at these evaluations. This is the first time I’ve seen an Earthling hoping to come to Eva to resolve our conflicts with the Federation.”", "Seeing how he was faintly smiling, he didn’t seem displeased.", "“Fine. If what you say is true, then I have another question to ask you.”", "Seol Jihu didn’t show it in his face, but he was thinking that Sorg Kühne was a little too strict.", "In the next moment, Sorg Kühne held his fists out in front of Seol Jihu.", "“Here are two evils.”", "He raised his left hand.", "“One side is controllable and seemingly has good functions, but its true nature is evil.”", "Next, he raised his right hand.", "“The other side is also evil. But this side is a total, irredeemable evil; a gang of racketeers and conmen who pay no attention to the Federation or anyone else and do all sorts of dirty work.”", "He then put his left and right hand together.", "“The important thing is that these two evils are preventing each other from going berserk and doing as they please. In other words, their mutual existence keeps each other in check.”", "Sorg Kühne asked Seol Jihu.", "“If you had to choose between these two evils, which would you choose?”", "Seol Jihu’s eyes narrowed.", "It seemed like a completely random question, but that surely wasn’t the case as it was coming from Eva’s royal administrator. It had to have something to do with Eva’s internal affairs.", "After contemplating for a moment, Seol Jihu decided to answer honestly. That seemed to be what Sorg Kühne wanted.", "Once he organized his thoughts, he grinned.", "“I didn’t think I’d be asked this question.”", "“Mm? Has someone asked you a similar question in the past?”", "“No, but I’ve seen it before. In a game.”", "“A game?”", "“Ah, don’t think about it as a simple form of entertainment just because it happens in a virtual world.”", "Seol Jihu continued.", "“The main character of that game said this: evil is evil.”", "Sorg Kühne’s eyes turned sharp.", "“Lesser, greater, middling… makes no difference. The degree is arbitrary. The definition’s blurred. If I’m to choose between one evil and another, I would rather not choose at all.”[1]", "Seol Jihu smiled.", "“It was very memorable. You just reminded me of that line.”", "“…Let me ask just to be sure.”", "Sorg Kühne opened his mouth after silently listening to Seol Jihu’s answer.", "“Does not choosing mean you will remain an idle spectator?”", "“No.”", "Seol Jihu shook his head.", "“It means I won’t let either side have their way. At least, that’s what it means to me.”", "Hearing this, Sorg Kühne let out a faint groan.", "“For the Federation’s sake… evil is evil…”", "He dug deeper into the couch and let out a long sigh.", "Tok, tok. Knocking on the table with his index finger, he fell into thought. Then, he glanced at the teacup before grabbing it.", "Slowly, he tilted the cup toward his mouth.", "It was as if he was slowly savoring the taste of Seol Jihu’s answer.", "“You won’t let either side have their way…”", "Only after a few minutes passed did he put down his tea cup and speak.", "“To be honest, the scale of the matter at hand is too grand for me to grasp clearly.”", "His mouth was forming a gentle smile as if he was having a nice dream.", "“But coming from the man who killed the infamous Undying Diligence, they don’t sound like empty words.”", "It was just as he said.", "What if Chohong or Phi Sora had said these words?", "Sorg Kühne might have respected their chivalrous spirit, but those words wouldn’t have touched him all that much.", "But Seol Jihu was different.", "From acting as bait in Arden Valley to the most recent war, the steps he had taken by risking his life were shining clearly.", "“To tell you the truth, my feelings were already decided the moment I received these documents. I guess you could call it an old man being hopeful.”", "“You mean…”", "“But—”", "Sorg Kühne bit his lip and spoke carefully.", "“There’s a bit of a problem to end the evaluation like this…”", "Feeling a sense of embarrassment from the royal administrator’s voice, Seol Jihu tilted his head. Sorg Kühne waved his hand in denial.", "“Don’t misunderstand. The problem isn’t Carpe Diem’s. It’s Eva’s internal problem.”", "Seol Jihu blinked dazedly.", "*", "Once the talk ended, Sorg Kühne returned to Eva after leaving behind a communication crystal and telling him to call if he could resolve the problem.", "The other members of Carpe Diem rushed in as soon as the evaluation ended, but Seol Jihu stayed seated on the couch and maintained his silence.", "His mind was in a state of disarray.", "Sorg Kühne had described two problems.", "First.", "[Eva currently does not have any land.]", "[We do not have any land to lease out to Carpe Diem because a pre-established alliance stole them all. And that includes even the royal palace’s land…!]", "[We tried our best to just barely protect our right to the land, but they will resist fiercely if we try to chase them out forcefully. I can’t guarantee the Queen will agree either.]", "[Can you acquire land through your own efforts? We aren’t asking for a high standard. As long as the land seems to meet the minimum requirements, I will do whatever is in my power to approve it.]", "Second.", "[And if possible, you should try to recruit a Priest.]", "[Carpe Diem has two well-balanced Archers and an incredible line of Warriors. Its biggest weakness is that it does not have a Priest.]", "[Of course, the Daughter of Luxuria is affiliated with it, but everyone knows that she is currently unable to function as a proper Priest.]", "[Whether you like it or not, rumors of Carpe Diem moving to Eva will soon go around, and I am unsure how Eva’s organizations will react.]", "[They might try to pressure the group. If that were to happen, it is highly likely that they will pick faults with Carpe Diem’s low headcount.]", "[There is a limit to asserting a high standard. If Carpe Diem can recruit just one skilled Priest, that will make it more stable, and I will have something to say as well.]", "What he said could be summarized simply.", "Find land on your own and recruit a Priest if possible.", "“What happened? Why did he leave without talking about the land?”", "Once Kim Hannah came back from seeing Sorg Kühne off, Seol Jihu confronted her with the two problems.", "After hearing the explanation, Kim Hannah snorted.", "“That’s barely a problem.”", "“Really?”", "“It’s common for the royal family to run out of leasable land, making potential buyers to purchase land from an organization. As for recruiting a Priest, look at who’s in this team and how much money we have. Do you really think finding a Priest for a short-term contract will be difficult?”", "The way Kim Hannah spoke like this wasn’t a big deal made her all the more trustworthy.", "“Hannahemon…!”", "“The heck are you saying.”", "Seol Jihu rushed to hug her, while Kim Hannah pushed him away with her foot.", "“Alright, let’s get to work right away. I’m going to go call someone.”", "“Who?”", "“You need to find land, right? Then I have to call organizations in Eva, of course.”", "“You have connections there?”", "“Well, I gave all the officially registered numbers to Sinyoung, but…”", "The corner of Kim Hannah’s mouth curled up.", "“You don’t think I only keep one extra pocket, do you? After hearing that you were going to Eva, I took a few with me when I went to turn in my resignation letter. Anyway, wait here.”", "Kim Hannah skipped into her room, and it wasn’t until 20 minutes went by that she appeared again.", "Then, she spoke.", "“We got an appointment.”", "1. The game mentioned here is ‘The Witcher’, and this remark is made by the main character, Geralt of Rivia. "]}