{"cid": "226", "title": "Chapter 226. I am an Egg (2)", "content": ["[Normally, you have to exchange contribution points for divine power…]", "In an instant, the surface of the egg became dyed in white.", "Seol Jihu vacantly gazed at the white egg that was glowing like a luminous pearl.", "[But I’ll do it without a price just this time, okay?]", "Luxuria giggled while seeing the absent-minded Seol Jihu preciously.", "Soon, the light filling up the egg slowly subsided.", "No, it was being absorbed.", "As if the egg was inhaling the light, the cluster of light slowly petered out until it finally disappeared at the center.", "That was it.", "Seol Jihu barely grabbed the egg as it fell down.", "It wasn’t that the egg didn’t go through any change. First, its surface was brighter and smoother than before. Now, it looked more like a jade than an egg.", "It might just be him, but he felt the egg heat up.", "His hand, which was holding onto the egg, felt warm.", "Seol Jihu looked a little disappointed.", "Well, it wasn’t that he expected some incredible effect, but he was at least hoping it would hatch right away.", "[The test has begun the moment I gave it divine power.]", "A gentle voice awakened Seol Jihu’s mind.", "‘Not after it hatches?’", "[Of course. I’m sure you’ve heard about cases where not a single Authority was granted to the spear’s master, right?]", "That meant the Arcus Spirit might refuse to hatch altogether.", "Seol Jihu was blown back.", "‘What kind of a tricky Spirit is this?’", "Anyway, he had met the minimum requirement.", "Seol Jihu courteously expressed his gratitude. Gula always had her head in the clouds when she explained things, but Luxuria spoke clearly. Seol Jihu liked that a lot about her.", "[Once the Arcus Spirit awakens, you’ll have to come to the temple a lot more often.]", "‘For divine power?’", "[Yes. You’ll be responsible for its growth the moment you become its master.]", "“….”", "Now he was unexpectedly entrusted with childcare as well.", "As if that wasn’t enough, he apparently had to exchange contribution points he’d gathered up to feed it divine power.", "Seol Jihu sighed.", "‘…Should I just sell it and buy another good spear?’", "He even had this embarrassing thought.", "[No, you can’t. I told you, the Arcus Spirit will become a powerful ally and partner, and not just for its Authority. Using contribution points for a lifelong companion isn’t a loss at all.]", "‘I see your point…’", "Seol Jihu smacked his lips and put the egg away in his pocket.", "[You can exchange contribution points for divine power wherever you go, but…]", "Luxuria giggled and raised her voice cheerfully.", "[But I’m hoping my baby will come to my temple more!]", "Seol Jihu smiled awkwardly.", "‘I’m not a baby.’", "A healthy, 26-year-old man, a baby?", "Of course, he might be a baby in a god’s eyes, but Seol Jihu couldn’t help but raise an objection from embarrassment.", "[Fufu.]", "Luxuria let out an indecipherable laugh.", "[To me, you’re still a cute baby… you were back then, and you are now.]", "Seol Jihu tilted his head.", "*", "Sinyoung Pharmaceuticals.", "Going back to roots, Sinyoung started from a business called Soonyang Pharmaceuticals. Although it was only a medium-sized company, when CEO Yun Seojin was invited to Paradise by coincidence, his life changed completely.", "Being excited about a new beginning lasted only a moment. It wasn’t as if his disposition as a businessman, who raised a small family business into a mid-sized enterprise, went anywhere.", "By amassing contribution points, he could take Paradise’s items to Earth.", "Meaning, Paradise was profitable.", "The moment he realized this, Chairman Yun Seojin moved fast.", "He decided to found a new company that was based in Paradise.", "Of all the products Paradise had to offer, what caught his eye was medicine.", "Not only did Paradise have all sorts of mystical medicine, but it also had potions and other drugs made with herbs and alchemy.", "There were all kinds of ingredients he had never even heard of before. To Chairman Yun Seojin, Paradise was a true treasure cove.", "His first product was a liquid medicine that was a diluted version of a potion that raised one’s focus.", "He released it as a sports drink and distributed it not only in pharmacies but also at convenience stores. The result, a massive success.", "Even though he thinned the effect by over a half, the drink immediately cleared up one’s mind and raised their focus for 10 or so minutes. To consumers, it was quite a refreshing product.", "Parents of students were even more excited. Almost explosively excited, even.", "Because of its instantaneous effect, stories of the product spread through the internet like wildfire, and sales saw a steep increase.", "Chairman Yun Seojin didn’t stop there. Settling Soonyang and establishing Sinyoung, he began his Paradise business for real.", "Of course, he couldn’t reveal the existence of Paradise in accordance with the oath, but that didn’t pose a problem.", "In fact, that was what he wanted.", "All he had to do was establish a research institute and say his researchers succeeded in developing new medicine.", "And now, Sinyoung proudly boasted its name in the top ranks of Korea’s pharmaceutical companies, and with hundreds of employees just in its headquarters alone, it was a fully-fledged conglomerate.", "According to the media, if it weren’t for Soyoung Trading Corporation, Hayeon Science, Haesol Institute, and Beauty Vivien, Sinyoung would rank as number one among all conglomerates.", "Going back to the main topic, Sinyoung was the first organization to have adopted a ‘company’ concept in Paradise.", "While it didn’t seem like it would suit a place like Paradise, as that was how Sinyoung operated, it naturally had an internal company hierarchy and a department that evaluated their employees.", "Murmur, murmur.", "Sinyoung’s first-floor lobby was unusually busy today. Quite a few people were gathered in front of the noticeboard, checking the company announcement.", "The title said this: Personnel Transfer.", "It was unusual in a way. The employees’ performance only really affected whether they got promotions, and layoffs in Paradise were practically non-existent. This was because they had to spend a considerable amount of contribution points to purchase a stamp when hiring a new employee.", "Of course, the announcement posted in the lobby wasn’t about a layoff, but a personnel transfer could be similar to one, depending on where one was transferred to.", "Clack, clack.", "When the sound of high-heels rang out, three or four people standing in the center turned back. Seeing who was walking up behind them, they flinched and staggered to the side.", "The crowd gathered in front of the noticeboard split like the Red Sea.", "A ponytailed woman wearing a neat grey suit cut through the crowd.", "Stopping in front of the noticeboard, she read the announcement without batting an eyelid.", "Her gaze stopped in the middle of the list of six names.", "—Personnel Transfer….Chief Kim Hannah → Transferred to Attack Team….", "A hint of bitterness flashed across her face when she saw her name. But because it only lasted a mere moment, no one noticed the change in her expression.", "“Congrats on your promotion.”", "Behind her, a sly voice rang out.", "Kim Hannah quietly turned around.", "A well-dressed man was staring at her with a smile.", "“…HR Director.”", "“Yes, Chief Kim. Or should I call you Manager Kim now?”", "Kim Hannah stared at the director, who was striking up a chummy conversation.", "Congrats? Kim Hannah was a non-combatant specialized for business. Leaving the recruitment team, which had a strong voice in the company, and being moved to the attack team was something to be congratulated about?", "Anyone who knew even a little bit of what was going on would say it was too harsh. However, Kim Hannah’s expression didn’t change in the slightest.", "In fact, she bowed with a faint smile.", "“Thank you, director.”", "The director patted Kim Hannah’s shoulder with a gentle smile.", "“Good luck out there. I put in a good word for you, so don’t make me lose face.”", "“I’ll do my best.”", "“Good, you better. Well, I don’t doubt you’ll do fantastic, Manager Kim. Ah, can you hurry up with organizing your past duties for the transfer? We have a new chief coming in soon.”", "Kim Hannah secretly swallowed hard before smiling.", "“Of course, I don’t see why not.”", "Even though the two of them were all smiles, their eyes weren’t friendly in the slightest. In fact, they both seemed tired of each other.", "“Shin Hansung has been waiting for ages, you see.”", "“I understand.”", "Kim Hannah bowed courteously before turning around. The director stared fixedly as Kim Hannah walked away without a single hint of agitation.", "*", "“How was it?”", "A cheerful voice rang out as soon as the planning department door, located on the highest floor of Sinyoung, opened.", "As the director had experienced this several times before, he simply bowed and replied.", "“Her expression didn’t change in the slightest.”", "“Oh really?”", "Yun Seohui looked rather amused, sitting in front of her desk.", "“I wonder what she’s thinking about. I doubt Chief Kim doesn’t know. After all, she’s known as a fox~”", "“Oh I’m sure she understands the situation, but I also know she’s full of grit. She might really try to endure.”", "“Then it’s your job, director, to make sure she doesn’t.”", "Speaking clearly, Yun Seohui stretched.", "“Aaaaah~ Our Chief Kim~ If only she squashed her ambition a little~”", "Chuckling to herself, she put her arms down before glancing over at the director. She had expected him to say “I agree” or something along that line, but he was surprisingly silent.", "“What’s wrong?”", "“…I…”", "The director seemed conflicted, but he barely managed to eke out his thoughts.", "“It may be presumptuous of me… but why not let her endure for a little while longer? If she tries to, that is.”", "“?”", "“It’s hard to find someone as talented as Chief Kim… Plus, it wouldn’t be bad to hold onto a directly connecting link to Seol Jihu…”", "The director blurred the end of his speech.", "A thick smile spread across Yun Seohui’s face.", "“Then it would be no different than how we’ve been doing things.”", "“….”", "“You must feel a lot of attachment towards her. I don’t blame you. You’re the one who raised her, after all.”", "“No, not at all.”", "“Chief Kim is competent. She’s a talented individual, no doubt about it.”", "Yun Seohui readily agreed. Then, she spoke.", "“Sinyoung has many competent individuals. Even the bottom of the barrel employees are picked meticulously, no?”", "What Yun Seohui meant was simple. She couldn’t deny that Kim Hannah was competent, but that didn’t mean that missing her would leave Sinyoung with an uncoverable hole.", "Yun Seohui spoke as she slowly lowered her arm.", "“Also, about that connecting link. Didn’t we settle this last time?”", "The new method Yun Seohui chose to recruit Seol Jihu was truly clear-cut.", "Since she couldn’t touch him, she would make him come to her.", "Just like when she took in Sung Shihyun.", "The cause of this sudden change in plan lay in Seol Jihu’s rapid growth.", "At first, she planned to look for the right opportunity to recruit him. That was why she put Kim Hannah, their best recruiter, to take care of him.", "But because Seol Jihu grew at a speed that far surpassed their wildest imaginations, Sinyoung had no choice but to suck on their thumbs and watch.", "A good example was the recent incident where an unknown organization tried to blemish his record. The Triads, Sicilia, Assassination Guild, and Haramark Royal Family had all risen up to help him.", "The important thing was that Kim Hannah was responsible for Sinyoung having to remain a spectator.", "Kim Hannah periodically submitted reports on Seol Jihu, and she had always attached excuses to delay Sinyoung coming into contact with him.", "Meanwhile, Seol Jihu surpassed everyone’s expectations and raised his personal value, gathering comrades and making connections. And in the war, he put the nail in the coffin.", "Yun Seohui wasn’t a fool.", "Reassessing just where Sinyoung had gone wrong, she discovered that there were many discrepancies between Seol Jihu’s achievements and what Kim Hannah reported.", "It didn’t take a genius to figure out why Kim Hannah went so far to prevent Sinyoung from making contact.", "It was just that Kim Hannah had hidden it well and prevented Yun Seohui from finding out.", "Canceling Kim Hannah’s plan through her authority and personally going to the cafe was an ultimatum of sorts. Yun Seohui had given Kim Hannah a chance to fix the situation.", "However, Kim Hannah didn’t take any action, so Yun Seohui made her own move.", "“I would have let her be for a little longer if she didn’t try to borrow Seora’s power.”", "Yun Seohui chortled. She understood why people would want to fill another pocket, but even that had a limit.", "Seol Jihu would most likely become one of the titans of Paradise in the future. Yun Seohui wasn’t the type to simply let him be an outside collaborator.", "He had grown so much in less than a year. What would happen if Kim Hannah openly supported Yun Seora in a year or two, when Seol Jihu had become a Unique Ranker?", "Then, things would really be out of her control.", "“A stitch in time saves nine.”", "“But if you chase her out, Seol Jihu might not think so well of it…”", "“Oh? What do you mean by that?”", "Yun Seohui widened her eyes and tilted her head.", "“I thought Chief Kim was walking out with her own feet?”", "When the director gave a bitter smile, Yun Seohui continued.", "“Well, he might not think well of it, but I doubt he’d draw his weapon and barge in. Besides, it is my job to handle Mister Seol Jihu’s law of causality. It isn’t yours, director.”", "The director still insisted.", "“Yes, you’re certainly right. But we have to consider Chief Kim leaving Sinyoung and forming an organization with Seol Jihu…”", "“Director.”", "Yun Seohui gently cut off the director.", "“What are you worried about so much? Organization? Do you think it’s so easy to register as an organization? So much so that it can be made in a single day?”", "“No, not at all.”", "“Even if they do make an organization… well, who cares? As far as I know~”", "Yun Seohui slurred the end of her speech as her eyes curled up like a crescent moon.", "“…Chief Kim has many enemies around her.”", "Her cold voice sent a shiver down the director’s spine. Because her face was making a sweet smile, the discrepancy was even more chilling.", "The director shut his mouth instinctively. He felt like he just saw a line he should never cross.", "Yun Seohui had to be allowing his impudence knowing his loyalty. But at the end of the day, even a hunting dog was a dog. He had to act properly if he wanted his owner to feed him.", "“I understand.”", "Just as the director bowed and turned back…", "“Oh, by the way, director.”", "Yun Seohui stopped him as if she just thought of something.", "“Have you looked into the organization that tried to stain Mister Seol Jihu?”", "“Ah, that incident, you mean?”", "The director furrowed his brows.", "“You see… my apologies, but we are not sure. The information team is still working on it, but they haven’t made any progress…”", "“Mm… it must be hard. Keep going at it. This is a very important task.”", "“Is it?”", "A light flashed across the director’s eyes when Yun Seohui called it a ‘very important’ task.", "“Of course, it will come in handy while dealing with the law of causality. And also…”", "Yun Seohui took a bite of her sherbet using the tiny spoon she was grabbing with her index finger and thumb.", "Her lovely lips closed in as she shrugged nonchalantly.", "“You know my personality, don’t you? I rea~lly hate having someone touch my belongings without permission.”", "As the director had watched over Yun Seohui from a young age, he calmly nodded his head.", "“Yes, of course. I will visit the information team again.”", "“Thank you. You must be busy. You can leave now.”", "Yun Seohui waved her hand with a charming smile.", "*", "After coming back to the office, Seol Jihu studied the egg carefully.", "He had just fed it Luxuria’s divine power, but it stood firm even when he nudged it a couple of times, incubated it, and used it as a bowling ball to hit a bunch of nails.", "“Ooh! Another strike!”", "[Hey! What are you doing!?]", "Bowling with it turned out to be pretty fun, so he did it a few times before Flone caught him and smacked him in the back.", "Anyway, the egg refused to move no matter what he did.", "‘Well, nothing I can do I guess.’", "It’ll hatch when it wants to.", "Murmuring to himself, Seol Jihu hopped onto his bed. After taking ages to convince Flone to introduce herself to the team, he unknowingly fell asleep.", "That was why he couldn’t see it.", "The egg sitting by his head twitching furiously.", "Not really sure what Yun Seohui means when she's talking about dealing with the law of causality..."]}