{"cid": "19", "title": "Chapter 19. Rewards Befitting One’s Achievements (2)", "content": ["“Will you please keep it down over there?”", "The Guide issued a stern warning as soon as things became a bit noisy. Hyun Sangmin didn't say anything else and suppressed his laughter.", "“First of all, let us commence with evaluating your level of cognition.”", "As soon as those words were spoken out, a message popped up in front of everyone's vision.", "[5. Level of Cognition]", "Actions/Emotions/Disposition", "“This is how it should look to you. From the left, Actions, Emotions, and Disposition. Well then, let’s start by assessing your Actions.”", "Suddenly, the left-most column began spinning up and down, just like how it was with a slot machine. Countless words flashed by.", "“The first section reflects how you appear to others through your actions and speeches.”", "As Han's explanation continued, the speed of the dizzying spin gradually slowed down. 'Righteous', 'Fussy', 'Temperamental', 'Disgusting'… all sorts of descriptors flashed by. Seol’s column went back and forth between 'Moderate', ‘Neutral’, and 'Hypocritical’ before finally stopping on the word 'Moderate'.", "“What?”", "Shin Sang-Ah responded to her evaluation as if it was the most absurd thing in the whole world.", "“This can't be right! Is this really correct?!”", "“I assure you, things will only get tougher for you if you are getting shocked already.”", "Han chuckled to himself and clapped his hands. Then, the middle column began spinning this time.", "“The middle column, 'Emotions', reflects your thought process or what you feel from facing certain events or phenomena. Out of the three, you could say it has the most variability.”", "For Seol, the middle column came to a stop with the word 'Curiosity’. Seol nodded his head in agreement. He then saw Hyun Sangmin giggling to himself and couldn't help but get curious – what did he get as his assessment result?", "“And finally…. The last column, 'Disposition'. This one has been raising a lot of controversy for a long time now.”", "Seol didn't even have the time to check using 'General Observation' before the third and the final column began spinning.", "“The 'Disposition' column indicates your inclination according to your overall personality. There have been numerous cases where this part simply repeats what's been shown on [Temperament] of your Status.”", "Seol's heartbeat sped up. He was judged to be 'weak-willed' and 'short-tempered' before. Since he couldn't really dispute those, he had no choice but to unhappily accept them until now.", "“However, there have been quite a few cases, where the ‘Disposition’ and [Temperament] didn't match.”", "Han's voice became rather serious there.", "“How could such a thing be possible? After many debates and research later…. We focused on the fact that [Temperament] was listed under [Traits], while ‘Disposition’ was listed under the [Level of Cognition]. And so, we arrived at a temporary conclusion.”", "Words such as 'Altruistic', 'Selfish', 'Rational', 'Lethargic', 'Evil', 'Detestable' flashed by in front of Seol's eyes…. Until the spinning speed gradually slowed down.", "“If your Temperament is a personality trait formed by interacting with the world at large, then….”", "Seol's column heavily seesawed in between the words 'Moderate', 'Hot-headed' and 'Narrow-minded'.", "“….Then, your Disposition should indicate your true nature; in other words, the foundation that forms the core of who you are. That's what we decided on.”", "However, the column suddenly spun again wildly and landed on 'Chaos' instead.", "“If you find that your Disposition and Temperament don't really match, or you find it disagreeable and that you're unhappy with the assessment, allow me to offer you this advice.”", "Han's voice became as light as air once more.", "“If you wish to change your Disposition, then you'd do well to try changing your Temperament first. You see, I personally hold the view that a good Temperament would naturally lead your Disposition towards the nicer path.”", "If you wish to change – those words rang inside Seol's heart.", "“On the flip side, your Disposition looks good, but your Temperament happens to be not? I can confidently say this – your Disposition too will slowly deteriorate and end up corrupted, eventually matching your Temperament.”", "The implication was simple – he was saying that one should try to change one's Temperament before it negatively influenced one's Disposition.", "And so, the evaluation came to an end. Seol carefully surmised his own evaluation results.", "Moderate (Actions and thoughts are sensible) / Curiosity / Chaotic (Many things are jumbled up and is impossible to unravel)", "[Your Status Window is being updated.]", "'Chaotic….'", "Although his head was tilting to a side ever so slightly, he could more or less understand why he ended up with that assessment.", "No matter what, the contradiction coming from the disposition he used to have up until his early twenties, the disposition he revealed after falling into a gambling addiction and losing his ability, and finally, the disposition he suddenly gained after experiencing that dream, was as chaotic as one could imagine.", "“Of course, that's not an easy thing to accomplish. The ‘Disposition’ has the lowest chance of changing, after all. Meaning, a person doesn't easily change.”", "Han winked a little here. It happened, then.", "Koong, Koong.", "Accompanied by loud thuds indicating that someone was coming up, the sixth-floor door was violently flung open. A clearly-incensed woman and a young man hesitantly following behind her entered the rooftop. They were the trio from before. No, one of them was missing now. The girl who pleaded with Seol to save her older brother was not among them.", "“We've brought along the passage fee.”", "With an icy voice, the woman threw down the object in her hand. It was a wooden handle of a mop, one that could be found commonly in any janitor's closet. However, from where a mop head should've been, only blood managed to drip down to the floor.", "Seol felt like he could hear the sorrowful wail of a woman coming from down below. However, the young man hurriedly closed the door behind him.", "A strange but conspicuous light flashed by Han's monocle.", "“What's the matter? Are we not allowed up here?”", "“No. I shall acknowledge it.”", "Han simply smiled even when the woman spat out coldly. In the end, the two belated arrivals also had to go through the assessment of their own Level of Cognition.", "As soon as that was completed, Han ordered everyone to line up in a row in front of the warp gate. The first one on the line was the last woman to arrive. She was glaring at Hyun Sangmin with venomous eyes. A deep grudge could be spied on them as well.", "“Aigoo~, I'm sooo scared.”", "Of course, Hyun Sangmin didn't even bat an eyelid.", "The woman then cast the coins off in a disgusted manner. However, Han showed off an incredible display of dexterity and caught every single one of them. And while maintaining a nonchalant smile, he pulled out a piece of document to read.", "“Let’s see… Ah, it was simple to calculate the points for Miss Oh Minyoung. You will receive 35 Survival Points.”", "“….Survival Points?”", "“You haven't done anything during the first mission, so out of the possible 100, you get 0. No need to mention the second mission either – 0 out of the possible 150. In the third mission, you couldn't even find enough coins for your passage, so also 0. However…. Just now, you have been judged to have struggled bitterly for your own survival, so 35 points were added to your tally. That is all.”", "“Where are we supposed to use these points, then?”", "“You'll find out once you get there.”", "The woman, Oh Minyoung, glared at Han for a long, long time. She then wordlessly stepped through the warp gate and disappeared from the view. The next person was the young man who had followed Oh Minyoung up to the roof.", "“You have 0 points.”", "Han's evaluation was short.", "“You've done nothing. Literally, nothing. I can't even see one category where you might have earned a point or two.”", "The young man was clearly embarrassed as he stepped through the gate.", "And so, the entry procedure carried on.", "Yun Seora received 317 points. Shin Sang-Ah, 116. Hyun Sangmin, 302. Yi Sung-Jin, 114. As for Yi Seol-Ah, she could only receive 46 for the things she had done in the assembly hall. As people stepped through the gate and disappeared one by one, Seol's turn eventually arrived. Han began groaning out as soon as seeing Seol's face.", "“Really now…. I thought I was going to die while trying to calculate your points. Although it wasn't as difficult during the first mission, the second and third missions were really, really problematic for me. Especially so, during the second mission, when things became really, completely nonsensical.”", "“?”", "“Not only were you not satisfied with breaking the all-time clear record, you then proceeded to destroy all of the traps as well as the mechanisms found there. Such an event is unprecedented.”", "The tone of his voice was quite combative, but Han was beaming rather brilliantly.", "“In any case, here is your points tally. During the first mission, 200 bonus points added after successfully chasing away the Gaekgwi from the assembly hall. Also, you made a correct move by going upstairs as soon as emptying out the convenience store. Since you were in possession of the diary, all you needed to do was to procure some food. So, 100 bonus points. Another 50 bonus points for rescuing Miss Shin Sang-Ah.”", "That amounted to 350 points. Hearing this, Seol tilted his head.", "“I thought 100 points was the maximum for the first mission?”", "“That's only for the base points. If you perform certain actions that weren't included within the mission goals, you're eligible to receive bonus points if those actions fall under certain categories. These bonus points can be as much as double the amount of base points.”", "Seol nodded his head in acceptance.", "'Is that why both Yun Seora and Hyun Sangmin have high scores?'", "Just by receiving the points from the first mission, he had become the top scorer.", "“For the second mission, the basic score is 150. 300 bonus points for the fastest clear in history. Another extra 300 points for destroying every trap and mechanism found. Total of 750 points.”", "“….”", "“For the third mission, the base points on offer are 150. 300 bonus points for finding as many coins as you have during the treasure hunt. 300 extra points for killing the Gaekgwi alone. 150 extra points for reviving Miss Yi Seol-Ah. 100 extra points for the act of giving out some of your coins to others, seen as an act of mercy. Total of 1050 points. When calculated together, 2150 points.”", "Han spoke non-stop up to here, but he wasn't finished yet.", "“And finally, possessing the Mark of Survival – which adds a 10 times multiplier. So, your total Survival points tally is 21500.”", "Han folded the paper away and stared at Seol with an envious expression.", "“….You must be very happy. Your points tally is the highest in history. You might even be able to use the VIP store as well.”", "“The VIP store?”", "“There is such a thing. You'll see once you get there…. Oh, I almost forgot.”", "Han suddenly displayed an extremely friendly attitude and leaned in closer to whisper something to Seol's ear. Seol began frowning somewhat after hearing the Guide out.", "“I do have it in my possession. But, why….”", "“I was only reminding you since you seem to have forgotten all about it. After all, you were lucky enough to draw them in the first place. Fufufu.”", "Seol was about to ask something, but then, the blonde maid began pushing him from behind.", "“H, hey! Wait a minute!”", "“My role ends here.”", "The last thing Seol got to see as he was being pushed into the warp gate was….", "“I wish you best of luck in the Neutral Zone.”", "….Han politely bowing his head, his hand placed on his chest.", "*", "As soon as Seol entered the warp gate, he arrived inside a small room. Seven people who entered before him were waiting there.", "The blonde maid was still pushing Seol forward while panting quite heavily. Once they were in, she let out a big sigh of relief and walked past everyone. She opened the exit door and pointed towards the passage beyond it, before walking first in light, airy steps.", "The passageway was made up of marble. It was long and dark like a tunnel. The group simply followed the maid while remaining completely clueless as to where they were headed off to. But, when they spotted light from a distance, a certain sense of excitement began filling them up.", "The maid arrived at the exit of the passage first and her steps came to a halt. She then softly opened her mouth.", "—Korea, Area 1, cleared.", "An unexpectedly clean and beautiful voice came out of her mouth.", "'She could actually speak?'", "As Seol stood there stewing in mental shock, several other clean and nice voices rang out from somewhere and entered his ears.", "—Europe, Area 2, cleared.—Germany, Area 3, cleared.—North America, Area 4, cleared.—Asia, Area 5, cleared.—Africa, Area 6, failed.—China, Area 7, cleared.—South America, Area 8, failed.—Oceania, Area 9, failed.", "“That's a bit weird, isn't it?”", "Hyun Sangmin muttered almost inaudibly.", "“What is?”", "“Six of those areas are the six continents, right? So how come Korea, Germany, and China get a separate area designation? Hey man, what do you think?”", "Seol shook his head.", "“Ah, she's moving again. Are we supposed to enter first?”", "Hyun Sangmin's guess proved to be correct. Beyond the exit of the passage was a large and empty area, shaped like a high-end theatre. While walking on the red carpet, Seol took a look around him.", "Towards the darkened front, he could sort of see a stage. Although the lights were off, there were some strange things on the walls that glistened and managed to illuminate the darkness a little bit. The ceiling was so high, he couldn't even see it properly.", "The maid leading in front took the group towards a row of chairs located just before the stage. The number of chairs was exactly eight. After confirming that everyone had taken a seat, the blonde maid climbed up to the stage and disappeared behind the curtains.", "That was the signal; Seol could hear many more footsteps coming from behind him.", "“I guess they are from the Area 2. Was it Europe?”", "Hyun Sangmin spoke as he turned his head around to look. Over thirty people were following a maid to their seats.", "The place this maid led them to was a location a bit behind Seol's group. There was a total of 32 chairs. The unfamiliar maid also disappeared behind the curtains as soon as she was done leading them to their seats.", "'So, that many people survived the European Tutorial.'", "As Seol wordlessly checked them out, one of them also began looking at Seol. It was a woman sitting in the middle of the front row. No, perhaps it would be more correct to call her a girl, instead.", "She possessed curly light brown hair and a pair of eyes bright enough to softly shimmer within this darkness. The rest of her face revealed with the aid of a white hairband holding her hair back was very memorable as well.", "Seol ended up inadvertently focusing on her neck that reminded him of a beautiful orchid flower until he saw her waving her hand slightly in greeting. So, he inadvertently ended up greeting back with a slight nod as well.", "Meanwhile, people continued to stream inside. Soon enough, Seol got to learn that the number of survivors differed greatly from area to area. Perhaps Hyun Sangmin thought of the same thing as he was constantly muttering to himself.", "“We have eight people. Europe, 32. Germany, 10. North America, 11. Asia, 17….”", "The queue of people steadily entering this large area briefly broke up. A short while afterwards, five men, all wearing the same type of black suits, appeared from the passage. And there were three people following behind them as well – all women, and for some reason, their heads lowered.", "“Huh. A group of five decked out in identical suits…. Oh, there are three more. So, a total of eight people from China, I guess?”", "That was the end of the queue and no one else entered afterwards, no matter how long they waited.", "“Does that mean there are no survivors from South America and Oceania?”", "“Don't forget Africa, too. When transitioning from Area 5 to Area 7, there was a short gap there.”", "Hyun Sangmin added his opinion while agreeing to Seol's guesses.'So, that means….'", "The surroundings became quiet. Sitting inside this lengthy silence, Seol inexplicably began recalling Han's words from earlier on.", "“You possess the notes from the Guide with you, yes? How about reading them and see what's written on them? Ah, I suggest that you read them while you're alone, if possible.”", "Seol got that 'note' while drawing medical supplies. There were three of them, even. But, why did the Guide go out of his way to mention them? They weren't even the so-called SPECIALs, either.", "Unable to calm his curiosity, Seol pulled his bag closer to open it. However, just as he was about to reach in….", "The curtains hiding the stage were silently pulled to the side.", "Paat!!!", "Suddenly, blinding lights bathed the stage.", "Not just Seol, but every survivor from the six continents dazedly stared at the brightly-lit stage."]}