{"cid": "404", "title": "Chapter 404. For the End (2)", "content": ["A meeting between Valhalla and Sinyoung was finally confirmed.", "News that Sinyoung had sent the invitation instantly spread throughout the entire region. The public thought what was to come had finally arrived.", "Most intelligence agencies had predicted that Sinyoung would accept Valhalla’s demands.", "The card that Valhalla had played — the migration of the Federation — was a checkmate to Sinyoung considering the dire straits. There was only decline waiting for them if they refused.", "They had no choice but to accept.", "However, this acceptance implied that Sinyoung was yielding to Valhalla. In other words, the regime that reigned for many years would change. Sinyoung was finally stepping down from their throne.", "In any case, the result of the meeting had not been revealed yet, so the whole city refrained from coming to hasty conclusions and placed their attention on the Scheherazade Royal Palace.", "However, the place that was at the center of so much public attention remained very quiet.", "Not to mention Scheherazade’s queen, but Yun Seohui and dozens of other Sinyoung members were all seated at the table, but no one spoke a word. They weren’t even looking each other in the eyes.", "In the silence, which was devoid of even the sound of breathing, everyone remained rigid with uncomfortable faces.", "After an unknown amount of time…", "The deathly silent palace suddenly became rowdy. One by one, the people sitting there with gloomy faces frowned as they turned towards the entrance.", "A moment later, one of the queen’s attendants opened the palace doors to announce the news.", "“T-They are here!”", "But why had the attendant come in with such haste?", "As the people whispered amongst themselves with puzzled expressions, the palace doors that were about to be closed slammed open again. And…", "Bang!", "The sound of a foot powerfully slamming down on the floor rang throughout the palace.", "Everyone grimaced in surprise at the sudden boom.", "A red-haired woman stood at the entrance with a confident smile. Her left hand rested on her waist where her longsword was hung while her right foot was stretched out to slam the floor.", "It was the captain of Valhalla’s vanguard team, the Level 6 Duke, Phi Sora. She flashed a smile before proudly striding across the palace hall.", "“What is the meaning of…!”", "One of Sinyoung’s members burst out in anger before hastily covering his mouth.", "A tall black man who walked in behind her had glared at him with a scary expression. It was the Level 5 Barbarian Champion, Richard Hugo.", "That wasn’t all.", "Grand Steel Sniper, Marcel Ghionea; High Templar, Chung Chohong; Archranger, Ayase Kazuki; Imperial Knight, Oh Rahee…", "A force composed of only High Rankers appeared one after the other, every one of them emitting a powerful aura.", "Each one of Valhalla’s members was quite famous as they had completed hard expeditions for the past few years.", "However, rumors were known to always be embellished.", "That was what the people present thought too. However, seeing them personally instantly drove away that notion.", "Instead, their mind and body were suppressed into intimidation, causing them to be unable to meet their eyes.", "Valhalla’s members really looked like they would immediately draw their weapons at any moment, so Sinyoung’s members were more than a little disconcerted. Never in their dreams had they imagined that Valhalla would come out like this.", "It was almost a declaration of war.", "Considering how Hanoi had met its downfall when Valhalla was holding their talk with the Japan Business Federation, Valhalla’s actions could be seen as a show of force right before a declaration of war.", "Eventually, the personnel from Valhalla entered the palace before parting left and right. From behind them walked in a young man accompanied by the attendant.", "Level 7 Star Seeker, Seol Jihu.", "The Unique Ranker and the one who had the final say in today’s meeting finally arrived.", "“Val, Valhalla’s representative has arrived.”", "The attendant belatedly announced his entrance in a small voice.", "Kim Hannah walked in next to Seol Jihu, trying her hardest to control her expression. She felt an immeasurable sense of pleasure feeling the sour gazes of the people towards her right.", "She felt as if she was trashing a wedding of her ex who had dumped her, in hand with a perfect boyfriend with excellent abilities and looks. Just how long had she waited for this moment!", "While walking, she happened to meet the gaze of an executive member she knew.", "Long time no see, Manager Shin.", "Shin Hansung gave a bitter smile after receiving Kim Hannah’s nod.", "Seol Jihu, who had gone ahead, looked up at the woman with faded blonde hair sitting on her throne.", "‘Her hair…’", "She most likely originally had rich blonde hair like Charlotte Aria, but for some reason, her hair was now dark as if she had bleached it.", "At any rate, the woman that was staring at him with bunny-eyes seemed to be the queen of the city, Roe Scheherazade.", "In truth, Seol Jihu had developed a prejudice against the Scheherazade Royal Family after they sent their guards when he was trying to capture Roberto Servillo and also when they sent an envoy to Eva afterward.", "At the very least, he didn’t see the royal family in a favorable light.", "It was for this reason that he sent Phi Sora to display a show of force. After all, wherever Sinyoung had spread its influence was enemy territory.", "Nevertheless, she was the queen of a kingdom. Unless he wished to bathe the place in blood, he had to bear some courtesy.", "“Thank you for inviting us.”", "As Seol Jihu flashed a smile and knelt on one knee, the rest of Valhalla’s members slowly knelt while looking up at the queen.", "“It’s my pleasure to meet you, Queen Roe Scheherazade. I am Valhalla’s representative, Seol Jihu.”", "A low voice that was pleasant to the ears rang in the palace.", "Roe Scheherazade was at a loss for words. Only when Yun Seohui lightly coughed did she regain her senses and unconsciously nod her head.", "“Y-Yes. You did well to come here. Uh… To meet Valhalla’s representative today, I am also…”", "She mumbled while glancing towards the area where Sinyoung was seated. Her actions were unbefitting that of a queen, but such matters no longer surprised Seol Jihu. It wasn’t as if there weren’t other cities where their king or queen didn’t act like a ruler…", "“P-Please take a seat. I hope that today’s talk will end on a good note for both parties.”", "Valhalla’s members were seated on the opposite side of Sinyoung.Seol Jihu sat down on the seat closest to Roe Scheherazade on the long table before looking at Yun Seohui who was seated across from him. Yun Seohui gazed back at Seol Jihu.", "A few members let loose their pent-up breaths, but the hall soon filled with new tension.", "Kim Hannah slowly swept her eyes across the table with a relaxed face.", "It was normal for the host to speak up first. However, all of Sinyoung’s people remained silent.", "‘Are they handing over the initiative?’", "This meeting was most likely going to end up as a negotiation between the two parties.", "Kim Hannah, who expected Sinyoung to impose some conditions in exchange for accepting their demands, felt that it wasn’t too bad.", "That said, she chose to prod them instead of pouncing on the opportunity. Of course, she first had to receive permission to do so.", "“Representative.”", "Seol Jihu quietly nodded when Kim Hannah asked in a small voice.", "“First of all, I’d like to thank you for inviting us to this meeting. We were worried when the invitation would arrive.”", "Kim Hannah lightly threw words full of hidden connotations while flashing a smile. She continued while secretly praising herself for taking the extra care with her wedding makeup for this very day.", "“But… Why don’t I see a few people that should be here?”", "“The chairman retired from Paradise a while ago.”", "A reply immediately came when she asked while looking at Yun Seohui. Kim Hannah pursed her lips.", "“So the chairman had nothing to do with this incident. Did I understand that correctly?”", "“While we have not officially announced it, the chairman has been semi-retired for a while. He passed over all of his authority to me two years ago and has since been enjoying his pastimes on Earth.”", "“Is that the case? This is the first time I am hearing of this. But setting that aside… shouldn’t there be another person present?”", "“The HR director, Jung Minjong, is… currently in disciplinary confinement.”", "“I see. Is he perhaps ill and at a hospital?”", "“…No, he is not.”", "Yun Seohui composedly continued.", "“The HR director, Jung Minjong, is still asserting his innocence. However, Sinyoung made a tentative conclusion concerning this case a few days ago. Sinyoung has decided that the HR director, Jung Minjong, is better off not attending this meeting, so we did not call him. He himself rejected participating as well.”", "Kim Hannah’s eyebrows went up.", "“Of course, we have no intention of covering up Jung Minjong’s crimes. Currently, Sinyoung employees are taking shifts to watch over him 24/7 and will immediately summon him back to Paradise once we reach a conclusion. We plan to use forceful means if he does not comply.”", "“.…”", "“In the case that he escapes, which I guarantee won’t happen, I will take full responsibility. I ask for Valhalla’s understanding regarding the actions that we’ve taken to make today’s talk a little smoother.”", "Yun Seohui replied in a calm voice. She maintained her unwavering attitude from start to end.", "Kim Hannah smirked before opening her folder.", "The opposing party was displaying a far more submissive attitude than she expected. Judging that she had prodded them enough, Kim Hannah decided to take the initiative.", "And so, she openly began firing at the enemy.", "“Why did Sinyoung attack Valhalla?”", "She fired questions based on the Five Ws and H.", "The issue was that all her questions weren’t focusing on the who, what, when, where, and how but arrived at \"why\"s.", "“François Delon was undeniably affiliated with Sinyoung and was known to be Sinyoung’s ace after Sung Shihyun left…”", "“If that’s truly the case, then why was the explanation announced so late? You mentioned that an internal investigation took place, but that was only when everything was already brought to light…”", "“Not to mention that you conspired with your partner organizations. Just for what reasons did you…”", "Kim Hannah ruthlessly attacked the opposing party while Yun Seohui calmly explained everything without a change in expression.", "“François Delon was the team leader of Attack Force One and was known to regularly talk with Jung Minjong on a personal basis…”", "“To Sinyoung, this incident was a bolt out of the blue since we were absolutely unaware of it. The accomplice, Bishop Roberto Servillo, was taken captive while the HR director, Jung Minjong, adamantly stated that he had nothing to do with the incident, making it hard for us to find out the truth…”", "“I’d like to remind you that the reason the organizations said such things was because of a single person. We also are displeased with Director Jung Minjong and will absolutely not remain a mere spectator…”", "“What I’m trying to say is that we’d like you to look at the origin of this incident. When Bishop Roberto Servillo publicly confessed his crimes, the only person he mentioned was the director of human resources, Jung Minjong, whether it was for plotting or secretly contacting the organizations.”", "Before they knew it, the meeting changed from a talk to something like a congressional hearing.", "You did that, right? No, that wasn’t us.", "The expected questions and answers were traded back and forth.", "Kim Hannah restlessly hounded their faults, while Yun Seohui admitted to the facts while reducing it to an act of an individual, not Sinyoung as a whole.", "It was practically a meaningless conversation as everything went as predicted from both sides.", "What really mattered was the following conversation.", "“I know we aren’t in the position to ask this, but… I’d like you to trust Sinyoung a little more.”", "Yun Seohui, who barely withstood Kim Hannah’s offensive, looked at Seol Jihu while placing her hand on her chest.", "“The reason we invited Valhalla to this place today is not to offer excuses or to negotiate, but to openly admit our faults and clear our misunderstandings.”", "“…Misunderstandings, huh.”", "Seol Jihu, who had silently been listening after leaving Kim Hannah to carry the conversation, spoke for the first time.", "“From what I’ve heard so far…”", "Everyone’s attention was suddenly focused on him. Seol Jihu clasped his hands and slightly leaned forwards.", "“You’re really good with your words.”", "Yun Seohui’s throat lightly trembled.", "“You mentioned clearing misunderstandings, but… Is the scope of the misunderstandings limited to just this incident? Or does it include past events as well?”", "“By past events, you’re saying…”", "“Hmm. There’s no way you don’t know, right?”", "“…”", "“Actually, the Sinyoung I know is a pretty ambiguous organization.”", "Seol Jihu smirked.", "“I have both good and bad memories of it. Well, I can’t make myself forget the time I was chased out of Scheherazade and forced to move to Haramark as soon as the Neutral Zone was closed.”", "“That…”", "Yun Seohui attempted to speak but Seol Jihu raised his hand. He signaled that he had more to say.", "“Yes. I know. If there are bad memories, then there are good ones as well. I heard that the one who gathered the Executors and sent reinforcements when Haramark was in danger was none other than you, Sinyoung’s representative director, Yun Seohui.”", "“….”", "“And you even personally attended Valhalla’s opening ceremony and lent us a hand. I’m still grateful for that day. Really.”", "Seol Jihu continued.", "“And if possible, I would like to cherish the gratitude I felt towards Sinyoung back then.”", "Yun Seohui shut her eyes as if she guessed the words that would follow.", "“Coming back to the main topic, after hearing what you’ve said… Yes. I think that’s possible. Sure. You might not have been aware.”", "“.…”", "“But I have no intention to withdraw my statement that I publicly announced a few months ago.”", "“.…”", "“Aren’t human relationships like this as well? I apologized, or, I apologized and you didn’t accept it. If the perpetrator acts like this, the victim would become terribly mad. A sincere apology that the victim could accept has to be made before the victim can decide whether to accept it or not.”", "After saying that, Seol Jihu glanced sideways at Kim Hannah. Noticing his signal, she took out a document she had prepared in advance, out of her folder before looking at the attendant.", "A moment later, the attendant carefully passed the document to Yun Seohui.", "Seol Jihu said nothing more. The other party should now be clear of what he wanted and what she had to do from then on.", "It was obvious that the contract given to Sinyoung had more reinforced conditions, unlike the one given to the several organizations.", "1. Those who sign the contract shall not collude with the Parasites and not do anything against the interest of humanity.", "2. In the case that a war against the Parasites breaks out, those who sign the contract shall spare no effort to help humanity.", "These two terms remained unchanged.", "After spending a few days struggling to think how much Sinyoung would consent to, Kim Hannah added a few more provisions.", "The first was for the HR director, Jung Minjong, to be handed over to Valhalla.", "The second was for Sinyoung to withdraw all of its branch offices except the one in Scheherazade.", "And lastly, for Yun Seohui to step down from her position as the representative director.", "In addition to these, she added another provision which stated that on the day of fulfillment of the above three terms, Sinyoung would be allowed to organize the Federation’s migration that would take place six months later, if Sinyoung wished for it.", "Seol Jihu carefully observed Yun Seohui who was staring at the contract.", "The intent behind the added provisions was plain. The first needed no explanation, the second and fourth were to reduce Sinyoung’s authority and status, while the third was to make Yun Seora, who was close to Seol Jihu, the new representative director.", "‘The third and fourth provisions are rather strong, but…’", "Up until now, the responses of the organizations that met with Valhalla had been largely similar. They would suck up to him, only for their complexions to instantly change when shown the contract.", "So he was curious. What would Yun Seohui’s response be? For now, she revealed no change in expression, but how would she act?", "‘She would try to negotiate at least one.’", "It didn’t matter.", "Valhalla had prepared several additional conditions in preparation for any number of cases. Kim Hannah was rummaging about her documents, preparing for the upcoming negotiation.", "And after a few minutes of silence where only the sound of her flipping through the document was heard, Sinyoung’s representative director placed the contract back on the table.", "“…Fine.”", "She took in a deep breath before nodding her head.", "“I accept.”", "Yun Seohui immediately lifted her pen to sign the contract, without the slightest hint of hesitation.", "Seol Jihu’s eyes narrowed."]}