{"cid": "13", "title": "Chapter 13. A Dangerous Treasure Hunt (1)", "content": ["The label above the classroom door read ‘3-1’.", "Seol quietly opened the door. He looked to be in an overall pathetic condition while propping himself up with the metal spear serving as a makeshift cane.", "His boiling-hot rage had cooled down by now, but the sense of emptiness filling him up after the end of his ability, Future Vision, was incredibly hard to endure. It was as if he was overcome with a bout of lethargy.", "The new gathering area was a regular classroom that could be found in pretty much any school out there. Seol chose a chair and as soon as he sat down, he plopped down on the desk with a thud. His eyeballs hurt so much, he thought they might pop out at any moment now. He was also beset with intense fatigue..", "And as he stayed there, barely moving, the door opened again and the classroom gradually became somewhat crowded.", "The total number of casualties during the second mission: 0.", "It was an obvious result, really. Seol ended up destroying every single trap there, so it was not a surprise that everyone got to clear it without a fuss.", "The survivors took an unsure glance at Seol who was still collapsed on the desk. Well, they had to bear witness to some unbelievable scenes that were simply beyond their ability to describe, so understandably, they couldn't stop staring at him. They already had some thoughts as to how special Seol could be, but still, their imagination had been easily exceeded.", "“Are you alright?”", "After flawlessly performing his duty as the trustworthy bag shuttle, Hyun Sangmin asked with a lot of worry in his voice. Seol simply waved his hand to imply, ‘don't worry about me.’", "Shin Sang-Ah entered the classroom in hesitating, faltering steps, then found a chair in a quiet corner for herself and settled down while hiding her face. Yun Seora arrived a bit later after that. Finally, Kang Seok and his lackeys showed up, signaling that all 12 survivors had gathered in the classroom.", "“Well, well, well. I'm truly shocked.”", "When that familiar voice suddenly popped out of nowhere, Seol's eyes shot right open.", "“I couldn't have imagined you'd pass the second mission that quickly. Thanks to you all, my prestige has gone up a level in the meantime.”", "Behind the teacher's podium stood the 'Guide' from the assembly hall, still wearing that butler outfit of his. Everyone stared at Han as if he was some sort of a phantom.", "“I congratulate you on successfully arriving on the fourth floor. I have to ask, did you enjoy the proceedings of the first and second periods?”", "His leisurely and bright tone of voice roused anger in the hearts of almost everyone present. But, they knew there was nothing they could do, so they simply had to swallow it back. Still, the breathing of the bespectacled, middle-aged man quickened noticeably.", "“I'm here to give you all great news. There is only one mission remaining in the Tutorial.”", "“There's another one?”", "“Yes. But, there is genuinely no reason to fret. The reason being….”", "The ends of the Guide's eyes arched upwards.", "“…The remaining mission, it can actually become quite easy and enjoyable for everyone.”", "“Easy and enjoyable…?”", "“Yes. As long as you stick to the rules. All of you.”", "When the Guide emphasized the words ‘all of you’, a dangerous smile crept up his face.", "“Shall I start with the explanations, then? Ah, the mission this time is a little more complicated, and that is why I'm here. Besides, those announcements are so robotic and impersonal, no? Ahaha!”", "For some reason, the Guide seemed to be in a really good mood.", "“Overall, this mission's goal is similar to the ones you had to go through until now. You are tasked with reaching the sixth floor via the fifth floor. However, there are a few more additional rules to consider this time.”", "The Guide picked up a piece of chalk and drew a small circle on the blackboard.", "“This is a coin.”", "“….”", "“Have you heard of treasure hunt?”", "“….”", "“…I am beginning to truly appreciate the greatness of the teachers who teach those unresponsive students.”", "The Guide's shoulders slumped forward rather theatrically, then, he played with his monocle.", "“Fine. I shall finish the explanation and disappear from your sights as soon as possible. On the fourth and the fifth floor, there are many such hidden coins waiting to be found. You all are required to find and amass as many coins as possible before nightfall.”", "He then began writing on the blackboard again.", "1. The usages for the coins:—Entry fee—Lucky draws", "“There is a place on the sixth floor where the gate leading to the Paradise is scheduled to open.”", "The mere mention of entry to Paradise caused a small commotion to rise up.", "“Unfortunately, there are no free lunches in the world. You will have to pay the appropriate entry fee. If you plan to enter the gate, you will need one hundred coins as the usage fee.”", "“One, one hundred? You need that many?”", "“Actually, that's not a lot.”", "Han shook his head.", "“The total number of hidden coins is 3000. With a little bit of leg work, finding 100 should be a cinch.”", "Han spoke up to here, before letting out a gasp of “Ah!”", "“Now that I think about it, there are coins hidden in this classroom too….”", "Suddenly, the sound of a chair being slid across the floor could be heard. A woman stood up and took a quick stride towards the podium, then began rummaging through it. It was none other than Yun Seora. Soon, she straightened her back and sure enough, four yellowish coins rested on her palm.", "Han showed some surprise after seeing a stack of papers clutched in Yun Seora's hand.", "“I see that you have searched through the staff room on the first floor. Those documents were useless until past the third floor, but from here onwards, they should prove to be quite helpful.”", "Still carrying an indifferent expression on her face, Yun Seora returned to her seat.", "'Did she find a map that shows where the coins are?'", "If that were the case, then Yun Seora held an overwhelming advantage on this mission. Seol couldn't help but feel a bit envious.", "Han continued on in the meantime.", "“On the fifth-floor library, you will find an item draw machine.”", "‘Item draw?’", "The expressions of the people present became confused after hearing an unexpected announcement.", "“Those of you who manage to amass lots of coins must use this machine! You will definitely be able to acquire many things that will aid you in your journey.”", "“L-Like what, exactly?”", "“You'll find out once you get there, but they will be things like food, consumable goods, etc, etc….”", "For some reason, Han quietly stared at the person who asked the question, causing Shin Sang-Ah to lower her gaze in a hurry and cross her legs in a defensive manner.", "“….Well, if your luck is good, then you might even receive a protective item of some kind. Also, weapons and spell balls as well….”", "'Weapons? Spell balls?'", "Seol narrowed his eyes.", "“Or, when you pour in a lot~ of coins in one go, you might find unique and special items. Items such as….”", "Han deliberately stretched his sentence trying to create a sense of anticipation.", "“….A legendary elixir that can bring the dead back to life.”", "The devastated and downtrodden middle-aged man's gaze shot towards the front of the classroom. Even the dazed Yi Sungjin visibly flinched.", "“Is, is that true?”", "“Noona can be revived? Really?”", "Han nodded his head at the two's hurried shouts.", "“Of course. However, you need to meet lots of requirements first. It's definitely not going to be easy. You shouldn't take the act of reviving a dead person so lightly…. Stop what you're doing this instant.”", "Han's icy voice reverberated throughout the classroom. The middle-aged man with the worn-out business suit had shot out from his seat and was heading towards the exit, but he had to stop and hesitate.", "“You won't find any coins even if you leave now. The treasure hunt will only commence precisely 30 minutes after I finish my explanations.”", "Even though Han's words were simple to understand, the middle-aged man showed no signs of sitting down. He simply staggered towards the door and stopped right in front of it.", "Han clicked his tongue in disapproval before spotting an oddity with the corner of his eye. It was Seol, who had raised his hand to ask a question.", "“Please speak.”", "“Why are things like weapons, defensive items, and spell balls available from the item draw machine?”", "“Hmm? Conversely, is there a reason they shouldn't be available?”", "“Why would we need items in a mission that's supposedly easy and enjoyable?”", "“….Fufufu. I like these kinds of questions.”", "The hardened expression of the Guide softened considerably.", "“Such questions mean that the listener isn't just taking things at face value and is constantly evaluating the situation…. For now, here is the answer to your question.”", "Han winked once, pulled out his smartphone, and tapped on the screen.", "[A message from the Guide has arrived.]", "“I'm not lying to you. If all of you can cooperate together, this mission will become very easy to clear. And you will even get to enjoy it. I guarantee this.”", "Han dropped the chalk and raised a finger.", "“And also, if I were to provide you with one more helpful hint…. Keep an eye out for the Hour of the Deceased, please. The Deceased carry an unending hatred for all living things, after all.”", "'The Hour of the Deceased!?'", "Seol hurriedly pulled out his phone to check the message.", "[Sender: The Guide]", "[1. Rules of the treasure hunt]—Classroom 3-1 will be set as your safe zone from here onwards.—The period between midnight till tomorrow midday will be designated as the Hour of the Deceased.—The phantom, 'Gaekgwi', and the Deceased are unable to enter the safe zone.", "[2. Requirements for gaining access to the sixth floor]—Access will be granted with the 'sixth-floor key' that can be drawn on the item draw machine using 199 coins, or by paying 499 coins at the door.", "[3. Requirements to activate the gate]—The gate will appear in the middle of the sixth floor, 30 minutes after the access has been granted.—When the access to the sixth floor has been granted, the metal barrier on the second floor will be removed immediately.", "When Seol raised his head, Han was already long gone.", "[The treasure hunt will begin in 30 minutes.]", "Seol began gritting his teeth.", "'Of course. I knew it.'", "“Hey, this isn't what you said!”", "Hyun Sangmin roared out in frustration.", "“What? When we gain access to the sixth floor, the metal barriers on the second floor will be removed? Isn't that the same thing as saying that that goddamn monster will show up here sooner or later!?”", "Seol was deeply worried about that as well. The 30-minute gap during the sixth-floor door opening and the gate ready to activate held all the potential to be absolutely fatal for everyone here. Besides, they had to worry about these so-called Deceased, as well.", "“I mean, we can open the door to the sixth floor, and then come back here to wait out the 30 minutes, no?”", "“What the fuck? What would you do if that damn Gaekgwi monster is waiting for you in front of this safe zone? What then?”", "When someone voiced his opinion, Hyun Sangmin promptly shut that person down. Then he spat out a long groan.", "“Wow…. Nothing is easy. Not a damn thing. What should we do now?”", "“Well, it doesn't have to be so bad.”", "Seol spoke up.", "“We go out and find as many coins as we can until midnight, then we wait until midday tomorrow. Then, we draw as many weapons and whatever we can from the item draw machine before opening the sixth floor….”", "…Seol was about to finish his sentence with ‘we might stand a chance then’, but he couldn't, and instead simply clicked his tongue. ", "Yun Seora and the middle-aged man were no longer in the classroom. It was the same story for Kang Seok and his crew as well. Only seven people remained in the classroom.", "“….Oh, well. Wanna eat something? We still have some time left to kill and all.”", "Seol wordlessly nodded his head. He was actually starving after going on a rampage earlier on, anyways. He felt like he needed to eat something in order to regain his strength.", "When Seol poured out various food items from his bag, the eyes of everyone present, besides Hyun Sangmin, grew extra-wide in shock.", "“Come. Let's eat together. Even you, Mister Yi Sungjin.”", "“I'm….”", "“You won't find any coins even if you leave now. It'll be more beneficial for you in the long run to fill up your belly before you begin.”", "“I…. Thank you….”", "Hyun Sangmin didn't seem to be too happy about Seol being so considerate but didn't try to stop him. After all, the food provided wasn't his to begin with, and there was plenty to go around anyways. Also, some of the food, like the gimbap, would go bad in a few days’ time. So they might as well give them away.", "And so, even Yi Sungjin joined in, leaving behind only one person.", "“What about you, Miss Shin Sang-Ah?”", "Shin Sang-Ah remained sitting in the chair. Seol was about to ask why she wasn't joining them, but then, saw her desperately trying to hide her exposed lower half. He realized that her pants were still missing.", "“I, I was too busy trying to enter…. I f-forgot….”", "“Wouldn't it be okay to go and fetch it now?”", "“….I'm scared….”", "Seol took off his jacket and handed it over to her. Shin Sang-Ah expressed her deep gratitude, and after wrapping the jacket around her lower waist, she was finally able to stand again.", "Afterwards, a silent and uneasy meal commenced.", "“….You seem to have a good appetite.”", "Shin Sang-Ah spoke in a surprised voice while unwrapping the packet of a cold sandwich. She saw Seol swallow hotbars in one go, and then proceed to devour several onigiris as well.", "'I wonder, since when did I have this much appetite?'", "Seol was also slightly confused by this and tilted his head. Even though this was all instant food from a convenience store, it tasted really good.", "The funny thing was that when he was still addicted to gambling, nothing tasted nice to his palette…. Well, the wise old people once said that hunger was king. Seol simply wolfed down the sandwich that Shin Sang-Ah personally took out from the packet without asking another question.", "It was around here that a young man who seemed to be around the age of a university student asked Seol.", "“Uhm…. We should start collecting those coins soon, right?”", "“Yes. You need to collect a minimum of 100 before you can pass.”", "The young man seemed to be waiting for Seol's reply, as he hurriedly continued on.", "“That Guide said it, didn't he? That we could revive a dead person.”", "“Mm? Yes, he did.”", "“Actually, I came here with a friend of mine, but he…. Uhm, so, like, the thing is….”", "The ends of his sentence blurred as he kept stealing glances in Seol's direction.", "“M-Me too!! I came here with an oppa I know well, but he, he tried to defend me and….”", "A girl suddenly jumped into the middle of the conversation, but she too couldn't get to finish her sentence and could only grow tearful in expression. She even stared at Seol with pleading eyes.", "Obviously, Seol stopped eating. He was feeling rather flabbergasted. He was already having a headache while wondering how he should go about clearing this mission, so what exactly were these people trying to say here? More importantly….", "'What do they want from me now?'", "“Hey, you! Let's just have a meal in peace. In peace, I say!”", "Hyun Sangmin shouted out loudly in an unhappy voice.", "“What do you all think you're doing? Seriously now!”", "Hyun Sangmin furrowed his brows rather grandly as if to display how displeased he was.", "“Can't you see how tired he is right now? Just let him enjoy his food in peace already! You aren't even supposed to provoke a dog during meals, let alone an actual human!”", "“No, I'm just saying….”", "“Just saying this and that. But, who cares!? You want to revive someone, then do it yourself, alright? Seriously, all you have to do is to find enough coins, anyway. What do you expect from him, then?”", "His abrasive and rude words led the duo's necks to visibly redden from heat. They didn't say anything else as a retort, but the young man simply snorted out as if he was dumbfounded or something similar. The girl too was visibly displeased.", "Meanwhile, Hyun Sangmin powerfully squeezed a packet of instant bread and popped it open, hard. If it weren't for Seol signaling with his eyes to take it easy, he might have started physically fighting the two.", "The awkward meal eventually came to an end. Seol left the classroom and stepped into the corridor. It was almost time to begin the treasure hunt, but it was also because Hyun Sangmin had called him out there to have a chat.", "“I'm telling you this right now, I can't stand people like those two and I won't go around with them.”", "Hyun Sangmin's voice was rather heated at the moment.", "“What useless fucking idiots! You found them a path, and hell, you even fed them food. Yet they want even more? Don't they have any shame!?”", "He glared in the direction of the classroom, unable to dissipate his simmering anger. But, he suddenly lowered his voice.", "“You should be careful too.”", "“?”", "“From where I'm sitting, it looks like those two think you're an easy mark or something. I apologize if you think I’m overstepping my boundaries. But things like this, you gotta cut off the head right from the beginning, if you know what I mean.”", "Seol slowly nodded his head and then shook it slightly. Even if Hyun Sangmin didn't step forward just now, Seol knew he wasn't going to say something nice to those two as well. It would be the same story whether Future Vision was activated or not.", "“A person's true nature is only revealed when he's pushed right to the edge, am I right? Now that their bellies are full, and they are feeling all nice and comfy, they are acting like a bunch of spoiled assholes. I don't like guys like Kang Seok, but that bastard's opinions aren't half wrong.”", "“….”", "“You continue being nice to them, and they'll eventually end up thinking that it's their birthright or something. Well, in any case…. Don't ever trust those two stinking bitches, okay?”", "[The treasure hunt will now commence.][Remaining time until midnight 05: 29: 59]", "People began leaving the classroom one by one, leading Hyun Sangmin to do a couple of fake coughs to clear his throat.", "“Well, I'm sure you'll do what's best for you…. Anyways, I'm going. See you back here around midnight, okay?”", "He lightly tapped Seol on his shoulder, affixed the bag on his back and disappeared through the stairwell.", "Almost instantly, the whole floor seemed to come alive with lots of activity. Seeing a person run past him in a hurry, Seol decided to concentrate on finding coins himself. He figured that by amassing as many coins as possible, a new path forward would open up for himself.", "[The Diary of an Unknown Student has been updated.]", "Seol stood there wondering where he should go first before he pulled out his phone when the message entered his ears.", "[Sender: Unknown]", "[#4th floor, the corridor in front of the classroom 3-1 (excerpt from the Diary of an Unknown Student)]", "—4th floor, classroom 3-1, inside the teacher's podium (x4)", "—4th floor, classroom 3-2, inside the 4th desk on the 2nd row (x1)", "—4th floor, classroom 3-3, inside the 1st locker (x2)", "—4th floor, classroom 3-4, on the window sills facing the corridor (x3)", "…", "…", "“…Oh.”"]}