{"cid": "468", "title": "Chapter 468. Fierce Battle (2)", "content": ["An indescribably powerful energy swept over the rear battlefield in an instant. It was at this time that other members of Valhalla sensed the appearance of a powerful being. Since only one Army Commander was unaccounted for, they did not have to look to know who it was.", "In war, there was no such thing as a moment of peace. It was either kill or be killed.", "Twisted Kindness spread her wings. Soaring into the sky, she raised both of her hands, and terrifying energy began to gather as dozens of magic circles appeared in the air.", "The air turned scorching hot before the sphere that appeared even got anywhere near Valhalla’s members.", "“You keep going.”", "Little Chick chirped after climbing up to Seol Jihu’s shoulder.", "“This is a good opportunity to have a proper fight with that lizard.”", "Seol Jihu looked confused, seeing Little Chick’s confident smile.", "“I evolved into adulthood, didn’t I? I’m curious to see whether I will be stronger than the last Dragon that is corrupted by evil.”", "“It’s not that I doubt you… but won’t you lose in a one on one fight?”", "“…Shut it.”", "Little Chick frowned. It looked like it wanted to say something but didn’t. There probably wasn’t enough time.", "Twisted Kindness pointed her hands at Seol Jihu.", "“Just trust me and go!”", "Little Chick kicked off of Seol Jihu’s shoulder. Soon, as a fiery blaze shot out of Twisted Kindness’ hands, a brilliant light burst out of Little Chick’s body.", "The blaze that was burning up even space itself could not advance any further due to the light.", "A huge shadow cast over Twisted Kindness’ body.", "Flap, flap….", "Twisted Kindness furrowed her brows as a phoenix radiating a beautiful rainbow light gazed back.", "The two of them did not waste any time with a staring contest. It was because Twisted Kindness saw Seol Jihu shooting past the phoenix like a bullet.", "“You!”", "Twisted Kindness moved to stop Seol Jihu’s advance but was startled to a stop. Chwek! Just as she thought she would block his path, Seol Jihu accelerated and brushed past her. He even sent a leisurely backward kick.", "“Hmph!”", "Twisted Kindness dodged to the side and tried to grab Seol Jihu’s leg. However…", "“I told you to just go!”", "She turned back at a voice that suddenly struck her back. A red-haired insect was shooting toward her with a flaming sword held up.", "Twisted Kindness’ left hand moved like a bolt of lighting.", "Clang!", "Phi Sora’s eyes widened and then furrowed with pain. She did not even see Twisted Kindness pulling out her sword. Only a scorching pain pierced her palm before the longsword in her hand flew into the air.", "Tk. A drop of blood fell on her forehead. When Phi Sora turned her head reflexively, she saw a blade dripping with blood, striking down toward the earth as if to break it in half.", "Just as she thought, “I’m screwed,” Phi Sora suddenly felt something pulling her back.", "Clang!", "At the same time, a fire erupted in front of her eyes. A shining halberd and a thorny mace were blocking the bloody longsword in front of her. No, it would only be correct to say they were delaying it.", "“Don’t space out, idiot!”", "Oh Rahee pulled Phi Sora back before the slowly falling blade hit her. She had given up on attacking Twisted Kindness to help out Phi Sora.", "When Twisted Kindness’ longsword did not stop coming down despite all this, a scythe came flying in and joined the other weapons in blocking the longsword’s path.", "It was only then that the sword stopped.", "“Keu…!”", "“Uuugggh!”", "Everyone groaned. Chohong, Hugo, Oh Rahee, and Vlad Halep. Even with four people working together, they could only stop the longsword’s advance for a bit.", "The four stacked weapons trembled as if they would break at any moment.", "Phi Sora grabbed her longsword, which fell from the sky before displaying a terrified face.", "“Screw off. Don’t get in my way.”", "It was because the several dozen magic circles around Twisted Kindness’ sword all shone at the same time.", "It was then.", "[Out of the way, weaklings!]", "Twisted Kindness suddenly stumbled back like she would fall. Little Chick had scratched her with its wing.", "Twisted Kindness minimized the damage by twisting her body to the side, but she couldn’t prevent her sword from cutting through the empty air and having the magic circles miss their mark.", "As a result, Phi Sora and the others could quickly run and distance themselves.", "Twisted Kindness clicked her tongue. She was a little annoyed with the phoenix, but she didn’t want to waste time fighting such insects.", "She absolutely did not want to let Seol Jihu reach the Queen. Of course, she could not imagine the Parasite Queen losing in her own territory, but this was a man who always turned an impossibility into reality.", "Because of it, she had a strong feeling that she must not let him through.", "And so, as she tried to chase after him belatedly…", "“Hoit!”", "She felt her neck suddenly grow chilly. Two arms and two legs appeared out of nowhere and coiled around her.", "“What’s up, lizard girl?”", "Hoshino Urara smiled beamingly and cut Twisted Kindness’ neck with her dagger.", "“It’s been a wh… kiyaaang!”", "Of course, she was caught and thrown off before the dagger could reach Twisted Kindness’ throat.", "Twisted Kindness furrowed her brows. She had planned to slam the girl down and break her spine, but the girl had used her throwing power to turn aside.", "It was easy to tell that this girl was a lot stronger than the insects from before. She observed the girl, wondering if she was an Executor in disguise, but no energy of the Seven Sins came from the girl.", "Seeing Hoshino Urara flailing her arms as she flew off, Twisted Kindness blinked.", "[I snatched it~ I snatched it~]", "[You can’t have it~ You can’t have it~]", "How could she forget? This was the same girl who kicked her legs into the air and mocked her with a strange dance.", "Twisted Kindness wanted to capture her and rip her to shreds, but she knew the gravity of this battle. Recalling her original goal, she spread her wings and soared up.", "The problem was that the phoenix was blocking the way to Seol Jihu. It flew toward her and headbutted her as if to ask where she was going.", "That wasn’t all. A wind suddenly blew behind her. It gathered around Twisted Kindness’ leg as she tried to kick the phoenix away, holding her in place.", "Having lost balance because of it, Twisted Kindness crashed into the phoenix and fell to the ground.", "‘What….’", "She looked back dumbfoundedly as she crashed down.", "“Yi Seol-Ah’s secret art! Leg pulling!”", "She could see another girl pointing at her while holding her leg up like a crane.", "“….”", "Her image overlapped with that of Hoshino Urara, whom she just sent flying, and Twisted Kindness unwittingly reached out with her hand.", "Dozens of orbs shot out of numerous magic circles.", "“Hmph! That’s nothing!”", "Yi Seol-Ah snorted and spun in the air to avoid Twisted Kindness’ attack. However, Twisted Kindness’ attack wasn’t like the boulders that rolled down the Path of the Soul’s slope in a fixed direction.", "“To this Yi Seol-Ah who surpassed her limits… hm?”", "The orbs that Yi Seol-Ah avoided quickly made a U-turn in the air.", "Kwang!", "“Ack—!”", "Yi Seol-Ah hurriedly twisted her body and lowered her altitude, but she ended up being hit and fell down, screaming.", "“Abubububu!”", "A trail of blood was drawn on the ground she rolled through. Yi Seol-Ah became dazed as she looked up at the sky lying on her back.", "Twisted Kindness was looking down at her with a chilling gaze. She seemed to be preparing to shoot down and crush her head.", "It was then. Just as a hint of hopelessness flashed across Yi Seol-Ah’s face, Twisted Kindness’ eyes suddenly shot open. She felt an energy shooting toward her like a flash of light from her blind spot.", "It was a killer move on the level of an ultimate art.", "‘Could it be?’", "Did Seol Jihu come back? Then I can say I succeeded.", "Twisted Kindness hurried flew back. This was the first time her body sent such strong warning signals.", "At that moment, a jade-green light brushed past her stomach. Twisted Kindness’ eyes shot open. What forced her to fall back wasn’t Seol Jihu. It was a woman wearing a white ceremonial robe.", "Level 9 Sacred Spear, Secret Art — Reinforced Sword Qi.", "Twisted Kindness couldn’t hide her shock after seeing the energy Baek Haeju emitted from the Tathagata Spear. Even the mighty Seventh Army Commander could not take it lightly.", "Then again, even the Parasite Queen would be gravely injured if struck. There was no way Twisted Kindness would be any different.", "“Ow, ow, ow….”", "Having escaped from death by a narrow margin, Yi Seol-Ah tried to get up before falling to her knees. The spot where she was hit was stinging.", "Checking on herself again, she noticed that her side was drenched with blood. If it weren’t for Aura compressing the air at the last second and protecting her, she would have a beautiful hole right about now.", "“Idiot, can’t you tone it down a little? Don’t be so crazy from the get-go!”", "Maria came running in and healed her.", "[Be careful.]", "Aura warned her as well.", "[You surpassed your limits for the first time in the Path of the Soul. However, the enemy we’re fighting is someone who has surpassed that limit multiple times.]", "Yi Seol-Ah nodded in silence. She had experienced the difference in their strength first-hand. With a short exchange, she could tell that Twisted Kindness was way out of her league.", "‘Oppa fought against someone like her all this time….’", "When he was both weak and strong…", "Yi Seol-Ah wasn’t the only one who thought this. Everyone else did as well.", "Seol Jihu might be able to toy around with Army Commanders now, but that didn’t mean they could as well.", "The enemy they were facing now was the Parasites’ strongest Army Commander. They had to risk losing everything from a single mistake. And so, they had to focus on withstanding her attacks, not trying to defeat her.", "The vigor of Valhalla’s members changed.", "Meanwhile, Twisted Kindness’ expression sunk as she scanned the phoenix, Baek Haeju, and the rest of the crew. She wasn’t given any opening to use Teleport. Everyone was clenching their teeth and trying to force her to stay.", "At this point, she had no choice but to admit; these people that initially weren’t worth looking at were now worth a look, and the ones that were only a little worrisome were now very worrying.", "She had not expected to be tied down by anyone other than Seol Jihu.", "“You lot…”", "She knew it was too late to chase after Seol Jihu. In that case, there was only one thing left to do. To take care of the matter here as quickly as possible and go back to the Queen.", "“…Fine.”", "Soon, a faint light began to creep out of Twisted Kindness’ body.", "Flash!", "It suddenly erupted into a blinding light, and Twisted Kindness began to grow in size exponentially.", "*", "KUOOOOOOO!", "A fierce roar resounded in the sky.", "Dragon Roar.", "Twisted Kindness had returned to her original form.", "‘I hope they’ll be okay….’", "Will they be able to stand their ground against Twisted Kindness? Should I have helped out a little before coming?", "All sorts of thoughts swirled inside Seol Jihu’s head, but he shook them off in the next moment. He could only see the allied force winning this war if everything went as planned.", "Moreover, before escaping from the Empire, Seol Jihu had asked the others not to do anything foolish like returning to help.", "Little Chick had kept the promise. So now, it was Seol Jihu’s turn to keep the promise.", "‘I just have to trust them.’", "Seol Jihu kicked off the ground and flew into the air.", "He would reach the Parasite Queen at any minute now.", "*", "Same time.", "The Parasite Queen was sitting on the wall, looking down at the battlefield. Her expression seemed both complicated and despondent.", "Even Twisted Kindness, whom she trusted, was tied down.", "…No, in truth, she knew things would turn out this way.", "A constellation did not refer to a single star. It referred to a cluster of stars gathered around the Brightest Star.", "Seol Jihu’s growth was one thing, but what the Parasite Queen feared from the beginning was the evolution of the constellation from the effect of the Brightest Star’s light.", "When she looked up at the celestial bodies now, she could see the stars forming a beautiful galaxy.", "The result of this was the scene in front of her.", "And just now, the star aiming for her throat arrived.", "The god and the godslayer finally came face to face.", "Seol Jihu landed on the wall and bowed toward the Parasite Queen. He then straightened his back while holding the Spear of Purity tall.", "The Parasite Queen’s eyes glinted.", "[Is that supposed to be a greeting?]", "She spoke with a light snort. However, Seol Jihu was still bowing his head without a word.", "[…I must admit, I am surprised. I thought you would pounce on me like a mad dog, but it seems you’ve learned some manners since the last time we met. You have grown a lot. Did becoming an apostle bring about this change?]", "“…No, not at all.”", "Hearing the Parasite Queen’s praise, Seol Jihu spoke with a respectful face.", "“It isn’t that I am minding my manners… I was just honoring the memory of the deceased. Facing off against you like this was a little touching, you see.”", "[?]", "“Ah, why don’t you join me in doing so, Your Majesty? Let us honor the great hero who sacrificed himself to allow us to meet, the light of the Federation and humanity, our savior, Raging Temperance…”", "The Parasite Queen’s brows twitched violently."]}