{"cid": "101", "title": "Chapter 101. The Threads of Bonds Coming Together (3)", "content": ["[Blessing of the Circum]", "『The law of three-orders encompasses all that is observed in nature. When talking about the essence of things, the matter is the first-order perspective, the magic is the second-order perspective, and the law of nature is the third-order perspective.", "The Blessing of the Circum is a three-dimensional shield created in accordance with these multi-order perspectives. It protects its user not only from physical matter and magic but also from spells carried out through divination and witchcraft.", "It uses its user’s mana as energy and lasts a total of 10 seconds once activated. It can be used three times per day, but its effects cannot be layered together.』", "“Oh….”", "Seol Jihu let out an exclamation of awe, but he didn’t really understand what the long text meant. All he could gather was that it was a good shield. What charmed him the most was that he didn’t need to carry it with his hand like a normal shield.", "‘So it’s like a phalanx?’", "He could say this only because he didn’t know that a real phalanx was a battle formation used by footsoldiers.", "In any case, he never even dreamed of using a shield since he was a spearman, but that had changed now that he had this bracelet.", "What if he summoned a shield in a critical moment of a battle?", "He found it cool just thinking about it. He readily equipped the bracelet on his left wrist and picked up his ice spear.", "Yaap! Haat! He jumped around here and there, pretending to be in the middle of a fierce fight. Suddenly, he imagined himself being attacked by a flying axe and raised his left hand.", "Woong! As soon as he infused his mana into it, three circles colored gold, red, and blue respectively appeared around the bracelet. They intersected each other, forming a triangle with the gold circle on top and the red and blue circles supporting the sides.", "‘With this size….’", "It was too small to cover his entire body, but it was big enough to protect his face and upper body. Exactly 10 seconds afterward, the three circular shields vanished into thin air.", "Seol Jihu must have noticed how childish his antics were as he snickered loudly. He continued putting the black belt on and off as he grinned in satisfaction. His body itched now that it gained additional tools for battle. No matter what work fell on his shoulders, he felt like he could go at it happily.", "But he wasn’t ready yet. He needed to reach his goals.", "After remembering that he had yet to learn Mana Spear, he turned serious. It was late at night, but there was no rule against training at this hour.", "‘Today will be the day!’", "After taking out a bunch of javelins from the belt, he hurriedly ran to the outdoor training ground.", "*", "Murphy’s law, an adage that stated, “Anything that can go wrong will go wrong.”", "Although the meaning of the phrase was a bit ill-natured, that was just how life was. Like the saying, ‘cross one mountain and another will show up’, misfortunes often came consecutively at the most unexpected time.", "When things started going wrong, it was to the point people blamed their ancestors or the heavens. Of course, that didn’t mean that bad luck was the only thing in their life.", "Fortune and misfortune were closely related, so there were times in one’s long life when good luck came knocking on their door.", "Sally’s law was the counterpart to Murphy’s law. If there were times when continued misfortunes dragged one’s life to the pits of hell, there were times when continued fortunes raised one’s life to the ends of heaven.", "In the case of Seol Jihu, one could say his life in Paradise has been a continued cruise.", "Just like Prihi said, the Haramark Royal Family was fair in rewards and punishments. In other words, they were quick with their work.", "Seol Jihu received news from a messenger that the king had already passed the message to the village head. Because of it, Ramman Village was apparently in a festive mood.", "It made sense. Haramark wasn’t necessarily safe, but it was much better than Ramman Village as it was farther from the border region and was under the protection of Earthlings and the royal army.", "The tomb visit was making progress as well. Teresa had hired a trustworthy Chief Priest and was in the process of preparing written prayers. The plan was apparently to build a shrine to console the ghost saintess. She also added that she would let him know as soon as the preparations were over.", "With this, the weight on his conscience was lifted. But like the saying, ‘even a jade has a scratch’, he wasn’t free of worries completely.", "Tak! A dull sound rang out. A javelin rolled on the ground after hitting a wall and reached a young man’s foot.", "“Huk… huk….”", "Seol Jihu was breathing heavily with his back bent when he spotted the javelin near his feet and grabbed it after wiping the sweat off of his forehead.", "He lost count how many days had gone by. But one thing he was sure of was that he had yet to learn how to throw a simple spear, much less one made out of mana.", "‘What’s the problem?’", "Theory and experience were different. Even if someone studied hard and amassed knowledge, translating it into flawless action was a different matter altogether.", "Seol Jihu expected some pushbacks, but the wall blocking his path was too big for him to overcome. To be frank, he was able to learn Mana Circulation with such ease only because of Psychi’s Tears. Since he didn’t have outside support or a stroke of luck to help him with Mana Spear, it was only normal for his progress to be slow, even considering the amount of effort he was putting in.", "In truth, he wasn’t even sure if he was making progress. After experiencing this impregnable wall seemingly blocking his path, he couldn’t help but agree that his talents were ‘average’.", "‘Argh, I’m going to go crazy at this rate.’", "Looking back, he realized how fortunate he was in the Neutral Zone. After all, he had an excellent instructor like Agnes. Although she beat him up and cursed at him every time, she was able to point out his mistakes like a demon and offer sound advice.", "‘Should I go give her a visit?’", "It wasn’t that this thought never crossed his mind. However, he always convinced himself otherwise.", "Paradise wasn’t the Neutral Zone. He couldn’t keep relying on others forever. Moreover, he was the one who decided to become the trailblazer of a thorny path.", "He couldn’t start complaining this quick.", "Once he shook his head, sweat flew in every direction, and after straightening his back, he began to pick up the javelins strewn on the ground.", "He practiced throwing javelins from early dawn to noon. It was then that he thought it wouldn’t be bad to go for a change of pace and spend one or two hours doing physical training.", "He carefully placed ten javelins together and headed to the first floor with sandbags around his arms and legs.", "Seol Jihu was so absorbed in training that he didn’t know another great fortune was finding its way toward him.", "*", "Around the time that the sun was hanging in the middle of the sky.", "“Slaughterer! It’s the Slaughterer!”", "“Uwaaaah, uwaaaaaah!”", "As the Earthlings on Haramark’s streets hightailed the hell out of there, Agnes was leisurely walking toward Carpe Diem’s office. She wasn’t going there on official business. In fact, it was a strictly personal visit.", "There really wasn’t much to it. She had simply promised someone to help him with his training and was on her way to keep her word.", "Although it was only a verbal promise, she made it her principle to never make a promise she couldn’t keep. Thus, she saw it as her duty to take responsibility for her words.", "And when she arrived at her destination….", "Tak, tak. She was greeted by the sound of something striking the ground periodically. As someone who was only a step away from becoming a Unique Ranker, Agnes could clearly hear the faint groaning coming out of the office.", "As she slowly made her way closer, she saw someone walking toward her from the other side of the street. Unlike most others in the city, this person showed no signs of being afraid of Agnes.", "The name Agnes was a source of terror in Haramark. The reason Haramark was called the ‘crime city’ had much to do with the infamy it amassed during its past internal strife.", "To explain in greater detail, the way Agnes dealt with her enemies could be summarized easily. An eye for an eye, a tooth for a tooth.", "She murdered enemies who were infamous for their cruelty even more cruelly. When she fought people who were crazy, she became even crazier than them.", "One time, she cleanly dismembered her enemies’ corpses and neatly placed their body parts on a platter before serving it during a negotiation dinner. Another time, she slaughtered every member of an enemy organization and decorated a Christmas tree using their corpses and organs. And as if that wasn’t enough, she even held an exhibition to show it off.", "It wasn’t just once or twice that Agnes has done something ridiculous under Sicilia’s principle, ‘an ally’s blood will be washed away with an enemy’s blood’. With such horror stories under her belt as Sicilia’s vanguard, it was no wonder why everyone was so terrified of Agnes.", "However, the man walking toward her didn’t seem to care in the slightest. Of course, Agnes had no reason to care either, so she passed him without paying too much attention to him.", "No, she tried to pass him.", "But she couldn’t. This was because she saw the man’s features as he drew closer.", "The fedora on his head and his dark blue coat made him look as if he just entered Paradise. He carried a long wooden stick in one hand. Rather than a staff used by Magicians, it seemed to be a walking cane that he carried around as a habit.", "He was shorter than Agnes and looked feebler too. The wrinkles on his aged face was a poignant reminder of the passage of time. However, even his age couldn’t hide the fiery vitality burning in his eyes.", "And when Agnes caught sight of them….", "“Eh?”", "Her eyes shot open in surprise. She even stopped entirely.", "Tak! The old man must have seen her too as he grabbed his cane tightly and halted his steps.", "“Hoh.”", "He took off his fedora, revealing his neatly brushed white hair. His raised eyebrows softened slightly, showing he was just as surprised as Agnes was.", "“You’re….”", "A rough, elderly voice flowed out. Agnes snapped out of her daze and respectfully cusped her hands together before bowing.", "“I didn’t expect to meet you here.”", "“Yes, it’s been a while.”", "“I see that you are still not talking to me comfortably.”", "“Huhu, that again. I believe I’ve already told you about that several times before.”", "“You’re right. I can’t help but feel a little disappointed, but it’s also quite nostalgic.”", "Agnes nodded her head and continued.", "“It feels like it was only yesterday that I was crying tears and snot after receiving Master’s lessons.”", "The old man protested with a look that said ‘What are you talking about?’", "“I don’t remember seeing you cry. The Agnes I remember always knew what to do even without someone to guide her.”", "“I cried when I was alone at night. Crying in front of others would hurt my pride.”", "The old man’s jaw dropped, and he chuckled without sound.", "“I see you learned to make jokes. All I did was look after you for a bit because of that person’s request…. Ah, is she doing well?”", "“If you are talking about Boss Cinzia, she is indeed doing well, all thanks to you.”", "Agnes replied respectfully.", "“All thanks to me? Oh please, flattering this old man won’t get you anything.”", "“No, I am sincere.”", "Agnes revealed a rare smile before slowly putting her hand over her chest.", "“The memories I have training under Master are like treasures inside an old drawer.”", "“Calling them treasures is a bit….”", "“They’re certainly treasures. Just like Boss, I was saved multiple times by Master’s teachings. In fact, it happened just a few weeks ago too.”", "“Hoh, something big must have happened.”", "The old man scratched his face, which was now slightly red.", "“It’s not like I taught anything great. After all, Cinzia and you always surpassed my expectations, fufu.”", "A warm smile spread across his face as if he was remembering the old times.", "After a moment of silence, Agnes opened her mouth with a hint of expectation.", "“I may be being impertinent, but-”", "“Mm, no.”", "The old man shook his head before she could even finish her sentence.", "“I came here because of a promise I made Dylan. You see, he made me promise to drop by every once in a while.”", "“I thought so….”", "Agnes put on a complicated look. She could tell her old master had no clue what happened to Dylan.", "“Anyways, what business do you have here? A request?”", "Agnes shook her head.", "“I’m here to meet someone for a personal reason.”", "“Oh? No one pops up in my head. I doubt it’s Chung Chohong or that Hugo…. Dylan?”", "“It’s neither of the three.”", "Neither of the three?", "“There’s one more person.”", "Realizing that Carpe Diem had a new recruit, his interest was immediately piqued. Someone had passed Dylan’s difficult screening? And not only that, this person managed to get Agnes to visit him personally?", "“Let’s go in. Since it’s been a while, why don’t we have some tea?”", "“No, it’s fine. I will come back at a later time.”", "Agnes was grateful for the offer but refused him politely. The old man in front of her would soon face a harsh reality. The person to tell him this should be a member of Carpe Diem, not her.", "Of course, that wasn’t the only reason.", "“It’s not anything urgent… and besides, it seems I have no reason to go anymore.”", "The old man nodded. He wasn’t sure what she meant, but he had no reason to stop her when she wanted to leave.", "“Take care. It was nice seeing you after so long.”", "“Yes, I hope you enjoy your stay in Paradise.”", "After giving a courteous bow, Agnes vanished in an instant. Once she left, the old man looked up at the old, dilapidated building. Nostalgia and wistfulness wet his eyes. But this feeling only lasted a moment. Soon, when he walked into the building….", "“Hm?”", "His eyes faced forward. He could see the first-floor training ground beyond the window. As it was a place he constructed with burning passion and painstaking effort, he had countless memories in that little space.", "But currently, a young man he had never seen before was training arduously while dripping with sweat. He didn't know who he was, but he had an idea.", "‘Is he that newbie?’", "Perfect, I was curious. The old man didn’t enter the training ground and watched the young man over the window.", "‘Hm….’", "Soon, he rubbed his chin.", "‘He’s quite decent for a newbie.’", "That was his evaluation. However, at a closer look, he noticed a few additional things.", "He wasn’t just giving it his all. Although he was lacking in a few areas, he seemed to be putting in a great deal of focus on his movements and breathing. From the way he periodically stopped to rest, the old man could tell he received professional training.", "‘I don’t know who taught him, but whoever it was, they did a fine job.’", "He gave a rare compliment. Soon, the young man unfastened his sandbags and went outside.", "Shiik! Tak…. Shiik! Tak….", "When the old man followed him to the backyard, he could periodically hear the sound of something cutting through the air before striking something. The young man was repeatedly throwing a javelin at a wall. The old man tilted his head while watching him secretly.", "‘What is he doing?’", "It looked like he was trying to learn his skills directly. That was something to be praised, but the old man didn’t stop tilting his head. Something seemed to be bothering him as an uncomfortable look emerged on his face.", "‘Is he practicing hitting a mark?’", "He suddenly caught sight of the young man’s notebook on the ground. Seeing how it was full of text, he nodded his head and looked back up. The young man was still throwing javelins without realizing someone was watching him.", "‘Wait, this is… javelin throw!’", "After looking back and forth between the young man’s movements and the notebook, the old man made a dumbfounded expression.", "‘That idiot!’", "He didn’t consider himself a nosy person, but it was a different matter if the young man was a member of Carpe Diem. In the end, he couldn’t bear to watch him and opened his mouth.", "“Oi.”", "Shiik! Tak…!", "He called the young man but there was no response.", "“Oi!!”", "“?”", "Once he raised his voice, the young man finally reacted. Clear eyes and white skin. He looked quite delicate for a man. However, looking at his robust body, the thought that the young man was weak vanished. When the young man turned around, the old man raised his cane.", "“Lift up your arm.”", "“…Pardon?”", "He retorted with a startled face. However, the old man continued without giving any explanation.", "“Your right arm. Turn it halfway clockwise.”", "“Um, who-”", "“Look where your elbow is and turn your hand!!”", "The old man suddenly shouted. The young man flinched before reflexively turning his pulled-back right arm clockwise.", "“L-Like this?”", "“Try again.”", "Hearing the old man abruptly telling him to try again, the young man blinked his eyes confusedly.", "“Don’t just stand there and start with the run-up.”", "The young man flinched at the old man’s frosty tone and moved. His left foot went out first, followed by his right. Immediately, the old man scowled.", "“Stop, stop!”", "He stomped forward, then tapped the ground in front of the young man’s foot with his cane.", "“I told you to do a run-up, not a tap dance. Why are you running with your left heel up?”", "Hearing this, the young man grumbled as if he was wronged in some way.", "“But that’s part of the run-up….”", "“The run-up is only there to help you build speed and rhythm. The crossover steps are when you set up for a good release position. Right now, you’re raising your foot when you’re kicking off the ground. It’s not like you’re a clown at a circus, so why are you starting off on by tiptoeing?”", "“But-”", "“Keep your left foot on the ground!”", "Seol Jihu was about to protest when he lost to the old man’s vigor and put his left foot down. The old man smacked his lips, looking unsatisfied even after the young man did as he was told.", "“Stay like that.”", "He entered the building and came out with a small hammer. After snatching the javelin out and putting the hammer in the young man’s hand, he moved behind the young man and held onto his right hand.", "“Alright, let’s try that again.”", "Even as he was startled by the strength of the old man’s grip, the young man kicked off the ground as his instincts told him to. However, the fiery scolding didn’t stop.", "“Don’t push down on the ground with the ball of your right foot! Use your toes! Your left foot is going up because you’re not transferring your strength properly!!”", "“Y-Yes!”", "“Don’t be flimsy with your arms! You’re starting with your foot, but your left hand is the key that ties everything together! Keep it straight like you’re pulling on air! Make that rotational energy transfer to your right arm!”", "“Yes!”", "From an outside perspective, it was quite a funny sight. The young man had his captured right arm pulled behind him, while his legs were moving forward like he was techno-dancing. However, the young man was on the verge of collapsing from shock.", "‘H-Huh?’", "The entire motion felt different than what he was used to. Some part of it made him feel strange, but because the old man was helping him stay on track, his movements connected rather smoothly. In other words, what he had been doing until now was wrong.", "Then suddenly, the grip holding on to his right hand loosened.", "‘He let go?’", "Even as he was taken aback, his body moved on its own, having remembered the new posture. His right foot ran up, while the left foot stepped on the ground with strength. He pulled his left arm in while turning his body counterclockwise, and the resulting rotational force transferred to his right arm.", "When his right arm almost flew forward automatically, Seol Jihu’s eyes widened in shock.", "‘So this is why…!’", "When his half-rotated arm returned to its original position, it rotated and amplified the rotational force that was transferred up from the rest of his body!", "“Now!”", "When the loud shout rang out, Seol Jihu instinctively threw the hammer forward.", "‘!’", "Pak! He felt a satisfying explosiveness from his hand. This was his first time experiencing this feeling. It felt like he just fired a gun.", "Kwak! He was staring at his hand in a daze when the sudden explosion made him raise his head. The tiny hammer he threw had pierced deep into the wall. Immediately, several messages popped up, alerting that he learned Spear Throw.", "‘Impossible….’", "He couldn’t believe it. Something that had been troubling him for the longest time was resolved in an instant.", "“There’s a difference between a short-throw and a long-throw.”", "A deep voice resounded. Seol Jihu went “Ah!” and turned to face the old man.", "“You’re trying to learn the long-throw, but your target is placed too close. It’s no wonder why you were having trouble.”", "Seol Jihu stared at him like a stone statue. He had no clue who he was. But he knew that the mysterious old man had helped him with his training.", "‘A fortuitous encounter!’", "It was something that often occurred in novels, a secluded eccentric suddenly appearing and helping the main character. He was well acquainted with such convenient plot devices.", "‘!!!’", "When he activated Nine Eyes, he almost closed his eyes out of shock. The golden light pouring out from the old man was something he had never experienced before. It was so dazzling that he became certain of his conjecture.", "‘It’s my fortuitous encounter!!’", "He suddenly thought back to when he was standing in Haramark’s plaza, looking at the color of Carpe Diem’s recruiting parchment. He refused to give up this opportunity.", "The old man noticed the young man’s clear-as-day gaze and took off his fedora.", "“I forgot to introduce myself.”", "He let out a dry cough and opened his mouth.", "“I’m….”", "“Help me!”", "Seol Jihu leaped on top of him.", "“H-Hm?”", "The old man was taken aback.", "“Help me!”", "“O-Oi, calm down first and-”", "“O mysterious eccentric, I beg you. I’m currently-!”", "“Quiet! Geez! Just hear me out first!”", "Seol Jihu clung to him as if his life depended on it. Because of it, the old man had to struggle for a long time to prevent his pants from sliding down.", "It wasn’t until three, four days after the old man and the young man’s meeting that Chohong returned to Carpe Diem.", "*", "[In the name of Ira, I shall henceforth bestow the title of Level 5 Templar to Chung Chohong! I expect great feats befitting the league of High Rankers from you!]", "“Haat!”", "After applying to become a High Ranker as soon as she came back, Chohong walked out of the temple proudly. She couldn’t hide her happiness after achieving what she always dreamed of.", "With a face full of smiles, she raised the shopping bags in her hands.", "‘He’ll like it, right?’", "She knew she returned quite late, so she brought gifts to bring Seol Jihu. As long as she explained her circumstances and offered him some gifts, she believed he wouldn’t be so angry.", "The only problem was that Chohong did not buy any presents for Hugo. She never thought about buying gifts for him in the first place.", "“That bastard, I bet he’s crying because he misses this noona so much.”", "Lulu~ Lululu~ Chohong hummed as she made her way down the temple’s stairs. Perhaps she was happy to be back after several weeks, or perhaps she was eager to see her comrade’s face when he received her gifts, but regardless, her steps quickened.", "Soon, Chohong reached Carpe Diem’s office.", "“Hey! Seol!”", "When she threw the door open and walked in.", "“Are you here? Come out if you are! Big Sis brought you some….!”", "Koong! Suddenly, the building slightly shook. Almost as if there was a small earthquake, the entire building was shaking.", "Koong…. Koong…. The shaking didn’t stop after the first and continued periodically. Chohong’s complexion froze stiff."]}