{"cid": "130", "title": "Chapter 130. Dances With Wolves", "content": ["Once Stage 2 ended, Seol Jihu relaxed a bit more. With his newfound leisure, he naturally began to grow curious about things he couldn’t pay attention to before.", "‘Who hosted the Banquet?’", "There was a reason the question changed from ‘how’ the Banquet was hosted to ‘who’ hosted the Banquet. Looking back, there were more than one or two suspicious points. The recent ‘exchange’ was a good example.", "He thought it would be impossible for everyone to be satisfied with the exchange. Although some might find items they were interested in and successfully trade for them, Seol Jihu believed there would be more than a few who didn’t. Of the remaining 100 or so people, he predicted at least half would fail.", "Yet in reality, almost everyone except three or four people were able to trade successfully. The rewards Earthlings wanted were limited in scope — to weapons, armor, and such — but everyone’s wishes had to be different even by a little.", "So how could so many people make successful trades? It was almost as if the rewards were designed to be this way.", "Of course, it could still be a coincidence. After all, there were over a hundred people who received rewards. Still… without some sort of an outside force helping to create this situation, it seemed close to impossible.", "Seol Jihu had a strong hunch that an unknown existence interfered in the matter, and clearly, this existence had to be the host of the Banquet.", "That was how far he went. Just as Ian mentioned, as long as he didn’t have a definitive proof, any believable deduction would only be a hypothesis.", "He felt like he could find clues to confirming his suspicions if he could enter Stage 3, but he didn’t know how. Seol Jihu sighed with frustration.", "Then, he went to find a certain Priest who was resting. Although conquering the Plaza of Sacrifice became easier as more people returned with the Dissonant Wish, that didn’t mean it suddenly became a walk in the park. As Seol Jihu always fought on the front lines, there were more than a few times when his life was in danger.", "The person who saved him each time was the Priest Kazuki invited.", "It was common sense for a Priest to support a Warrior during battle, but Seol Jihu felt like she was paying attention to him to an almost excessive degree. Of course, it was entirely possible that he was mistaken. But if this weren’t the case, it didn’t make sense for the healing or protective spells to always come in at critical moments.", "Plus, the Priest was suspicious in more than a couple areas. She not wanting to reveal her identity could have been because of a privacy reason like Kazuki said, but there definitely was something else.", "A Priest’s spells weren’t infinite. It was normal for a Priest to run out of saved spells over successive battles or a prolonged fight.", "When Maria used her eight stored spells, she had to restore them by making offerings, and she would pant when she ran out of them after her sixteenth spell.", "But this mysterious Priest was strange. She poured out one holy spell after another when it came to Seol Jihu, yet she didn’t show any sign of running dry of them. And because she used chantless casting, Seol Jihu couldn’t pick up any clues from her voice.", "Everything about her was shrouded in a veil. Solely based on the abilities she had shown, Seol Jihu wouldn’t hesitate to believe she was a Unique Ranker.", "Suddenly, Seol Jihu remembered the gentle touch from when he lost consciousness during his battle with the Orc Champion.", "‘Who is she?’", "To be honest….", "‘Just who is she to care about me so much…?’", "Every time he felt her gaze underneath her hood, she felt like a mother bird worriedly gazing at her child who had just learned to fly.", "A part of him wanted to rush up to her and pulled down her hood. Although it would be incredibly rude, he had a baseless feeling that she would forgive him. Of course, he couldn’t bring himself to do such a thing to his benefactor, so he simply expressed his gratitude.", "“Thank you for taking care of me.”", "In response to Seol Jihu’s courteous bow, the robed Priest silently nodded her head and reached out as if to stroke his head. Seeing this, Seol Jihu bent down subconsciously.", "‘Huh?’ He paused instantly and blinked his eyes.", "He had subconsciously tried to put his head against her hand. He found it strange how his body reacted automatically.", "Seol Jihu stared at the Priest with a flustered look. Seeing how the Priest had retracted her hand and was taking tiny steps back, it seemed she was flustered as well.", "“Hm, hm.” She then let out a low cough before turning around. Perhaps uncomfortable with the young man’s fixed stare, she made a slight bow before quickly leaving.", "“….”", "Seeing the Priest getting farther away, Seol Jihu rubbed his chest with a disappointed look. They were only slightly acquainted, so why did he feel so wistful?", "Seol Jihu didn’t know.", "*", "Once afternoon came around, only half of the participants remained on the field. With the permanent opening of the Plaza of the Dissonant Wish, those who had no reason to stay had left - to either Paradise or Stage 3.", "The Alliance team didn’t rush things as entering Stage 3 wasn’t based on a first-come, first-served basis. But because they were tired of the Banquet, a part of them wanted to go back to Paradise as soon as possible.", "Kazuki finished cleaning up the campsite and reminded everyone of what to do after exiting Stage 2. Only then did he bring up leaving through the Plaza of the Dissonant Wish.", "When they walked past the long pathway and the reward room, they finally arrived at their destination — a room with a circular red portal on top of an altar.", "Kazuki stopped and looked back at the team.", "“I won’t say good job yet.”", "Things weren’t over until they were out of the Banquet. He was reminding them not to let their guards down.", "“In case anyone manages to enter Stage 3, the rest of us will be waiting outside, so don’t worry about that….”", "Kazuki furrowed his brows in the middle of his speech. He was bothered by Hugo, who was smirking while stuffing his battle-axe into his pants.", "He had already said the same thing before coming in anyways. Shaking his head, Kazuki turned back.", "Next, when he entered the portal, he felt his body sink.", "Splash!", "The sound of water splashing rang out, and Kazuki immediately realized what had happened.", "“Puha!” Spitting out the water and standing tall, just as he expected, he found himself back in the oasis he used to enter Stage 1. He had returned to Paradise.", "Bitterness shone on his face as he brushed off his soaked hair.", "‘Third time’s the same, huh….’", "Soon, more splashing rang out. Kazuki turned back and performed a head count. Six people had entered the red portal.", "‘One, two….’", "“Osu! You’re back! Kazuki Hyung-nim!”", "While Kazuki was counting, a familiar voice struck his ears.", "Sakamoto Jun was waving his hand from outside the oasis.", "“You….” Kazuki asked in a fluster, “You were alive?”", "“Yes! I got eliminated in Stage 1! I thought I’d die while waiting!”", "Sakamoto Jun shouted proudly. Well, it was a good thing he was alive….", "Kazuki’s eyes narrowed. The Alliance team had a total of seven people, but two were missing. No matter how long he waited, they didn’t show up.", "*", "Seol Jihu steeled his mind from the moment he stepped onto the portal. Remembering how it was while entering the Banquet, he prepared for impact as soon as his vision turned red.", "However, the impact he was expecting didn’t arrive. Instead, he smelled a somewhat salty air.", "‘?’", "Seol Jihu’s tightly closed eyes opened slowly. When he realized he had been transported to another area, his jaw immediately dropped.", "He had heard that if he were sent back to Paradise, he would return to the place he entered from. However, the place he was currently in wasn’t the Salt Desert’s oasis. Moreover, the salty smell in the air carried the scent of the ocean.", "Immediately raising his spear, he stood alert. He couldn’t sense anyone nearby, but he examined the room nervously. Only after carefully scrutinizing the place several times did he slowly put his spear down.", "He was in a room with a desk and a bed. Beyond the small window on the wall, he could see an open sea. Realizing that this was probably the mysterious ship signaling the coming of the Banquet, Seol Jihu was convinced.", "He had entered Stage 3 on his first attempt; the same Stage Kazuki and Dylan failed to enter twice before.", "The problem was this. He couldn’t find the door out.", "But as he had experienced something similar in Stage 1, he decided to wait calmly.", "‘I read that Stage 3 is a battle royale….’", "He was thinking about all sorts of things when he caught sight of a plate of bread sitting on the table. Even a glass of wine was placed next to it.", "Now that he thought about it, he hadn’t eaten lunch yet. Being a glutton that he was, Seol Jihu rejoiced and reached for the bread before going ‘Ah!’ and retracting his hand. Although it did look tasty, he couldn’t just eat something so suspicious.", "He took out some dried meat from the black belt Teresa had secretly given him. The hunger and thirst he experienced while escaping from the laboratory remained as a trauma, making him develop a habit of bringing ample food and water wherever he went.", "‘Tasty.’", "Seol Jihu looked around the cabin room while chewing on the dried meat. Realizing there wasn’t anything else, he sat down on the bed and began to wait.", "How much time passed by?", "Splash- Splash- While only the sound of waves crashing against the ship rang out….", "Click! A familiar sound rang out.", "A part of the flat wooden walls slightly came apart. It now looked like a revolving door.", "As he was tired of waiting around, Seol Jihu got up from the bed excitedly.", "It was then…", "‘Hm?’", "The door began to spin on its own.", "When it turned 180 degrees and the other side of the wall came into his view… Seol Jihu flinched seeing the huge characters written on the wall.", "He had never seen these characters before. But Synchronization seemed to be taking place, as they began to wriggle in the next moment.", "Not long afterwards, the strange characters turned into a recognizable word and Seol Jihu could easily read what it said.", "‘Wo…?’", "Just as he read the word that had turned Korean….", "Sparkle! The word suddenly shone.", "Seeing a bright light for an instant, Seol Jihu’s eyes dimmed. He looked as if he was entranced, and his arms drooped down as well.", "“….”", "Seol Jihu left the cabin room in a daze.", "Walking like a puppet, he made his way through the dark ship. Opening the door at the end of the corridor, he walked down the staircase that followed.", "Almost like someone who had his soul sucked out of him, he walked non-stop.", "It wasn’t until he reached the bottom of the staircase that he stopped.", "Click!", "Another click rang out, and light returned to his dim eyes.", "“…Ah.”", "Snapping out of his daze, Seol Jihu blinked multiple times. He felt like he had lost consciousness after reading the character, but he couldn’t remember it well.", "He felt like he had a dream.", "‘What happened?’", "Seol Jihu stared at the staircase with a confused look. It looked like he had walked down to the basement, but he couldn’t see a door at the end of the staircase.", "It must have disappeared immediately.", "The only exit was a door that he could see in front of him.", "The mysterious power that brought him here was obviously telling him to open it.", "Despite understanding this, not knowing what was beyond the door made him hesitate. But he obviously couldn’t just stand there forever.", "After hesitating for a long time, Seol Jihu walked toward the door. Taking a deep breath, he pushed his left hand forward. Rousing his mana to activate the Blessing of the Circum if needed, he slowly pushed the door with his spear.", "And when he carefully stepped in…", "Zing–! A powerful, acute pain struck his brain.", "“Keuk!”", "His eyes widened automatically, and his waist bent back. Struggling from the powerful pain, Seol Jihu clutched his head.", "It was information.", "Just like when he experienced Synchronization and just like when he saw the stone stele in Stage 2, new information was being jammed into this brain.", "And just like always, the pain soon disappeared. But Seol Jihu didn’t straighten out his back and stood there, frozen.", "He was in utter shock at the rules of Stage 3.", "‘Wh… what?’", "The rules this time weren’t as complicated as before, but they were several times more shocking.", "At that moment, rustling rang out. Seol Jihu raised his head, and nine doors entered his vision. Including the door he had used to enter, there were ten in total.", "And in front of each door was a person groaning while massaging their temples.", "They seemed to have noticed the situation too, as they looked around the room and fixed their posture.", "Soon…. A total of ten people gathered in one place."]}